defmodule ChinaAdminDivisions.Gen.Lv3x.M13 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "桃城区" or input == "131102",
    do: [
      %{"name" => "河西街道", "code" => "131102001"},
      %{"name" => "河东街道", "code" => "131102002"},
      %{"name" => "路北街道", "code" => "131102003"},
      %{"name" => "中华大街街道", "code" => "131102004"},
      %{"name" => "郑家河沿镇", "code" => "131102100"},
      %{"name" => "赵家圈镇", "code" => "131102101"},
      %{"name" => "邓庄镇", "code" => "131102102"},
      %{"name" => "何家庄乡", "code" => "131102200"}
    ]

  def next(input) when input == "冀州区" or input == "131103",
    do: [
      %{"name" => "冀州镇", "code" => "131103100"},
      %{"name" => "官道李镇", "code" => "131103102"},
      %{"name" => "南午村镇", "code" => "131103103"},
      %{"name" => "周村镇", "code" => "131103104"},
      %{"name" => "码头李镇", "code" => "131103105"},
      %{"name" => "西王镇", "code" => "131103106"},
      %{"name" => "门家庄乡", "code" => "131103200"},
      %{"name" => "徐家庄乡", "code" => "131103201"},
      %{"name" => "北漳淮乡", "code" => "131103202"},
      %{"name" => "小寨乡", "code" => "131103203"},
      %{"name" => "社区建设办公室", "code" => "131103400"},
      %{"name" => "河北冀州高新技术产业开发区", "code" => "131103401"}
    ]

  def next(input) when input == "枣强县" or input == "131121",
    do: [
      %{"name" => "枣强镇", "code" => "131121100"},
      %{"name" => "恩察镇", "code" => "131121101"},
      %{"name" => "大营镇", "code" => "131121102"},
      %{"name" => "嘉会镇", "code" => "131121103"},
      %{"name" => "马屯镇", "code" => "131121104"},
      %{"name" => "肖张镇", "code" => "131121105"},
      %{"name" => "张秀屯镇", "code" => "131121106"},
      %{"name" => "新屯镇", "code" => "131121107"},
      %{"name" => "唐林镇", "code" => "131121108"},
      %{"name" => "王均乡", "code" => "131121202"},
      %{"name" => "王常乡", "code" => "131121204"}
    ]

  def next(input) when input == "武邑县" or input == "131122",
    do: [
      %{"name" => "武邑镇", "code" => "131122100"},
      %{"name" => "清凉店镇", "code" => "131122101"},
      %{"name" => "审坡镇", "code" => "131122102"},
      %{"name" => "赵桥镇", "code" => "131122103"},
      %{"name" => "韩庄镇", "code" => "131122104"},
      %{"name" => "肖桥头镇", "code" => "131122105"},
      %{"name" => "龙店镇", "code" => "131122106"},
      %{"name" => "圈头乡", "code" => "131122201"},
      %{"name" => "大紫塔乡", "code" => "131122203"}
    ]

  def next(input) when input == "武强县" or input == "131123",
    do: [
      %{"name" => "武强镇", "code" => "131123100"},
      %{"name" => "街关镇", "code" => "131123101"},
      %{"name" => "周窝镇", "code" => "131123102"},
      %{"name" => "东孙庄镇", "code" => "131123103"},
      %{"name" => "豆村镇", "code" => "131123104"},
      %{"name" => "北代镇", "code" => "131123105"}
    ]

  def next(input) when input == "饶阳县" or input == "131124",
    do: [
      %{"name" => "饶阳镇", "code" => "131124100"},
      %{"name" => "大尹村镇", "code" => "131124101"},
      %{"name" => "五公镇", "code" => "131124102"},
      %{"name" => "大官亭镇", "code" => "131124103"},
      %{"name" => "王同岳镇", "code" => "131124104"},
      %{"name" => "东里满镇", "code" => "131124105"},
      %{"name" => "留楚镇", "code" => "131124106"}
    ]

  def next(input) when input == "安平县" or input == "131125",
    do: [
      %{"name" => "安平镇", "code" => "131125100"},
      %{"name" => "马店镇", "code" => "131125101"},
      %{"name" => "南王庄镇", "code" => "131125102"},
      %{"name" => "大子文镇", "code" => "131125103"},
      %{"name" => "东黄城镇", "code" => "131125104"},
      %{"name" => "大何庄乡", "code" => "131125200"},
      %{"name" => "程油子乡", "code" => "131125201"},
      %{"name" => "西两洼乡", "code" => "131125202"},
      %{"name" => "高新技术产业开发区", "code" => "131125400"},
      %{"name" => "社区建设办公室", "code" => "131125401"}
    ]

  def next(input) when input == "故城县" or input == "131126",
    do: [
      %{"name" => "郑口镇", "code" => "131126100"},
      %{"name" => "夏庄镇", "code" => "131126101"},
      %{"name" => "青罕镇", "code" => "131126102"},
      %{"name" => "故城镇", "code" => "131126103"},
      %{"name" => "武官寨镇", "code" => "131126104"},
      %{"name" => "饶阳店镇", "code" => "131126105"},
      %{"name" => "军屯镇", "code" => "131126106"},
      %{"name" => "建国镇", "code" => "131126107"},
      %{"name" => "西半屯镇", "code" => "131126108"},
      %{"name" => "房庄镇", "code" => "131126109"},
      %{"name" => "三朗镇", "code" => "131126110"},
      %{"name" => "辛庄乡", "code" => "131126200"},
      %{"name" => "里老乡", "code" => "131126201"}
    ]

  def next(input) when input == "景县" or input == "131127",
    do: [
      %{"name" => "景州镇", "code" => "131127100"},
      %{"name" => "龙华镇", "code" => "131127101"},
      %{"name" => "广川镇", "code" => "131127102"},
      %{"name" => "王瞳镇", "code" => "131127103"},
      %{"name" => "洚河流镇", "code" => "131127104"},
      %{"name" => "安陵镇", "code" => "131127105"},
      %{"name" => "杜桥镇", "code" => "131127106"},
      %{"name" => "王谦寺镇", "code" => "131127107"},
      %{"name" => "北留智镇", "code" => "131127108"},
      %{"name" => "留智庙镇", "code" => "131127109"},
      %{"name" => "梁集镇", "code" => "131127110"},
      %{"name" => "温城镇", "code" => "131127111"},
      %{"name" => "青兰镇", "code" => "131127112"},
      %{"name" => "刘集乡", "code" => "131127200"},
      %{"name" => "连镇乡", "code" => "131127201"},
      %{"name" => "后留名府乡", "code" => "131127204"}
    ]

  def next(input) when input == "阜城县" or input == "131128",
    do: [
      %{"name" => "阜城镇", "code" => "131128100"},
      %{"name" => "古城镇", "code" => "131128101"},
      %{"name" => "码头镇", "code" => "131128102"},
      %{"name" => "霞口镇", "code" => "131128103"},
      %{"name" => "崔家庙镇", "code" => "131128104"},
      %{"name" => "漫河镇", "code" => "131128105"},
      %{"name" => "建桥乡", "code" => "131128201"},
      %{"name" => "蒋坊乡", "code" => "131128202"},
      %{"name" => "大白乡", "code" => "131128203"},
      %{"name" => "王集乡", "code" => "131128204"}
    ]

  def next(input) when input == "河北衡水高新技术产业开发区" or input == "131171",
    do: [
      %{"name" => "大麻森乡", "code" => "131171201"},
      %{"name" => "高新技术产业开发区", "code" => "131171400"},
      %{"name" => "新型功能材料产业园", "code" => "131171401"},
      %{"name" => "苏正", "code" => "131171402"}
    ]

  def next(input) when input == "衡水滨湖新区" or input == "131172",
    do: [
      %{"name" => "魏家屯镇", "code" => "131172101"},
      %{"name" => "彭杜村乡", "code" => "131172203"},
      %{"name" => "滨湖新区教育园区", "code" => "131172401"}
    ]

  def next(input) when input == "深州市" or input == "131182",
    do: [
      %{"name" => "唐奉镇", "code" => "131182100"},
      %{"name" => "深州镇", "code" => "131182101"},
      %{"name" => "辰时镇", "code" => "131182102"},
      %{"name" => "榆科镇", "code" => "131182103"},
      %{"name" => "魏家桥镇", "code" => "131182104"},
      %{"name" => "大堤镇", "code" => "131182105"},
      %{"name" => "前磨头镇", "code" => "131182106"},
      %{"name" => "王家井镇", "code" => "131182107"},
      %{"name" => "护驾迟镇", "code" => "131182108"},
      %{"name" => "大屯镇", "code" => "131182109"},
      %{"name" => "高古庄镇", "code" => "131182110"},
      %{"name" => "北溪村镇", "code" => "131182111"},
      %{"name" => "大冯营镇", "code" => "131182112"},
      %{"name" => "穆村镇", "code" => "131182113"},
      %{"name" => "兵曹乡", "code" => "131182200"},
      %{"name" => "东安庄乡", "code" => "131182202"},
      %{"name" => "乔屯乡", "code" => "131182206"},
      %{"name" => "深州监狱", "code" => "131182400"},
      %{"name" => "城市新区", "code" => "131182401"},
      %{"name" => "经济开发区", "code" => "131182403"}
    ]

  def next(input) when input == "安次区" or input == "131002",
    do: [
      %{"name" => "银河南路街道", "code" => "131002001"},
      %{"name" => "光明西道街道", "code" => "131002002"},
      %{"name" => "永华道街道", "code" => "131002003"},
      %{"name" => "落垡镇", "code" => "131002100"},
      %{"name" => "码头镇", "code" => "131002101"},
      %{"name" => "葛渔城镇", "code" => "131002102"},
      %{"name" => "东沽港镇", "code" => "131002103"},
      %{"name" => "调河头镇", "code" => "131002104"},
      %{"name" => "北史家务镇", "code" => "131002105"},
      %{"name" => "杨税务镇", "code" => "131002106"},
      %{"name" => "仇庄镇", "code" => "131002107"},
      %{"name" => "廊坊龙河高新技术产业开发区", "code" => "131002400"},
      %{"name" => "河北廊坊高新技术产业开发区", "code" => "131002401"},
      %{"name" => "河北廊坊龙港经济开发区", "code" => "131002402"},
      %{"name" => "河北安次经济开发区", "code" => "131002403"}
    ]

  def next(input) when input == "广阳区" or input == "131003",
    do: [
      %{"name" => "银河北路街道", "code" => "131003001"},
      %{"name" => "爱民东道街道", "code" => "131003002"},
      %{"name" => "解放道街道", "code" => "131003003"},
      %{"name" => "新开路街道", "code" => "131003004"},
      %{"name" => "新源道街道", "code" => "131003005"},
      %{"name" => "南尖塔镇", "code" => "131003100"},
      %{"name" => "万庄镇", "code" => "131003101"},
      %{"name" => "九州镇", "code" => "131003102"},
      %{"name" => "北旺镇", "code" => "131003103"},
      %{"name" => "河北廊坊广阳经济开发区", "code" => "131003400"}
    ]

  def next(input) when input == "固安县" or input == "131022",
    do: [
      %{"name" => "固安镇", "code" => "131022100"},
      %{"name" => "宫村镇", "code" => "131022101"},
      %{"name" => "柳泉镇", "code" => "131022102"},
      %{"name" => "牛驼镇", "code" => "131022103"},
      %{"name" => "马庄镇", "code" => "131022104"},
      %{"name" => "东湾镇", "code" => "131022105"},
      %{"name" => "渠沟镇", "code" => "131022106"},
      %{"name" => "彭村乡", "code" => "131022201"},
      %{"name" => "礼让店乡", "code" => "131022203"},
      %{"name" => "固安温泉休闲商务产业园区", "code" => "131022400"}
    ]

  def next(input) when input == "永清县" or input == "131023",
    do: [
      %{"name" => "城区街道", "code" => "131023001"},
      %{"name" => "永清镇", "code" => "131023100"},
      %{"name" => "韩村镇", "code" => "131023101"},
      %{"name" => "后奕镇", "code" => "131023102"},
      %{"name" => "别古庄镇", "code" => "131023103"},
      %{"name" => "里澜城镇", "code" => "131023104"},
      %{"name" => "管家务回族乡", "code" => "131023200"},
      %{"name" => "曹家务乡", "code" => "131023201"},
      %{"name" => "龙虎庄乡", "code" => "131023202"},
      %{"name" => "刘街乡", "code" => "131023203"},
      %{"name" => "三圣口乡", "code" => "131023204"},
      %{"name" => "河北永清经济开发区", "code" => "131023400"},
      %{"name" => "北京亦庄永清高新技术产业开发区", "code" => "131023401"}
    ]

  def next(input) when input == "香河县" or input == "131024",
    do: [
      %{"name" => "淑阳镇", "code" => "131024100"},
      %{"name" => "蒋辛屯镇", "code" => "131024101"},
      %{"name" => "渠口镇", "code" => "131024102"},
      %{"name" => "安头屯镇", "code" => "131024103"},
      %{"name" => "安平镇", "code" => "131024104"},
      %{"name" => "刘宋镇", "code" => "131024105"},
      %{"name" => "五百户镇", "code" => "131024106"},
      %{"name" => "钱旺镇", "code" => "131024107"},
      %{"name" => "钳屯镇", "code" => "131024108"},
      %{"name" => "河北香河经济开发区", "code" => "131024500"},
      %{"name" => "香河新兴产业示范区", "code" => "131024501"}
    ]

  def next(input) when input == "大城县" or input == "131025",
    do: [
      %{"name" => "平舒镇", "code" => "131025100"},
      %{"name" => "旺村镇", "code" => "131025101"},
      %{"name" => "大尚屯镇", "code" => "131025102"},
      %{"name" => "南赵扶镇", "code" => "131025103"},
      %{"name" => "留各庄镇", "code" => "131025104"},
      %{"name" => "权村镇", "code" => "131025105"},
      %{"name" => "里坦镇", "code" => "131025106"},
      %{"name" => "广安镇", "code" => "131025107"},
      %{"name" => "北魏镇", "code" => "131025108"},
      %{"name" => "臧屯镇", "code" => "131025109"},
      %{"name" => "河北大城经济开发区", "code" => "131025400"}
    ]

  def next(input) when input == "文安县" or input == "131026",
    do: [
      %{"name" => "文安镇", "code" => "131026100"},
      %{"name" => "新镇镇", "code" => "131026101"},
      %{"name" => "苏桥镇", "code" => "131026102"},
      %{"name" => "大柳河镇", "code" => "131026103"},
      %{"name" => "左各庄镇", "code" => "131026104"},
      %{"name" => "滩里镇", "code" => "131026105"},
      %{"name" => "史各庄镇", "code" => "131026106"},
      %{"name" => "赵各庄镇", "code" => "131026107"},
      %{"name" => "兴隆宫镇", "code" => "131026108"},
      %{"name" => "大留镇镇", "code" => "131026109"},
      %{"name" => "孙氏镇", "code" => "131026110"},
      %{"name" => "德归镇", "code" => "131026111"},
      %{"name" => "大围河回族满族乡", "code" => "131026200"}
    ]

  def next(input) when input == "大厂回族自治县" or input == "131028",
    do: [
      %{"name" => "北辰街道", "code" => "131028001"},
      %{"name" => "大厂镇", "code" => "131028100"},
      %{"name" => "夏垫镇", "code" => "131028101"},
      %{"name" => "祁各庄镇", "code" => "131028102"},
      %{"name" => "邵府镇", "code" => "131028103"},
      %{"name" => "陈府镇", "code" => "131028104"},
      %{"name" => "河北大厂高新技术产业开发区", "code" => "131028400"}
    ]

  def next(input) when input == "廊坊经济技术开发区" or input == "131071",
    do: [%{"name" => "耀华道街道", "code" => "131071450"}, %{"name" => "云鹏道街道", "code" => "131071451"}]

  def next(input) when input == "霸州市" or input == "131081",
    do: [
      %{"name" => "裕华街道", "code" => "131081001"},
      %{"name" => "霸州镇", "code" => "131081100"},
      %{"name" => "南孟镇", "code" => "131081101"},
      %{"name" => "信安镇", "code" => "131081102"},
      %{"name" => "堂二里镇", "code" => "131081103"},
      %{"name" => "煎茶铺镇", "code" => "131081104"},
      %{"name" => "胜芳镇", "code" => "131081105"},
      %{"name" => "杨芬港镇", "code" => "131081106"},
      %{"name" => "康仙庄镇", "code" => "131081107"},
      %{"name" => "王庄子镇", "code" => "131081108"},
      %{"name" => "岔河集乡", "code" => "131081200"},
      %{"name" => "东杨庄乡", "code" => "131081202"},
      %{"name" => "东段乡", "code" => "131081204"}
    ]

  def next(input) when input == "三河市" or input == "131082",
    do: [
      %{"name" => "鼎盛东街道", "code" => "131082001"},
      %{"name" => "泃阳西街道", "code" => "131082002"},
      %{"name" => "行宫东街道", "code" => "131082003"},
      %{"name" => "迎宾北路街道", "code" => "131082004"},
      %{"name" => "燕顺路街道", "code" => "131082005"},
      %{"name" => "康城街道", "code" => "131082006"},
      %{"name" => "泃阳镇", "code" => "131082100"},
      %{"name" => "李旗庄镇", "code" => "131082101"},
      %{"name" => "杨庄镇", "code" => "131082102"},
      %{"name" => "皇庄镇", "code" => "131082103"},
      %{"name" => "新集镇", "code" => "131082104"},
      %{"name" => "段甲岭镇", "code" => "131082105"},
      %{"name" => "黄土庄镇", "code" => "131082106"},
      %{"name" => "高楼镇", "code" => "131082107"},
      %{"name" => "齐心庄镇", "code" => "131082108"},
      %{"name" => "燕郊镇", "code" => "131082109"},
      %{"name" => "燕郊高新技术产业开发区", "code" => "131082450"},
      %{"name" => "河北三河国家农业科技园区", "code" => "131082451"}
    ]

  def next(input) when input == "新华区" or input == "130902",
    do: [
      %{"name" => "建设北街街道", "code" => "130902001"},
      %{"name" => "车站街道", "code" => "130902002"},
      %{"name" => "南大街街道", "code" => "130902003"},
      %{"name" => "东环中街街道", "code" => "130902004"},
      %{"name" => "道东街道", "code" => "130902005"},
      %{"name" => "小赵庄乡", "code" => "130902200"}
    ]

  def next(input) when input == "运河区" or input == "130903",
    do: [
      %{"name" => "水月寺街街道", "code" => "130903001"},
      %{"name" => "南环中路街道", "code" => "130903002"},
      %{"name" => "南湖街道", "code" => "130903003"},
      %{"name" => "市场街道", "code" => "130903004"},
      %{"name" => "西环中街街道", "code" => "130903005"},
      %{"name" => "公园街道", "code" => "130903006"},
      %{"name" => "小王庄镇", "code" => "130903100"},
      %{"name" => "南陈屯镇", "code" => "130903101"}
    ]

  def next(input) when input == "沧县" or input == "130921",
    do: [
      %{"name" => "旧州镇", "code" => "130921100"},
      %{"name" => "兴济镇", "code" => "130921101"},
      %{"name" => "杜生镇", "code" => "130921102"},
      %{"name" => "崔尔庄镇", "code" => "130921103"},
      %{"name" => "李天木镇", "code" => "130921104"},
      %{"name" => "纸房头镇", "code" => "130921105"},
      %{"name" => "姚官屯镇", "code" => "130921106"},
      %{"name" => "杜林镇", "code" => "130921107"},
      %{"name" => "汪家铺镇", "code" => "130921108"},
      %{"name" => "张官屯镇", "code" => "130921109"},
      %{"name" => "薛官屯乡", "code" => "130921200"},
      %{"name" => "捷地回族乡", "code" => "130921201"},
      %{"name" => "风化店乡", "code" => "130921204"},
      %{"name" => "刘家庙乡", "code" => "130921208"},
      %{"name" => "仵龙堂乡", "code" => "130921209"},
      %{"name" => "大官厅乡", "code" => "130921210"},
      %{"name" => "高川乡", "code" => "130921211"},
      %{"name" => "黄递铺乡", "code" => "130921212"},
      %{"name" => "大褚村回族乡", "code" => "130921213"}
    ]

  def next(input) when input == "青县" or input == "130922",
    do: [
      %{"name" => "清州镇", "code" => "130922100"},
      %{"name" => "金牛镇", "code" => "130922101"},
      %{"name" => "新兴镇", "code" => "130922102"},
      %{"name" => "流河镇", "code" => "130922103"},
      %{"name" => "木门店镇", "code" => "130922104"},
      %{"name" => "马厂镇", "code" => "130922105"},
      %{"name" => "盘古镇", "code" => "130922106"},
      %{"name" => "曹寺镇", "code" => "130922107"},
      %{"name" => "上伍乡", "code" => "130922200"},
      %{"name" => "陈嘴乡", "code" => "130922203"},
      %{"name" => "青县农场", "code" => "130922400"}
    ]

  def next(input) when input == "东光县" or input == "130923",
    do: [
      %{"name" => "东光镇", "code" => "130923100"},
      %{"name" => "连镇镇", "code" => "130923101"},
      %{"name" => "找王镇", "code" => "130923102"},
      %{"name" => "秦村镇", "code" => "130923103"},
      %{"name" => "灯明寺镇", "code" => "130923104"},
      %{"name" => "南霞口镇", "code" => "130923105"},
      %{"name" => "大单镇", "code" => "130923106"},
      %{"name" => "龙王李镇", "code" => "130923107"},
      %{"name" => "于桥镇", "code" => "130923108"}
    ]

  def next(input) when input == "海兴县" or input == "130924",
    do: [
      %{"name" => "苏基镇", "code" => "130924100"},
      %{"name" => "辛集镇", "code" => "130924101"},
      %{"name" => "高湾镇", "code" => "130924102"},
      %{"name" => "赵毛陶镇", "code" => "130924103"},
      %{"name" => "张会亭镇", "code" => "130924104"},
      %{"name" => "香坊乡", "code" => "130924201"},
      %{"name" => "小山乡", "code" => "130924202"},
      %{"name" => "海兴县农场", "code" => "130924400"},
      %{"name" => "青先农场", "code" => "130924401"},
      %{"name" => "青锋农场", "code" => "130924402"}
    ]

  def next(input) when input == "盐山县" or input == "130925",
    do: [
      %{"name" => "盐山镇", "code" => "130925100"},
      %{"name" => "望树镇", "code" => "130925101"},
      %{"name" => "庆云镇", "code" => "130925102"},
      %{"name" => "韩集镇", "code" => "130925103"},
      %{"name" => "千童镇", "code" => "130925104"},
      %{"name" => "圣佛镇", "code" => "130925105"},
      %{"name" => "边务镇", "code" => "130925106"},
      %{"name" => "小庄镇", "code" => "130925107"},
      %{"name" => "杨集镇", "code" => "130925108"},
      %{"name" => "孟店镇", "code" => "130925109"},
      %{"name" => "小营乡", "code" => "130925201"},
      %{"name" => "常庄乡", "code" => "130925204"}
    ]

  def next(input) when input == "肃宁县" or input == "130926",
    do: [
      %{"name" => "肃宁镇", "code" => "130926100"},
      %{"name" => "梁家村镇", "code" => "130926101"},
      %{"name" => "窝北镇", "code" => "130926102"},
      %{"name" => "尚村镇", "code" => "130926103"},
      %{"name" => "万里镇", "code" => "130926104"},
      %{"name" => "师素镇", "code" => "130926105"},
      %{"name" => "河北留善寺镇", "code" => "130926106"},
      %{"name" => "付家佐镇", "code" => "130926107"},
      %{"name" => "邵庄乡", "code" => "130926205"}
    ]

  def next(input) when input == "南皮县" or input == "130927",
    do: [
      %{"name" => "南皮镇", "code" => "130927100"},
      %{"name" => "冯家口镇", "code" => "130927101"},
      %{"name" => "寨子镇", "code" => "130927102"},
      %{"name" => "鲍官屯镇", "code" => "130927103"},
      %{"name" => "王寺镇", "code" => "130927104"},
      %{"name" => "乌马营镇", "code" => "130927105"},
      %{"name" => "潞灌镇", "code" => "130927106"},
      %{"name" => "刘八里镇", "code" => "130927107"},
      %{"name" => "大浪淀乡", "code" => "130927200"}
    ]

  def next(input) when input == "吴桥县" or input == "130928",
    do: [
      %{"name" => "桑园镇", "code" => "130928100"},
      %{"name" => "铁城镇", "code" => "130928101"},
      %{"name" => "于集镇", "code" => "130928102"},
      %{"name" => "梁集镇", "code" => "130928103"},
      %{"name" => "安陵镇", "code" => "130928104"},
      %{"name" => "曹家洼乡", "code" => "130928200"},
      %{"name" => "东宋门乡", "code" => "130928201"},
      %{"name" => "杨家寺乡", "code" => "130928202"},
      %{"name" => "沟店铺乡", "code" => "130928203"},
      %{"name" => "何庄乡", "code" => "130928204"},
      %{"name" => "吴桥经济技术开发区", "code" => "130928400"}
    ]

  def next(input) when input == "献县" or input == "130929",
    do: [
      %{"name" => "乐寿镇", "code" => "130929100"},
      %{"name" => "淮镇镇", "code" => "130929101"},
      %{"name" => "郭庄镇", "code" => "130929102"},
      %{"name" => "河城街镇", "code" => "130929103"},
      %{"name" => "韩村镇", "code" => "130929104"},
      %{"name" => "陌南镇", "code" => "130929105"},
      %{"name" => "陈庄镇", "code" => "130929106"},
      %{"name" => "段村镇", "code" => "130929107"},
      %{"name" => "高官镇", "code" => "130929108"},
      %{"name" => "十五级镇", "code" => "130929109"},
      %{"name" => "商林乡", "code" => "130929206"},
      %{"name" => "张村乡", "code" => "130929209"},
      %{"name" => "临河乡", "code" => "130929210"},
      %{"name" => "小平王乡", "code" => "130929211"},
      %{"name" => "垒头乡", "code" => "130929213"},
      %{"name" => "南河头乡", "code" => "130929214"},
      %{"name" => "西城乡", "code" => "130929215"},
      %{"name" => "本斋回族乡", "code" => "130929216"},
      %{"name" => "梅庄洼农场", "code" => "130929400"},
      %{"name" => "献县经济开发区", "code" => "130929401"}
    ]

  def next(input) when input == "孟村回族自治县" or input == "130930",
    do: [
      %{"name" => "孟村镇", "code" => "130930100"},
      %{"name" => "新县镇", "code" => "130930101"},
      %{"name" => "辛店镇", "code" => "130930102"},
      %{"name" => "高寨镇", "code" => "130930103"},
      %{"name" => "宋庄子乡", "code" => "130930200"},
      %{"name" => "牛进庄乡", "code" => "130930201"}
    ]

  def next(input) when input == "河北沧州经济开发区" or input == "130971",
    do: [%{"name" => "社会事务局", "code" => "130971401"}]

  def next(input) when input == "沧州高新技术产业开发区" or input == "130972",
    do: [%{"name" => "社会发展局", "code" => "130972401"}]

  def next(input) when input == "沧州渤海新区" or input == "130973",
    do: [
      %{"name" => "新村回族乡", "code" => "130973206"},
      %{"name" => "南大港管理区", "code" => "130973400"},
      %{"name" => "国营中捷农场", "code" => "130973401"},
      %{"name" => "港城街道", "code" => "130973402"},
      %{"name" => "临港化工园区", "code" => "130973403"}
    ]

  def next(input) when input == "泊头市" or input == "130981",
    do: [
      %{"name" => "解放街道", "code" => "130981001"},
      %{"name" => "河东街道", "code" => "130981002"},
      %{"name" => "鼓楼街道", "code" => "130981003"},
      %{"name" => "泊镇", "code" => "130981100"},
      %{"name" => "交河镇", "code" => "130981101"},
      %{"name" => "齐桥镇", "code" => "130981102"},
      %{"name" => "寺门村镇", "code" => "130981103"},
      %{"name" => "郝村镇", "code" => "130981104"},
      %{"name" => "富镇镇", "code" => "130981105"},
      %{"name" => "文庙镇", "code" => "130981106"},
      %{"name" => "洼里王镇", "code" => "130981107"},
      %{"name" => "四营镇", "code" => "130981108"},
      %{"name" => "王武庄乡", "code" => "130981201"},
      %{"name" => "营子乡", "code" => "130981202"},
      %{"name" => "西辛店乡", "code" => "130981204"},
      %{"name" => "河北泊头经济开发区", "code" => "130981400"}
    ]

  def next(input) when input == "任丘市" or input == "130982",
    do: [
      %{"name" => "新华路街道", "code" => "130982001"},
      %{"name" => "西环路街道", "code" => "130982002"},
      %{"name" => "永丰路街道", "code" => "130982003"},
      %{"name" => "中华路街道", "code" => "130982004"},
      %{"name" => "渤海路街道", "code" => "130982005"},
      %{"name" => "油建路街道", "code" => "130982006"},
      %{"name" => "会战道街道", "code" => "130982007"},
      %{"name" => "出岸镇", "code" => "130982100"},
      %{"name" => "石门桥镇", "code" => "130982101"},
      %{"name" => "吕公堡镇", "code" => "130982102"},
      %{"name" => "长丰镇", "code" => "130982103"},
      %{"name" => "梁召镇", "code" => "130982106"},
      %{"name" => "辛中驿镇", "code" => "130982107"},
      %{"name" => "麻家坞镇", "code" => "130982108"},
      %{"name" => "北辛庄镇", "code" => "130982109"},
      %{"name" => "议论堡镇", "code" => "130982110"},
      %{"name" => "于村镇", "code" => "130982111"},
      %{"name" => "青塔乡", "code" => "130982204"},
      %{"name" => "北汉乡", "code" => "130982207"},
      %{"name" => "华北石油管理局", "code" => "130982400"},
      %{"name" => "河北任丘经济开发区", "code" => "130982500"}
    ]

  def next(input) when input == "黄骅市" or input == "130983",
    do: [
      %{"name" => "骅东街道", "code" => "130983001"},
      %{"name" => "骅中街道", "code" => "130983002"},
      %{"name" => "骅西街道", "code" => "130983003"},
      %{"name" => "黄骅镇", "code" => "130983100"},
      %{"name" => "南排河镇", "code" => "130983101"},
      %{"name" => "吕桥镇", "code" => "130983102"},
      %{"name" => "旧城镇", "code" => "130983103"},
      %{"name" => "齐家务镇", "code" => "130983104"},
      %{"name" => "滕庄子镇", "code" => "130983105"},
      %{"name" => "常郭镇", "code" => "130983106"},
      %{"name" => "羊二庄镇", "code" => "130983107"},
      %{"name" => "官庄乡", "code" => "130983204"},
      %{"name" => "羊三木回族乡", "code" => "130983207"},
      %{"name" => "黄骅经济技术开发区", "code" => "130983404"}
    ]

  def next(input) when input == "河间市" or input == "130984",
    do: [
      %{"name" => "瀛州路街道", "code" => "130984001"},
      %{"name" => "城垣西路街道", "code" => "130984002"},
      %{"name" => "米各庄镇", "code" => "130984101"},
      %{"name" => "景和镇", "code" => "130984102"},
      %{"name" => "卧佛堂镇", "code" => "130984103"},
      %{"name" => "束城镇", "code" => "130984104"},
      %{"name" => "留古寺镇", "code" => "130984105"},
      %{"name" => "沙河桥镇", "code" => "130984106"},
      %{"name" => "诗经村镇", "code" => "130984107"},
      %{"name" => "尊祖庄镇", "code" => "130984108"},
      %{"name" => "兴村镇", "code" => "130984109"},
      %{"name" => "行别营镇", "code" => "130984110"},
      %{"name" => "故仙镇", "code" => "130984111"},
      %{"name" => "黎民居乡", "code" => "130984201"},
      %{"name" => "沙洼乡", "code" => "130984203"},
      %{"name" => "西九吉乡", "code" => "130984204"},
      %{"name" => "北石槽乡", "code" => "130984205"},
      %{"name" => "时村乡", "code" => "130984209"},
      %{"name" => "龙华店乡", "code" => "130984212"},
      %{"name" => "果子洼回族乡", "code" => "130984213"},
      %{"name" => "河北河间经济开发区", "code" => "130984403"}
    ]

  def next(input) when input == "双桥区" or input == "130802",
    do: [
      %{"name" => "西大街街道", "code" => "130802001"},
      %{"name" => "头道牌楼街道", "code" => "130802002"},
      %{"name" => "潘家沟街道", "code" => "130802003"},
      %{"name" => "中华路街道", "code" => "130802004"},
      %{"name" => "新华路街道", "code" => "130802005"},
      %{"name" => "石洞子沟街道", "code" => "130802006"},
      %{"name" => "桥东街道", "code" => "130802007"},
      %{"name" => "水泉沟镇", "code" => "130802100"},
      %{"name" => "狮子沟镇", "code" => "130802101"},
      %{"name" => "牛圈子沟镇", "code" => "130802102"},
      %{"name" => "大石庙镇", "code" => "130802103"},
      %{"name" => "双峰寺镇", "code" => "130802105"}
    ]

  def next(input) when input == "双滦区" or input == "130803",
    do: [
      %{"name" => "元宝山街道", "code" => "130803001"},
      %{"name" => "钢城街道", "code" => "130803002"},
      %{"name" => "秀水街道", "code" => "130803003"},
      %{"name" => "双塔山镇", "code" => "130803100"},
      %{"name" => "滦河镇", "code" => "130803101"},
      %{"name" => "大庙镇", "code" => "130803102"},
      %{"name" => "偏桥子镇", "code" => "130803103"},
      %{"name" => "西地镇", "code" => "130803104"},
      %{"name" => "陈栅子镇", "code" => "130803105"}
    ]

  def next(input) when input == "鹰手营子矿区" or input == "130804",
    do: [
      %{"name" => "铁北路街道", "code" => "130804001"},
      %{"name" => "鹰手营子镇", "code" => "130804100"},
      %{"name" => "北马圈子镇", "code" => "130804101"},
      %{"name" => "寿王坟镇", "code" => "130804102"},
      %{"name" => "汪家庄镇", "code" => "130804103"}
    ]

  def next(input) when input == "承德县" or input == "130821",
    do: [
      %{"name" => "下板城镇", "code" => "130821100"},
      %{"name" => "甲山镇", "code" => "130821102"},
      %{"name" => "六沟镇", "code" => "130821103"},
      %{"name" => "三沟镇", "code" => "130821104"},
      %{"name" => "头沟镇", "code" => "130821105"},
      %{"name" => "高寺台镇", "code" => "130821106"},
      %{"name" => "鞍匠镇", "code" => "130821107"},
      %{"name" => "三家镇", "code" => "130821108"},
      %{"name" => "磴上镇", "code" => "130821109"},
      %{"name" => "上谷镇", "code" => "130821110"},
      %{"name" => "新杖子镇", "code" => "130821111"},
      %{"name" => "石灰窑镇", "code" => "130821112"},
      %{"name" => "东小白旗乡", "code" => "130821200"},
      %{"name" => "刘杖子乡", "code" => "130821202"},
      %{"name" => "孟家院乡", "code" => "130821204"},
      %{"name" => "大营子乡", "code" => "130821205"},
      %{"name" => "八家乡", "code" => "130821206"},
      %{"name" => "满杖子乡", "code" => "130821208"},
      %{"name" => "五道河乡", "code" => "130821210"},
      %{"name" => "岔沟乡", "code" => "130821211"},
      %{"name" => "岗子满族乡", "code" => "130821212"},
      %{"name" => "两家满族乡", "code" => "130821214"},
      %{"name" => "仓子乡", "code" => "130821216"}
    ]

  def next(input) when input == "兴隆县" or input == "130822",
    do: [
      %{"name" => "兴隆镇", "code" => "130822100"},
      %{"name" => "半壁山镇", "code" => "130822101"},
      %{"name" => "挂兰峪镇", "code" => "130822102"},
      %{"name" => "青松岭镇", "code" => "130822103"},
      %{"name" => "六道河镇", "code" => "130822104"},
      %{"name" => "平安堡镇", "code" => "130822105"},
      %{"name" => "北营房镇", "code" => "130822106"},
      %{"name" => "孤山子镇", "code" => "130822107"},
      %{"name" => "蓝旗营镇", "code" => "130822108"},
      %{"name" => "雾灵山镇", "code" => "130822109"},
      %{"name" => "李家营镇", "code" => "130822110"},
      %{"name" => "大杖子镇", "code" => "130822111"},
      %{"name" => "三道河镇", "code" => "130822112"},
      %{"name" => "蘑菇峪镇", "code" => "130822113"},
      %{"name" => "大水泉镇", "code" => "130822114"},
      %{"name" => "南天门满族乡", "code" => "130822200"},
      %{"name" => "八卦岭满族乡", "code" => "130822202"},
      %{"name" => "陡子峪乡", "code" => "130822203"},
      %{"name" => "上石洞乡", "code" => "130822204"},
      %{"name" => "安子岭乡", "code" => "130822211"}
    ]

  def next(input) when input == "滦平县" or input == "130824",
    do: [
      %{"name" => "中兴路街道", "code" => "130824001"},
      %{"name" => "滦平镇", "code" => "130824100"},
      %{"name" => "长山峪镇", "code" => "130824101"},
      %{"name" => "红旗镇", "code" => "130824102"},
      %{"name" => "金沟屯镇", "code" => "130824103"},
      %{"name" => "虎什哈镇", "code" => "130824104"},
      %{"name" => "巴克什营镇", "code" => "130824105"},
      %{"name" => "张百湾镇", "code" => "130824106"},
      %{"name" => "付营子镇", "code" => "130824107"},
      %{"name" => "大屯镇", "code" => "130824108"},
      %{"name" => "火斗山镇", "code" => "130824109"},
      %{"name" => "两间房镇", "code" => "130824110"},
      %{"name" => "小营镇", "code" => "130824111"},
      %{"name" => "安纯沟门镇", "code" => "130824112"},
      %{"name" => "平坊满族乡", "code" => "130824200"},
      %{"name" => "西沟满族乡", "code" => "130824206"},
      %{"name" => "邓厂满族乡", "code" => "130824207"},
      %{"name" => "五道营子满族乡", "code" => "130824208"},
      %{"name" => "马营子满族乡", "code" => "130824209"},
      %{"name" => "付家店满族乡", "code" => "130824210"}
    ]

  def next(input) when input == "隆化县" or input == "130825",
    do: [
      %{"name" => "安州街道", "code" => "130825001"},
      %{"name" => "韩麻营镇", "code" => "130825101"},
      %{"name" => "中关镇", "code" => "130825102"},
      %{"name" => "七家镇", "code" => "130825103"},
      %{"name" => "汤头沟镇", "code" => "130825104"},
      %{"name" => "张三营镇", "code" => "130825105"},
      %{"name" => "唐三营镇", "code" => "130825106"},
      %{"name" => "蓝旗镇", "code" => "130825107"},
      %{"name" => "步古沟镇", "code" => "130825108"},
      %{"name" => "郭家屯镇", "code" => "130825109"},
      %{"name" => "茅荆坝镇", "code" => "130825110"},
      %{"name" => "苔山镇", "code" => "130825111"},
      %{"name" => "荒地镇", "code" => "130825112"},
      %{"name" => "章吉营镇", "code" => "130825113"},
      %{"name" => "偏坡营镇", "code" => "130825114"},
      %{"name" => "尹家营满族乡", "code" => "130825203"},
      %{"name" => "庙子沟蒙古族满族乡", "code" => "130825204"},
      %{"name" => "山湾乡", "code" => "130825206"},
      %{"name" => "八达营蒙古族乡", "code" => "130825207"},
      %{"name" => "太平庄满族乡", "code" => "130825208"},
      %{"name" => "旧屯满族乡", "code" => "130825209"},
      %{"name" => "西阿超满族蒙古族乡", "code" => "130825210"},
      %{"name" => "碱房乡", "code" => "130825212"},
      %{"name" => "韩家店乡", "code" => "130825213"},
      %{"name" => "湾沟门乡", "code" => "130825214"}
    ]

  def next(input) when input == "丰宁满族自治县" or input == "130826",
    do: [
      %{"name" => "新丰路街道", "code" => "130826001"},
      %{"name" => "大阁镇", "code" => "130826100"},
      %{"name" => "大滩镇", "code" => "130826101"},
      %{"name" => "鱼儿山镇", "code" => "130826102"},
      %{"name" => "土城镇", "code" => "130826103"},
      %{"name" => "黄旗镇", "code" => "130826104"},
      %{"name" => "凤山镇", "code" => "130826105"},
      %{"name" => "波罗诺镇", "code" => "130826106"},
      %{"name" => "黑山咀嘴镇", "code" => "130826107"},
      %{"name" => "天桥镇", "code" => "130826108"},
      %{"name" => "胡麻营镇", "code" => "130826109"},
      %{"name" => "将军营镇", "code" => "130826110"},
      %{"name" => "万胜永乡", "code" => "130826200"},
      %{"name" => "四岔口乡", "code" => "130826201"},
      %{"name" => "苏家店乡", "code" => "130826202"},
      %{"name" => "外沟门乡", "code" => "130826203"},
      %{"name" => "草原乡", "code" => "130826204"},
      %{"name" => "窟窿山乡", "code" => "130826205"},
      %{"name" => "小坝子乡", "code" => "130826206"},
      %{"name" => "五道营乡", "code" => "130826207"},
      %{"name" => "选将营乡", "code" => "130826209"},
      %{"name" => "西官营乡", "code" => "130826210"},
      %{"name" => "王营乡", "code" => "130826211"},
      %{"name" => "北头营乡", "code" => "130826212"},
      %{"name" => "石人沟乡", "code" => "130826214"},
      %{"name" => "汤河乡", "code" => "130826215"},
      %{"name" => "杨木栅子乡", "code" => "130826216"}
    ]

  def next(input) when input == "宽城满族自治县" or input == "130827",
    do: [
      %{"name" => "宽城镇", "code" => "130827100"},
      %{"name" => "龙须门镇", "code" => "130827101"},
      %{"name" => "峪耳崖镇", "code" => "130827102"},
      %{"name" => "板城镇", "code" => "130827103"},
      %{"name" => "汤道河镇", "code" => "130827104"},
      %{"name" => "桲罗台镇", "code" => "130827105"},
      %{"name" => "碾子峪镇", "code" => "130827106"},
      %{"name" => "亮甲台镇", "code" => "130827107"},
      %{"name" => "化皮溜子镇", "code" => "130827108"},
      %{"name" => "松岭镇", "code" => "130827109"},
      %{"name" => "塌山乡", "code" => "130827201"},
      %{"name" => "孟子岭乡", "code" => "130827203"},
      %{"name" => "独石沟乡", "code" => "130827204"},
      %{"name" => "铧尖乡", "code" => "130827207"},
      %{"name" => "东黄花川乡", "code" => "130827208"},
      %{"name" => "苇子沟乡", "code" => "130827210"},
      %{"name" => "大字沟门乡", "code" => "130827211"},
      %{"name" => "大石柱子乡", "code" => "130827212"}
    ]

  def next(input) when input == "围场满族蒙古族自治县" or input == "130828",
    do: [
      %{"name" => "围场镇", "code" => "130828100"},
      %{"name" => "四合永镇", "code" => "130828101"},
      %{"name" => "克勒沟镇", "code" => "130828102"},
      %{"name" => "棋盘山镇", "code" => "130828103"},
      %{"name" => "半截塔镇", "code" => "130828104"},
      %{"name" => "朝阳地镇", "code" => "130828105"},
      %{"name" => "朝阳湾镇", "code" => "130828106"},
      %{"name" => "腰站镇", "code" => "130828107"},
      %{"name" => "龙头山镇", "code" => "130828108"},
      %{"name" => "新拨镇", "code" => "130828109"},
      %{"name" => "御道口镇", "code" => "130828110"},
      %{"name" => "城子镇", "code" => "130828111"},
      %{"name" => "新地镇", "code" => "130828112"},
      %{"name" => "哈里哈镇", "code" => "130828113"},
      %{"name" => "道坝子乡", "code" => "130828200"},
      %{"name" => "黄土坎乡", "code" => "130828203"},
      %{"name" => "四道沟乡", "code" => "130828204"},
      %{"name" => "兰旗卡伦乡", "code" => "130828205"},
      %{"name" => "银窝沟乡", "code" => "130828206"},
      %{"name" => "广发永乡", "code" => "130828208"},
      %{"name" => "育太和乡", "code" => "130828209"},
      %{"name" => "郭家湾乡", "code" => "130828210"},
      %{"name" => "杨家湾乡", "code" => "130828211"},
      %{"name" => "大唤起乡", "code" => "130828212"},
      %{"name" => "张家湾乡", "code" => "130828215"},
      %{"name" => "宝元栈乡", "code" => "130828216"},
      %{"name" => "山湾子乡", "code" => "130828217"},
      %{"name" => "三义永乡", "code" => "130828218"},
      %{"name" => "姜家店乡", "code" => "130828219"},
      %{"name" => "下伙房乡", "code" => "130828220"},
      %{"name" => "燕格柏乡", "code" => "130828221"},
      %{"name" => "牌楼乡", "code" => "130828222"},
      %{"name" => "老窝铺乡", "code" => "130828224"},
      %{"name" => "石桌子乡", "code" => "130828226"},
      %{"name" => "大头山乡", "code" => "130828227"},
      %{"name" => "南山嘴乡", "code" => "130828228"},
      %{"name" => "西龙头乡", "code" => "130828229"},
      %{"name" => "塞罕坝机械林场", "code" => "130828450"},
      %{"name" => "国营御道口牧场", "code" => "130828500"}
    ]

  def next(input) when input == "承德高新技术产业开发区" or input == "130871",
    do: [%{"name" => "冯营子镇", "code" => "130871104"}, %{"name" => "上板城镇", "code" => "130871106"}]

  def next(input) when input == "平泉市" or input == "130881",
    do: [
      %{"name" => "平泉镇", "code" => "130881100"},
      %{"name" => "黄土梁子镇", "code" => "130881101"},
      %{"name" => "榆树林子镇", "code" => "130881102"},
      %{"name" => "杨树岭镇", "code" => "130881103"},
      %{"name" => "七沟镇", "code" => "130881104"},
      %{"name" => "小寺沟镇", "code" => "130881105"},
      %{"name" => "党坝镇", "code" => "130881106"},
      %{"name" => "卧龙镇", "code" => "130881107"},
      %{"name" => "南五十家子镇", "code" => "130881108"},
      %{"name" => "北五十家子镇", "code" => "130881109"},
      %{"name" => "桲椤树镇", "code" => "130881110"},
      %{"name" => "柳溪镇", "code" => "130881111"},
      %{"name" => "平北镇", "code" => "130881112"},
      %{"name" => "青河镇", "code" => "130881113"},
      %{"name" => "台头山镇", "code" => "130881114"},
      %{"name" => "王土房乡", "code" => "130881200"},
      %{"name" => "七家岱满族乡", "code" => "130881203"},
      %{"name" => "茅兰沟满族蒙古族乡", "code" => "130881206"},
      %{"name" => "道虎沟乡", "code" => "130881210"}
    ]

  def next(input) when input == "桥东区" or input == "130702",
    do: [
      %{"name" => "红旗楼街道", "code" => "130702001"},
      %{"name" => "胜利北路街道", "code" => "130702002"},
      %{"name" => "五一路街道", "code" => "130702003"},
      %{"name" => "花园街街道", "code" => "130702004"},
      %{"name" => "工业路街道", "code" => "130702005"},
      %{"name" => "姚家庄镇", "code" => "130702101"},
      %{"name" => "大仓盖镇", "code" => "130702102"},
      %{"name" => "东望山乡", "code" => "130702202"}
    ]

  def next(input) when input == "桥西区" or input == "130703",
    do: [
      %{"name" => "新华街街道", "code" => "130703001"},
      %{"name" => "大境门街道", "code" => "130703002"},
      %{"name" => "明德北街街道", "code" => "130703003"},
      %{"name" => "明德南街街道", "code" => "130703004"},
      %{"name" => "堡子里街道", "code" => "130703005"},
      %{"name" => "南营坊街道", "code" => "130703006"},
      %{"name" => "工人新村街道", "code" => "130703007"},
      %{"name" => "东窑子镇", "code" => "130703100"}
    ]

  def next(input) when input == "宣化区" or input == "130705",
    do: [
      %{"name" => "天泰寺街道", "code" => "130705001"},
      %{"name" => "皇城街道", "code" => "130705002"},
      %{"name" => "南关街道", "code" => "130705003"},
      %{"name" => "南大街街道", "code" => "130705004"},
      %{"name" => "大北街街道", "code" => "130705005"},
      %{"name" => "工业街街道", "code" => "130705006"},
      %{"name" => "建国街街道", "code" => "130705007"},
      %{"name" => "庞家堡镇", "code" => "130705100"},
      %{"name" => "深井镇", "code" => "130705101"},
      %{"name" => "崞村镇", "code" => "130705102"},
      %{"name" => "洋河南镇", "code" => "130705104"},
      %{"name" => "贾家营镇", "code" => "130705106"},
      %{"name" => "顾家营镇", "code" => "130705107"},
      %{"name" => "赵川镇", "code" => "130705108"},
      %{"name" => "江家屯镇", "code" => "130705109"},
      %{"name" => "河子西镇", "code" => "130705110"},
      %{"name" => "侯家庙镇", "code" => "130705111"},
      %{"name" => "春光乡", "code" => "130705201"},
      %{"name" => "李家堡乡", "code" => "130705204"},
      %{"name" => "王家湾乡", "code" => "130705205"},
      %{"name" => "塔儿村乡", "code" => "130705206"}
    ]

  def next(input) when input == "下花园区" or input == "130706",
    do: [
      %{"name" => "城镇街道", "code" => "130706001"},
      %{"name" => "煤矿街道", "code" => "130706002"},
      %{"name" => "花园乡", "code" => "130706200"},
      %{"name" => "辛庄子乡", "code" => "130706201"},
      %{"name" => "定方水乡", "code" => "130706202"},
      %{"name" => "段家堡乡", "code" => "130706203"}
    ]

  def next(input) when input == "万全区" or input == "130708",
    do: [
      %{"name" => "孔家庄镇", "code" => "130708100"},
      %{"name" => "万全镇", "code" => "130708101"},
      %{"name" => "洗马林镇", "code" => "130708102"},
      %{"name" => "郭磊庄镇", "code" => "130708103"},
      %{"name" => "膳房堡乡", "code" => "130708200"},
      %{"name" => "北新屯乡", "code" => "130708201"},
      %{"name" => "宣平堡乡", "code" => "130708202"},
      %{"name" => "高庙堡乡", "code" => "130708203"},
      %{"name" => "旧堡乡", "code" => "130708204"},
      %{"name" => "安家堡乡", "code" => "130708205"},
      %{"name" => "北沙城乡", "code" => "130708206"},
      %{"name" => "孔家庄街道", "code" => "130708400"},
      %{"name" => "宣平街道", "code" => "130708401"}
    ]

  def next(input) when input == "崇礼区" or input == "130709",
    do: [
      %{"name" => "西湾子镇", "code" => "130709100"},
      %{"name" => "高家营镇", "code" => "130709101"},
      %{"name" => "四台嘴乡", "code" => "130709200"},
      %{"name" => "红旗营乡", "code" => "130709201"},
      %{"name" => "石窑子乡", "code" => "130709202"},
      %{"name" => "驿马图乡", "code" => "130709203"},
      %{"name" => "石嘴子乡", "code" => "130709204"},
      %{"name" => "狮子沟乡", "code" => "130709205"},
      %{"name" => "清三营乡", "code" => "130709206"},
      %{"name" => "白旗乡", "code" => "130709207"},
      %{"name" => "城关街道筹备处", "code" => "130709400"}
    ]

  def next(input) when input == "张北县" or input == "130722",
    do: [
      %{"name" => "张北镇", "code" => "130722100"},
      %{"name" => "公会镇", "code" => "130722101"},
      %{"name" => "二台镇", "code" => "130722102"},
      %{"name" => "大囫囵镇", "code" => "130722103"},
      %{"name" => "小二台镇", "code" => "130722104"},
      %{"name" => "油篓沟镇", "code" => "130722106"},
      %{"name" => "大河镇", "code" => "130722107"},
      %{"name" => "台路沟乡", "code" => "130722200"},
      %{"name" => "馒头营乡", "code" => "130722202"},
      %{"name" => "二泉井乡", "code" => "130722203"},
      %{"name" => "单晶河乡", "code" => "130722204"},
      %{"name" => "海流图乡", "code" => "130722206"},
      %{"name" => "两面井乡", "code" => "130722207"},
      %{"name" => "大西湾乡", "code" => "130722208"},
      %{"name" => "郝家营乡", "code" => "130722209"},
      %{"name" => "白庙滩乡", "code" => "130722210"},
      %{"name" => "战海乡", "code" => "130722212"},
      %{"name" => "三号乡", "code" => "130722213"}
    ]

  def next(input) when input == "康保县" or input == "130723",
    do: [
      %{"name" => "康保镇", "code" => "130723100"},
      %{"name" => "张纪镇", "code" => "130723101"},
      %{"name" => "土城子镇", "code" => "130723102"},
      %{"name" => "邓油坊镇", "code" => "130723103"},
      %{"name" => "李家地镇", "code" => "130723104"},
      %{"name" => "照阳河镇", "code" => "130723105"},
      %{"name" => "屯垦镇", "code" => "130723106"},
      %{"name" => "闫油坊乡", "code" => "130723200"},
      %{"name" => "丹清河乡", "code" => "130723201"},
      %{"name" => "哈咇嘎乡", "code" => "130723202"},
      %{"name" => "二号卜乡", "code" => "130723203"},
      %{"name" => "芦家营乡", "code" => "130723204"},
      %{"name" => "忠义乡", "code" => "130723205"},
      %{"name" => "处长地乡", "code" => "130723206"},
      %{"name" => "满德堂乡", "code" => "130723207"},
      %{"name" => "康保牧场", "code" => "130723500"},
      %{"name" => "屯垦林场", "code" => "130723501"}
    ]

  def next(input) when input == "沽源县" or input == "130724",
    do: [
      %{"name" => "平定堡镇", "code" => "130724100"},
      %{"name" => "小厂镇", "code" => "130724101"},
      %{"name" => "黄盖淖镇", "code" => "130724102"},
      %{"name" => "九连城镇", "code" => "130724103"},
      %{"name" => "高山堡乡", "code" => "130724200"},
      %{"name" => "小河子乡", "code" => "130724201"},
      %{"name" => "二道渠乡", "code" => "130724202"},
      %{"name" => "大二号回族乡", "code" => "130724203"},
      %{"name" => "闪电河乡", "code" => "130724204"},
      %{"name" => "长梁乡", "code" => "130724205"},
      %{"name" => "丰源店乡", "code" => "130724206"},
      %{"name" => "西辛营乡", "code" => "130724207"},
      %{"name" => "莲花滩乡", "code" => "130724208"},
      %{"name" => "白土窑乡", "code" => "130724209"}
    ]

  def next(input) when input == "尚义县" or input == "130725",
    do: [
      %{"name" => "南壕堑镇", "code" => "130725100"},
      %{"name" => "大青沟镇", "code" => "130725101"},
      %{"name" => "八道沟镇", "code" => "130725102"},
      %{"name" => "红土梁镇", "code" => "130725103"},
      %{"name" => "小蒜沟镇", "code" => "130725104"},
      %{"name" => "三工地镇", "code" => "130725105"},
      %{"name" => "满井镇", "code" => "130725106"},
      %{"name" => "大营盘乡", "code" => "130725200"},
      %{"name" => "大苏计乡", "code" => "130725201"},
      %{"name" => "石井乡", "code" => "130725202"},
      %{"name" => "七甲乡", "code" => "130725205"},
      %{"name" => "套里庄乡", "code" => "130725206"},
      %{"name" => "甲石河乡", "code" => "130725207"},
      %{"name" => "下马圈乡", "code" => "130725208"}
    ]

  def next(input) when input == "蔚县" or input == "130726",
    do: [
      %{"name" => "蔚州镇", "code" => "130726100"},
      %{"name" => "代王城镇", "code" => "130726101"},
      %{"name" => "西合营镇", "code" => "130726102"},
      %{"name" => "吉家庄镇", "code" => "130726103"},
      %{"name" => "白乐镇", "code" => "130726104"},
      %{"name" => "暖泉镇", "code" => "130726105"},
      %{"name" => "南留庄镇", "code" => "130726106"},
      %{"name" => "北水泉镇", "code" => "130726107"},
      %{"name" => "桃花镇", "code" => "130726108"},
      %{"name" => "阳眷镇", "code" => "130726109"},
      %{"name" => "宋家庄镇", "code" => "130726110"},
      %{"name" => "下宫村乡", "code" => "130726200"},
      %{"name" => "南杨庄乡", "code" => "130726202"},
      %{"name" => "柏树乡", "code" => "130726203"},
      %{"name" => "常宁乡", "code" => "130726204"},
      %{"name" => "涌泉庄乡", "code" => "130726205"},
      %{"name" => "杨庄窠乡", "code" => "130726206"},
      %{"name" => "南岭庄乡", "code" => "130726207"},
      %{"name" => "陈家洼乡", "code" => "130726208"},
      %{"name" => "黄梅乡", "code" => "130726209"},
      %{"name" => "白草村乡", "code" => "130726210"},
      %{"name" => "草沟堡乡", "code" => "130726211"}
    ]

  def next(input) when input == "阳原县" or input == "130727",
    do: [
      %{"name" => "西城镇", "code" => "130727100"},
      %{"name" => "东城镇", "code" => "130727101"},
      %{"name" => "化稍营镇", "code" => "130727102"},
      %{"name" => "揣骨疃镇", "code" => "130727103"},
      %{"name" => "东井集镇", "code" => "130727104"},
      %{"name" => "要家庄乡", "code" => "130727200"},
      %{"name" => "东坊城堡乡", "code" => "130727201"},
      %{"name" => "井儿沟乡", "code" => "130727202"},
      %{"name" => "三马坊乡", "code" => "130727203"},
      %{"name" => "高墙乡", "code" => "130727204"},
      %{"name" => "大田洼乡", "code" => "130727205"},
      %{"name" => "辛堡乡", "code" => "130727206"},
      %{"name" => "马圈堡乡", "code" => "130727207"},
      %{"name" => "浮图讲乡", "code" => "130727208"}
    ]

  def next(input) when input == "怀安县" or input == "130728",
    do: [
      %{"name" => "柴沟堡镇", "code" => "130728100"},
      %{"name" => "左卫镇", "code" => "130728101"},
      %{"name" => "头百户镇", "code" => "130728102"},
      %{"name" => "怀安城镇", "code" => "130728103"},
      %{"name" => "渡口堡乡", "code" => "130728200"},
      %{"name" => "第六屯乡", "code" => "130728201"},
      %{"name" => "西湾堡乡", "code" => "130728202"},
      %{"name" => "西沙城乡", "code" => "130728203"},
      %{"name" => "太平庄乡", "code" => "130728204"},
      %{"name" => "王虎屯乡", "code" => "130728205"},
      %{"name" => "第三堡乡", "code" => "130728206"}
    ]

  def next(input) when input == "怀来县" or input == "130730",
    do: [
      %{"name" => "沙城镇", "code" => "130730100"},
      %{"name" => "北辛堡镇", "code" => "130730101"},
      %{"name" => "新保安镇", "code" => "130730102"},
      %{"name" => "东花园镇", "code" => "130730103"},
      %{"name" => "官厅镇", "code" => "130730104"},
      %{"name" => "桑园镇", "code" => "130730105"},
      %{"name" => "存瑞镇", "code" => "130730106"},
      %{"name" => "土木镇", "code" => "130730107"},
      %{"name" => "大黄庄镇", "code" => "130730108"},
      %{"name" => "西八里镇", "code" => "130730109"},
      %{"name" => "小南辛堡镇", "code" => "130730110"},
      %{"name" => "狼山乡", "code" => "130730200"},
      %{"name" => "鸡鸣驿乡", "code" => "130730203"},
      %{"name" => "东八里乡", "code" => "130730205"},
      %{"name" => "瑞云观乡", "code" => "130730207"},
      %{"name" => "孙庄子乡", "code" => "130730208"},
      %{"name" => "王家楼回族乡", "code" => "130730210"}
    ]

  def next(input) when input == "涿鹿县" or input == "130731",
    do: [
      %{"name" => "涿鹿镇", "code" => "130731100"},
      %{"name" => "张家堡镇", "code" => "130731101"},
      %{"name" => "武家沟镇", "code" => "130731102"},
      %{"name" => "五堡镇", "code" => "130731103"},
      %{"name" => "保岱镇", "code" => "130731104"},
      %{"name" => "矾山镇", "code" => "130731105"},
      %{"name" => "大堡镇", "code" => "130731106"},
      %{"name" => "河东镇", "code" => "130731107"},
      %{"name" => "东小庄镇", "code" => "130731108"},
      %{"name" => "辉耀镇", "code" => "130731109"},
      %{"name" => "大河南镇", "code" => "130731110"},
      %{"name" => "温泉屯镇", "code" => "130731111"},
      %{"name" => "蟒石口镇", "code" => "130731112"},
      %{"name" => "卧佛寺镇", "code" => "130731113"},
      %{"name" => "栾庄乡", "code" => "130731201"},
      %{"name" => "黑山寺乡", "code" => "130731204"},
      %{"name" => "谢家堡乡", "code" => "130731206"}
    ]

  def next(input) when input == "赤城县" or input == "130732",
    do: [
      %{"name" => "赤城镇", "code" => "130732100"},
      %{"name" => "田家窑镇", "code" => "130732101"},
      %{"name" => "龙关镇", "code" => "130732102"},
      %{"name" => "雕鹗镇", "code" => "130732103"},
      %{"name" => "独石口镇", "code" => "130732104"},
      %{"name" => "白草镇", "code" => "130732105"},
      %{"name" => "龙门所镇", "code" => "130732106"},
      %{"name" => "后城镇", "code" => "130732107"},
      %{"name" => "东卯镇", "code" => "130732108"},
      %{"name" => "炮梁乡", "code" => "130732200"},
      %{"name" => "大海陀乡", "code" => "130732201"},
      %{"name" => "镇宁堡乡", "code" => "130732202"},
      %{"name" => "马营乡", "code" => "130732203"},
      %{"name" => "云州乡", "code" => "130732204"},
      %{"name" => "三道川乡", "code" => "130732205"},
      %{"name" => "东万口乡", "code" => "130732206"},
      %{"name" => "茨营子乡", "code" => "130732207"},
      %{"name" => "样田乡", "code" => "130732208"}
    ]

  def next(input) when input == "张家口经济开发区" or input == "130771",
    do: [
      %{"name" => "南站街道", "code" => "130771001"},
      %{"name" => "马路东街道", "code" => "130771002"},
      %{"name" => "老鸦庄镇", "code" => "130771100"},
      %{"name" => "沈家屯镇", "code" => "130771101"},
      %{"name" => "姚家房镇", "code" => "130771102"},
      %{"name" => "沙岭子镇", "code" => "130771103"}
    ]

  def next(input) when input == "张家口市察北管理区" or input == "130772",
    do: [
      %{"name" => "沙沟镇", "code" => "130772105"},
      %{"name" => "宇宙营乡", "code" => "130772215"},
      %{"name" => "黄山管理处", "code" => "130772401"},
      %{"name" => "石门管理处", "code" => "130772402"},
      %{"name" => "乌兰管理处", "code" => "130772403"},
      %{"name" => "金沙管理处", "code" => "130772404"},
      %{"name" => "白塔管理处", "code" => "130772405"}
    ]

  def next(input) when input == "张家口市塞北管理区" or input == "130773",
    do: [
      %{"name" => "榆树沟管理处", "code" => "130773501"},
      %{"name" => "沙梁子管理处", "code" => "130773502"},
      %{"name" => "小城子管理处", "code" => "130773503"},
      %{"name" => "东大门管理处", "code" => "130773504"}
    ]

  def next(input) when input == "竞秀区" or input == "130602",
    do: [
      %{"name" => "先锋街道", "code" => "130602001"},
      %{"name" => "新市场街道", "code" => "130602002"},
      %{"name" => "东风路街道", "code" => "130602003"},
      %{"name" => "建南街道", "code" => "130602004"},
      %{"name" => "韩村北路街道", "code" => "130602005"},
      %{"name" => "大激店镇", "code" => "130602100"},
      %{"name" => "一亩泉镇", "code" => "130602101"},
      %{"name" => "颉庄乡", "code" => "130602200"},
      %{"name" => "富昌乡", "code" => "130602201"},
      %{"name" => "韩村乡", "code" => "130602202"}
    ]

  def next(input) when input == "莲池区" or input == "130606",
    do: [
      %{"name" => "和平里街道", "code" => "130606001"},
      %{"name" => "五四路街道", "code" => "130606002"},
      %{"name" => "西关街道", "code" => "130606003"},
      %{"name" => "中华路街道", "code" => "130606004"},
      %{"name" => "东关街道", "code" => "130606005"},
      %{"name" => "联盟街道", "code" => "130606006"},
      %{"name" => "红星街道", "code" => "130606007"},
      %{"name" => "裕华街道", "code" => "130606008"},
      %{"name" => "永华街道", "code" => "130606009"},
      %{"name" => "南关街道", "code" => "130606010"},
      %{"name" => "百楼镇", "code" => "130606100"},
      %{"name" => "焦庄镇", "code" => "130606101"},
      %{"name" => "韩庄乡", "code" => "130606200"},
      %{"name" => "东金庄乡", "code" => "130606201"},
      %{"name" => "杨庄乡", "code" => "130606203"},
      %{"name" => "南大园乡", "code" => "130606204"},
      %{"name" => "五尧乡", "code" => "130606206"}
    ]

  def next(input) when input == "满城区" or input == "130607",
    do: [
      %{"name" => "惠阳街道", "code" => "130607001"},
      %{"name" => "满城镇", "code" => "130607100"},
      %{"name" => "大册营镇", "code" => "130607101"},
      %{"name" => "神星镇", "code" => "130607102"},
      %{"name" => "南韩村镇", "code" => "130607103"},
      %{"name" => "方顺桥镇", "code" => "130607104"},
      %{"name" => "于家庄镇", "code" => "130607105"},
      %{"name" => "要庄乡", "code" => "130607203"},
      %{"name" => "白龙乡", "code" => "130607204"},
      %{"name" => "石井乡", "code" => "130607205"},
      %{"name" => "坨南乡", "code" => "130607206"},
      %{"name" => "刘家台乡", "code" => "130607207"},
      %{"name" => "河北满城经济开发区", "code" => "130607400"}
    ]

  def next(input) when input == "清苑区" or input == "130608",
    do: [
      %{"name" => "清苑镇", "code" => "130608100"},
      %{"name" => "冉庄镇", "code" => "130608101"},
      %{"name" => "阳城镇", "code" => "130608102"},
      %{"name" => "魏村镇", "code" => "130608103"},
      %{"name" => "温仁镇", "code" => "130608104"},
      %{"name" => "张登镇", "code" => "130608105"},
      %{"name" => "大庄镇", "code" => "130608106"},
      %{"name" => "臧村镇", "code" => "130608107"},
      %{"name" => "望亭镇", "code" => "130608108"},
      %{"name" => "东闾镇", "code" => "130608109"},
      %{"name" => "白团镇", "code" => "130608110"},
      %{"name" => "石桥镇", "code" => "130608111"},
      %{"name" => "何桥镇", "code" => "130608112"},
      %{"name" => "北店乡", "code" => "130608201"},
      %{"name" => "李庄乡", "code" => "130608203"},
      %{"name" => "北王力乡", "code" => "130608204"},
      %{"name" => "孙村乡", "code" => "130608207"},
      %{"name" => "阎庄乡", "code" => "130608208"},
      %{"name" => "河北清苑经济开发区", "code" => "130608400"}
    ]

  def next(input) when input == "徐水区" or input == "130609",
    do: [
      %{"name" => "安肃镇", "code" => "130609100"},
      %{"name" => "崔庄镇", "code" => "130609101"},
      %{"name" => "大因镇", "code" => "130609102"},
      %{"name" => "遂城镇", "code" => "130609103"},
      %{"name" => "高林村镇", "code" => "130609104"},
      %{"name" => "大王店镇", "code" => "130609105"},
      %{"name" => "漕河镇", "code" => "130609106"},
      %{"name" => "东史端镇", "code" => "130609107"},
      %{"name" => "留村镇", "code" => "130609108"},
      %{"name" => "正村镇", "code" => "130609109"},
      %{"name" => "户木乡", "code" => "130609203"},
      %{"name" => "瀑河乡", "code" => "130609204"},
      %{"name" => "东釜山乡", "code" => "130609205"},
      %{"name" => "义联庄乡", "code" => "130609206"}
    ]

  def next(input) when input == "涞水县" or input == "130623",
    do: [
      %{"name" => "涞水镇", "code" => "130623100"},
      %{"name" => "永阳镇", "code" => "130623101"},
      %{"name" => "义安镇", "code" => "130623102"},
      %{"name" => "石亭镇", "code" => "130623103"},
      %{"name" => "赵各庄镇", "code" => "130623104"},
      %{"name" => "九龙镇", "code" => "130623105"},
      %{"name" => "三坡镇", "code" => "130623106"},
      %{"name" => "一渡镇", "code" => "130623107"},
      %{"name" => "明义镇", "code" => "130623108"},
      %{"name" => "王村镇", "code" => "130623109"},
      %{"name" => "娄村镇", "code" => "130623110"},
      %{"name" => "东文山镇", "code" => "130623111"},
      %{"name" => "其中口乡", "code" => "130623205"},
      %{"name" => "龙门乡", "code" => "130623206"},
      %{"name" => "胡家庄乡", "code" => "130623207"},
      %{"name" => "涞水县城区社区管理办公室", "code" => "130623401"}
    ]

  def next(input) when input == "阜平县" or input == "130624",
    do: [
      %{"name" => "阜平镇", "code" => "130624100"},
      %{"name" => "龙泉关镇", "code" => "130624101"},
      %{"name" => "平阳镇", "code" => "130624102"},
      %{"name" => "城南庄镇", "code" => "130624103"},
      %{"name" => "天生桥镇", "code" => "130624104"},
      %{"name" => "王林口镇", "code" => "130624105"},
      %{"name" => "砂窝镇", "code" => "130624106"},
      %{"name" => "北果园镇", "code" => "130624107"},
      %{"name" => "台峪乡", "code" => "130624202"},
      %{"name" => "大台乡", "code" => "130624203"},
      %{"name" => "史家寨乡", "code" => "130624204"},
      %{"name" => "吴王口乡", "code" => "130624206"},
      %{"name" => "夏庄乡", "code" => "130624207"},
      %{"name" => "河北阜平经济开发区", "code" => "130624400"}
    ]

  def next(input) when input == "定兴县" or input == "130626",
    do: [
      %{"name" => "定兴镇", "code" => "130626100"},
      %{"name" => "固城镇", "code" => "130626101"},
      %{"name" => "贤寓镇", "code" => "130626102"},
      %{"name" => "北河镇", "code" => "130626103"},
      %{"name" => "天宫寺镇", "code" => "130626104"},
      %{"name" => "小朱庄镇", "code" => "130626105"},
      %{"name" => "姚村镇", "code" => "130626106"},
      %{"name" => "杨村镇", "code" => "130626107"},
      %{"name" => "高里镇", "code" => "130626108"},
      %{"name" => "内章镇", "code" => "130626109"},
      %{"name" => "东落堡镇", "code" => "130626110"},
      %{"name" => "张家庄乡", "code" => "130626202"},
      %{"name" => "肖村乡", "code" => "130626204"},
      %{"name" => "柳卓乡", "code" => "130626205"},
      %{"name" => "北南蔡乡", "code" => "130626208"},
      %{"name" => "李郁庄乡", "code" => "130626209"}
    ]

  def next(input) when input == "唐县" or input == "130627",
    do: [
      %{"name" => "仁厚镇", "code" => "130627100"},
      %{"name" => "王京镇", "code" => "130627101"},
      %{"name" => "高昌镇", "code" => "130627102"},
      %{"name" => "北罗镇", "code" => "130627103"},
      %{"name" => "白合镇", "code" => "130627104"},
      %{"name" => "军城镇", "code" => "130627105"},
      %{"name" => "川里镇", "code" => "130627106"},
      %{"name" => "长古城镇", "code" => "130627107"},
      %{"name" => "罗庄镇", "code" => "130627108"},
      %{"name" => "北店头镇", "code" => "130627109"},
      %{"name" => "齐家佐镇", "code" => "130627110"},
      %{"name" => "黄石口镇", "code" => "130627111"},
      %{"name" => "都亭乡", "code" => "130627201"},
      %{"name" => "南店头乡", "code" => "130627202"},
      %{"name" => "雹水乡", "code" => "130627205"},
      %{"name" => "大洋乡", "code" => "130627206"},
      %{"name" => "迷城乡", "code" => "130627207"},
      %{"name" => "羊角乡", "code" => "130627209"},
      %{"name" => "石门乡", "code" => "130627210"},
      %{"name" => "倒马关乡", "code" => "130627212"}
    ]

  def next(input) when input == "高阳县" or input == "130628",
    do: [
      %{"name" => "高阳县锦华街道", "code" => "130628001"},
      %{"name" => "庞口镇", "code" => "130628101"},
      %{"name" => "西演镇", "code" => "130628102"},
      %{"name" => "邢家南镇", "code" => "130628103"},
      %{"name" => "晋庄镇", "code" => "130628104"},
      %{"name" => "小王果庄镇", "code" => "130628105"},
      %{"name" => "蒲口镇", "code" => "130628106"},
      %{"name" => "庞家佐镇", "code" => "130628107"},
      %{"name" => "高阳县经济开发区", "code" => "130628400"}
    ]

  def next(input) when input == "容城县" or input == "130629",
    do: [
      %{"name" => "容城镇", "code" => "130629100"},
      %{"name" => "小里镇", "code" => "130629101"},
      %{"name" => "南张镇", "code" => "130629102"},
      %{"name" => "大河镇", "code" => "130629103"},
      %{"name" => "晾马台镇", "code" => "130629104"},
      %{"name" => "八于乡", "code" => "130629200"},
      %{"name" => "贾光乡", "code" => "130629201"},
      %{"name" => "平王乡", "code" => "130629203"},
      %{"name" => "容东片区", "code" => "130629400"},
      %{"name" => "容西片区", "code" => "130629401"}
    ]

  def next(input) when input == "涞源县" or input == "130630",
    do: [
      %{"name" => "涞源镇", "code" => "130630100"},
      %{"name" => "银坊镇", "code" => "130630101"},
      %{"name" => "走马驿镇", "code" => "130630102"},
      %{"name" => "水堡镇", "code" => "130630103"},
      %{"name" => "王安镇", "code" => "130630104"},
      %{"name" => "杨家庄镇", "code" => "130630105"},
      %{"name" => "白石山镇", "code" => "130630106"},
      %{"name" => "南屯镇", "code" => "130630107"},
      %{"name" => "泉坊镇", "code" => "130630108"},
      %{"name" => "北石佛镇", "code" => "130630109"},
      %{"name" => "南马庄乡", "code" => "130630201"},
      %{"name" => "金家井乡", "code" => "130630203"},
      %{"name" => "留家庄乡", "code" => "130630204"},
      %{"name" => "上庄乡", "code" => "130630205"},
      %{"name" => "东团堡乡", "code" => "130630206"},
      %{"name" => "塔崖驿乡", "code" => "130630207"},
      %{"name" => "乌龙沟乡", "code" => "130630208"}
    ]

  def next(input) when input == "望都县" or input == "130631",
    do: [
      %{"name" => "望都镇", "code" => "130631100"},
      %{"name" => "固店镇", "code" => "130631101"},
      %{"name" => "贾村镇", "code" => "130631102"},
      %{"name" => "中韩庄镇", "code" => "130631103"},
      %{"name" => "寺庄镇", "code" => "130631104"},
      %{"name" => "赵庄镇", "code" => "130631105"},
      %{"name" => "高岭镇", "code" => "130631106"},
      %{"name" => "黑堡乡", "code" => "130631202"},
      %{"name" => "望都经济开发区", "code" => "130631400"}
    ]

  def next(input) when input == "安新县" or input == "130632",
    do: [
      %{"name" => "安新镇", "code" => "130632100"},
      %{"name" => "大王镇", "code" => "130632101"},
      %{"name" => "三台镇", "code" => "130632102"},
      %{"name" => "端村镇", "code" => "130632103"},
      %{"name" => "赵北口镇", "code" => "130632104"},
      %{"name" => "同口镇", "code" => "130632105"},
      %{"name" => "刘李庄镇", "code" => "130632106"},
      %{"name" => "安州镇", "code" => "130632107"},
      %{"name" => "老河头镇", "code" => "130632108"},
      %{"name" => "圈头乡", "code" => "130632200"},
      %{"name" => "寨里乡", "code" => "130632201"},
      %{"name" => "芦庄乡", "code" => "130632202"},
      %{"name" => "龙化乡", "code" => "130632203"}
    ]

  def next(input) when input == "易县" or input == "130633",
    do: [
      %{"name" => "易州镇", "code" => "130633100"},
      %{"name" => "梁格庄镇", "code" => "130633101"},
      %{"name" => "西陵镇", "code" => "130633102"},
      %{"name" => "裴山镇", "code" => "130633103"},
      %{"name" => "塘湖镇", "code" => "130633104"},
      %{"name" => "狼牙山镇", "code" => "130633105"},
      %{"name" => "良岗镇", "code" => "130633106"},
      %{"name" => "紫荆关镇", "code" => "130633107"},
      %{"name" => "高村镇", "code" => "130633108"},
      %{"name" => "西山北镇", "code" => "130633109"},
      %{"name" => "高陌镇", "code" => "130633110"},
      %{"name" => "桥头乡", "code" => "130633200"},
      %{"name" => "白马乡", "code" => "130633201"},
      %{"name" => "流井乡", "code" => "130633202"},
      %{"name" => "大龙华乡", "code" => "130633205"},
      %{"name" => "安格庄乡", "code" => "130633206"},
      %{"name" => "凌云册乡", "code" => "130633207"},
      %{"name" => "尉都乡", "code" => "130633209"},
      %{"name" => "独乐乡", "code" => "130633210"},
      %{"name" => "七峪乡", "code" => "130633211"},
      %{"name" => "富岗乡", "code" => "130633212"},
      %{"name" => "坡仓乡", "code" => "130633213"},
      %{"name" => "牛岗乡", "code" => "130633214"},
      %{"name" => "桥家河乡", "code" => "130633215"},
      %{"name" => "甘河净乡", "code" => "130633216"},
      %{"name" => "蔡家峪乡", "code" => "130633217"},
      %{"name" => "南城司乡", "code" => "130633218"},
      %{"name" => "恋乡太行水镇", "code" => "130633400"},
      %{"name" => "河北易县经济开发区", "code" => "130633401"}
    ]

  def next(input) when input == "曲阳县" or input == "130634",
    do: [
      %{"name" => "恒州镇", "code" => "130634100"},
      %{"name" => "灵山镇", "code" => "130634101"},
      %{"name" => "燕赵镇", "code" => "130634102"},
      %{"name" => "羊平镇", "code" => "130634103"},
      %{"name" => "文德镇", "code" => "130634104"},
      %{"name" => "晓林镇", "code" => "130634105"},
      %{"name" => "邸村镇", "code" => "130634106"},
      %{"name" => "齐村镇", "code" => "130634107"},
      %{"name" => "孝墓镇", "code" => "130634108"},
      %{"name" => "产德镇", "code" => "130634109"},
      %{"name" => "下河镇", "code" => "130634110"},
      %{"name" => "嘉禾镇", "code" => "130634111"},
      %{"name" => "路庄子乡", "code" => "130634200"},
      %{"name" => "庄窠乡", "code" => "130634202"},
      %{"name" => "党城乡", "code" => "130634210"},
      %{"name" => "郎家庄乡", "code" => "130634211"},
      %{"name" => "范家庄乡", "code" => "130634212"},
      %{"name" => "北台乡", "code" => "130634213"}
    ]

  def next(input) when input == "蠡县" or input == "130635",
    do: [
      %{"name" => "蠡吾镇", "code" => "130635100"},
      %{"name" => "留史镇", "code" => "130635101"},
      %{"name" => "大百尺镇", "code" => "130635102"},
      %{"name" => "辛兴镇", "code" => "130635103"},
      %{"name" => "北郭丹镇", "code" => "130635104"},
      %{"name" => "万安镇", "code" => "130635105"},
      %{"name" => "桑园镇", "code" => "130635106"},
      %{"name" => "南庄镇", "code" => "130635107"},
      %{"name" => "大曲堤镇", "code" => "130635108"},
      %{"name" => "鲍墟镇", "code" => "130635109"},
      %{"name" => "小陈镇", "code" => "130635110"},
      %{"name" => "林堡乡", "code" => "130635201"},
      %{"name" => "北埝头乡", "code" => "130635202"}
    ]

  def next(input) when input == "顺平县" or input == "130636",
    do: [
      %{"name" => "蒲阳镇", "code" => "130636100"},
      %{"name" => "高于铺镇", "code" => "130636101"},
      %{"name" => "腰山镇", "code" => "130636102"},
      %{"name" => "蒲上镇", "code" => "130636103"},
      %{"name" => "神南镇", "code" => "130636104"},
      %{"name" => "安阳镇", "code" => "130636105"},
      %{"name" => "白云镇", "code" => "130636106"},
      %{"name" => "河口乡", "code" => "130636202"},
      %{"name" => "台鱼乡", "code" => "130636204"},
      %{"name" => "大悲乡", "code" => "130636205"}
    ]

  def next(input) when input == "博野县" or input == "130637",
    do: [
      %{"name" => "博野镇", "code" => "130637100"},
      %{"name" => "小店镇", "code" => "130637101"},
      %{"name" => "程委镇", "code" => "130637102"},
      %{"name" => "东墟镇", "code" => "130637103"},
      %{"name" => "北杨镇", "code" => "130637104"},
      %{"name" => "城东镇", "code" => "130637105"},
      %{"name" => "南小王镇", "code" => "130637106"}
    ]

  def next(input) when input == "雄县" or input == "130638",
    do: [
      %{"name" => "雄州镇", "code" => "130638100"},
      %{"name" => "昝岗镇", "code" => "130638101"},
      %{"name" => "大营镇", "code" => "130638102"},
      %{"name" => "龙湾镇", "code" => "130638103"},
      %{"name" => "朱各庄镇", "code" => "130638104"},
      %{"name" => "米家务镇", "code" => "130638105"},
      %{"name" => "鄚州镇", "code" => "130638106"},
      %{"name" => "苟各庄镇", "code" => "130638107"},
      %{"name" => "北沙口乡", "code" => "130638200"},
      %{"name" => "双堂乡", "code" => "130638203"},
      %{"name" => "张岗乡", "code" => "130638204"},
      %{"name" => "七间房乡", "code" => "130638205"},
      %{"name" => "昝岗片区", "code" => "130638400"}
    ]

  def next(input) when input == "保定高新技术产业开发区" or input == "130671",
    do: [
      %{"name" => "贤台乡", "code" => "130671202"},
      %{"name" => "大马坊乡", "code" => "130671205"},
      %{"name" => "保定国家高新区", "code" => "130671400"}
    ]

  def next(input) when input == "保定白沟新城" or input == "130672",
    do: [%{"name" => "白沟镇", "code" => "130672103"}]

  def next(input) when input == "涿州市" or input == "130681",
    do: [
      %{"name" => "双塔街道", "code" => "130681001"},
      %{"name" => "桃园街道", "code" => "130681002"},
      %{"name" => "清凉寺街道", "code" => "130681003"},
      %{"name" => "松林店镇", "code" => "130681100"},
      %{"name" => "码头镇", "code" => "130681101"},
      %{"name" => "东城坊镇", "code" => "130681102"},
      %{"name" => "高官庄镇", "code" => "130681103"},
      %{"name" => "东仙坡镇", "code" => "130681104"},
      %{"name" => "百尺竿镇", "code" => "130681105"},
      %{"name" => "义和庄镇", "code" => "130681106"},
      %{"name" => "刁窝镇", "code" => "130681107"},
      %{"name" => "林家屯镇", "code" => "130681108"},
      %{"name" => "豆庄镇", "code" => "130681109"},
      %{"name" => "孙家庄乡", "code" => "130681204"},
      %{"name" => "高新技术产业开发区", "code" => "130681400"},
      %{"name" => "京南经济开发区", "code" => "130681401"},
      %{"name" => "松林店经济开发区", "code" => "130681402"}
    ]

  def next(input) when input == "定州市" or input == "130682",
    do: [
      %{"name" => "南城区街道", "code" => "130682001"},
      %{"name" => "北城区街道", "code" => "130682002"},
      %{"name" => "西城区街道", "code" => "130682003"},
      %{"name" => "长安路街道", "code" => "130682004"},
      %{"name" => "留早镇", "code" => "130682100"},
      %{"name" => "清风店镇", "code" => "130682101"},
      %{"name" => "庞村镇", "code" => "130682102"},
      %{"name" => "砖路镇", "code" => "130682103"},
      %{"name" => "明月店镇", "code" => "130682104"},
      %{"name" => "叮咛店镇", "code" => "130682105"},
      %{"name" => "东亭镇", "code" => "130682106"},
      %{"name" => "大辛庄镇", "code" => "130682107"},
      %{"name" => "东旺镇", "code" => "130682108"},
      %{"name" => "高蓬镇", "code" => "130682109"},
      %{"name" => "邢邑镇", "code" => "130682110"},
      %{"name" => "李亲顾镇", "code" => "130682111"},
      %{"name" => "子位镇", "code" => "130682112"},
      %{"name" => "开元镇", "code" => "130682113"},
      %{"name" => "周村镇", "code" => "130682115"},
      %{"name" => "息冢镇", "code" => "130682116"},
      %{"name" => "东留春乡", "code" => "130682203"},
      %{"name" => "号头庄回族乡", "code" => "130682204"},
      %{"name" => "杨家庄乡", "code" => "130682205"},
      %{"name" => "大鹿庄乡", "code" => "130682206"},
      %{"name" => "西城乡", "code" => "130682208"}
    ]

  def next(input) when input == "安国市" or input == "130683",
    do: [
      %{"name" => "药都街道", "code" => "130683001"},
      %{"name" => "祁州路街道", "code" => "130683002"},
      %{"name" => "伍仁桥镇", "code" => "130683101"},
      %{"name" => "石佛镇", "code" => "130683102"},
      %{"name" => "郑章镇", "code" => "130683103"},
      %{"name" => "大五女镇", "code" => "130683104"},
      %{"name" => "西佛落镇", "code" => "130683105"},
      %{"name" => "西城镇", "code" => "130683106"},
      %{"name" => "明官店乡", "code" => "130683200"},
      %{"name" => "南娄底乡", "code" => "130683201"},
      %{"name" => "北段村乡", "code" => "130683204"},
      %{"name" => "现代中药工业园区", "code" => "130683400"}
    ]

  def next(input) when input == "高碑店市" or input == "130684",
    do: [
      %{"name" => "和平街道", "code" => "130684001"},
      %{"name" => "军城街道", "code" => "130684002"},
      %{"name" => "东盛街道", "code" => "130684003"},
      %{"name" => "北城街道", "code" => "130684004"},
      %{"name" => "兴华路街道", "code" => "130684005"},
      %{"name" => "方官镇", "code" => "130684100"},
      %{"name" => "新城镇", "code" => "130684101"},
      %{"name" => "泗庄镇", "code" => "130684102"},
      %{"name" => "辛立庄镇", "code" => "130684104"},
      %{"name" => "东马营镇", "code" => "130684105"},
      %{"name" => "辛桥镇", "code" => "130684106"},
      %{"name" => "肖官营镇", "code" => "130684107"},
      %{"name" => "张六庄镇", "code" => "130684108"},
      %{"name" => "梁家营镇", "code" => "130684109"}
    ]

  def next(input) when input == "襄都区" or input == "130502",
    do: [
      %{"name" => "南长街街道", "code" => "130502001"},
      %{"name" => "北大街街道", "code" => "130502002"},
      %{"name" => "西大街街道", "code" => "130502003"},
      %{"name" => "西门里街道", "code" => "130502004"},
      %{"name" => "泉东街道", "code" => "130502005"},
      %{"name" => "豫让桥街道", "code" => "130502006"},
      %{"name" => "东郭村镇", "code" => "130502100"},
      %{"name" => "祝村镇", "code" => "130502101"},
      %{"name" => "晏家屯镇", "code" => "130502103"},
      %{"name" => "大梁庄乡", "code" => "130502200"}
    ]

  def next(input) when input == "信都区" or input == "130503",
    do: [
      %{"name" => "钢铁路街道", "code" => "130503001"},
      %{"name" => "中兴路街道", "code" => "130503002"},
      %{"name" => "达活泉街道", "code" => "130503003"},
      %{"name" => "张宽街道", "code" => "130503004"},
      %{"name" => "章村街道", "code" => "130503005"},
      %{"name" => "中华大街街道", "code" => "130503006"},
      %{"name" => "团结路街道", "code" => "130503007"},
      %{"name" => "泉西街道", "code" => "130503008"},
      %{"name" => "南大郭镇", "code" => "130503100"},
      %{"name" => "李村镇", "code" => "130503101"},
      %{"name" => "南石门镇", "code" => "130503102"},
      %{"name" => "羊范镇", "code" => "130503103"},
      %{"name" => "皇寺镇", "code" => "130503104"},
      %{"name" => "会宁镇", "code" => "130503105"},
      %{"name" => "西黄村镇", "code" => "130503106"},
      %{"name" => "路罗镇", "code" => "130503107"},
      %{"name" => "将军墓镇", "code" => "130503108"},
      %{"name" => "浆水镇", "code" => "130503109"},
      %{"name" => "宋家庄镇", "code" => "130503110"},
      %{"name" => "太子井乡", "code" => "130503202"},
      %{"name" => "龙泉寺乡", "code" => "130503203"},
      %{"name" => "北小庄乡", "code" => "130503204"},
      %{"name" => "城计头乡", "code" => "130503205"},
      %{"name" => "白岸乡", "code" => "130503206"},
      %{"name" => "冀家村乡", "code" => "130503207"}
    ]

  def next(input) when input == "任泽区" or input == "130505",
    do: [
      %{"name" => "任城镇", "code" => "130505100"},
      %{"name" => "邢家湾镇", "code" => "130505101"},
      %{"name" => "辛店镇", "code" => "130505102"},
      %{"name" => "天口镇", "code" => "130505103"},
      %{"name" => "西固城镇", "code" => "130505104"},
      %{"name" => "永福庄乡", "code" => "130505201"},
      %{"name" => "大屯乡", "code" => "130505202"},
      %{"name" => "骆庄乡", "code" => "130505203"}
    ]

  def next(input) when input == "南和区" or input == "130506",
    do: [
      %{"name" => "和阳镇", "code" => "130506100"},
      %{"name" => "贾宋镇", "code" => "130506101"},
      %{"name" => "郝桥镇", "code" => "130506102"},
      %{"name" => "三思镇", "code" => "130506103"},
      %{"name" => "河郭镇", "code" => "130506104"},
      %{"name" => "东三召乡", "code" => "130506200"},
      %{"name" => "阎里乡", "code" => "130506201"},
      %{"name" => "史召乡", "code" => "130506203"}
    ]

  def next(input) when input == "临城县" or input == "130522",
    do: [
      %{"name" => "临城镇", "code" => "130522100"},
      %{"name" => "东镇镇", "code" => "130522101"},
      %{"name" => "西竖镇", "code" => "130522102"},
      %{"name" => "郝庄镇", "code" => "130522103"},
      %{"name" => "黑城镇", "code" => "130522104"},
      %{"name" => "鸭鸽营乡", "code" => "130522201"},
      %{"name" => "石城乡", "code" => "130522203"},
      %{"name" => "赵庄乡", "code" => "130522205"}
    ]

  def next(input) when input == "内丘县" or input == "130523",
    do: [
      %{"name" => "内丘镇", "code" => "130523100"},
      %{"name" => "大孟村镇", "code" => "130523101"},
      %{"name" => "金店镇", "code" => "130523102"},
      %{"name" => "官庄镇", "code" => "130523103"},
      %{"name" => "柳林镇", "code" => "130523104"},
      %{"name" => "五郭店乡", "code" => "130523200"},
      %{"name" => "南赛乡", "code" => "130523203"},
      %{"name" => "獐獏乡", "code" => "130523204"},
      %{"name" => "侯家庄乡", "code" => "130523205"}
    ]

  def next(input) when input == "柏乡县" or input == "130524",
    do: [
      %{"name" => "柏乡镇", "code" => "130524100"},
      %{"name" => "固城店镇", "code" => "130524101"},
      %{"name" => "西汪镇", "code" => "130524102"},
      %{"name" => "龙华镇", "code" => "130524103"},
      %{"name" => "王家庄乡", "code" => "130524200"},
      %{"name" => "内步乡", "code" => "130524203"}
    ]

  def next(input) when input == "隆尧县" or input == "130525",
    do: [
      %{"name" => "隆尧镇", "code" => "130525100"},
      %{"name" => "魏家庄镇", "code" => "130525101"},
      %{"name" => "尹村镇", "code" => "130525102"},
      %{"name" => "山口镇", "code" => "130525103"},
      %{"name" => "莲子镇镇", "code" => "130525104"},
      %{"name" => "固城镇", "code" => "130525105"},
      %{"name" => "东良镇", "code" => "130525106"},
      %{"name" => "北楼乡", "code" => "130525200"},
      %{"name" => "双碑乡", "code" => "130525202"},
      %{"name" => "牛家桥乡", "code" => "130525203"},
      %{"name" => "千户营乡", "code" => "130525204"},
      %{"name" => "大张家庄乡", "code" => "130525205"},
      %{"name" => "柳行农场", "code" => "130525400"}
    ]

  def next(input) when input == "宁晋县" or input == "130528",
    do: [
      %{"name" => "宁北街道", "code" => "130528001"},
      %{"name" => "凤凰镇", "code" => "130528100"},
      %{"name" => "河渠镇", "code" => "130528101"},
      %{"name" => "北河庄镇", "code" => "130528102"},
      %{"name" => "耿庄桥镇", "code" => "130528103"},
      %{"name" => "东汪镇", "code" => "130528104"},
      %{"name" => "贾家口镇", "code" => "130528105"},
      %{"name" => "四芝兰镇", "code" => "130528106"},
      %{"name" => "大陆村镇", "code" => "130528107"},
      %{"name" => "苏家庄镇", "code" => "130528108"},
      %{"name" => "换马店镇", "code" => "130528109"},
      %{"name" => "唐邱镇", "code" => "130528110"},
      %{"name" => "大曹庄镇", "code" => "130528111"},
      %{"name" => "侯口镇", "code" => "130528112"},
      %{"name" => "纪昌庄镇", "code" => "130528113"},
      %{"name" => "北鱼乡", "code" => "130528205"},
      %{"name" => "徐家河乡", "code" => "130528208"},
      %{"name" => "大曹庄管理区", "code" => "130528401"}
    ]

  def next(input) when input == "巨鹿县" or input == "130529",
    do: [
      %{"name" => "巨鹿镇", "code" => "130529100"},
      %{"name" => "王虎寨镇", "code" => "130529101"},
      %{"name" => "西郭城镇", "code" => "130529102"},
      %{"name" => "官亭镇", "code" => "130529103"},
      %{"name" => "阎疃镇", "code" => "130529104"},
      %{"name" => "小吕寨镇", "code" => "130529105"},
      %{"name" => "苏家营镇", "code" => "130529106"},
      %{"name" => "观寨镇", "code" => "130529107"},
      %{"name" => "堤村乡", "code" => "130529200"},
      %{"name" => "张王疃乡", "code" => "130529201"}
    ]

  def next(input) when input == "新河县" or input == "130530",
    do: [
      %{"name" => "新河镇", "code" => "130530100"},
      %{"name" => "寻寨镇", "code" => "130530101"},
      %{"name" => "白神首乡", "code" => "130530200"},
      %{"name" => "荆家庄乡", "code" => "130530201"},
      %{"name" => "西流乡", "code" => "130530202"},
      %{"name" => "仁让里乡", "code" => "130530203"}
    ]

  def next(input) when input == "广宗县" or input == "130531",
    do: [
      %{"name" => "广宗镇", "code" => "130531100"},
      %{"name" => "冯家寨镇", "code" => "130531101"},
      %{"name" => "北塘疃镇", "code" => "130531102"},
      %{"name" => "核桃园镇", "code" => "130531103"},
      %{"name" => "葫芦乡", "code" => "130531200"},
      %{"name" => "大平台乡", "code" => "130531201"},
      %{"name" => "件只乡", "code" => "130531202"},
      %{"name" => "东召乡", "code" => "130531204"}
    ]

  def next(input) when input == "平乡县" or input == "130532",
    do: [
      %{"name" => "中华路街道", "code" => "130532001"},
      %{"name" => "平乡镇", "code" => "130532101"},
      %{"name" => "河古庙镇", "code" => "130532102"},
      %{"name" => "田付村镇", "code" => "130532103"},
      %{"name" => "节固镇", "code" => "130532104"},
      %{"name" => "油召乡", "code" => "130532201"},
      %{"name" => "寻召乡", "code" => "130532203"}
    ]

  def next(input) when input == "威县" or input == "130533",
    do: [
      %{"name" => "洺州镇", "code" => "130533100"},
      %{"name" => "梨园屯镇", "code" => "130533101"},
      %{"name" => "章台镇", "code" => "130533102"},
      %{"name" => "侯贯镇", "code" => "130533103"},
      %{"name" => "七级镇", "code" => "130533104"},
      %{"name" => "贺营镇", "code" => "130533105"},
      %{"name" => "方家营镇", "code" => "130533106"},
      %{"name" => "常庄镇", "code" => "130533107"},
      %{"name" => "第什营镇", "code" => "130533108"},
      %{"name" => "贺钊镇", "code" => "130533109"},
      %{"name" => "赵村镇", "code" => "130533110"},
      %{"name" => "固献镇", "code" => "130533111"},
      %{"name" => "枣园乡", "code" => "130533202"},
      %{"name" => "张家营乡", "code" => "130533206"},
      %{"name" => "常屯乡", "code" => "130533207"},
      %{"name" => "高公庄乡", "code" => "130533209"}
    ]

  def next(input) when input == "清河县" or input == "130534",
    do: [
      %{"name" => "葛仙庄镇", "code" => "130534100"},
      %{"name" => "连庄镇", "code" => "130534101"},
      %{"name" => "油坊镇", "code" => "130534102"},
      %{"name" => "谢炉镇", "code" => "130534103"},
      %{"name" => "王官庄镇", "code" => "130534104"},
      %{"name" => "坝营镇", "code" => "130534105"}
    ]

  def next(input) when input == "临西县" or input == "130535",
    do: [
      %{"name" => "临西镇", "code" => "130535100"},
      %{"name" => "河西镇", "code" => "130535101"},
      %{"name" => "下堡寺镇", "code" => "130535102"},
      %{"name" => "尖塚镇", "code" => "130535103"},
      %{"name" => "老官寨镇", "code" => "130535104"},
      %{"name" => "吕寨镇", "code" => "130535105"},
      %{"name" => "大刘庄镇", "code" => "130535106"},
      %{"name" => "东枣园乡", "code" => "130535200"},
      %{"name" => "摇鞍镇乡", "code" => "130535203"},
      %{"name" => "轴承工业园区", "code" => "130535400"}
    ]

  def next(input) when input == "河北邢台经济开发区" or input == "130571",
    do: [
      %{"name" => "留村街道", "code" => "130571001"},
      %{"name" => "火炬街道", "code" => "130571002"},
      %{"name" => "东汪镇", "code" => "130571100"},
      %{"name" => "王快镇", "code" => "130571101"},
      %{"name" => "沙河城镇", "code" => "130571103"}
    ]

  def next(input) when input == "南宫市" or input == "130581",
    do: [
      %{"name" => "凤岗街道", "code" => "130581001"},
      %{"name" => "南杜街道", "code" => "130581002"},
      %{"name" => "北胡街道", "code" => "130581003"},
      %{"name" => "西丁街道", "code" => "130581004"},
      %{"name" => "苏村镇", "code" => "130581100"},
      %{"name" => "大高村镇", "code" => "130581101"},
      %{"name" => "垂杨镇", "code" => "130581102"},
      %{"name" => "明化镇", "code" => "130581103"},
      %{"name" => "段芦头镇", "code" => "130581104"},
      %{"name" => "紫冢镇", "code" => "130581105"},
      %{"name" => "大村乡", "code" => "130581200"},
      %{"name" => "南便村乡", "code" => "130581201"},
      %{"name" => "大屯乡", "code" => "130581202"},
      %{"name" => "王道寨乡", "code" => "130581203"},
      %{"name" => "薛吴村乡", "code" => "130581204"}
    ]

  def next(input) when input == "沙河市" or input == "130582",
    do: [
      %{"name" => "褡裢街道", "code" => "130582001"},
      %{"name" => "桥东街道", "code" => "130582002"},
      %{"name" => "桥西街道", "code" => "130582003"},
      %{"name" => "赞善街道", "code" => "130582004"},
      %{"name" => "周庄街道", "code" => "130582005"},
      %{"name" => "新城镇", "code" => "130582101"},
      %{"name" => "白塔镇", "code" => "130582102"},
      %{"name" => "十里亭镇", "code" => "130582103"},
      %{"name" => "綦村镇", "code" => "130582104"},
      %{"name" => "刘石岗镇", "code" => "130582107"},
      %{"name" => "册井镇", "code" => "130582108"},
      %{"name" => "柴关乡", "code" => "130582203"},
      %{"name" => "蝉房乡", "code" => "130582204"}
    ]

  def next(input) when input == "邯山区" or input == "130402",
    do: [
      %{"name" => "火磨街道", "code" => "130402001"},
      %{"name" => "陵园路街道", "code" => "130402002"},
      %{"name" => "光明路街道", "code" => "130402003"},
      %{"name" => "滏东街道", "code" => "130402004"},
      %{"name" => "罗城头街道", "code" => "130402005"},
      %{"name" => "渚河路街道", "code" => "130402006"},
      %{"name" => "浴新南街道", "code" => "130402007"},
      %{"name" => "农林路街道", "code" => "130402008"},
      %{"name" => "贸东街道", "code" => "130402009"},
      %{"name" => "贸西街道", "code" => "130402010"},
      %{"name" => "盛和路街道", "code" => "130402011"},
      %{"name" => "北张庄镇", "code" => "130402101"},
      %{"name" => "河沙镇镇", "code" => "130402102"},
      %{"name" => "南堡乡", "code" => "130402201"},
      %{"name" => "代召乡", "code" => "130402202"}
    ]

  def next(input) when input == "丛台区" or input == "130403",
    do: [
      %{"name" => "丛台西街道", "code" => "130403001"},
      %{"name" => "联纺西街道", "code" => "130403002"},
      %{"name" => "联纺东街道", "code" => "130403003"},
      %{"name" => "光明桥街道", "code" => "130403004"},
      %{"name" => "丛台东街道", "code" => "130403005"},
      %{"name" => "四季青街道", "code" => "130403006"},
      %{"name" => "中华街道", "code" => "130403008"},
      %{"name" => "人民路街道", "code" => "130403009"},
      %{"name" => "柳林桥街道", "code" => "130403010"},
      %{"name" => "东柳街道", "code" => "130403011"},
      %{"name" => "黄粱梦镇", "code" => "130403101"},
      %{"name" => "苏曹乡", "code" => "130403200"},
      %{"name" => "三陵乡", "code" => "130403205"},
      %{"name" => "南吕固乡", "code" => "130403206"},
      %{"name" => "兼庄乡", "code" => "130403207"}
    ]

  def next(input) when input == "复兴区" or input == "130404",
    do: [
      %{"name" => "胜利桥街道", "code" => "130404001"},
      %{"name" => "百家村街道", "code" => "130404002"},
      %{"name" => "铁路大院街道", "code" => "130404003"},
      %{"name" => "化林路街道", "code" => "130404004"},
      %{"name" => "庞村街道", "code" => "130404005"},
      %{"name" => "二六七二街道", "code" => "130404006"},
      %{"name" => "石化街道", "code" => "130404007"},
      %{"name" => "户村镇", "code" => "130404100"},
      %{"name" => "彭家寨乡", "code" => "130404200"},
      %{"name" => "康庄乡", "code" => "130404201"}
    ]

  def next(input) when input == "峰峰矿区" or input == "130406",
    do: [
      %{"name" => "滏阳东路街道", "code" => "130406001"},
      %{"name" => "临水镇", "code" => "130406100"},
      %{"name" => "峰峰镇", "code" => "130406101"},
      %{"name" => "新坡镇", "code" => "130406102"},
      %{"name" => "大社镇", "code" => "130406103"},
      %{"name" => "和村镇", "code" => "130406104"},
      %{"name" => "义井镇", "code" => "130406105"},
      %{"name" => "彭城镇", "code" => "130406106"},
      %{"name" => "界城镇", "code" => "130406107"},
      %{"name" => "大峪镇", "code" => "130406108"},
      %{"name" => "西固义乡", "code" => "130406200"}
    ]

  def next(input) when input == "肥乡区" or input == "130407",
    do: [
      %{"name" => "肥乡镇", "code" => "130407100"},
      %{"name" => "天台山镇", "code" => "130407101"},
      %{"name" => "辛安镇镇", "code" => "130407102"},
      %{"name" => "大寺上镇", "code" => "130407103"},
      %{"name" => "东漳堡镇", "code" => "130407104"},
      %{"name" => "毛演堡镇", "code" => "130407105"},
      %{"name" => "西吕营镇", "code" => "130407106"},
      %{"name" => "元固镇", "code" => "130407107"},
      %{"name" => "北高镇", "code" => "130407108"}
    ]

  def next(input) when input == "永年区" or input == "130408",
    do: [
      %{"name" => "临洺关镇", "code" => "130408100"},
      %{"name" => "大北汪镇", "code" => "130408101"},
      %{"name" => "张西堡镇", "code" => "130408102"},
      %{"name" => "广府镇", "code" => "130408103"},
      %{"name" => "永合会镇", "code" => "130408105"},
      %{"name" => "刘营镇", "code" => "130408106"},
      %{"name" => "西苏镇", "code" => "130408107"},
      %{"name" => "讲武镇", "code" => "130408108"},
      %{"name" => "东杨庄镇", "code" => "130408109"},
      %{"name" => "界河店乡", "code" => "130408201"},
      %{"name" => "刘汉乡", "code" => "130408203"},
      %{"name" => "正西乡", "code" => "130408204"},
      %{"name" => "曲陌乡", "code" => "130408206"},
      %{"name" => "辛庄堡乡", "code" => "130408207"},
      %{"name" => "小龙马乡", "code" => "130408208"},
      %{"name" => "西河庄乡", "code" => "130408211"},
      %{"name" => "西阳城乡", "code" => "130408213"}
    ]

  def next(input) when input == "临漳县" or input == "130423",
    do: [
      %{"name" => "临漳镇", "code" => "130423100"},
      %{"name" => "南东坊镇", "code" => "130423101"},
      %{"name" => "孙陶集镇", "code" => "130423102"},
      %{"name" => "柳园镇", "code" => "130423103"},
      %{"name" => "称勾集镇", "code" => "130423104"},
      %{"name" => "邺城镇", "code" => "130423105"},
      %{"name" => "章里集镇", "code" => "130423106"},
      %{"name" => "张村集镇", "code" => "130423107"},
      %{"name" => "砖寨营镇", "code" => "130423108"},
      %{"name" => "习文镇", "code" => "130423109"},
      %{"name" => "狄邱乡", "code" => "130423200"},
      %{"name" => "西羊羔乡", "code" => "130423202"},
      %{"name" => "杜村集乡", "code" => "130423204"},
      %{"name" => "柏鹤集乡", "code" => "130423208"}
    ]

  def next(input) when input == "成安县" or input == "130424",
    do: [
      %{"name" => "成安镇", "code" => "130424100"},
      %{"name" => "商城镇", "code" => "130424101"},
      %{"name" => "漳河店镇", "code" => "130424102"},
      %{"name" => "李家疃镇", "code" => "130424103"},
      %{"name" => "北乡义镇", "code" => "130424104"},
      %{"name" => "道东堡镇", "code" => "130424105"},
      %{"name" => "辛义乡", "code" => "130424200"},
      %{"name" => "柏寺营乡", "code" => "130424201"},
      %{"name" => "长巷乡", "code" => "130424204"}
    ]

  def next(input) when input == "大名县" or input == "130425",
    do: [
      %{"name" => "大名镇", "code" => "130425100"},
      %{"name" => "杨桥镇", "code" => "130425101"},
      %{"name" => "万堤镇", "code" => "130425102"},
      %{"name" => "龙王庙镇", "code" => "130425103"},
      %{"name" => "束馆镇", "code" => "130425104"},
      %{"name" => "金滩镇", "code" => "130425105"},
      %{"name" => "沙圪塔镇", "code" => "130425106"},
      %{"name" => "大街镇", "code" => "130425107"},
      %{"name" => "铺上镇", "code" => "130425108"},
      %{"name" => "孙甘店镇", "code" => "130425109"},
      %{"name" => "北峰镇", "code" => "130425110"},
      %{"name" => "黄金堤镇", "code" => "130425111"},
      %{"name" => "王村乡", "code" => "130425201"},
      %{"name" => "旧治乡", "code" => "130425205"},
      %{"name" => "西未庄乡", "code" => "130425206"},
      %{"name" => "西付集乡", "code" => "130425208"},
      %{"name" => "埝头乡", "code" => "130425209"},
      %{"name" => "张铁集乡", "code" => "130425211"},
      %{"name" => "红庙乡", "code" => "130425212"},
      %{"name" => "营镇回族乡", "code" => "130425213"}
    ]

  def next(input) when input == "涉县" or input == "130426",
    do: [
      %{"name" => "平安街道", "code" => "130426001"},
      %{"name" => "河南店镇", "code" => "130426101"},
      %{"name" => "索堡镇", "code" => "130426102"},
      %{"name" => "西戌镇", "code" => "130426103"},
      %{"name" => "井店镇", "code" => "130426104"},
      %{"name" => "更乐镇", "code" => "130426105"},
      %{"name" => "固新镇", "code" => "130426106"},
      %{"name" => "西达镇", "code" => "130426107"},
      %{"name" => "偏城镇", "code" => "130426108"},
      %{"name" => "神头乡", "code" => "130426200"},
      %{"name" => "辽城乡", "code" => "130426201"},
      %{"name" => "偏店乡", "code" => "130426202"},
      %{"name" => "龙虎乡", "code" => "130426203"},
      %{"name" => "木井乡", "code" => "130426204"},
      %{"name" => "关防乡", "code" => "130426205"},
      %{"name" => "合漳乡", "code" => "130426206"},
      %{"name" => "鹿头乡", "code" => "130426207"},
      %{"name" => "涉城镇", "code" => "130426400"}
    ]

  def next(input) when input == "磁县" or input == "130427",
    do: [
      %{"name" => "磁州镇", "code" => "130427100"},
      %{"name" => "讲武城镇", "code" => "130427103"},
      %{"name" => "岳城镇", "code" => "130427104"},
      %{"name" => "观台镇", "code" => "130427105"},
      %{"name" => "白土镇", "code" => "130427107"},
      %{"name" => "黄沙镇", "code" => "130427108"},
      %{"name" => "路村营乡", "code" => "130427200"},
      %{"name" => "时村营乡", "code" => "130427204"},
      %{"name" => "陶泉乡", "code" => "130427207"},
      %{"name" => "都党乡", "code" => "130427208"},
      %{"name" => "北贾壁乡", "code" => "130427209"}
    ]

  def next(input) when input == "邱县" or input == "130430",
    do: [
      %{"name" => "新马头镇", "code" => "130430100"},
      %{"name" => "邱城镇", "code" => "130430101"},
      %{"name" => "梁二庄镇", "code" => "130430102"},
      %{"name" => "香城固镇", "code" => "130430103"},
      %{"name" => "古城营镇", "code" => "130430104"},
      %{"name" => "南辛店乡", "code" => "130430201"},
      %{"name" => "陈村回族乡", "code" => "130430204"}
    ]

  def next(input) when input == "鸡泽县" or input == "130431",
    do: [
      %{"name" => "鸡泽镇", "code" => "130431100"},
      %{"name" => "小寨镇", "code" => "130431101"},
      %{"name" => "双塔镇", "code" => "130431102"},
      %{"name" => "曹庄镇", "code" => "130431103"},
      %{"name" => "浮图店镇", "code" => "130431104"},
      %{"name" => "吴官营镇", "code" => "130431105"},
      %{"name" => "风正乡", "code" => "130431202"}
    ]

  def next(input) when input == "广平县" or input == "130432",
    do: [
      %{"name" => "广平镇", "code" => "130432100"},
      %{"name" => "平固店镇", "code" => "130432101"},
      %{"name" => "胜营镇", "code" => "130432102"},
      %{"name" => "南阳堡镇", "code" => "130432103"},
      %{"name" => "十里铺镇", "code" => "130432104"},
      %{"name" => "南韩镇", "code" => "130432105"},
      %{"name" => "东张孟镇", "code" => "130432106"}
    ]

  def next(input) when input == "馆陶县" or input == "130433",
    do: [
      %{"name" => "馆陶镇", "code" => "130433100"},
      %{"name" => "房寨镇", "code" => "130433101"},
      %{"name" => "柴堡镇", "code" => "130433102"},
      %{"name" => "魏僧寨镇", "code" => "130433103"},
      %{"name" => "寿山寺镇", "code" => "130433104"},
      %{"name" => "王桥镇", "code" => "130433105"},
      %{"name" => "南徐村乡", "code" => "130433202"},
      %{"name" => "路桥乡", "code" => "130433203"}
    ]

  def next(input) when input == "魏县" or input == "130434",
    do: [
      %{"name" => "魏城镇", "code" => "130434100"},
      %{"name" => "德政镇", "code" => "130434101"},
      %{"name" => "北皋镇", "code" => "130434102"},
      %{"name" => "双井镇", "code" => "130434103"},
      %{"name" => "牙里镇", "code" => "130434104"},
      %{"name" => "车往镇", "code" => "130434105"},
      %{"name" => "回隆镇", "code" => "130434106"},
      %{"name" => "张二庄镇", "code" => "130434107"},
      %{"name" => "东代固镇", "code" => "130434108"},
      %{"name" => "院堡镇", "code" => "130434109"},
      %{"name" => "棘针寨镇", "code" => "130434110"},
      %{"name" => "南双庙镇", "code" => "130434111"},
      %{"name" => "边马镇", "code" => "130434112"},
      %{"name" => "泊口镇", "code" => "130434113"},
      %{"name" => "仕望集镇", "code" => "130434114"},
      %{"name" => "沙口集镇", "code" => "130434115"},
      %{"name" => "大兴庄镇", "code" => "130434116"},
      %{"name" => "野胡拐乡", "code" => "130434203"},
      %{"name" => "前大磨乡", "code" => "130434205"},
      %{"name" => "大马村乡", "code" => "130434209"},
      %{"name" => "北台头乡", "code" => "130434212"}
    ]

  def next(input) when input == "曲周县" or input == "130435",
    do: [
      %{"name" => "曲周镇", "code" => "130435100"},
      %{"name" => "安寨镇", "code" => "130435101"},
      %{"name" => "侯村镇", "code" => "130435102"},
      %{"name" => "河南疃镇", "code" => "130435103"},
      %{"name" => "第四疃镇", "code" => "130435104"},
      %{"name" => "白寨镇", "code" => "130435105"},
      %{"name" => "槐桥镇", "code" => "130435106"},
      %{"name" => "南里岳镇", "code" => "130435107"},
      %{"name" => "大河道乡", "code" => "130435203"},
      %{"name" => "依庄乡", "code" => "130435204"}
    ]

  def next(input) when input == "邯郸经济技术开发区" or input == "130471",
    do: [
      %{"name" => "尚璧镇", "code" => "130471100"},
      %{"name" => "南沿村镇", "code" => "130471101"},
      %{"name" => "小西堡乡", "code" => "130471200"},
      %{"name" => "姚寨乡", "code" => "130471201"},
      %{"name" => "开发区街道", "code" => "130471400"}
    ]

  def next(input) when input == "邯郸冀南新区" or input == "130473",
    do: [
      %{"name" => "城南街道", "code" => "130473001"},
      %{"name" => "高臾镇", "code" => "130473100"},
      %{"name" => "光禄镇", "code" => "130473101"},
      %{"name" => "林坛镇", "code" => "130473102"},
      %{"name" => "马头镇", "code" => "130473103"},
      %{"name" => "辛庄营乡", "code" => "130473200"},
      %{"name" => "花官营乡", "code" => "130473201"},
      %{"name" => "台城乡", "code" => "130473202"},
      %{"name" => "南城乡", "code" => "130473203"}
    ]

  def next(input) when input == "武安市" or input == "130481",
    do: [
      %{"name" => "武安镇", "code" => "130481100"},
      %{"name" => "康二城镇", "code" => "130481101"},
      %{"name" => "午汲镇", "code" => "130481102"},
      %{"name" => "磁山镇", "code" => "130481103"},
      %{"name" => "伯延镇", "code" => "130481104"},
      %{"name" => "淑村镇", "code" => "130481105"},
      %{"name" => "大同镇", "code" => "130481106"},
      %{"name" => "邑城镇", "code" => "130481107"},
      %{"name" => "矿山镇", "code" => "130481108"},
      %{"name" => "贺进镇", "code" => "130481109"},
      %{"name" => "阳邑镇", "code" => "130481110"},
      %{"name" => "徘徊镇", "code" => "130481111"},
      %{"name" => "冶陶镇", "code" => "130481112"},
      %{"name" => "上团城镇", "code" => "130481113"},
      %{"name" => "西土山镇", "code" => "130481114"},
      %{"name" => "北安庄乡", "code" => "130481201"},
      %{"name" => "北安乐乡", "code" => "130481202"},
      %{"name" => "西寺庄乡", "code" => "130481204"},
      %{"name" => "活水乡", "code" => "130481205"},
      %{"name" => "石洞乡", "code" => "130481206"},
      %{"name" => "管陶乡", "code" => "130481207"},
      %{"name" => "马家庄乡", "code" => "130481208"},
      %{"name" => "河北武安工业园区", "code" => "130481400"}
    ]

  def next(input) when input == "海港区" or input == "130302",
    do: [
      %{"name" => "文化路街道", "code" => "130302001"},
      %{"name" => "海滨路街道", "code" => "130302002"},
      %{"name" => "北环路街道", "code" => "130302003"},
      %{"name" => "建设大街街道", "code" => "130302004"},
      %{"name" => "河东街道", "code" => "130302005"},
      %{"name" => "西港路街道", "code" => "130302006"},
      %{"name" => "燕山大街街道", "code" => "130302007"},
      %{"name" => "港城大街街道", "code" => "130302008"},
      %{"name" => "东环路街道", "code" => "130302009"},
      %{"name" => "白塔岭街道", "code" => "130302010"},
      %{"name" => "东港镇", "code" => "130302100"},
      %{"name" => "海港镇", "code" => "130302101"},
      %{"name" => "西港镇", "code" => "130302102"},
      %{"name" => "海阳镇", "code" => "130302103"},
      %{"name" => "北港镇", "code" => "130302104"},
      %{"name" => "杜庄镇", "code" => "130302105"},
      %{"name" => "石门寨镇", "code" => "130302106"},
      %{"name" => "驻操营镇", "code" => "130302107"},
      %{"name" => "临港物流园区", "code" => "130302403"},
      %{"name" => "海港经济开发区", "code" => "130302404"}
    ]

  def next(input) when input == "山海关区" or input == "130303",
    do: [
      %{"name" => "南关街道", "code" => "130303001"},
      %{"name" => "古城街道", "code" => "130303002"},
      %{"name" => "西关街道", "code" => "130303003"},
      %{"name" => "路南街道", "code" => "130303004"},
      %{"name" => "第一关镇", "code" => "130303100"},
      %{"name" => "石河镇", "code" => "130303101"},
      %{"name" => "孟姜镇", "code" => "130303102"}
    ]

  def next(input) when input == "北戴河区" or input == "130304",
    do: [
      %{"name" => "西山街道", "code" => "130304001"},
      %{"name" => "东山街道", "code" => "130304002"},
      %{"name" => "海滨镇", "code" => "130304100"},
      %{"name" => "戴河镇", "code" => "130304101"},
      %{"name" => "牛头崖镇", "code" => "130304103"}
    ]

  def next(input) when input == "抚宁区" or input == "130306",
    do: [
      %{"name" => "骊城街道", "code" => "130306001"},
      %{"name" => "抚宁镇", "code" => "130306100"},
      %{"name" => "留守营镇", "code" => "130306101"},
      %{"name" => "榆关镇", "code" => "130306102"},
      %{"name" => "台营镇", "code" => "130306105"},
      %{"name" => "大新寨镇", "code" => "130306106"},
      %{"name" => "坟坨镇", "code" => "130306109"},
      %{"name" => "茶棚乡", "code" => "130306200"}
    ]

  def next(input) when input == "青龙满族自治县" or input == "130321",
    do: [
      %{"name" => "都阳路街道", "code" => "130321001"},
      %{"name" => "青龙镇", "code" => "130321100"},
      %{"name" => "祖山镇", "code" => "130321101"},
      %{"name" => "木头凳镇", "code" => "130321102"},
      %{"name" => "双山子镇", "code" => "130321103"},
      %{"name" => "马圈子镇", "code" => "130321104"},
      %{"name" => "肖营子镇", "code" => "130321105"},
      %{"name" => "大巫岚镇", "code" => "130321106"},
      %{"name" => "土门子镇", "code" => "130321107"},
      %{"name" => "八道河镇", "code" => "130321108"},
      %{"name" => "隔河头镇", "code" => "130321109"},
      %{"name" => "娄杖子镇", "code" => "130321110"},
      %{"name" => "龙王庙镇", "code" => "130321111"},
      %{"name" => "茨榆山镇", "code" => "130321112"},
      %{"name" => "凤凰山乡", "code" => "130321200"},
      %{"name" => "三星口乡", "code" => "130321202"},
      %{"name" => "干沟乡", "code" => "130321203"},
      %{"name" => "大石岭乡", "code" => "130321206"},
      %{"name" => "官场乡", "code" => "130321208"},
      %{"name" => "平方子乡", "code" => "130321210"},
      %{"name" => "安子岭乡", "code" => "130321211"},
      %{"name" => "朱杖子乡", "code" => "130321212"},
      %{"name" => "草碾乡", "code" => "130321213"},
      %{"name" => "三拨子乡", "code" => "130321217"},
      %{"name" => "凉水河乡", "code" => "130321218"}
    ]

  def next(input) when input == "昌黎县" or input == "130322",
    do: [
      %{"name" => "昌黎镇", "code" => "130322100"},
      %{"name" => "靖安镇", "code" => "130322101"},
      %{"name" => "安山镇", "code" => "130322102"},
      %{"name" => "龙家店镇", "code" => "130322103"},
      %{"name" => "泥井镇", "code" => "130322104"},
      %{"name" => "大蒲河镇", "code" => "130322105"},
      %{"name" => "新集镇", "code" => "130322106"},
      %{"name" => "刘台庄镇", "code" => "130322107"},
      %{"name" => "茹荷镇", "code" => "130322108"},
      %{"name" => "朱各庄镇", "code" => "130322109"},
      %{"name" => "荒佃庄镇", "code" => "130322110"},
      %{"name" => "团林乡", "code" => "130322201"},
      %{"name" => "葛条港乡", "code" => "130322202"},
      %{"name" => "马坨店乡", "code" => "130322203"},
      %{"name" => "两山乡", "code" => "130322206"},
      %{"name" => "十里铺乡", "code" => "130322207"}
    ]

  def next(input) when input == "卢龙县" or input == "130324",
    do: [
      %{"name" => "卢龙镇", "code" => "130324100"},
      %{"name" => "潘庄镇", "code" => "130324101"},
      %{"name" => "燕河营镇", "code" => "130324102"},
      %{"name" => "双望镇", "code" => "130324103"},
      %{"name" => "刘田各庄镇", "code" => "130324104"},
      %{"name" => "石门镇", "code" => "130324105"},
      %{"name" => "木井镇", "code" => "130324106"},
      %{"name" => "陈官屯镇", "code" => "130324107"},
      %{"name" => "蛤泊镇", "code" => "130324108"},
      %{"name" => "印庄镇", "code" => "130324109"},
      %{"name" => "下寨乡", "code" => "130324200"},
      %{"name" => "刘家营乡", "code" => "130324201"}
    ]

  def next(input) when input == "秦皇岛市经济技术开发区" or input == "130371",
    do: [
      %{"name" => "船厂路街道", "code" => "130371005"},
      %{"name" => "珠江道街道", "code" => "130371011"},
      %{"name" => "黄河道街道", "code" => "130371012"},
      %{"name" => "腾飞路街道", "code" => "130371013"},
      %{"name" => "渤海乡", "code" => "130371200"}
    ]

  def next(input) when input == "北戴河新区" or input == "130372",
    do: [
      %{"name" => "南戴河街道", "code" => "130372001"},
      %{"name" => "大蒲河管理处", "code" => "130372400"},
      %{"name" => "团林管理处", "code" => "130372401"},
      %{"name" => "留守营管理处", "code" => "130372402"}
    ]

  def next(input) when input == "路南区" or input == "130202",
    do: [
      %{"name" => "学院南路街道", "code" => "130202001"},
      %{"name" => "友谊街道", "code" => "130202002"},
      %{"name" => "广场街道", "code" => "130202003"},
      %{"name" => "永红桥街道", "code" => "130202004"},
      %{"name" => "小山街道", "code" => "130202005"},
      %{"name" => "文化北后街街道", "code" => "130202006"},
      %{"name" => "钱家营矿区街道", "code" => "130202007"},
      %{"name" => "惠民道街道", "code" => "130202008"},
      %{"name" => "梁家屯路街道", "code" => "130202009"},
      %{"name" => "稻地镇", "code" => "130202102"},
      %{"name" => "女织寨镇", "code" => "130202103"}
    ]

  def next(input) when input == "路北区" or input == "130203",
    do: [
      %{"name" => "乔屯街道", "code" => "130203001"},
      %{"name" => "文化路街道", "code" => "130203002"},
      %{"name" => "钓鱼台街道", "code" => "130203003"},
      %{"name" => "东新村街道", "code" => "130203004"},
      %{"name" => "缸窑街道", "code" => "130203005"},
      %{"name" => "机场路街道", "code" => "130203006"},
      %{"name" => "河北路街道", "code" => "130203007"},
      %{"name" => "龙东街道", "code" => "130203008"},
      %{"name" => "大里街道", "code" => "130203009"},
      %{"name" => "光明街道", "code" => "130203010"},
      %{"name" => "翔云道街道", "code" => "130203011"},
      %{"name" => "韩城镇", "code" => "130203100"},
      %{"name" => "果园镇", "code" => "130203101"}
    ]

  def next(input) when input == "古冶区" or input == "130204",
    do: [
      %{"name" => "林西街道", "code" => "130204001"},
      %{"name" => "唐家庄街道", "code" => "130204002"},
      %{"name" => "古冶街道", "code" => "130204003"},
      %{"name" => "赵各庄街道", "code" => "130204004"},
      %{"name" => "京华街道", "code" => "130204007"},
      %{"name" => "范各庄镇", "code" => "130204100"},
      %{"name" => "卑家店镇", "code" => "130204101"},
      %{"name" => "王辇庄乡", "code" => "130204201"},
      %{"name" => "习家套乡", "code" => "130204202"},
      %{"name" => "大庄坨乡", "code" => "130204203"}
    ]

  def next(input) when input == "开平区" or input == "130205",
    do: [
      %{"name" => "马家沟街道", "code" => "130205001"},
      %{"name" => "开平街道", "code" => "130205002"},
      %{"name" => "税务庄街道", "code" => "130205003"},
      %{"name" => "陡电街道", "code" => "130205005"},
      %{"name" => "荆各庄街道", "code" => "130205006"},
      %{"name" => "开平镇", "code" => "130205100"},
      %{"name" => "栗园镇", "code" => "130205101"},
      %{"name" => "越河镇", "code" => "130205102"},
      %{"name" => "双桥镇", "code" => "130205103"},
      %{"name" => "郑庄子镇", "code" => "130205104"},
      %{"name" => "洼里镇", "code" => "130205105"}
    ]

  def next(input) when input == "丰南区" or input == "130207",
    do: [
      %{"name" => "青年路街道", "code" => "130207001"},
      %{"name" => "胥各庄镇", "code" => "130207100"},
      %{"name" => "小集镇", "code" => "130207103"},
      %{"name" => "黄各庄镇", "code" => "130207104"},
      %{"name" => "西葛镇", "code" => "130207105"},
      %{"name" => "大新庄镇", "code" => "130207106"},
      %{"name" => "钱营镇", "code" => "130207107"},
      %{"name" => "唐坊镇", "code" => "130207108"},
      %{"name" => "王兰庄镇", "code" => "130207109"},
      %{"name" => "柳树瞿阝镇", "code" => "130207110"},
      %{"name" => "黑沿子镇", "code" => "130207111"},
      %{"name" => "大齐各庄镇", "code" => "130207114"},
      %{"name" => "岔河镇", "code" => "130207116"},
      %{"name" => "南孙庄镇", "code" => "130207117"},
      %{"name" => "东田庄镇", "code" => "130207118"},
      %{"name" => "尖字沽乡", "code" => "130207203"}
    ]

  def next(input) when input == "丰润区" or input == "130208",
    do: [
      %{"name" => "太平路街道", "code" => "130208001"},
      %{"name" => "燕山路街道", "code" => "130208002"},
      %{"name" => "浭阳街道", "code" => "130208003"},
      %{"name" => "丰润镇", "code" => "130208100"},
      %{"name" => "任各庄镇", "code" => "130208102"},
      %{"name" => "左家坞镇", "code" => "130208103"},
      %{"name" => "泉河头镇", "code" => "130208104"},
      %{"name" => "王官营镇", "code" => "130208105"},
      %{"name" => "火石营镇", "code" => "130208106"},
      %{"name" => "新军屯镇", "code" => "130208109"},
      %{"name" => "小张各庄镇", "code" => "130208110"},
      %{"name" => "丰登坞镇", "code" => "130208111"},
      %{"name" => "李钊庄镇", "code" => "130208112"},
      %{"name" => "白官屯镇", "code" => "130208113"},
      %{"name" => "石各庄镇", "code" => "130208114"},
      %{"name" => "沙流河镇", "code" => "130208115"},
      %{"name" => "七树庄镇", "code" => "130208116"},
      %{"name" => "杨官林镇", "code" => "130208117"},
      %{"name" => "银城铺镇", "code" => "130208118"},
      %{"name" => "常庄镇", "code" => "130208119"},
      %{"name" => "姜家营镇", "code" => "130208120"},
      %{"name" => "欢喜庄乡", "code" => "130208205"},
      %{"name" => "刘家营乡", "code" => "130208208"}
    ]

  def next(input) when input == "曹妃甸区" or input == "130209",
    do: [
      %{"name" => "唐海镇", "code" => "130209100"},
      %{"name" => "滨海镇", "code" => "130209112"},
      %{"name" => "柳赞镇", "code" => "130209113"},
      %{"name" => "一农场", "code" => "130209401"},
      %{"name" => "三农场", "code" => "130209403"},
      %{"name" => "四农场", "code" => "130209404"},
      %{"name" => "五农场", "code" => "130209405"},
      %{"name" => "六农场", "code" => "130209406"},
      %{"name" => "七农场", "code" => "130209407"},
      %{"name" => "八农场", "code" => "130209408"},
      %{"name" => "九农场", "code" => "130209409"},
      %{"name" => "十农场", "code" => "130209410"},
      %{"name" => "十一农场", "code" => "130209411"},
      %{"name" => "八里滩养殖场", "code" => "130209412"},
      %{"name" => "十里海养殖场", "code" => "130209413"},
      %{"name" => "唐山国际旅游岛", "code" => "130209414"},
      %{"name" => "南堡经济开发区", "code" => "130209450"},
      %{"name" => "曹妃甸工业区", "code" => "130209451"},
      %{"name" => "曹妃甸新城", "code" => "130209452"}
    ]

  def next(input) when input == "滦南县" or input == "130224",
    do: [
      %{"name" => "友谊路街道", "code" => "130224001"},
      %{"name" => "倴城镇", "code" => "130224100"},
      %{"name" => "宋道口镇", "code" => "130224101"},
      %{"name" => "长凝镇", "code" => "130224102"},
      %{"name" => "胡各庄镇", "code" => "130224103"},
      %{"name" => "坨里镇", "code" => "130224104"},
      %{"name" => "姚王庄镇", "code" => "130224105"},
      %{"name" => "司各庄镇", "code" => "130224106"},
      %{"name" => "安各庄镇", "code" => "130224107"},
      %{"name" => "扒齿港镇", "code" => "130224108"},
      %{"name" => "程庄镇", "code" => "130224109"},
      %{"name" => "青坨营镇", "code" => "130224110"},
      %{"name" => "柏各庄镇", "code" => "130224111"},
      %{"name" => "南堡镇", "code" => "130224114"},
      %{"name" => "方各庄镇", "code" => "130224115"},
      %{"name" => "东黄坨镇", "code" => "130224116"},
      %{"name" => "马城镇", "code" => "130224117"}
    ]

  def next(input) when input == "乐亭县" or input == "130225",
    do: [
      %{"name" => "乐安街道", "code" => "130225001"},
      %{"name" => "乐亭镇", "code" => "130225100"},
      %{"name" => "汤家河镇", "code" => "130225101"},
      %{"name" => "胡家坨镇", "code" => "130225102"},
      %{"name" => "闫各庄镇", "code" => "130225104"},
      %{"name" => "马头营镇", "code" => "130225105"},
      %{"name" => "新寨镇", "code" => "130225106"},
      %{"name" => "汀流河镇", "code" => "130225107"},
      %{"name" => "姜各庄镇", "code" => "130225108"},
      %{"name" => "毛庄镇", "code" => "130225109"},
      %{"name" => "中堡镇", "code" => "130225110"},
      %{"name" => "大相各庄镇", "code" => "130225111"},
      %{"name" => "庞各庄乡", "code" => "130225201"},
      %{"name" => "古河乡", "code" => "130225203"},
      %{"name" => "河北乐亭经济开发区", "code" => "130225453"},
      %{"name" => "乐亭县城区工业聚集区", "code" => "130225454"}
    ]

  def next(input) when input == "迁西县" or input == "130227",
    do: [
      %{"name" => "栗乡街道", "code" => "130227001"},
      %{"name" => "兴城镇", "code" => "130227100"},
      %{"name" => "金厂峪镇", "code" => "130227101"},
      %{"name" => "洒河桥镇", "code" => "130227102"},
      %{"name" => "太平寨镇", "code" => "130227103"},
      %{"name" => "罗家屯镇", "code" => "130227104"},
      %{"name" => "东荒峪镇", "code" => "130227105"},
      %{"name" => "新集镇", "code" => "130227106"},
      %{"name" => "三屯营镇", "code" => "130227107"},
      %{"name" => "滦阳镇", "code" => "130227108"},
      %{"name" => "汉儿庄镇", "code" => "130227109"},
      %{"name" => "新庄子镇", "code" => "130227110"},
      %{"name" => "东莲花院镇", "code" => "130227111"},
      %{"name" => "白庙子镇", "code" => "130227112"},
      %{"name" => "上营镇", "code" => "130227113"},
      %{"name" => "渔户寨乡", "code" => "130227203"},
      %{"name" => "旧城乡", "code" => "130227204"},
      %{"name" => "尹庄乡", "code" => "130227205"},
      %{"name" => "河北迁西经济开发区", "code" => "130227450"}
    ]

  def next(input) when input == "玉田县" or input == "130229",
    do: [
      %{"name" => "无终街道", "code" => "130229001"},
      %{"name" => "玉田镇", "code" => "130229100"},
      %{"name" => "亮甲店镇", "code" => "130229101"},
      %{"name" => "鸦鸿桥镇", "code" => "130229102"},
      %{"name" => "窝洛沽镇", "code" => "130229103"},
      %{"name" => "石臼窝镇", "code" => "130229104"},
      %{"name" => "虹桥镇", "code" => "130229105"},
      %{"name" => "散水头镇", "code" => "130229106"},
      %{"name" => "林南仓镇", "code" => "130229107"},
      %{"name" => "林西镇", "code" => "130229108"},
      %{"name" => "杨家板桥镇", "code" => "130229109"},
      %{"name" => "彩亭桥镇", "code" => "130229110"},
      %{"name" => "孤树镇", "code" => "130229111"},
      %{"name" => "大安镇镇", "code" => "130229112"},
      %{"name" => "唐自头镇", "code" => "130229113"},
      %{"name" => "郭家屯镇", "code" => "130229114"},
      %{"name" => "杨家套镇", "code" => "130229115"},
      %{"name" => "陈家铺镇", "code" => "130229116"},
      %{"name" => "林头屯乡", "code" => "130229201"},
      %{"name" => "潮洛窝乡", "code" => "130229203"},
      %{"name" => "郭家桥乡", "code" => "130229205"},
      %{"name" => "河北玉田经济开发区", "code" => "130229400"},
      %{"name" => "河北唐山国家农业科技园区", "code" => "130229401"}
    ]

  def next(input) when input == "河北唐山芦台经济开发区" or input == "130271",
    do: [%{"name" => "海北镇", "code" => "130271100"}, %{"name" => "新华路街道", "code" => "130271450"}]

  def next(input) when input == "唐山市汉沽管理区" or input == "130272",
    do: [
      %{"name" => "汉丰镇", "code" => "130272101"},
      %{"name" => "兴农街道", "code" => "130272451"},
      %{"name" => "振兴街道", "code" => "130272452"}
    ]

  def next(input) when input == "唐山高新技术产业开发区" or input == "130273",
    do: [
      %{"name" => "街道", "code" => "130273001"},
      %{"name" => "老庄子镇", "code" => "130273101"},
      %{"name" => "庆北", "code" => "130273401"},
      %{"name" => "三女河", "code" => "130273402"}
    ]

  def next(input) when input == "河北唐山海港经济开发区" or input == "130274",
    do: [
      %{"name" => "王滩镇", "code" => "130274103"},
      %{"name" => "港城街道服务中心", "code" => "130274451"}
    ]

  def next(input) when input == "遵化市" or input == "130281",
    do: [
      %{"name" => "华明路街道", "code" => "130281001"},
      %{"name" => "文化路街道", "code" => "130281002"},
      %{"name" => "遵化镇", "code" => "130281100"},
      %{"name" => "堡子店镇", "code" => "130281101"},
      %{"name" => "马兰峪镇", "code" => "130281102"},
      %{"name" => "平安城镇", "code" => "130281103"},
      %{"name" => "东新庄镇", "code" => "130281104"},
      %{"name" => "新店子镇", "code" => "130281105"},
      %{"name" => "党峪镇", "code" => "130281106"},
      %{"name" => "地北头镇", "code" => "130281107"},
      %{"name" => "东旧寨镇", "code" => "130281108"},
      %{"name" => "铁厂镇", "code" => "130281109"},
      %{"name" => "苏家洼镇", "code" => "130281110"},
      %{"name" => "建明镇", "code" => "130281111"},
      %{"name" => "石门镇", "code" => "130281112"},
      %{"name" => "崔家庄镇", "code" => "130281113"},
      %{"name" => "西留村镇", "code" => "130281114"},
      %{"name" => "兴旺寨镇", "code" => "130281115"},
      %{"name" => "西三里镇", "code" => "130281116"},
      %{"name" => "团瓢庄镇", "code" => "130281117"},
      %{"name" => "娘娘庄镇", "code" => "130281118"},
      %{"name" => "侯家寨镇", "code" => "130281119"},
      %{"name" => "西下营满族乡", "code" => "130281203"},
      %{"name" => "汤泉满族乡", "code" => "130281204"},
      %{"name" => "东陵满族乡", "code" => "130281205"},
      %{"name" => "刘备寨乡", "code" => "130281206"},
      %{"name" => "小厂乡", "code" => "130281211"}
    ]

  def next(input) when input == "迁安市" or input == "130283",
    do: [
      %{"name" => "永顺街道", "code" => "130283001"},
      %{"name" => "兴安街道", "code" => "130283002"},
      %{"name" => "滨河街道", "code" => "130283003"},
      %{"name" => "杨店子街道", "code" => "130283004"},
      %{"name" => "夏官营镇", "code" => "130283101"},
      %{"name" => "杨各庄镇", "code" => "130283102"},
      %{"name" => "建昌营镇", "code" => "130283103"},
      %{"name" => "赵店子镇", "code" => "130283104"},
      %{"name" => "野鸡坨镇", "code" => "130283105"},
      %{"name" => "大崔庄镇", "code" => "130283106"},
      %{"name" => "蔡园镇", "code" => "130283108"},
      %{"name" => "马兰庄镇", "code" => "130283109"},
      %{"name" => "沙河驿镇", "code" => "130283110"},
      %{"name" => "木厂口镇", "code" => "130283111"},
      %{"name" => "上射雁庄镇", "code" => "130283112"},
      %{"name" => "太平庄镇", "code" => "130283113"},
      %{"name" => "扣庄镇", "code" => "130283114"},
      %{"name" => "大五里镇", "code" => "130283115"},
      %{"name" => "五重安镇", "code" => "130283116"},
      %{"name" => "彭店子镇", "code" => "130283117"},
      %{"name" => "阎家店镇", "code" => "130283118"}
    ]

  def next(input) when input == "滦州市" or input == "130284",
    do: [
      %{"name" => "滦河街道", "code" => "130284001"},
      %{"name" => "古城街道", "code" => "130284002"},
      %{"name" => "滦城路街道", "code" => "130284003"},
      %{"name" => "响嘡街道", "code" => "130284004"},
      %{"name" => "东安各庄镇", "code" => "130284102"},
      %{"name" => "雷庄镇", "code" => "130284103"},
      %{"name" => "茨榆坨镇", "code" => "130284104"},
      %{"name" => "榛子镇", "code" => "130284105"},
      %{"name" => "杨柳庄镇", "code" => "130284106"},
      %{"name" => "油榨镇", "code" => "130284107"},
      %{"name" => "古马镇", "code" => "130284108"},
      %{"name" => "小马庄镇", "code" => "130284109"},
      %{"name" => "九百户镇", "code" => "130284110"},
      %{"name" => "王店子镇", "code" => "130284111"}
    ]

  def next(input) when input == "长安区" or input == "130102",
    do: [
      %{"name" => "建北街道", "code" => "130102001"},
      %{"name" => "青园街道", "code" => "130102002"},
      %{"name" => "广安街道", "code" => "130102003"},
      %{"name" => "育才街道", "code" => "130102004"},
      %{"name" => "跃进街道", "code" => "130102005"},
      %{"name" => "河东街道", "code" => "130102007"},
      %{"name" => "长丰街道", "code" => "130102010"},
      %{"name" => "谈固街道", "code" => "130102011"},
      %{"name" => "中山东路街道", "code" => "130102012"},
      %{"name" => "阜康街道", "code" => "130102013"},
      %{"name" => "建安街道", "code" => "130102014"},
      %{"name" => "胜北街道", "code" => "130102015"},
      %{"name" => "西兆通镇", "code" => "130102100"},
      %{"name" => "南村镇", "code" => "130102101"},
      %{"name" => "高营镇", "code" => "130102102"},
      %{"name" => "桃园镇", "code" => "130102103"}
    ]

  def next(input) when input == "桥西区" or input == "130104",
    do: [
      %{"name" => "东里街道", "code" => "130104001"},
      %{"name" => "中山街道", "code" => "130104002"},
      %{"name" => "南长街道", "code" => "130104004"},
      %{"name" => "维明街道", "code" => "130104005"},
      %{"name" => "友谊街道", "code" => "130104007"},
      %{"name" => "红旗街道", "code" => "130104008"},
      %{"name" => "新石街道", "code" => "130104009"},
      %{"name" => "苑东街道", "code" => "130104010"},
      %{"name" => "西里街道", "code" => "130104011"},
      %{"name" => "振头街道", "code" => "130104012"},
      %{"name" => "留营街道", "code" => "130104013"},
      %{"name" => "长兴街道", "code" => "130104014"},
      %{"name" => "彭后街道", "code" => "130104015"},
      %{"name" => "东风街道", "code" => "130104016"},
      %{"name" => "东华街道", "code" => "130104017"},
      %{"name" => "休门街道", "code" => "130104018"},
      %{"name" => "汇通街道", "code" => "130104019"}
    ]

  def next(input) when input == "新华区" or input == "130105",
    do: [
      %{"name" => "革新街街道", "code" => "130105001"},
      %{"name" => "新华路街道", "code" => "130105003"},
      %{"name" => "宁安街道", "code" => "130105004"},
      %{"name" => "东焦街道", "code" => "130105005"},
      %{"name" => "西苑街道", "code" => "130105006"},
      %{"name" => "合作路街道", "code" => "130105007"},
      %{"name" => "联盟街道", "code" => "130105008"},
      %{"name" => "石岗街道", "code" => "130105009"},
      %{"name" => "天苑街道", "code" => "130105011"},
      %{"name" => "北苑街道", "code" => "130105012"},
      %{"name" => "赵陵铺路街道", "code" => "130105013"},
      %{"name" => "西三庄街道", "code" => "130105014"},
      %{"name" => "大郭街道", "code" => "130105015"},
      %{"name" => "杜北街道", "code" => "130105016"},
      %{"name" => "赵佗路街道", "code" => "130105017"}
    ]

  def next(input) when input == "井陉矿区" or input == "130107",
    do: [
      %{"name" => "矿市街道", "code" => "130107001"},
      %{"name" => "四微街道", "code" => "130107002"},
      %{"name" => "贾庄镇", "code" => "130107100"},
      %{"name" => "凤山镇", "code" => "130107101"},
      %{"name" => "横涧乡", "code" => "130107200"}
    ]

  def next(input) when input == "裕华区" or input == "130108",
    do: [
      %{"name" => "裕兴街道", "code" => "130108001"},
      %{"name" => "裕强街道", "code" => "130108002"},
      %{"name" => "东苑街道", "code" => "130108003"},
      %{"name" => "建通街道", "code" => "130108004"},
      %{"name" => "槐底街道", "code" => "130108005"},
      %{"name" => "裕华路街道", "code" => "130108006"},
      %{"name" => "裕东街道", "code" => "130108007"},
      %{"name" => "裕翔街道", "code" => "130108008"},
      %{"name" => "建华南街道", "code" => "130108009"},
      %{"name" => "方村镇", "code" => "130108101"}
    ]

  def next(input) when input == "藁城区" or input == "130109",
    do: [
      %{"name" => "廉州镇", "code" => "130109100"},
      %{"name" => "兴安镇", "code" => "130109101"},
      %{"name" => "贾市庄镇", "code" => "130109102"},
      %{"name" => "南营镇", "code" => "130109103"},
      %{"name" => "梅花镇", "code" => "130109104"},
      %{"name" => "岗上镇", "code" => "130109105"},
      %{"name" => "南董镇", "code" => "130109107"},
      %{"name" => "张家庄镇", "code" => "130109108"},
      %{"name" => "南孟镇", "code" => "130109109"},
      %{"name" => "增村镇", "code" => "130109110"},
      %{"name" => "常安镇", "code" => "130109111"},
      %{"name" => "西关镇", "code" => "130109112"},
      %{"name" => "九门回族乡", "code" => "130109200"},
      %{"name" => "石家庄经济技术开发区", "code" => "130109500"}
    ]

  def next(input) when input == "鹿泉区" or input == "130110",
    do: [
      %{"name" => "获鹿镇", "code" => "130110100"},
      %{"name" => "铜冶镇", "code" => "130110101"},
      %{"name" => "寺家庄镇", "code" => "130110102"},
      %{"name" => "上庄镇", "code" => "130110103"},
      %{"name" => "李村镇", "code" => "130110104"},
      %{"name" => "宜安镇", "code" => "130110105"},
      %{"name" => "黄壁庄镇", "code" => "130110106"},
      %{"name" => "大河镇", "code" => "130110107"},
      %{"name" => "山尹村镇", "code" => "130110108"},
      %{"name" => "石井乡", "code" => "130110200"},
      %{"name" => "白鹿泉乡", "code" => "130110201"},
      %{"name" => "上寨乡", "code" => "130110202"},
      %{"name" => "河北鹿泉经济开发区", "code" => "130110500"}
    ]

  def next(input) when input == "栾城区" or input == "130111",
    do: [
      %{"name" => "栾城镇", "code" => "130111100"},
      %{"name" => "冶河镇", "code" => "130111103"},
      %{"name" => "窦妪镇", "code" => "130111104"},
      %{"name" => "楼底镇", "code" => "130111105"},
      %{"name" => "南高乡", "code" => "130111200"},
      %{"name" => "柳林屯乡", "code" => "130111201"},
      %{"name" => "西营乡", "code" => "130111202"}
    ]

  def next(input) when input == "井陉县" or input == "130121",
    do: [
      %{"name" => "微水镇", "code" => "130121100"},
      %{"name" => "上安镇", "code" => "130121101"},
      %{"name" => "天长镇", "code" => "130121102"},
      %{"name" => "秀林镇", "code" => "130121103"},
      %{"name" => "南峪镇", "code" => "130121104"},
      %{"name" => "威州镇", "code" => "130121105"},
      %{"name" => "小作镇", "code" => "130121106"},
      %{"name" => "南障城镇", "code" => "130121107"},
      %{"name" => "苍岩山镇", "code" => "130121108"},
      %{"name" => "测鱼镇", "code" => "130121109"},
      %{"name" => "吴家窑乡", "code" => "130121200"},
      %{"name" => "北正乡", "code" => "130121201"},
      %{"name" => "于家乡", "code" => "130121202"},
      %{"name" => "孙庄乡", "code" => "130121203"},
      %{"name" => "南陉乡", "code" => "130121204"},
      %{"name" => "辛庄乡", "code" => "130121205"},
      %{"name" => "南王庄乡", "code" => "130121206"}
    ]

  def next(input) when input == "正定县" or input == "130123",
    do: [
      %{"name" => "诸福屯街道", "code" => "130123001"},
      %{"name" => "三里屯街道", "code" => "130123002"},
      %{"name" => "正定镇", "code" => "130123100"},
      %{"name" => "新城铺镇", "code" => "130123102"},
      %{"name" => "新安镇", "code" => "130123103"},
      %{"name" => "南岗镇", "code" => "130123104"},
      %{"name" => "曲阳桥镇", "code" => "130123105"},
      %{"name" => "南牛镇", "code" => "130123106"},
      %{"name" => "南楼乡", "code" => "130123201"},
      %{"name" => "西平乐乡", "code" => "130123202"}
    ]

  def next(input) when input == "行唐县" or input == "130125",
    do: [
      %{"name" => "龙州镇", "code" => "130125100"},
      %{"name" => "南桥镇", "code" => "130125101"},
      %{"name" => "上碑镇", "code" => "130125102"},
      %{"name" => "口头镇", "code" => "130125103"},
      %{"name" => "上方镇", "code" => "130125104"},
      %{"name" => "独羊岗乡", "code" => "130125200"},
      %{"name" => "安香乡", "code" => "130125201"},
      %{"name" => "只里乡", "code" => "130125202"},
      %{"name" => "市同乡", "code" => "130125203"},
      %{"name" => "翟营乡", "code" => "130125204"},
      %{"name" => "城寨乡", "code" => "130125205"},
      %{"name" => "玉亭乡", "code" => "130125207"},
      %{"name" => "北河乡", "code" => "130125208"},
      %{"name" => "上阎庄乡", "code" => "130125209"},
      %{"name" => "九口子乡", "code" => "130125210"},
      %{"name" => "河北行唐经济开发区", "code" => "130125400"}
    ]

  def next(input) when input == "灵寿县" or input == "130126",
    do: [
      %{"name" => "灵寿镇", "code" => "130126100"},
      %{"name" => "青同镇", "code" => "130126101"},
      %{"name" => "塔上镇", "code" => "130126102"},
      %{"name" => "陈庄镇", "code" => "130126103"},
      %{"name" => "慈峪镇", "code" => "130126104"},
      %{"name" => "岔头镇", "code" => "130126105"},
      %{"name" => "三圣院乡", "code" => "130126200"},
      %{"name" => "北洼乡", "code" => "130126201"},
      %{"name" => "牛城乡", "code" => "130126202"},
      %{"name" => "狗台乡", "code" => "130126203"},
      %{"name" => "南寨乡", "code" => "130126204"},
      %{"name" => "南燕川乡", "code" => "130126205"},
      %{"name" => "北谭庄乡", "code" => "130126206"},
      %{"name" => "寨头乡", "code" => "130126207"},
      %{"name" => "南营乡", "code" => "130126208"}
    ]

  def next(input) when input == "高邑县" or input == "130127",
    do: [
      %{"name" => "高邑镇", "code" => "130127100"},
      %{"name" => "大营镇", "code" => "130127101"},
      %{"name" => "富村镇", "code" => "130127102"},
      %{"name" => "万城镇", "code" => "130127103"},
      %{"name" => "中韩镇", "code" => "130127104"}
    ]

  def next(input) when input == "深泽县" or input == "130128",
    do: [
      %{"name" => "深泽镇", "code" => "130128100"},
      %{"name" => "铁杆镇", "code" => "130128101"},
      %{"name" => "赵八镇", "code" => "130128102"},
      %{"name" => "大桥头镇", "code" => "130128103"},
      %{"name" => "白庄乡", "code" => "130128200"},
      %{"name" => "留村乡", "code" => "130128201"}
    ]

  def next(input) when input == "赞皇县" or input == "130129",
    do: [
      %{"name" => "赞皇镇", "code" => "130129100"},
      %{"name" => "院头镇", "code" => "130129101"},
      %{"name" => "南邢郭镇", "code" => "130129102"},
      %{"name" => "嶂石岩镇", "code" => "130129103"},
      %{"name" => "西龙门镇", "code" => "130129104"},
      %{"name" => "西阳泽镇", "code" => "130129105"},
      %{"name" => "许亭镇", "code" => "130129106"},
      %{"name" => "南清河乡", "code" => "130129202"},
      %{"name" => "土门乡", "code" => "130129204"},
      %{"name" => "黄北坪乡", "code" => "130129205"},
      %{"name" => "张楞乡", "code" => "130129208"}
    ]

  def next(input) when input == "无极县" or input == "130130",
    do: [
      %{"name" => "无极镇", "code" => "130130100"},
      %{"name" => "七汲镇", "code" => "130130101"},
      %{"name" => "张段固镇", "code" => "130130102"},
      %{"name" => "北苏镇", "code" => "130130103"},
      %{"name" => "郭庄镇", "code" => "130130104"},
      %{"name" => "大陈镇", "code" => "130130105"},
      %{"name" => "东侯坊镇", "code" => "130130106"},
      %{"name" => "里城道镇", "code" => "130130107"},
      %{"name" => "高头回族乡", "code" => "130130200"},
      %{"name" => "郝庄乡", "code" => "130130201"},
      %{"name" => "南流乡", "code" => "130130204"}
    ]

  def next(input) when input == "平山县" or input == "130131",
    do: [
      %{"name" => "平山镇", "code" => "130131100"},
      %{"name" => "东回舍镇", "code" => "130131101"},
      %{"name" => "温塘镇", "code" => "130131102"},
      %{"name" => "南甸镇", "code" => "130131103"},
      %{"name" => "岗南镇", "code" => "130131104"},
      %{"name" => "古月镇", "code" => "130131105"},
      %{"name" => "下槐镇", "code" => "130131106"},
      %{"name" => "孟家庄镇", "code" => "130131107"},
      %{"name" => "小觉镇", "code" => "130131108"},
      %{"name" => "蛟潭庄镇", "code" => "130131109"},
      %{"name" => "西柏坡镇", "code" => "130131110"},
      %{"name" => "下口镇", "code" => "130131111"},
      %{"name" => "西大吾乡", "code" => "130131200"},
      %{"name" => "上三汲乡", "code" => "130131201"},
      %{"name" => "两河乡", "code" => "130131202"},
      %{"name" => "东王坡乡", "code" => "130131203"},
      %{"name" => "苏家庄乡", "code" => "130131204"},
      %{"name" => "宅北乡", "code" => "130131205"},
      %{"name" => "北冶乡", "code" => "130131207"},
      %{"name" => "上观音堂乡", "code" => "130131209"},
      %{"name" => "杨家桥乡", "code" => "130131210"},
      %{"name" => "营里乡", "code" => "130131211"},
      %{"name" => "合河口乡", "code" => "130131212"}
    ]

  def next(input) when input == "元氏县" or input == "130132",
    do: [
      %{"name" => "槐阳镇", "code" => "130132100"},
      %{"name" => "殷村镇", "code" => "130132101"},
      %{"name" => "南佐镇", "code" => "130132102"},
      %{"name" => "宋曹镇", "code" => "130132103"},
      %{"name" => "南因镇", "code" => "130132104"},
      %{"name" => "姬村镇", "code" => "130132105"},
      %{"name" => "北褚镇", "code" => "130132106"},
      %{"name" => "马村镇", "code" => "130132107"},
      %{"name" => "东张乡", "code" => "130132201"},
      %{"name" => "赵同乡", "code" => "130132202"},
      %{"name" => "苏村乡", "code" => "130132204"},
      %{"name" => "苏阳乡", "code" => "130132205"},
      %{"name" => "北正乡", "code" => "130132206"},
      %{"name" => "前仙乡", "code" => "130132207"},
      %{"name" => "黑水河乡", "code" => "130132208"}
    ]

  def next(input) when input == "赵县" or input == "130133",
    do: [
      %{"name" => "赵州镇", "code" => "130133100"},
      %{"name" => "范庄镇", "code" => "130133101"},
      %{"name" => "北王里镇", "code" => "130133102"},
      %{"name" => "新寨店镇", "code" => "130133103"},
      %{"name" => "韩村镇", "code" => "130133104"},
      %{"name" => "南柏舍镇", "code" => "130133105"},
      %{"name" => "沙河店镇", "code" => "130133106"},
      %{"name" => "王西章镇", "code" => "130133107"},
      %{"name" => "谢庄镇", "code" => "130133108"},
      %{"name" => "前大章乡", "code" => "130133200"},
      %{"name" => "高村乡", "code" => "130133202"}
    ]

  def next(input) when input == "石家庄高新技术产业开发区" or input == "130171",
    do: [
      %{"name" => "长江街道", "code" => "130171010"},
      %{"name" => "太行街道", "code" => "130171011"},
      %{"name" => "宋营镇", "code" => "130171100"},
      %{"name" => "郄马镇", "code" => "130171101"}
    ]

  def next(input) when input == "石家庄循环化工园区" or input == "130172",
    do: [%{"name" => "丘头镇", "code" => "130172100"}]

  def next(input) when input == "辛集市" or input == "130181",
    do: [
      %{"name" => "辛集镇", "code" => "130181100"},
      %{"name" => "旧城镇", "code" => "130181101"},
      %{"name" => "张古庄镇", "code" => "130181102"},
      %{"name" => "位伯镇", "code" => "130181103"},
      %{"name" => "新垒头镇", "code" => "130181104"},
      %{"name" => "新城镇", "code" => "130181105"},
      %{"name" => "南智邱镇", "code" => "130181106"},
      %{"name" => "王口镇", "code" => "130181107"},
      %{"name" => "天宫营乡", "code" => "130181200"},
      %{"name" => "前营乡", "code" => "130181201"},
      %{"name" => "马庄乡", "code" => "130181202"},
      %{"name" => "和睦井乡", "code" => "130181203"},
      %{"name" => "田家庄乡", "code" => "130181204"},
      %{"name" => "中里厢乡", "code" => "130181205"},
      %{"name" => "小辛庄乡", "code" => "130181206"},
      %{"name" => "辛集经济开发区", "code" => "130181500"}
    ]

  def next(input) when input == "晋州市" or input == "130183",
    do: [
      %{"name" => "晋州镇", "code" => "130183100"},
      %{"name" => "总十庄镇", "code" => "130183101"},
      %{"name" => "营里镇", "code" => "130183102"},
      %{"name" => "桃园镇", "code" => "130183103"},
      %{"name" => "东卓宿镇", "code" => "130183104"},
      %{"name" => "马于镇", "code" => "130183105"},
      %{"name" => "小樵镇", "code" => "130183106"},
      %{"name" => "槐树镇", "code" => "130183107"},
      %{"name" => "东里庄镇", "code" => "130183108"},
      %{"name" => "周家庄乡", "code" => "130183201"}
    ]

  def next(input) when input == "新乐市" or input == "130184",
    do: [
      %{"name" => "长寿街道", "code" => "130184001"},
      %{"name" => "化皮镇", "code" => "130184101"},
      %{"name" => "承安镇", "code" => "130184102"},
      %{"name" => "正莫镇", "code" => "130184103"},
      %{"name" => "南大岳镇", "code" => "130184104"},
      %{"name" => "杜固镇", "code" => "130184105"},
      %{"name" => "邯邰镇", "code" => "130184106"},
      %{"name" => "东王镇", "code" => "130184107"},
      %{"name" => "马头铺镇", "code" => "130184108"},
      %{"name" => "协神乡", "code" => "130184200"},
      %{"name" => "木村乡", "code" => "130184201"},
      %{"name" => "彭家庄回族乡", "code" => "130184202"}
    ]

  def next(_), do: nil
end