defmodule ChinaAdminDivisions.Gen.Lv3x.M13 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "深州市" or input == "131182",
    do: [
      %{"name" => "唐奉镇", "code" => "131182100000"},
      %{"name" => "深州镇", "code" => "131182101000"},
      %{"name" => "辰时镇", "code" => "131182102000"},
      %{"name" => "榆科镇", "code" => "131182103000"},
      %{"name" => "魏家桥镇", "code" => "131182104000"},
      %{"name" => "大堤镇", "code" => "131182105000"},
      %{"name" => "前磨头镇", "code" => "131182106000"},
      %{"name" => "王家井镇", "code" => "131182107000"},
      %{"name" => "护驾迟镇", "code" => "131182108000"},
      %{"name" => "大屯镇", "code" => "131182109000"},
      %{"name" => "高古庄镇", "code" => "131182110000"},
      %{"name" => "北溪村镇", "code" => "131182111000"},
      %{"name" => "大冯营镇", "code" => "131182112000"},
      %{"name" => "穆村镇", "code" => "131182113000"},
      %{"name" => "兵曹乡", "code" => "131182200000"},
      %{"name" => "东安庄乡", "code" => "131182202000"},
      %{"name" => "乔屯乡", "code" => "131182206000"},
      %{"name" => "深州监狱", "code" => "131182400000"},
      %{"name" => "城市新区", "code" => "131182401000"},
      %{"name" => "经济开发区", "code" => "131182403000"}
    ]

  def next(input) when input == "衡水滨湖新区" or input == "131172",
    do: [
      %{"name" => "魏家屯镇", "code" => "131172101000"},
      %{"name" => "彭杜村乡", "code" => "131172203000"},
      %{"name" => "滨湖新区教育园区", "code" => "131172401000"}
    ]

  def next(input) when input == "河北衡水高新技术产业开发区" or input == "131171",
    do: [
      %{"name" => "大麻森乡", "code" => "131171201000"},
      %{"name" => "高新技术产业开发区", "code" => "131171400000"},
      %{"name" => "新型功能材料产业园", "code" => "131171401000"},
      %{"name" => "苏正", "code" => "131171402000"}
    ]

  def next(input) when input == "阜城县" or input == "131128",
    do: [
      %{"name" => "阜城镇", "code" => "131128100000"},
      %{"name" => "古城镇", "code" => "131128101000"},
      %{"name" => "码头镇", "code" => "131128102000"},
      %{"name" => "霞口镇", "code" => "131128103000"},
      %{"name" => "崔家庙镇", "code" => "131128104000"},
      %{"name" => "漫河镇", "code" => "131128105000"},
      %{"name" => "建桥乡", "code" => "131128201000"},
      %{"name" => "蒋坊乡", "code" => "131128202000"},
      %{"name" => "大白乡", "code" => "131128203000"},
      %{"name" => "王集乡", "code" => "131128204000"}
    ]

  def next(input) when input == "景县" or input == "131127",
    do: [
      %{"name" => "景州镇", "code" => "131127100000"},
      %{"name" => "龙华镇", "code" => "131127101000"},
      %{"name" => "广川镇", "code" => "131127102000"},
      %{"name" => "王瞳镇", "code" => "131127103000"},
      %{"name" => "洚河流镇", "code" => "131127104000"},
      %{"name" => "安陵镇", "code" => "131127105000"},
      %{"name" => "杜桥镇", "code" => "131127106000"},
      %{"name" => "王谦寺镇", "code" => "131127107000"},
      %{"name" => "北留智镇", "code" => "131127108000"},
      %{"name" => "留智庙镇", "code" => "131127109000"},
      %{"name" => "梁集镇", "code" => "131127110000"},
      %{"name" => "温城镇", "code" => "131127111000"},
      %{"name" => "青兰镇", "code" => "131127112000"},
      %{"name" => "刘集乡", "code" => "131127200000"},
      %{"name" => "连镇乡", "code" => "131127201000"},
      %{"name" => "后留名府乡", "code" => "131127204000"}
    ]

  def next(input) when input == "故城县" or input == "131126",
    do: [
      %{"name" => "郑口镇", "code" => "131126100000"},
      %{"name" => "夏庄镇", "code" => "131126101000"},
      %{"name" => "青罕镇", "code" => "131126102000"},
      %{"name" => "故城镇", "code" => "131126103000"},
      %{"name" => "武官寨镇", "code" => "131126104000"},
      %{"name" => "饶阳店镇", "code" => "131126105000"},
      %{"name" => "军屯镇", "code" => "131126106000"},
      %{"name" => "建国镇", "code" => "131126107000"},
      %{"name" => "西半屯镇", "code" => "131126108000"},
      %{"name" => "房庄镇", "code" => "131126109000"},
      %{"name" => "三朗镇", "code" => "131126110000"},
      %{"name" => "辛庄乡", "code" => "131126200000"},
      %{"name" => "里老乡", "code" => "131126201000"}
    ]

  def next(input) when input == "安平县" or input == "131125",
    do: [
      %{"name" => "安平镇", "code" => "131125100000"},
      %{"name" => "马店镇", "code" => "131125101000"},
      %{"name" => "南王庄镇", "code" => "131125102000"},
      %{"name" => "大子文镇", "code" => "131125103000"},
      %{"name" => "东黄城镇", "code" => "131125104000"},
      %{"name" => "大何庄乡", "code" => "131125200000"},
      %{"name" => "程油子乡", "code" => "131125201000"},
      %{"name" => "西两洼乡", "code" => "131125202000"},
      %{"name" => "高新技术产业开发区", "code" => "131125400000"},
      %{"name" => "社区建设办公室", "code" => "131125401000"}
    ]

  def next(input) when input == "饶阳县" or input == "131124",
    do: [
      %{"name" => "饶阳镇", "code" => "131124100000"},
      %{"name" => "大尹村镇", "code" => "131124101000"},
      %{"name" => "五公镇", "code" => "131124102000"},
      %{"name" => "大官亭镇", "code" => "131124103000"},
      %{"name" => "王同岳镇", "code" => "131124104000"},
      %{"name" => "东里满镇", "code" => "131124105000"},
      %{"name" => "留楚镇", "code" => "131124106000"}
    ]

  def next(input) when input == "武强县" or input == "131123",
    do: [
      %{"name" => "武强镇", "code" => "131123100000"},
      %{"name" => "街关镇", "code" => "131123101000"},
      %{"name" => "周窝镇", "code" => "131123102000"},
      %{"name" => "东孙庄镇", "code" => "131123103000"},
      %{"name" => "豆村镇", "code" => "131123104000"},
      %{"name" => "北代镇", "code" => "131123105000"}
    ]

  def next(input) when input == "武邑县" or input == "131122",
    do: [
      %{"name" => "武邑镇", "code" => "131122100000"},
      %{"name" => "清凉店镇", "code" => "131122101000"},
      %{"name" => "审坡镇", "code" => "131122102000"},
      %{"name" => "赵桥镇", "code" => "131122103000"},
      %{"name" => "韩庄镇", "code" => "131122104000"},
      %{"name" => "肖桥头镇", "code" => "131122105000"},
      %{"name" => "龙店镇", "code" => "131122106000"},
      %{"name" => "圈头乡", "code" => "131122201000"},
      %{"name" => "大紫塔乡", "code" => "131122203000"}
    ]

  def next(input) when input == "枣强县" or input == "131121",
    do: [
      %{"name" => "枣强镇", "code" => "131121100000"},
      %{"name" => "恩察镇", "code" => "131121101000"},
      %{"name" => "大营镇", "code" => "131121102000"},
      %{"name" => "嘉会镇", "code" => "131121103000"},
      %{"name" => "马屯镇", "code" => "131121104000"},
      %{"name" => "肖张镇", "code" => "131121105000"},
      %{"name" => "张秀屯镇", "code" => "131121106000"},
      %{"name" => "新屯镇", "code" => "131121107000"},
      %{"name" => "唐林镇", "code" => "131121108000"},
      %{"name" => "王均乡", "code" => "131121202000"},
      %{"name" => "王常乡", "code" => "131121204000"}
    ]

  def next(input) when input == "冀州区" or input == "131103",
    do: [
      %{"name" => "冀州镇", "code" => "131103100000"},
      %{"name" => "官道李镇", "code" => "131103102000"},
      %{"name" => "南午村镇", "code" => "131103103000"},
      %{"name" => "周村镇", "code" => "131103104000"},
      %{"name" => "码头李镇", "code" => "131103105000"},
      %{"name" => "西王镇", "code" => "131103106000"},
      %{"name" => "门家庄乡", "code" => "131103200000"},
      %{"name" => "徐家庄乡", "code" => "131103201000"},
      %{"name" => "北漳淮乡", "code" => "131103202000"},
      %{"name" => "小寨乡", "code" => "131103203000"},
      %{"name" => "社区建设办公室", "code" => "131103400000"},
      %{"name" => "河北冀州高新技术产业开发区", "code" => "131103401000"}
    ]

  def next(input) when input == "桃城区" or input == "131102",
    do: [
      %{"name" => "河西街道", "code" => "131102001000"},
      %{"name" => "河东街道", "code" => "131102002000"},
      %{"name" => "路北街道", "code" => "131102003000"},
      %{"name" => "中华大街街道", "code" => "131102004000"},
      %{"name" => "郑家河沿镇", "code" => "131102100000"},
      %{"name" => "赵家圈镇", "code" => "131102101000"},
      %{"name" => "邓庄镇", "code" => "131102102000"},
      %{"name" => "何家庄乡", "code" => "131102200000"}
    ]

  def next(input) when input == "三河市" or input == "131082",
    do: [
      %{"name" => "鼎盛东街道", "code" => "131082001000"},
      %{"name" => "泃阳西街道", "code" => "131082002000"},
      %{"name" => "行宫东街道", "code" => "131082003000"},
      %{"name" => "迎宾北路街道", "code" => "131082004000"},
      %{"name" => "燕顺路街道", "code" => "131082005000"},
      %{"name" => "康城街道", "code" => "131082006000"},
      %{"name" => "泃阳镇", "code" => "131082100000"},
      %{"name" => "李旗庄镇", "code" => "131082101000"},
      %{"name" => "杨庄镇", "code" => "131082102000"},
      %{"name" => "皇庄镇", "code" => "131082103000"},
      %{"name" => "新集镇", "code" => "131082104000"},
      %{"name" => "段甲岭镇", "code" => "131082105000"},
      %{"name" => "黄土庄镇", "code" => "131082106000"},
      %{"name" => "高楼镇", "code" => "131082107000"},
      %{"name" => "齐心庄镇", "code" => "131082108000"},
      %{"name" => "燕郊镇", "code" => "131082109000"},
      %{"name" => "燕郊高新技术产业开发区", "code" => "131082450000"},
      %{"name" => "河北三河国家农业科技园区", "code" => "131082451000"}
    ]

  def next(input) when input == "霸州市" or input == "131081",
    do: [
      %{"name" => "裕华街道", "code" => "131081001000"},
      %{"name" => "霸州镇", "code" => "131081100000"},
      %{"name" => "南孟镇", "code" => "131081101000"},
      %{"name" => "信安镇", "code" => "131081102000"},
      %{"name" => "堂二里镇", "code" => "131081103000"},
      %{"name" => "煎茶铺镇", "code" => "131081104000"},
      %{"name" => "胜芳镇", "code" => "131081105000"},
      %{"name" => "杨芬港镇", "code" => "131081106000"},
      %{"name" => "康仙庄镇", "code" => "131081107000"},
      %{"name" => "王庄子镇", "code" => "131081108000"},
      %{"name" => "岔河集乡", "code" => "131081200000"},
      %{"name" => "东杨庄乡", "code" => "131081202000"},
      %{"name" => "东段乡", "code" => "131081204000"}
    ]

  def next(input) when input == "廊坊经济技术开发区" or input == "131071",
    do: [
      %{"name" => "耀华道街道", "code" => "131071450000"},
      %{"name" => "云鹏道街道", "code" => "131071451000"}
    ]

  def next(input) when input == "大厂回族自治县" or input == "131028",
    do: [
      %{"name" => "北辰街道", "code" => "131028001000"},
      %{"name" => "大厂镇", "code" => "131028100000"},
      %{"name" => "夏垫镇", "code" => "131028101000"},
      %{"name" => "祁各庄镇", "code" => "131028102000"},
      %{"name" => "邵府镇", "code" => "131028103000"},
      %{"name" => "陈府镇", "code" => "131028104000"},
      %{"name" => "河北大厂高新技术产业开发区", "code" => "131028400000"}
    ]

  def next(input) when input == "文安县" or input == "131026",
    do: [
      %{"name" => "文安镇", "code" => "131026100000"},
      %{"name" => "新镇镇", "code" => "131026101000"},
      %{"name" => "苏桥镇", "code" => "131026102000"},
      %{"name" => "大柳河镇", "code" => "131026103000"},
      %{"name" => "左各庄镇", "code" => "131026104000"},
      %{"name" => "滩里镇", "code" => "131026105000"},
      %{"name" => "史各庄镇", "code" => "131026106000"},
      %{"name" => "赵各庄镇", "code" => "131026107000"},
      %{"name" => "兴隆宫镇", "code" => "131026108000"},
      %{"name" => "大留镇镇", "code" => "131026109000"},
      %{"name" => "孙氏镇", "code" => "131026110000"},
      %{"name" => "德归镇", "code" => "131026111000"},
      %{"name" => "大围河回族满族乡", "code" => "131026200000"}
    ]

  def next(input) when input == "大城县" or input == "131025",
    do: [
      %{"name" => "平舒镇", "code" => "131025100000"},
      %{"name" => "旺村镇", "code" => "131025101000"},
      %{"name" => "大尚屯镇", "code" => "131025102000"},
      %{"name" => "南赵扶镇", "code" => "131025103000"},
      %{"name" => "留各庄镇", "code" => "131025104000"},
      %{"name" => "权村镇", "code" => "131025105000"},
      %{"name" => "里坦镇", "code" => "131025106000"},
      %{"name" => "广安镇", "code" => "131025107000"},
      %{"name" => "北魏镇", "code" => "131025108000"},
      %{"name" => "臧屯镇", "code" => "131025109000"},
      %{"name" => "河北大城经济开发区", "code" => "131025400000"}
    ]

  def next(input) when input == "香河县" or input == "131024",
    do: [
      %{"name" => "淑阳镇", "code" => "131024100000"},
      %{"name" => "蒋辛屯镇", "code" => "131024101000"},
      %{"name" => "渠口镇", "code" => "131024102000"},
      %{"name" => "安头屯镇", "code" => "131024103000"},
      %{"name" => "安平镇", "code" => "131024104000"},
      %{"name" => "刘宋镇", "code" => "131024105000"},
      %{"name" => "五百户镇", "code" => "131024106000"},
      %{"name" => "钱旺镇", "code" => "131024107000"},
      %{"name" => "钳屯镇", "code" => "131024108000"},
      %{"name" => "河北香河经济开发区", "code" => "131024500000"},
      %{"name" => "香河新兴产业示范区", "code" => "131024501000"}
    ]

  def next(input) when input == "永清县" or input == "131023",
    do: [
      %{"name" => "城区街道", "code" => "131023001000"},
      %{"name" => "永清镇", "code" => "131023100000"},
      %{"name" => "韩村镇", "code" => "131023101000"},
      %{"name" => "后奕镇", "code" => "131023102000"},
      %{"name" => "别古庄镇", "code" => "131023103000"},
      %{"name" => "里澜城镇", "code" => "131023104000"},
      %{"name" => "管家务回族乡", "code" => "131023200000"},
      %{"name" => "曹家务乡", "code" => "131023201000"},
      %{"name" => "龙虎庄乡", "code" => "131023202000"},
      %{"name" => "刘街乡", "code" => "131023203000"},
      %{"name" => "三圣口乡", "code" => "131023204000"},
      %{"name" => "河北永清经济开发区", "code" => "131023400000"},
      %{"name" => "北京亦庄永清高新技术产业开发区", "code" => "131023401000"}
    ]

  def next(input) when input == "固安县" or input == "131022",
    do: [
      %{"name" => "固安镇", "code" => "131022100000"},
      %{"name" => "宫村镇", "code" => "131022101000"},
      %{"name" => "柳泉镇", "code" => "131022102000"},
      %{"name" => "牛驼镇", "code" => "131022103000"},
      %{"name" => "马庄镇", "code" => "131022104000"},
      %{"name" => "东湾镇", "code" => "131022105000"},
      %{"name" => "渠沟镇", "code" => "131022106000"},
      %{"name" => "彭村乡", "code" => "131022201000"},
      %{"name" => "礼让店乡", "code" => "131022203000"},
      %{"name" => "固安温泉休闲商务产业园区", "code" => "131022400000"}
    ]

  def next(input) when input == "广阳区" or input == "131003",
    do: [
      %{"name" => "银河北路街道", "code" => "131003001000"},
      %{"name" => "爱民东道街道", "code" => "131003002000"},
      %{"name" => "解放道街道", "code" => "131003003000"},
      %{"name" => "新开路街道", "code" => "131003004000"},
      %{"name" => "新源道街道", "code" => "131003005000"},
      %{"name" => "南尖塔镇", "code" => "131003100000"},
      %{"name" => "万庄镇", "code" => "131003101000"},
      %{"name" => "九州镇", "code" => "131003102000"},
      %{"name" => "北旺镇", "code" => "131003103000"},
      %{"name" => "河北廊坊广阳经济开发区", "code" => "131003400000"}
    ]

  def next(input) when input == "安次区" or input == "131002",
    do: [
      %{"name" => "银河南路街道", "code" => "131002001000"},
      %{"name" => "光明西道街道", "code" => "131002002000"},
      %{"name" => "永华道街道", "code" => "131002003000"},
      %{"name" => "落垡镇", "code" => "131002100000"},
      %{"name" => "码头镇", "code" => "131002101000"},
      %{"name" => "葛渔城镇", "code" => "131002102000"},
      %{"name" => "东沽港镇", "code" => "131002103000"},
      %{"name" => "调河头镇", "code" => "131002104000"},
      %{"name" => "北史家务镇", "code" => "131002105000"},
      %{"name" => "杨税务镇", "code" => "131002106000"},
      %{"name" => "仇庄镇", "code" => "131002107000"},
      %{"name" => "廊坊龙河高新技术产业开发区", "code" => "131002400000"},
      %{"name" => "河北廊坊高新技术产业开发区", "code" => "131002401000"},
      %{"name" => "河北廊坊龙港经济开发区", "code" => "131002402000"},
      %{"name" => "河北安次经济开发区", "code" => "131002403000"}
    ]

  def next(input) when input == "河间市" or input == "130984",
    do: [
      %{"name" => "瀛州路街道", "code" => "130984001000"},
      %{"name" => "城垣西路街道", "code" => "130984002000"},
      %{"name" => "米各庄镇", "code" => "130984101000"},
      %{"name" => "景和镇", "code" => "130984102000"},
      %{"name" => "卧佛堂镇", "code" => "130984103000"},
      %{"name" => "束城镇", "code" => "130984104000"},
      %{"name" => "留古寺镇", "code" => "130984105000"},
      %{"name" => "沙河桥镇", "code" => "130984106000"},
      %{"name" => "诗经村镇", "code" => "130984107000"},
      %{"name" => "尊祖庄镇", "code" => "130984108000"},
      %{"name" => "兴村镇", "code" => "130984109000"},
      %{"name" => "行别营镇", "code" => "130984110000"},
      %{"name" => "故仙镇", "code" => "130984111000"},
      %{"name" => "黎民居乡", "code" => "130984201000"},
      %{"name" => "沙洼乡", "code" => "130984203000"},
      %{"name" => "西九吉乡", "code" => "130984204000"},
      %{"name" => "北石槽乡", "code" => "130984205000"},
      %{"name" => "时村乡", "code" => "130984209000"},
      %{"name" => "龙华店乡", "code" => "130984212000"},
      %{"name" => "果子洼回族乡", "code" => "130984213000"},
      %{"name" => "河北河间经济开发区", "code" => "130984403000"}
    ]

  def next(input) when input == "黄骅市" or input == "130983",
    do: [
      %{"name" => "骅东街道", "code" => "130983001000"},
      %{"name" => "骅中街道", "code" => "130983002000"},
      %{"name" => "骅西街道", "code" => "130983003000"},
      %{"name" => "黄骅镇", "code" => "130983100000"},
      %{"name" => "南排河镇", "code" => "130983101000"},
      %{"name" => "吕桥镇", "code" => "130983102000"},
      %{"name" => "旧城镇", "code" => "130983103000"},
      %{"name" => "齐家务镇", "code" => "130983104000"},
      %{"name" => "滕庄子镇", "code" => "130983105000"},
      %{"name" => "常郭镇", "code" => "130983106000"},
      %{"name" => "羊二庄镇", "code" => "130983107000"},
      %{"name" => "官庄乡", "code" => "130983204000"},
      %{"name" => "羊三木回族乡", "code" => "130983207000"},
      %{"name" => "黄骅经济技术开发区", "code" => "130983404000"}
    ]

  def next(input) when input == "任丘市" or input == "130982",
    do: [
      %{"name" => "新华路街道", "code" => "130982001000"},
      %{"name" => "西环路街道", "code" => "130982002000"},
      %{"name" => "永丰路街道", "code" => "130982003000"},
      %{"name" => "中华路街道", "code" => "130982004000"},
      %{"name" => "渤海路街道", "code" => "130982005000"},
      %{"name" => "油建路街道", "code" => "130982006000"},
      %{"name" => "会战道街道", "code" => "130982007000"},
      %{"name" => "出岸镇", "code" => "130982100000"},
      %{"name" => "石门桥镇", "code" => "130982101000"},
      %{"name" => "吕公堡镇", "code" => "130982102000"},
      %{"name" => "长丰镇", "code" => "130982103000"},
      %{"name" => "梁召镇", "code" => "130982106000"},
      %{"name" => "辛中驿镇", "code" => "130982107000"},
      %{"name" => "麻家坞镇", "code" => "130982108000"},
      %{"name" => "北辛庄镇", "code" => "130982109000"},
      %{"name" => "议论堡镇", "code" => "130982110000"},
      %{"name" => "于村镇", "code" => "130982111000"},
      %{"name" => "青塔乡", "code" => "130982204000"},
      %{"name" => "北汉乡", "code" => "130982207000"},
      %{"name" => "华北石油管理局", "code" => "130982400000"},
      %{"name" => "河北任丘经济开发区", "code" => "130982500000"}
    ]

  def next(input) when input == "泊头市" or input == "130981",
    do: [
      %{"name" => "解放街道", "code" => "130981001000"},
      %{"name" => "河东街道", "code" => "130981002000"},
      %{"name" => "鼓楼街道", "code" => "130981003000"},
      %{"name" => "泊镇", "code" => "130981100000"},
      %{"name" => "交河镇", "code" => "130981101000"},
      %{"name" => "齐桥镇", "code" => "130981102000"},
      %{"name" => "寺门村镇", "code" => "130981103000"},
      %{"name" => "郝村镇", "code" => "130981104000"},
      %{"name" => "富镇镇", "code" => "130981105000"},
      %{"name" => "文庙镇", "code" => "130981106000"},
      %{"name" => "洼里王镇", "code" => "130981107000"},
      %{"name" => "四营镇", "code" => "130981108000"},
      %{"name" => "王武庄乡", "code" => "130981201000"},
      %{"name" => "营子乡", "code" => "130981202000"},
      %{"name" => "西辛店乡", "code" => "130981204000"},
      %{"name" => "河北泊头经济开发区", "code" => "130981400000"}
    ]

  def next(input) when input == "沧州渤海新区" or input == "130973",
    do: [
      %{"name" => "新村回族乡", "code" => "130973206000"},
      %{"name" => "南大港管理区", "code" => "130973400000"},
      %{"name" => "国营中捷农场", "code" => "130973401000"},
      %{"name" => "港城街道", "code" => "130973402000"},
      %{"name" => "临港化工园区", "code" => "130973403000"}
    ]

  def next(input) when input == "沧州高新技术产业开发区" or input == "130972",
    do: [%{"name" => "社会发展局", "code" => "130972401000"}]

  def next(input) when input == "河北沧州经济开发区" or input == "130971",
    do: [%{"name" => "社会事务局", "code" => "130971401000"}]

  def next(input) when input == "孟村回族自治县" or input == "130930",
    do: [
      %{"name" => "孟村镇", "code" => "130930100000"},
      %{"name" => "新县镇", "code" => "130930101000"},
      %{"name" => "辛店镇", "code" => "130930102000"},
      %{"name" => "高寨镇", "code" => "130930103000"},
      %{"name" => "宋庄子乡", "code" => "130930200000"},
      %{"name" => "牛进庄乡", "code" => "130930201000"}
    ]

  def next(input) when input == "献县" or input == "130929",
    do: [
      %{"name" => "乐寿镇", "code" => "130929100000"},
      %{"name" => "淮镇镇", "code" => "130929101000"},
      %{"name" => "郭庄镇", "code" => "130929102000"},
      %{"name" => "河城街镇", "code" => "130929103000"},
      %{"name" => "韩村镇", "code" => "130929104000"},
      %{"name" => "陌南镇", "code" => "130929105000"},
      %{"name" => "陈庄镇", "code" => "130929106000"},
      %{"name" => "段村镇", "code" => "130929107000"},
      %{"name" => "高官镇", "code" => "130929108000"},
      %{"name" => "十五级镇", "code" => "130929109000"},
      %{"name" => "商林乡", "code" => "130929206000"},
      %{"name" => "张村乡", "code" => "130929209000"},
      %{"name" => "临河乡", "code" => "130929210000"},
      %{"name" => "小平王乡", "code" => "130929211000"},
      %{"name" => "垒头乡", "code" => "130929213000"},
      %{"name" => "南河头乡", "code" => "130929214000"},
      %{"name" => "西城乡", "code" => "130929215000"},
      %{"name" => "本斋回族乡", "code" => "130929216000"},
      %{"name" => "梅庄洼农场", "code" => "130929400000"},
      %{"name" => "献县经济开发区", "code" => "130929401000"}
    ]

  def next(input) when input == "吴桥县" or input == "130928",
    do: [
      %{"name" => "桑园镇", "code" => "130928100000"},
      %{"name" => "铁城镇", "code" => "130928101000"},
      %{"name" => "于集镇", "code" => "130928102000"},
      %{"name" => "梁集镇", "code" => "130928103000"},
      %{"name" => "安陵镇", "code" => "130928104000"},
      %{"name" => "曹家洼乡", "code" => "130928200000"},
      %{"name" => "东宋门乡", "code" => "130928201000"},
      %{"name" => "杨家寺乡", "code" => "130928202000"},
      %{"name" => "沟店铺乡", "code" => "130928203000"},
      %{"name" => "何庄乡", "code" => "130928204000"},
      %{"name" => "吴桥经济技术开发区", "code" => "130928400000"}
    ]

  def next(input) when input == "南皮县" or input == "130927",
    do: [
      %{"name" => "南皮镇", "code" => "130927100000"},
      %{"name" => "冯家口镇", "code" => "130927101000"},
      %{"name" => "寨子镇", "code" => "130927102000"},
      %{"name" => "鲍官屯镇", "code" => "130927103000"},
      %{"name" => "王寺镇", "code" => "130927104000"},
      %{"name" => "乌马营镇", "code" => "130927105000"},
      %{"name" => "潞灌镇", "code" => "130927106000"},
      %{"name" => "刘八里镇", "code" => "130927107000"},
      %{"name" => "大浪淀乡", "code" => "130927200000"}
    ]

  def next(input) when input == "肃宁县" or input == "130926",
    do: [
      %{"name" => "肃宁镇", "code" => "130926100000"},
      %{"name" => "梁家村镇", "code" => "130926101000"},
      %{"name" => "窝北镇", "code" => "130926102000"},
      %{"name" => "尚村镇", "code" => "130926103000"},
      %{"name" => "万里镇", "code" => "130926104000"},
      %{"name" => "师素镇", "code" => "130926105000"},
      %{"name" => "河北留善寺镇", "code" => "130926106000"},
      %{"name" => "付家佐镇", "code" => "130926107000"},
      %{"name" => "邵庄乡", "code" => "130926205000"}
    ]

  def next(input) when input == "盐山县" or input == "130925",
    do: [
      %{"name" => "盐山镇", "code" => "130925100000"},
      %{"name" => "望树镇", "code" => "130925101000"},
      %{"name" => "庆云镇", "code" => "130925102000"},
      %{"name" => "韩集镇", "code" => "130925103000"},
      %{"name" => "千童镇", "code" => "130925104000"},
      %{"name" => "圣佛镇", "code" => "130925105000"},
      %{"name" => "边务镇", "code" => "130925106000"},
      %{"name" => "小庄镇", "code" => "130925107000"},
      %{"name" => "杨集镇", "code" => "130925108000"},
      %{"name" => "孟店镇", "code" => "130925109000"},
      %{"name" => "小营乡", "code" => "130925201000"},
      %{"name" => "常庄乡", "code" => "130925204000"}
    ]

  def next(input) when input == "海兴县" or input == "130924",
    do: [
      %{"name" => "苏基镇", "code" => "130924100000"},
      %{"name" => "辛集镇", "code" => "130924101000"},
      %{"name" => "高湾镇", "code" => "130924102000"},
      %{"name" => "赵毛陶镇", "code" => "130924103000"},
      %{"name" => "张会亭镇", "code" => "130924104000"},
      %{"name" => "香坊乡", "code" => "130924201000"},
      %{"name" => "小山乡", "code" => "130924202000"},
      %{"name" => "海兴县农场", "code" => "130924400000"},
      %{"name" => "青先农场", "code" => "130924401000"},
      %{"name" => "青锋农场", "code" => "130924402000"}
    ]

  def next(input) when input == "东光县" or input == "130923",
    do: [
      %{"name" => "东光镇", "code" => "130923100000"},
      %{"name" => "连镇镇", "code" => "130923101000"},
      %{"name" => "找王镇", "code" => "130923102000"},
      %{"name" => "秦村镇", "code" => "130923103000"},
      %{"name" => "灯明寺镇", "code" => "130923104000"},
      %{"name" => "南霞口镇", "code" => "130923105000"},
      %{"name" => "大单镇", "code" => "130923106000"},
      %{"name" => "龙王李镇", "code" => "130923107000"},
      %{"name" => "于桥镇", "code" => "130923108000"}
    ]

  def next(input) when input == "青县" or input == "130922",
    do: [
      %{"name" => "清州镇", "code" => "130922100000"},
      %{"name" => "金牛镇", "code" => "130922101000"},
      %{"name" => "新兴镇", "code" => "130922102000"},
      %{"name" => "流河镇", "code" => "130922103000"},
      %{"name" => "木门店镇", "code" => "130922104000"},
      %{"name" => "马厂镇", "code" => "130922105000"},
      %{"name" => "盘古镇", "code" => "130922106000"},
      %{"name" => "曹寺镇", "code" => "130922107000"},
      %{"name" => "上伍乡", "code" => "130922200000"},
      %{"name" => "陈嘴乡", "code" => "130922203000"},
      %{"name" => "青县农场", "code" => "130922400000"}
    ]

  def next(input) when input == "沧县" or input == "130921",
    do: [
      %{"name" => "旧州镇", "code" => "130921100000"},
      %{"name" => "兴济镇", "code" => "130921101000"},
      %{"name" => "杜生镇", "code" => "130921102000"},
      %{"name" => "崔尔庄镇", "code" => "130921103000"},
      %{"name" => "李天木镇", "code" => "130921104000"},
      %{"name" => "纸房头镇", "code" => "130921105000"},
      %{"name" => "姚官屯镇", "code" => "130921106000"},
      %{"name" => "杜林镇", "code" => "130921107000"},
      %{"name" => "汪家铺镇", "code" => "130921108000"},
      %{"name" => "张官屯镇", "code" => "130921109000"},
      %{"name" => "薛官屯乡", "code" => "130921200000"},
      %{"name" => "捷地回族乡", "code" => "130921201000"},
      %{"name" => "风化店乡", "code" => "130921204000"},
      %{"name" => "刘家庙乡", "code" => "130921208000"},
      %{"name" => "仵龙堂乡", "code" => "130921209000"},
      %{"name" => "大官厅乡", "code" => "130921210000"},
      %{"name" => "高川乡", "code" => "130921211000"},
      %{"name" => "黄递铺乡", "code" => "130921212000"},
      %{"name" => "大褚村回族乡", "code" => "130921213000"}
    ]

  def next(input) when input == "运河区" or input == "130903",
    do: [
      %{"name" => "水月寺街街道", "code" => "130903001000"},
      %{"name" => "南环中路街道", "code" => "130903002000"},
      %{"name" => "南湖街道", "code" => "130903003000"},
      %{"name" => "市场街道", "code" => "130903004000"},
      %{"name" => "西环中街街道", "code" => "130903005000"},
      %{"name" => "公园街道", "code" => "130903006000"},
      %{"name" => "小王庄镇", "code" => "130903100000"},
      %{"name" => "南陈屯镇", "code" => "130903101000"}
    ]

  def next(input) when input == "新华区" or input == "130902",
    do: [
      %{"name" => "建设北街街道", "code" => "130902001000"},
      %{"name" => "车站街道", "code" => "130902002000"},
      %{"name" => "南大街街道", "code" => "130902003000"},
      %{"name" => "东环中街街道", "code" => "130902004000"},
      %{"name" => "道东街道", "code" => "130902005000"},
      %{"name" => "小赵庄乡", "code" => "130902200000"}
    ]

  def next(input) when input == "平泉市" or input == "130881",
    do: [
      %{"name" => "平泉镇", "code" => "130881100000"},
      %{"name" => "黄土梁子镇", "code" => "130881101000"},
      %{"name" => "榆树林子镇", "code" => "130881102000"},
      %{"name" => "杨树岭镇", "code" => "130881103000"},
      %{"name" => "七沟镇", "code" => "130881104000"},
      %{"name" => "小寺沟镇", "code" => "130881105000"},
      %{"name" => "党坝镇", "code" => "130881106000"},
      %{"name" => "卧龙镇", "code" => "130881107000"},
      %{"name" => "南五十家子镇", "code" => "130881108000"},
      %{"name" => "北五十家子镇", "code" => "130881109000"},
      %{"name" => "桲椤树镇", "code" => "130881110000"},
      %{"name" => "柳溪镇", "code" => "130881111000"},
      %{"name" => "平北镇", "code" => "130881112000"},
      %{"name" => "青河镇", "code" => "130881113000"},
      %{"name" => "台头山镇", "code" => "130881114000"},
      %{"name" => "王土房乡", "code" => "130881200000"},
      %{"name" => "七家岱满族乡", "code" => "130881203000"},
      %{"name" => "茅兰沟满族蒙古族乡", "code" => "130881206000"},
      %{"name" => "道虎沟乡", "code" => "130881210000"}
    ]

  def next(input) when input == "承德高新技术产业开发区" or input == "130871",
    do: [
      %{"name" => "冯营子镇", "code" => "130871104000"},
      %{"name" => "上板城镇", "code" => "130871106000"}
    ]

  def next(input) when input == "围场满族蒙古族自治县" or input == "130828",
    do: [
      %{"name" => "围场镇", "code" => "130828100000"},
      %{"name" => "四合永镇", "code" => "130828101000"},
      %{"name" => "克勒沟镇", "code" => "130828102000"},
      %{"name" => "棋盘山镇", "code" => "130828103000"},
      %{"name" => "半截塔镇", "code" => "130828104000"},
      %{"name" => "朝阳地镇", "code" => "130828105000"},
      %{"name" => "朝阳湾镇", "code" => "130828106000"},
      %{"name" => "腰站镇", "code" => "130828107000"},
      %{"name" => "龙头山镇", "code" => "130828108000"},
      %{"name" => "新拨镇", "code" => "130828109000"},
      %{"name" => "御道口镇", "code" => "130828110000"},
      %{"name" => "城子镇", "code" => "130828111000"},
      %{"name" => "新地镇", "code" => "130828112000"},
      %{"name" => "哈里哈镇", "code" => "130828113000"},
      %{"name" => "道坝子乡", "code" => "130828200000"},
      %{"name" => "黄土坎乡", "code" => "130828203000"},
      %{"name" => "四道沟乡", "code" => "130828204000"},
      %{"name" => "兰旗卡伦乡", "code" => "130828205000"},
      %{"name" => "银窝沟乡", "code" => "130828206000"},
      %{"name" => "广发永乡", "code" => "130828208000"},
      %{"name" => "育太和乡", "code" => "130828209000"},
      %{"name" => "郭家湾乡", "code" => "130828210000"},
      %{"name" => "杨家湾乡", "code" => "130828211000"},
      %{"name" => "大唤起乡", "code" => "130828212000"},
      %{"name" => "张家湾乡", "code" => "130828215000"},
      %{"name" => "宝元栈乡", "code" => "130828216000"},
      %{"name" => "山湾子乡", "code" => "130828217000"},
      %{"name" => "三义永乡", "code" => "130828218000"},
      %{"name" => "姜家店乡", "code" => "130828219000"},
      %{"name" => "下伙房乡", "code" => "130828220000"},
      %{"name" => "燕格柏乡", "code" => "130828221000"},
      %{"name" => "牌楼乡", "code" => "130828222000"},
      %{"name" => "老窝铺乡", "code" => "130828224000"},
      %{"name" => "石桌子乡", "code" => "130828226000"},
      %{"name" => "大头山乡", "code" => "130828227000"},
      %{"name" => "南山嘴乡", "code" => "130828228000"},
      %{"name" => "西龙头乡", "code" => "130828229000"},
      %{"name" => "塞罕坝机械林场", "code" => "130828450000"},
      %{"name" => "国营御道口牧场", "code" => "130828500000"}
    ]

  def next(input) when input == "宽城满族自治县" or input == "130827",
    do: [
      %{"name" => "宽城镇", "code" => "130827100000"},
      %{"name" => "龙须门镇", "code" => "130827101000"},
      %{"name" => "峪耳崖镇", "code" => "130827102000"},
      %{"name" => "板城镇", "code" => "130827103000"},
      %{"name" => "汤道河镇", "code" => "130827104000"},
      %{"name" => "桲罗台镇", "code" => "130827105000"},
      %{"name" => "碾子峪镇", "code" => "130827106000"},
      %{"name" => "亮甲台镇", "code" => "130827107000"},
      %{"name" => "化皮溜子镇", "code" => "130827108000"},
      %{"name" => "松岭镇", "code" => "130827109000"},
      %{"name" => "塌山乡", "code" => "130827201000"},
      %{"name" => "孟子岭乡", "code" => "130827203000"},
      %{"name" => "独石沟乡", "code" => "130827204000"},
      %{"name" => "铧尖乡", "code" => "130827207000"},
      %{"name" => "东黄花川乡", "code" => "130827208000"},
      %{"name" => "苇子沟乡", "code" => "130827210000"},
      %{"name" => "大字沟门乡", "code" => "130827211000"},
      %{"name" => "大石柱子乡", "code" => "130827212000"}
    ]

  def next(input) when input == "丰宁满族自治县" or input == "130826",
    do: [
      %{"name" => "新丰路街道", "code" => "130826001000"},
      %{"name" => "大阁镇", "code" => "130826100000"},
      %{"name" => "大滩镇", "code" => "130826101000"},
      %{"name" => "鱼儿山镇", "code" => "130826102000"},
      %{"name" => "土城镇", "code" => "130826103000"},
      %{"name" => "黄旗镇", "code" => "130826104000"},
      %{"name" => "凤山镇", "code" => "130826105000"},
      %{"name" => "波罗诺镇", "code" => "130826106000"},
      %{"name" => "黑山咀嘴镇", "code" => "130826107000"},
      %{"name" => "天桥镇", "code" => "130826108000"},
      %{"name" => "胡麻营镇", "code" => "130826109000"},
      %{"name" => "将军营镇", "code" => "130826110000"},
      %{"name" => "万胜永乡", "code" => "130826200000"},
      %{"name" => "四岔口乡", "code" => "130826201000"},
      %{"name" => "苏家店乡", "code" => "130826202000"},
      %{"name" => "外沟门乡", "code" => "130826203000"},
      %{"name" => "草原乡", "code" => "130826204000"},
      %{"name" => "窟窿山乡", "code" => "130826205000"},
      %{"name" => "小坝子乡", "code" => "130826206000"},
      %{"name" => "五道营乡", "code" => "130826207000"},
      %{"name" => "选将营乡", "code" => "130826209000"},
      %{"name" => "西官营乡", "code" => "130826210000"},
      %{"name" => "王营乡", "code" => "130826211000"},
      %{"name" => "北头营乡", "code" => "130826212000"},
      %{"name" => "石人沟乡", "code" => "130826214000"},
      %{"name" => "汤河乡", "code" => "130826215000"},
      %{"name" => "杨木栅子乡", "code" => "130826216000"}
    ]

  def next(input) when input == "隆化县" or input == "130825",
    do: [
      %{"name" => "安州街道", "code" => "130825001000"},
      %{"name" => "韩麻营镇", "code" => "130825101000"},
      %{"name" => "中关镇", "code" => "130825102000"},
      %{"name" => "七家镇", "code" => "130825103000"},
      %{"name" => "汤头沟镇", "code" => "130825104000"},
      %{"name" => "张三营镇", "code" => "130825105000"},
      %{"name" => "唐三营镇", "code" => "130825106000"},
      %{"name" => "蓝旗镇", "code" => "130825107000"},
      %{"name" => "步古沟镇", "code" => "130825108000"},
      %{"name" => "郭家屯镇", "code" => "130825109000"},
      %{"name" => "茅荆坝镇", "code" => "130825110000"},
      %{"name" => "苔山镇", "code" => "130825111000"},
      %{"name" => "荒地镇", "code" => "130825112000"},
      %{"name" => "章吉营镇", "code" => "130825113000"},
      %{"name" => "偏坡营镇", "code" => "130825114000"},
      %{"name" => "尹家营满族乡", "code" => "130825203000"},
      %{"name" => "庙子沟蒙古族满族乡", "code" => "130825204000"},
      %{"name" => "山湾乡", "code" => "130825206000"},
      %{"name" => "八达营蒙古族乡", "code" => "130825207000"},
      %{"name" => "太平庄满族乡", "code" => "130825208000"},
      %{"name" => "旧屯满族乡", "code" => "130825209000"},
      %{"name" => "西阿超满族蒙古族乡", "code" => "130825210000"},
      %{"name" => "碱房乡", "code" => "130825212000"},
      %{"name" => "韩家店乡", "code" => "130825213000"},
      %{"name" => "湾沟门乡", "code" => "130825214000"}
    ]

  def next(input) when input == "滦平县" or input == "130824",
    do: [
      %{"name" => "中兴路街道", "code" => "130824001000"},
      %{"name" => "滦平镇", "code" => "130824100000"},
      %{"name" => "长山峪镇", "code" => "130824101000"},
      %{"name" => "红旗镇", "code" => "130824102000"},
      %{"name" => "金沟屯镇", "code" => "130824103000"},
      %{"name" => "虎什哈镇", "code" => "130824104000"},
      %{"name" => "巴克什营镇", "code" => "130824105000"},
      %{"name" => "张百湾镇", "code" => "130824106000"},
      %{"name" => "付营子镇", "code" => "130824107000"},
      %{"name" => "大屯镇", "code" => "130824108000"},
      %{"name" => "火斗山镇", "code" => "130824109000"},
      %{"name" => "两间房镇", "code" => "130824110000"},
      %{"name" => "小营镇", "code" => "130824111000"},
      %{"name" => "安纯沟门镇", "code" => "130824112000"},
      %{"name" => "平坊满族乡", "code" => "130824200000"},
      %{"name" => "西沟满族乡", "code" => "130824206000"},
      %{"name" => "邓厂满族乡", "code" => "130824207000"},
      %{"name" => "五道营子满族乡", "code" => "130824208000"},
      %{"name" => "马营子满族乡", "code" => "130824209000"},
      %{"name" => "付家店满族乡", "code" => "130824210000"}
    ]

  def next(input) when input == "兴隆县" or input == "130822",
    do: [
      %{"name" => "兴隆镇", "code" => "130822100000"},
      %{"name" => "半壁山镇", "code" => "130822101000"},
      %{"name" => "挂兰峪镇", "code" => "130822102000"},
      %{"name" => "青松岭镇", "code" => "130822103000"},
      %{"name" => "六道河镇", "code" => "130822104000"},
      %{"name" => "平安堡镇", "code" => "130822105000"},
      %{"name" => "北营房镇", "code" => "130822106000"},
      %{"name" => "孤山子镇", "code" => "130822107000"},
      %{"name" => "蓝旗营镇", "code" => "130822108000"},
      %{"name" => "雾灵山镇", "code" => "130822109000"},
      %{"name" => "李家营镇", "code" => "130822110000"},
      %{"name" => "大杖子镇", "code" => "130822111000"},
      %{"name" => "三道河镇", "code" => "130822112000"},
      %{"name" => "蘑菇峪镇", "code" => "130822113000"},
      %{"name" => "大水泉镇", "code" => "130822114000"},
      %{"name" => "南天门满族乡", "code" => "130822200000"},
      %{"name" => "八卦岭满族乡", "code" => "130822202000"},
      %{"name" => "陡子峪乡", "code" => "130822203000"},
      %{"name" => "上石洞乡", "code" => "130822204000"},
      %{"name" => "安子岭乡", "code" => "130822211000"}
    ]

  def next(input) when input == "承德县" or input == "130821",
    do: [
      %{"name" => "下板城镇", "code" => "130821100000"},
      %{"name" => "甲山镇", "code" => "130821102000"},
      %{"name" => "六沟镇", "code" => "130821103000"},
      %{"name" => "三沟镇", "code" => "130821104000"},
      %{"name" => "头沟镇", "code" => "130821105000"},
      %{"name" => "高寺台镇", "code" => "130821106000"},
      %{"name" => "鞍匠镇", "code" => "130821107000"},
      %{"name" => "三家镇", "code" => "130821108000"},
      %{"name" => "磴上镇", "code" => "130821109000"},
      %{"name" => "上谷镇", "code" => "130821110000"},
      %{"name" => "新杖子镇", "code" => "130821111000"},
      %{"name" => "石灰窑镇", "code" => "130821112000"},
      %{"name" => "东小白旗乡", "code" => "130821200000"},
      %{"name" => "刘杖子乡", "code" => "130821202000"},
      %{"name" => "孟家院乡", "code" => "130821204000"},
      %{"name" => "大营子乡", "code" => "130821205000"},
      %{"name" => "八家乡", "code" => "130821206000"},
      %{"name" => "满杖子乡", "code" => "130821208000"},
      %{"name" => "五道河乡", "code" => "130821210000"},
      %{"name" => "岔沟乡", "code" => "130821211000"},
      %{"name" => "岗子满族乡", "code" => "130821212000"},
      %{"name" => "两家满族乡", "code" => "130821214000"},
      %{"name" => "仓子乡", "code" => "130821216000"}
    ]

  def next(input) when input == "鹰手营子矿区" or input == "130804",
    do: [
      %{"name" => "铁北路街道", "code" => "130804001000"},
      %{"name" => "鹰手营子镇", "code" => "130804100000"},
      %{"name" => "北马圈子镇", "code" => "130804101000"},
      %{"name" => "寿王坟镇", "code" => "130804102000"},
      %{"name" => "汪家庄镇", "code" => "130804103000"}
    ]

  def next(input) when input == "双滦区" or input == "130803",
    do: [
      %{"name" => "元宝山街道", "code" => "130803001000"},
      %{"name" => "钢城街道", "code" => "130803002000"},
      %{"name" => "秀水街道", "code" => "130803003000"},
      %{"name" => "双塔山镇", "code" => "130803100000"},
      %{"name" => "滦河镇", "code" => "130803101000"},
      %{"name" => "大庙镇", "code" => "130803102000"},
      %{"name" => "偏桥子镇", "code" => "130803103000"},
      %{"name" => "西地镇", "code" => "130803104000"},
      %{"name" => "陈栅子镇", "code" => "130803105000"}
    ]

  def next(input) when input == "双桥区" or input == "130802",
    do: [
      %{"name" => "西大街街道", "code" => "130802001000"},
      %{"name" => "头道牌楼街道", "code" => "130802002000"},
      %{"name" => "潘家沟街道", "code" => "130802003000"},
      %{"name" => "中华路街道", "code" => "130802004000"},
      %{"name" => "新华路街道", "code" => "130802005000"},
      %{"name" => "石洞子沟街道", "code" => "130802006000"},
      %{"name" => "桥东街道", "code" => "130802007000"},
      %{"name" => "水泉沟镇", "code" => "130802100000"},
      %{"name" => "狮子沟镇", "code" => "130802101000"},
      %{"name" => "牛圈子沟镇", "code" => "130802102000"},
      %{"name" => "大石庙镇", "code" => "130802103000"},
      %{"name" => "双峰寺镇", "code" => "130802105000"}
    ]

  def next(input) when input == "张家口市塞北管理区" or input == "130773",
    do: [
      %{"name" => "榆树沟管理处", "code" => "130773501000"},
      %{"name" => "沙梁子管理处", "code" => "130773502000"},
      %{"name" => "小城子管理处", "code" => "130773503000"},
      %{"name" => "东大门管理处", "code" => "130773504000"}
    ]

  def next(input) when input == "张家口市察北管理区" or input == "130772",
    do: [
      %{"name" => "沙沟镇", "code" => "130772105000"},
      %{"name" => "宇宙营乡", "code" => "130772215000"},
      %{"name" => "黄山管理处", "code" => "130772401000"},
      %{"name" => "石门管理处", "code" => "130772402000"},
      %{"name" => "乌兰管理处", "code" => "130772403000"},
      %{"name" => "金沙管理处", "code" => "130772404000"},
      %{"name" => "白塔管理处", "code" => "130772405000"}
    ]

  def next(input) when input == "张家口经济开发区" or input == "130771",
    do: [
      %{"name" => "南站街道", "code" => "130771001000"},
      %{"name" => "马路东街道", "code" => "130771002000"},
      %{"name" => "老鸦庄镇", "code" => "130771100000"},
      %{"name" => "沈家屯镇", "code" => "130771101000"},
      %{"name" => "姚家房镇", "code" => "130771102000"},
      %{"name" => "沙岭子镇", "code" => "130771103000"}
    ]

  def next(input) when input == "赤城县" or input == "130732",
    do: [
      %{"name" => "赤城镇", "code" => "130732100000"},
      %{"name" => "田家窑镇", "code" => "130732101000"},
      %{"name" => "龙关镇", "code" => "130732102000"},
      %{"name" => "雕鹗镇", "code" => "130732103000"},
      %{"name" => "独石口镇", "code" => "130732104000"},
      %{"name" => "白草镇", "code" => "130732105000"},
      %{"name" => "龙门所镇", "code" => "130732106000"},
      %{"name" => "后城镇", "code" => "130732107000"},
      %{"name" => "东卯镇", "code" => "130732108000"},
      %{"name" => "炮梁乡", "code" => "130732200000"},
      %{"name" => "大海陀乡", "code" => "130732201000"},
      %{"name" => "镇宁堡乡", "code" => "130732202000"},
      %{"name" => "马营乡", "code" => "130732203000"},
      %{"name" => "云州乡", "code" => "130732204000"},
      %{"name" => "三道川乡", "code" => "130732205000"},
      %{"name" => "东万口乡", "code" => "130732206000"},
      %{"name" => "茨营子乡", "code" => "130732207000"},
      %{"name" => "样田乡", "code" => "130732208000"}
    ]

  def next(input) when input == "涿鹿县" or input == "130731",
    do: [
      %{"name" => "涿鹿镇", "code" => "130731100000"},
      %{"name" => "张家堡镇", "code" => "130731101000"},
      %{"name" => "武家沟镇", "code" => "130731102000"},
      %{"name" => "五堡镇", "code" => "130731103000"},
      %{"name" => "保岱镇", "code" => "130731104000"},
      %{"name" => "矾山镇", "code" => "130731105000"},
      %{"name" => "大堡镇", "code" => "130731106000"},
      %{"name" => "河东镇", "code" => "130731107000"},
      %{"name" => "东小庄镇", "code" => "130731108000"},
      %{"name" => "辉耀镇", "code" => "130731109000"},
      %{"name" => "大河南镇", "code" => "130731110000"},
      %{"name" => "温泉屯镇", "code" => "130731111000"},
      %{"name" => "蟒石口镇", "code" => "130731112000"},
      %{"name" => "卧佛寺镇", "code" => "130731113000"},
      %{"name" => "栾庄乡", "code" => "130731201000"},
      %{"name" => "黑山寺乡", "code" => "130731204000"},
      %{"name" => "谢家堡乡", "code" => "130731206000"}
    ]

  def next(input) when input == "怀来县" or input == "130730",
    do: [
      %{"name" => "沙城镇", "code" => "130730100000"},
      %{"name" => "北辛堡镇", "code" => "130730101000"},
      %{"name" => "新保安镇", "code" => "130730102000"},
      %{"name" => "东花园镇", "code" => "130730103000"},
      %{"name" => "官厅镇", "code" => "130730104000"},
      %{"name" => "桑园镇", "code" => "130730105000"},
      %{"name" => "存瑞镇", "code" => "130730106000"},
      %{"name" => "土木镇", "code" => "130730107000"},
      %{"name" => "大黄庄镇", "code" => "130730108000"},
      %{"name" => "西八里镇", "code" => "130730109000"},
      %{"name" => "小南辛堡镇", "code" => "130730110000"},
      %{"name" => "狼山乡", "code" => "130730200000"},
      %{"name" => "鸡鸣驿乡", "code" => "130730203000"},
      %{"name" => "东八里乡", "code" => "130730205000"},
      %{"name" => "瑞云观乡", "code" => "130730207000"},
      %{"name" => "孙庄子乡", "code" => "130730208000"},
      %{"name" => "王家楼回族乡", "code" => "130730210000"}
    ]

  def next(input) when input == "怀安县" or input == "130728",
    do: [
      %{"name" => "柴沟堡镇", "code" => "130728100000"},
      %{"name" => "左卫镇", "code" => "130728101000"},
      %{"name" => "头百户镇", "code" => "130728102000"},
      %{"name" => "怀安城镇", "code" => "130728103000"},
      %{"name" => "渡口堡乡", "code" => "130728200000"},
      %{"name" => "第六屯乡", "code" => "130728201000"},
      %{"name" => "西湾堡乡", "code" => "130728202000"},
      %{"name" => "西沙城乡", "code" => "130728203000"},
      %{"name" => "太平庄乡", "code" => "130728204000"},
      %{"name" => "王虎屯乡", "code" => "130728205000"},
      %{"name" => "第三堡乡", "code" => "130728206000"}
    ]

  def next(input) when input == "阳原县" or input == "130727",
    do: [
      %{"name" => "西城镇", "code" => "130727100000"},
      %{"name" => "东城镇", "code" => "130727101000"},
      %{"name" => "化稍营镇", "code" => "130727102000"},
      %{"name" => "揣骨疃镇", "code" => "130727103000"},
      %{"name" => "东井集镇", "code" => "130727104000"},
      %{"name" => "要家庄乡", "code" => "130727200000"},
      %{"name" => "东坊城堡乡", "code" => "130727201000"},
      %{"name" => "井儿沟乡", "code" => "130727202000"},
      %{"name" => "三马坊乡", "code" => "130727203000"},
      %{"name" => "高墙乡", "code" => "130727204000"},
      %{"name" => "大田洼乡", "code" => "130727205000"},
      %{"name" => "辛堡乡", "code" => "130727206000"},
      %{"name" => "马圈堡乡", "code" => "130727207000"},
      %{"name" => "浮图讲乡", "code" => "130727208000"}
    ]

  def next(input) when input == "蔚县" or input == "130726",
    do: [
      %{"name" => "蔚州镇", "code" => "130726100000"},
      %{"name" => "代王城镇", "code" => "130726101000"},
      %{"name" => "西合营镇", "code" => "130726102000"},
      %{"name" => "吉家庄镇", "code" => "130726103000"},
      %{"name" => "白乐镇", "code" => "130726104000"},
      %{"name" => "暖泉镇", "code" => "130726105000"},
      %{"name" => "南留庄镇", "code" => "130726106000"},
      %{"name" => "北水泉镇", "code" => "130726107000"},
      %{"name" => "桃花镇", "code" => "130726108000"},
      %{"name" => "阳眷镇", "code" => "130726109000"},
      %{"name" => "宋家庄镇", "code" => "130726110000"},
      %{"name" => "下宫村乡", "code" => "130726200000"},
      %{"name" => "南杨庄乡", "code" => "130726202000"},
      %{"name" => "柏树乡", "code" => "130726203000"},
      %{"name" => "常宁乡", "code" => "130726204000"},
      %{"name" => "涌泉庄乡", "code" => "130726205000"},
      %{"name" => "杨庄窠乡", "code" => "130726206000"},
      %{"name" => "南岭庄乡", "code" => "130726207000"},
      %{"name" => "陈家洼乡", "code" => "130726208000"},
      %{"name" => "黄梅乡", "code" => "130726209000"},
      %{"name" => "白草村乡", "code" => "130726210000"},
      %{"name" => "草沟堡乡", "code" => "130726211000"}
    ]

  def next(input) when input == "尚义县" or input == "130725",
    do: [
      %{"name" => "南壕堑镇", "code" => "130725100000"},
      %{"name" => "大青沟镇", "code" => "130725101000"},
      %{"name" => "八道沟镇", "code" => "130725102000"},
      %{"name" => "红土梁镇", "code" => "130725103000"},
      %{"name" => "小蒜沟镇", "code" => "130725104000"},
      %{"name" => "三工地镇", "code" => "130725105000"},
      %{"name" => "满井镇", "code" => "130725106000"},
      %{"name" => "大营盘乡", "code" => "130725200000"},
      %{"name" => "大苏计乡", "code" => "130725201000"},
      %{"name" => "石井乡", "code" => "130725202000"},
      %{"name" => "七甲乡", "code" => "130725205000"},
      %{"name" => "套里庄乡", "code" => "130725206000"},
      %{"name" => "甲石河乡", "code" => "130725207000"},
      %{"name" => "下马圈乡", "code" => "130725208000"}
    ]

  def next(input) when input == "沽源县" or input == "130724",
    do: [
      %{"name" => "平定堡镇", "code" => "130724100000"},
      %{"name" => "小厂镇", "code" => "130724101000"},
      %{"name" => "黄盖淖镇", "code" => "130724102000"},
      %{"name" => "九连城镇", "code" => "130724103000"},
      %{"name" => "高山堡乡", "code" => "130724200000"},
      %{"name" => "小河子乡", "code" => "130724201000"},
      %{"name" => "二道渠乡", "code" => "130724202000"},
      %{"name" => "大二号回族乡", "code" => "130724203000"},
      %{"name" => "闪电河乡", "code" => "130724204000"},
      %{"name" => "长梁乡", "code" => "130724205000"},
      %{"name" => "丰源店乡", "code" => "130724206000"},
      %{"name" => "西辛营乡", "code" => "130724207000"},
      %{"name" => "莲花滩乡", "code" => "130724208000"},
      %{"name" => "白土窑乡", "code" => "130724209000"}
    ]

  def next(input) when input == "康保县" or input == "130723",
    do: [
      %{"name" => "康保镇", "code" => "130723100000"},
      %{"name" => "张纪镇", "code" => "130723101000"},
      %{"name" => "土城子镇", "code" => "130723102000"},
      %{"name" => "邓油坊镇", "code" => "130723103000"},
      %{"name" => "李家地镇", "code" => "130723104000"},
      %{"name" => "照阳河镇", "code" => "130723105000"},
      %{"name" => "屯垦镇", "code" => "130723106000"},
      %{"name" => "闫油坊乡", "code" => "130723200000"},
      %{"name" => "丹清河乡", "code" => "130723201000"},
      %{"name" => "哈咇嘎乡", "code" => "130723202000"},
      %{"name" => "二号卜乡", "code" => "130723203000"},
      %{"name" => "芦家营乡", "code" => "130723204000"},
      %{"name" => "忠义乡", "code" => "130723205000"},
      %{"name" => "处长地乡", "code" => "130723206000"},
      %{"name" => "满德堂乡", "code" => "130723207000"},
      %{"name" => "康保牧场", "code" => "130723500000"},
      %{"name" => "屯垦林场", "code" => "130723501000"}
    ]

  def next(input) when input == "张北县" or input == "130722",
    do: [
      %{"name" => "张北镇", "code" => "130722100000"},
      %{"name" => "公会镇", "code" => "130722101000"},
      %{"name" => "二台镇", "code" => "130722102000"},
      %{"name" => "大囫囵镇", "code" => "130722103000"},
      %{"name" => "小二台镇", "code" => "130722104000"},
      %{"name" => "油篓沟镇", "code" => "130722106000"},
      %{"name" => "大河镇", "code" => "130722107000"},
      %{"name" => "台路沟乡", "code" => "130722200000"},
      %{"name" => "馒头营乡", "code" => "130722202000"},
      %{"name" => "二泉井乡", "code" => "130722203000"},
      %{"name" => "单晶河乡", "code" => "130722204000"},
      %{"name" => "海流图乡", "code" => "130722206000"},
      %{"name" => "两面井乡", "code" => "130722207000"},
      %{"name" => "大西湾乡", "code" => "130722208000"},
      %{"name" => "郝家营乡", "code" => "130722209000"},
      %{"name" => "白庙滩乡", "code" => "130722210000"},
      %{"name" => "战海乡", "code" => "130722212000"},
      %{"name" => "三号乡", "code" => "130722213000"}
    ]

  def next(input) when input == "崇礼区" or input == "130709",
    do: [
      %{"name" => "西湾子镇", "code" => "130709100000"},
      %{"name" => "高家营镇", "code" => "130709101000"},
      %{"name" => "四台嘴乡", "code" => "130709200000"},
      %{"name" => "红旗营乡", "code" => "130709201000"},
      %{"name" => "石窑子乡", "code" => "130709202000"},
      %{"name" => "驿马图乡", "code" => "130709203000"},
      %{"name" => "石嘴子乡", "code" => "130709204000"},
      %{"name" => "狮子沟乡", "code" => "130709205000"},
      %{"name" => "清三营乡", "code" => "130709206000"},
      %{"name" => "白旗乡", "code" => "130709207000"},
      %{"name" => "城关街道筹备处", "code" => "130709400000"}
    ]

  def next(input) when input == "万全区" or input == "130708",
    do: [
      %{"name" => "孔家庄镇", "code" => "130708100000"},
      %{"name" => "万全镇", "code" => "130708101000"},
      %{"name" => "洗马林镇", "code" => "130708102000"},
      %{"name" => "郭磊庄镇", "code" => "130708103000"},
      %{"name" => "膳房堡乡", "code" => "130708200000"},
      %{"name" => "北新屯乡", "code" => "130708201000"},
      %{"name" => "宣平堡乡", "code" => "130708202000"},
      %{"name" => "高庙堡乡", "code" => "130708203000"},
      %{"name" => "旧堡乡", "code" => "130708204000"},
      %{"name" => "安家堡乡", "code" => "130708205000"},
      %{"name" => "北沙城乡", "code" => "130708206000"},
      %{"name" => "孔家庄街道", "code" => "130708400000"},
      %{"name" => "宣平街道", "code" => "130708401000"}
    ]

  def next(input) when input == "下花园区" or input == "130706",
    do: [
      %{"name" => "城镇街道", "code" => "130706001000"},
      %{"name" => "煤矿街道", "code" => "130706002000"},
      %{"name" => "花园乡", "code" => "130706200000"},
      %{"name" => "辛庄子乡", "code" => "130706201000"},
      %{"name" => "定方水乡", "code" => "130706202000"},
      %{"name" => "段家堡乡", "code" => "130706203000"}
    ]

  def next(input) when input == "宣化区" or input == "130705",
    do: [
      %{"name" => "天泰寺街道", "code" => "130705001000"},
      %{"name" => "皇城街道", "code" => "130705002000"},
      %{"name" => "南关街道", "code" => "130705003000"},
      %{"name" => "南大街街道", "code" => "130705004000"},
      %{"name" => "大北街街道", "code" => "130705005000"},
      %{"name" => "工业街街道", "code" => "130705006000"},
      %{"name" => "建国街街道", "code" => "130705007000"},
      %{"name" => "庞家堡镇", "code" => "130705100000"},
      %{"name" => "深井镇", "code" => "130705101000"},
      %{"name" => "崞村镇", "code" => "130705102000"},
      %{"name" => "洋河南镇", "code" => "130705104000"},
      %{"name" => "贾家营镇", "code" => "130705106000"},
      %{"name" => "顾家营镇", "code" => "130705107000"},
      %{"name" => "赵川镇", "code" => "130705108000"},
      %{"name" => "江家屯镇", "code" => "130705109000"},
      %{"name" => "河子西镇", "code" => "130705110000"},
      %{"name" => "侯家庙镇", "code" => "130705111000"},
      %{"name" => "春光乡", "code" => "130705201000"},
      %{"name" => "李家堡乡", "code" => "130705204000"},
      %{"name" => "王家湾乡", "code" => "130705205000"},
      %{"name" => "塔儿村乡", "code" => "130705206000"}
    ]

  def next(input) when input == "桥西区" or input == "130703",
    do: [
      %{"name" => "新华街街道", "code" => "130703001000"},
      %{"name" => "大境门街道", "code" => "130703002000"},
      %{"name" => "明德北街街道", "code" => "130703003000"},
      %{"name" => "明德南街街道", "code" => "130703004000"},
      %{"name" => "堡子里街道", "code" => "130703005000"},
      %{"name" => "南营坊街道", "code" => "130703006000"},
      %{"name" => "工人新村街道", "code" => "130703007000"},
      %{"name" => "东窑子镇", "code" => "130703100000"}
    ]

  def next(input) when input == "桥东区" or input == "130702",
    do: [
      %{"name" => "红旗楼街道", "code" => "130702001000"},
      %{"name" => "胜利北路街道", "code" => "130702002000"},
      %{"name" => "五一路街道", "code" => "130702003000"},
      %{"name" => "花园街街道", "code" => "130702004000"},
      %{"name" => "工业路街道", "code" => "130702005000"},
      %{"name" => "姚家庄镇", "code" => "130702101000"},
      %{"name" => "大仓盖镇", "code" => "130702102000"},
      %{"name" => "东望山乡", "code" => "130702202000"}
    ]

  def next(input) when input == "高碑店市" or input == "130684",
    do: [
      %{"name" => "和平街道", "code" => "130684001000"},
      %{"name" => "军城街道", "code" => "130684002000"},
      %{"name" => "东盛街道", "code" => "130684003000"},
      %{"name" => "北城街道", "code" => "130684004000"},
      %{"name" => "兴华路街道", "code" => "130684005000"},
      %{"name" => "方官镇", "code" => "130684100000"},
      %{"name" => "新城镇", "code" => "130684101000"},
      %{"name" => "泗庄镇", "code" => "130684102000"},
      %{"name" => "辛立庄镇", "code" => "130684104000"},
      %{"name" => "东马营镇", "code" => "130684105000"},
      %{"name" => "辛桥镇", "code" => "130684106000"},
      %{"name" => "肖官营镇", "code" => "130684107000"},
      %{"name" => "张六庄镇", "code" => "130684108000"},
      %{"name" => "梁家营镇", "code" => "130684109000"}
    ]

  def next(input) when input == "安国市" or input == "130683",
    do: [
      %{"name" => "药都街道", "code" => "130683001000"},
      %{"name" => "祁州路街道", "code" => "130683002000"},
      %{"name" => "伍仁桥镇", "code" => "130683101000"},
      %{"name" => "石佛镇", "code" => "130683102000"},
      %{"name" => "郑章镇", "code" => "130683103000"},
      %{"name" => "大五女镇", "code" => "130683104000"},
      %{"name" => "西佛落镇", "code" => "130683105000"},
      %{"name" => "西城镇", "code" => "130683106000"},
      %{"name" => "明官店乡", "code" => "130683200000"},
      %{"name" => "南娄底乡", "code" => "130683201000"},
      %{"name" => "北段村乡", "code" => "130683204000"},
      %{"name" => "现代中药工业园区", "code" => "130683400000"}
    ]

  def next(input) when input == "定州市" or input == "130682",
    do: [
      %{"name" => "南城区街道", "code" => "130682001000"},
      %{"name" => "北城区街道", "code" => "130682002000"},
      %{"name" => "西城区街道", "code" => "130682003000"},
      %{"name" => "长安路街道", "code" => "130682004000"},
      %{"name" => "留早镇", "code" => "130682100000"},
      %{"name" => "清风店镇", "code" => "130682101000"},
      %{"name" => "庞村镇", "code" => "130682102000"},
      %{"name" => "砖路镇", "code" => "130682103000"},
      %{"name" => "明月店镇", "code" => "130682104000"},
      %{"name" => "叮咛店镇", "code" => "130682105000"},
      %{"name" => "东亭镇", "code" => "130682106000"},
      %{"name" => "大辛庄镇", "code" => "130682107000"},
      %{"name" => "东旺镇", "code" => "130682108000"},
      %{"name" => "高蓬镇", "code" => "130682109000"},
      %{"name" => "邢邑镇", "code" => "130682110000"},
      %{"name" => "李亲顾镇", "code" => "130682111000"},
      %{"name" => "子位镇", "code" => "130682112000"},
      %{"name" => "开元镇", "code" => "130682113000"},
      %{"name" => "周村镇", "code" => "130682115000"},
      %{"name" => "息冢镇", "code" => "130682116000"},
      %{"name" => "东留春乡", "code" => "130682203000"},
      %{"name" => "号头庄回族乡", "code" => "130682204000"},
      %{"name" => "杨家庄乡", "code" => "130682205000"},
      %{"name" => "大鹿庄乡", "code" => "130682206000"},
      %{"name" => "西城乡", "code" => "130682208000"}
    ]

  def next(input) when input == "涿州市" or input == "130681",
    do: [
      %{"name" => "双塔街道", "code" => "130681001000"},
      %{"name" => "桃园街道", "code" => "130681002000"},
      %{"name" => "清凉寺街道", "code" => "130681003000"},
      %{"name" => "松林店镇", "code" => "130681100000"},
      %{"name" => "码头镇", "code" => "130681101000"},
      %{"name" => "东城坊镇", "code" => "130681102000"},
      %{"name" => "高官庄镇", "code" => "130681103000"},
      %{"name" => "东仙坡镇", "code" => "130681104000"},
      %{"name" => "百尺竿镇", "code" => "130681105000"},
      %{"name" => "义和庄镇", "code" => "130681106000"},
      %{"name" => "刁窝镇", "code" => "130681107000"},
      %{"name" => "林家屯镇", "code" => "130681108000"},
      %{"name" => "豆庄镇", "code" => "130681109000"},
      %{"name" => "孙家庄乡", "code" => "130681204000"},
      %{"name" => "高新技术产业开发区", "code" => "130681400000"},
      %{"name" => "京南经济开发区", "code" => "130681401000"},
      %{"name" => "松林店经济开发区", "code" => "130681402000"}
    ]

  def next(input) when input == "保定白沟新城" or input == "130672",
    do: [%{"name" => "白沟镇", "code" => "130672103000"}]

  def next(input) when input == "保定高新技术产业开发区" or input == "130671",
    do: [
      %{"name" => "贤台乡", "code" => "130671202000"},
      %{"name" => "大马坊乡", "code" => "130671205000"},
      %{"name" => "保定国家高新区", "code" => "130671400000"}
    ]

  def next(input) when input == "雄县" or input == "130638",
    do: [
      %{"name" => "雄州镇", "code" => "130638100000"},
      %{"name" => "昝岗镇", "code" => "130638101000"},
      %{"name" => "大营镇", "code" => "130638102000"},
      %{"name" => "龙湾镇", "code" => "130638103000"},
      %{"name" => "朱各庄镇", "code" => "130638104000"},
      %{"name" => "米家务镇", "code" => "130638105000"},
      %{"name" => "鄚州镇", "code" => "130638106000"},
      %{"name" => "苟各庄镇", "code" => "130638107000"},
      %{"name" => "北沙口乡", "code" => "130638200000"},
      %{"name" => "双堂乡", "code" => "130638203000"},
      %{"name" => "张岗乡", "code" => "130638204000"},
      %{"name" => "七间房乡", "code" => "130638205000"},
      %{"name" => "昝岗片区", "code" => "130638400000"}
    ]

  def next(input) when input == "博野县" or input == "130637",
    do: [
      %{"name" => "博野镇", "code" => "130637100000"},
      %{"name" => "小店镇", "code" => "130637101000"},
      %{"name" => "程委镇", "code" => "130637102000"},
      %{"name" => "东墟镇", "code" => "130637103000"},
      %{"name" => "北杨镇", "code" => "130637104000"},
      %{"name" => "城东镇", "code" => "130637105000"},
      %{"name" => "南小王镇", "code" => "130637106000"}
    ]

  def next(input) when input == "顺平县" or input == "130636",
    do: [
      %{"name" => "蒲阳镇", "code" => "130636100000"},
      %{"name" => "高于铺镇", "code" => "130636101000"},
      %{"name" => "腰山镇", "code" => "130636102000"},
      %{"name" => "蒲上镇", "code" => "130636103000"},
      %{"name" => "神南镇", "code" => "130636104000"},
      %{"name" => "安阳镇", "code" => "130636105000"},
      %{"name" => "白云镇", "code" => "130636106000"},
      %{"name" => "河口乡", "code" => "130636202000"},
      %{"name" => "台鱼乡", "code" => "130636204000"},
      %{"name" => "大悲乡", "code" => "130636205000"}
    ]

  def next(input) when input == "蠡县" or input == "130635",
    do: [
      %{"name" => "蠡吾镇", "code" => "130635100000"},
      %{"name" => "留史镇", "code" => "130635101000"},
      %{"name" => "大百尺镇", "code" => "130635102000"},
      %{"name" => "辛兴镇", "code" => "130635103000"},
      %{"name" => "北郭丹镇", "code" => "130635104000"},
      %{"name" => "万安镇", "code" => "130635105000"},
      %{"name" => "桑园镇", "code" => "130635106000"},
      %{"name" => "南庄镇", "code" => "130635107000"},
      %{"name" => "大曲堤镇", "code" => "130635108000"},
      %{"name" => "鲍墟镇", "code" => "130635109000"},
      %{"name" => "小陈镇", "code" => "130635110000"},
      %{"name" => "林堡乡", "code" => "130635201000"},
      %{"name" => "北埝头乡", "code" => "130635202000"}
    ]

  def next(input) when input == "曲阳县" or input == "130634",
    do: [
      %{"name" => "恒州镇", "code" => "130634100000"},
      %{"name" => "灵山镇", "code" => "130634101000"},
      %{"name" => "燕赵镇", "code" => "130634102000"},
      %{"name" => "羊平镇", "code" => "130634103000"},
      %{"name" => "文德镇", "code" => "130634104000"},
      %{"name" => "晓林镇", "code" => "130634105000"},
      %{"name" => "邸村镇", "code" => "130634106000"},
      %{"name" => "齐村镇", "code" => "130634107000"},
      %{"name" => "孝墓镇", "code" => "130634108000"},
      %{"name" => "产德镇", "code" => "130634109000"},
      %{"name" => "下河镇", "code" => "130634110000"},
      %{"name" => "嘉禾镇", "code" => "130634111000"},
      %{"name" => "路庄子乡", "code" => "130634200000"},
      %{"name" => "庄窠乡", "code" => "130634202000"},
      %{"name" => "党城乡", "code" => "130634210000"},
      %{"name" => "郎家庄乡", "code" => "130634211000"},
      %{"name" => "范家庄乡", "code" => "130634212000"},
      %{"name" => "北台乡", "code" => "130634213000"}
    ]

  def next(input) when input == "易县" or input == "130633",
    do: [
      %{"name" => "易州镇", "code" => "130633100000"},
      %{"name" => "梁格庄镇", "code" => "130633101000"},
      %{"name" => "西陵镇", "code" => "130633102000"},
      %{"name" => "裴山镇", "code" => "130633103000"},
      %{"name" => "塘湖镇", "code" => "130633104000"},
      %{"name" => "狼牙山镇", "code" => "130633105000"},
      %{"name" => "良岗镇", "code" => "130633106000"},
      %{"name" => "紫荆关镇", "code" => "130633107000"},
      %{"name" => "高村镇", "code" => "130633108000"},
      %{"name" => "西山北镇", "code" => "130633109000"},
      %{"name" => "高陌镇", "code" => "130633110000"},
      %{"name" => "桥头乡", "code" => "130633200000"},
      %{"name" => "白马乡", "code" => "130633201000"},
      %{"name" => "流井乡", "code" => "130633202000"},
      %{"name" => "大龙华乡", "code" => "130633205000"},
      %{"name" => "安格庄乡", "code" => "130633206000"},
      %{"name" => "凌云册乡", "code" => "130633207000"},
      %{"name" => "尉都乡", "code" => "130633209000"},
      %{"name" => "独乐乡", "code" => "130633210000"},
      %{"name" => "七峪乡", "code" => "130633211000"},
      %{"name" => "富岗乡", "code" => "130633212000"},
      %{"name" => "坡仓乡", "code" => "130633213000"},
      %{"name" => "牛岗乡", "code" => "130633214000"},
      %{"name" => "桥家河乡", "code" => "130633215000"},
      %{"name" => "甘河净乡", "code" => "130633216000"},
      %{"name" => "蔡家峪乡", "code" => "130633217000"},
      %{"name" => "南城司乡", "code" => "130633218000"},
      %{"name" => "恋乡太行水镇", "code" => "130633400000"},
      %{"name" => "河北易县经济开发区", "code" => "130633401000"}
    ]

  def next(input) when input == "安新县" or input == "130632",
    do: [
      %{"name" => "安新镇", "code" => "130632100000"},
      %{"name" => "大王镇", "code" => "130632101000"},
      %{"name" => "三台镇", "code" => "130632102000"},
      %{"name" => "端村镇", "code" => "130632103000"},
      %{"name" => "赵北口镇", "code" => "130632104000"},
      %{"name" => "同口镇", "code" => "130632105000"},
      %{"name" => "刘李庄镇", "code" => "130632106000"},
      %{"name" => "安州镇", "code" => "130632107000"},
      %{"name" => "老河头镇", "code" => "130632108000"},
      %{"name" => "圈头乡", "code" => "130632200000"},
      %{"name" => "寨里乡", "code" => "130632201000"},
      %{"name" => "芦庄乡", "code" => "130632202000"},
      %{"name" => "龙化乡", "code" => "130632203000"}
    ]

  def next(input) when input == "望都县" or input == "130631",
    do: [
      %{"name" => "望都镇", "code" => "130631100000"},
      %{"name" => "固店镇", "code" => "130631101000"},
      %{"name" => "贾村镇", "code" => "130631102000"},
      %{"name" => "中韩庄镇", "code" => "130631103000"},
      %{"name" => "寺庄镇", "code" => "130631104000"},
      %{"name" => "赵庄镇", "code" => "130631105000"},
      %{"name" => "高岭镇", "code" => "130631106000"},
      %{"name" => "黑堡乡", "code" => "130631202000"},
      %{"name" => "望都经济开发区", "code" => "130631400000"}
    ]

  def next(input) when input == "涞源县" or input == "130630",
    do: [
      %{"name" => "涞源镇", "code" => "130630100000"},
      %{"name" => "银坊镇", "code" => "130630101000"},
      %{"name" => "走马驿镇", "code" => "130630102000"},
      %{"name" => "水堡镇", "code" => "130630103000"},
      %{"name" => "王安镇", "code" => "130630104000"},
      %{"name" => "杨家庄镇", "code" => "130630105000"},
      %{"name" => "白石山镇", "code" => "130630106000"},
      %{"name" => "南屯镇", "code" => "130630107000"},
      %{"name" => "泉坊镇", "code" => "130630108000"},
      %{"name" => "北石佛镇", "code" => "130630109000"},
      %{"name" => "南马庄乡", "code" => "130630201000"},
      %{"name" => "金家井乡", "code" => "130630203000"},
      %{"name" => "留家庄乡", "code" => "130630204000"},
      %{"name" => "上庄乡", "code" => "130630205000"},
      %{"name" => "东团堡乡", "code" => "130630206000"},
      %{"name" => "塔崖驿乡", "code" => "130630207000"},
      %{"name" => "乌龙沟乡", "code" => "130630208000"}
    ]

  def next(input) when input == "容城县" or input == "130629",
    do: [
      %{"name" => "容城镇", "code" => "130629100000"},
      %{"name" => "小里镇", "code" => "130629101000"},
      %{"name" => "南张镇", "code" => "130629102000"},
      %{"name" => "大河镇", "code" => "130629103000"},
      %{"name" => "晾马台镇", "code" => "130629104000"},
      %{"name" => "八于乡", "code" => "130629200000"},
      %{"name" => "贾光乡", "code" => "130629201000"},
      %{"name" => "平王乡", "code" => "130629203000"},
      %{"name" => "容东片区", "code" => "130629400000"},
      %{"name" => "容西片区", "code" => "130629401000"}
    ]

  def next(input) when input == "高阳县" or input == "130628",
    do: [
      %{"name" => "高阳县锦华街道", "code" => "130628001000"},
      %{"name" => "庞口镇", "code" => "130628101000"},
      %{"name" => "西演镇", "code" => "130628102000"},
      %{"name" => "邢家南镇", "code" => "130628103000"},
      %{"name" => "晋庄镇", "code" => "130628104000"},
      %{"name" => "小王果庄镇", "code" => "130628105000"},
      %{"name" => "蒲口镇", "code" => "130628106000"},
      %{"name" => "庞家佐镇", "code" => "130628107000"},
      %{"name" => "高阳县经济开发区", "code" => "130628400000"}
    ]

  def next(input) when input == "唐县" or input == "130627",
    do: [
      %{"name" => "仁厚镇", "code" => "130627100000"},
      %{"name" => "王京镇", "code" => "130627101000"},
      %{"name" => "高昌镇", "code" => "130627102000"},
      %{"name" => "北罗镇", "code" => "130627103000"},
      %{"name" => "白合镇", "code" => "130627104000"},
      %{"name" => "军城镇", "code" => "130627105000"},
      %{"name" => "川里镇", "code" => "130627106000"},
      %{"name" => "长古城镇", "code" => "130627107000"},
      %{"name" => "罗庄镇", "code" => "130627108000"},
      %{"name" => "北店头镇", "code" => "130627109000"},
      %{"name" => "齐家佐镇", "code" => "130627110000"},
      %{"name" => "黄石口镇", "code" => "130627111000"},
      %{"name" => "都亭乡", "code" => "130627201000"},
      %{"name" => "南店头乡", "code" => "130627202000"},
      %{"name" => "雹水乡", "code" => "130627205000"},
      %{"name" => "大洋乡", "code" => "130627206000"},
      %{"name" => "迷城乡", "code" => "130627207000"},
      %{"name" => "羊角乡", "code" => "130627209000"},
      %{"name" => "石门乡", "code" => "130627210000"},
      %{"name" => "倒马关乡", "code" => "130627212000"}
    ]

  def next(input) when input == "定兴县" or input == "130626",
    do: [
      %{"name" => "定兴镇", "code" => "130626100000"},
      %{"name" => "固城镇", "code" => "130626101000"},
      %{"name" => "贤寓镇", "code" => "130626102000"},
      %{"name" => "北河镇", "code" => "130626103000"},
      %{"name" => "天宫寺镇", "code" => "130626104000"},
      %{"name" => "小朱庄镇", "code" => "130626105000"},
      %{"name" => "姚村镇", "code" => "130626106000"},
      %{"name" => "杨村镇", "code" => "130626107000"},
      %{"name" => "高里镇", "code" => "130626108000"},
      %{"name" => "内章镇", "code" => "130626109000"},
      %{"name" => "东落堡镇", "code" => "130626110000"},
      %{"name" => "张家庄乡", "code" => "130626202000"},
      %{"name" => "肖村乡", "code" => "130626204000"},
      %{"name" => "柳卓乡", "code" => "130626205000"},
      %{"name" => "北南蔡乡", "code" => "130626208000"},
      %{"name" => "李郁庄乡", "code" => "130626209000"}
    ]

  def next(input) when input == "阜平县" or input == "130624",
    do: [
      %{"name" => "阜平镇", "code" => "130624100000"},
      %{"name" => "龙泉关镇", "code" => "130624101000"},
      %{"name" => "平阳镇", "code" => "130624102000"},
      %{"name" => "城南庄镇", "code" => "130624103000"},
      %{"name" => "天生桥镇", "code" => "130624104000"},
      %{"name" => "王林口镇", "code" => "130624105000"},
      %{"name" => "砂窝镇", "code" => "130624106000"},
      %{"name" => "北果园镇", "code" => "130624107000"},
      %{"name" => "台峪乡", "code" => "130624202000"},
      %{"name" => "大台乡", "code" => "130624203000"},
      %{"name" => "史家寨乡", "code" => "130624204000"},
      %{"name" => "吴王口乡", "code" => "130624206000"},
      %{"name" => "夏庄乡", "code" => "130624207000"},
      %{"name" => "河北阜平经济开发区", "code" => "130624400000"}
    ]

  def next(input) when input == "涞水县" or input == "130623",
    do: [
      %{"name" => "涞水镇", "code" => "130623100000"},
      %{"name" => "永阳镇", "code" => "130623101000"},
      %{"name" => "义安镇", "code" => "130623102000"},
      %{"name" => "石亭镇", "code" => "130623103000"},
      %{"name" => "赵各庄镇", "code" => "130623104000"},
      %{"name" => "九龙镇", "code" => "130623105000"},
      %{"name" => "三坡镇", "code" => "130623106000"},
      %{"name" => "一渡镇", "code" => "130623107000"},
      %{"name" => "明义镇", "code" => "130623108000"},
      %{"name" => "王村镇", "code" => "130623109000"},
      %{"name" => "娄村镇", "code" => "130623110000"},
      %{"name" => "东文山镇", "code" => "130623111000"},
      %{"name" => "其中口乡", "code" => "130623205000"},
      %{"name" => "龙门乡", "code" => "130623206000"},
      %{"name" => "胡家庄乡", "code" => "130623207000"},
      %{"name" => "涞水县城区社区管理办公室", "code" => "130623401000"}
    ]

  def next(input) when input == "徐水区" or input == "130609",
    do: [
      %{"name" => "安肃镇", "code" => "130609100000"},
      %{"name" => "崔庄镇", "code" => "130609101000"},
      %{"name" => "大因镇", "code" => "130609102000"},
      %{"name" => "遂城镇", "code" => "130609103000"},
      %{"name" => "高林村镇", "code" => "130609104000"},
      %{"name" => "大王店镇", "code" => "130609105000"},
      %{"name" => "漕河镇", "code" => "130609106000"},
      %{"name" => "东史端镇", "code" => "130609107000"},
      %{"name" => "留村镇", "code" => "130609108000"},
      %{"name" => "正村镇", "code" => "130609109000"},
      %{"name" => "户木乡", "code" => "130609203000"},
      %{"name" => "瀑河乡", "code" => "130609204000"},
      %{"name" => "东釜山乡", "code" => "130609205000"},
      %{"name" => "义联庄乡", "code" => "130609206000"}
    ]

  def next(input) when input == "清苑区" or input == "130608",
    do: [
      %{"name" => "清苑镇", "code" => "130608100000"},
      %{"name" => "冉庄镇", "code" => "130608101000"},
      %{"name" => "阳城镇", "code" => "130608102000"},
      %{"name" => "魏村镇", "code" => "130608103000"},
      %{"name" => "温仁镇", "code" => "130608104000"},
      %{"name" => "张登镇", "code" => "130608105000"},
      %{"name" => "大庄镇", "code" => "130608106000"},
      %{"name" => "臧村镇", "code" => "130608107000"},
      %{"name" => "望亭镇", "code" => "130608108000"},
      %{"name" => "东闾镇", "code" => "130608109000"},
      %{"name" => "白团镇", "code" => "130608110000"},
      %{"name" => "石桥镇", "code" => "130608111000"},
      %{"name" => "何桥镇", "code" => "130608112000"},
      %{"name" => "北店乡", "code" => "130608201000"},
      %{"name" => "李庄乡", "code" => "130608203000"},
      %{"name" => "北王力乡", "code" => "130608204000"},
      %{"name" => "孙村乡", "code" => "130608207000"},
      %{"name" => "阎庄乡", "code" => "130608208000"},
      %{"name" => "河北清苑经济开发区", "code" => "130608400000"}
    ]

  def next(input) when input == "满城区" or input == "130607",
    do: [
      %{"name" => "惠阳街道", "code" => "130607001000"},
      %{"name" => "满城镇", "code" => "130607100000"},
      %{"name" => "大册营镇", "code" => "130607101000"},
      %{"name" => "神星镇", "code" => "130607102000"},
      %{"name" => "南韩村镇", "code" => "130607103000"},
      %{"name" => "方顺桥镇", "code" => "130607104000"},
      %{"name" => "于家庄镇", "code" => "130607105000"},
      %{"name" => "要庄乡", "code" => "130607203000"},
      %{"name" => "白龙乡", "code" => "130607204000"},
      %{"name" => "石井乡", "code" => "130607205000"},
      %{"name" => "坨南乡", "code" => "130607206000"},
      %{"name" => "刘家台乡", "code" => "130607207000"},
      %{"name" => "河北满城经济开发区", "code" => "130607400000"}
    ]

  def next(input) when input == "莲池区" or input == "130606",
    do: [
      %{"name" => "和平里街道", "code" => "130606001000"},
      %{"name" => "五四路街道", "code" => "130606002000"},
      %{"name" => "西关街道", "code" => "130606003000"},
      %{"name" => "中华路街道", "code" => "130606004000"},
      %{"name" => "东关街道", "code" => "130606005000"},
      %{"name" => "联盟街道", "code" => "130606006000"},
      %{"name" => "红星街道", "code" => "130606007000"},
      %{"name" => "裕华街道", "code" => "130606008000"},
      %{"name" => "永华街道", "code" => "130606009000"},
      %{"name" => "南关街道", "code" => "130606010000"},
      %{"name" => "百楼镇", "code" => "130606100000"},
      %{"name" => "焦庄镇", "code" => "130606101000"},
      %{"name" => "韩庄乡", "code" => "130606200000"},
      %{"name" => "东金庄乡", "code" => "130606201000"},
      %{"name" => "杨庄乡", "code" => "130606203000"},
      %{"name" => "南大园乡", "code" => "130606204000"},
      %{"name" => "五尧乡", "code" => "130606206000"}
    ]

  def next(input) when input == "竞秀区" or input == "130602",
    do: [
      %{"name" => "先锋街道", "code" => "130602001000"},
      %{"name" => "新市场街道", "code" => "130602002000"},
      %{"name" => "东风路街道", "code" => "130602003000"},
      %{"name" => "建南街道", "code" => "130602004000"},
      %{"name" => "韩村北路街道", "code" => "130602005000"},
      %{"name" => "大激店镇", "code" => "130602100000"},
      %{"name" => "一亩泉镇", "code" => "130602101000"},
      %{"name" => "颉庄乡", "code" => "130602200000"},
      %{"name" => "富昌乡", "code" => "130602201000"},
      %{"name" => "韩村乡", "code" => "130602202000"}
    ]

  def next(input) when input == "沙河市" or input == "130582",
    do: [
      %{"name" => "褡裢街道", "code" => "130582001000"},
      %{"name" => "桥东街道", "code" => "130582002000"},
      %{"name" => "桥西街道", "code" => "130582003000"},
      %{"name" => "赞善街道", "code" => "130582004000"},
      %{"name" => "周庄街道", "code" => "130582005000"},
      %{"name" => "新城镇", "code" => "130582101000"},
      %{"name" => "白塔镇", "code" => "130582102000"},
      %{"name" => "十里亭镇", "code" => "130582103000"},
      %{"name" => "綦村镇", "code" => "130582104000"},
      %{"name" => "刘石岗镇", "code" => "130582107000"},
      %{"name" => "册井镇", "code" => "130582108000"},
      %{"name" => "柴关乡", "code" => "130582203000"},
      %{"name" => "蝉房乡", "code" => "130582204000"}
    ]

  def next(input) when input == "南宫市" or input == "130581",
    do: [
      %{"name" => "凤岗街道", "code" => "130581001000"},
      %{"name" => "南杜街道", "code" => "130581002000"},
      %{"name" => "北胡街道", "code" => "130581003000"},
      %{"name" => "西丁街道", "code" => "130581004000"},
      %{"name" => "苏村镇", "code" => "130581100000"},
      %{"name" => "大高村镇", "code" => "130581101000"},
      %{"name" => "垂杨镇", "code" => "130581102000"},
      %{"name" => "明化镇", "code" => "130581103000"},
      %{"name" => "段芦头镇", "code" => "130581104000"},
      %{"name" => "紫冢镇", "code" => "130581105000"},
      %{"name" => "大村乡", "code" => "130581200000"},
      %{"name" => "南便村乡", "code" => "130581201000"},
      %{"name" => "大屯乡", "code" => "130581202000"},
      %{"name" => "王道寨乡", "code" => "130581203000"},
      %{"name" => "薛吴村乡", "code" => "130581204000"}
    ]

  def next(input) when input == "河北邢台经济开发区" or input == "130571",
    do: [
      %{"name" => "留村街道", "code" => "130571001000"},
      %{"name" => "火炬街道", "code" => "130571002000"},
      %{"name" => "东汪镇", "code" => "130571100000"},
      %{"name" => "王快镇", "code" => "130571101000"},
      %{"name" => "沙河城镇", "code" => "130571103000"}
    ]

  def next(input) when input == "临西县" or input == "130535",
    do: [
      %{"name" => "临西镇", "code" => "130535100000"},
      %{"name" => "河西镇", "code" => "130535101000"},
      %{"name" => "下堡寺镇", "code" => "130535102000"},
      %{"name" => "尖塚镇", "code" => "130535103000"},
      %{"name" => "老官寨镇", "code" => "130535104000"},
      %{"name" => "吕寨镇", "code" => "130535105000"},
      %{"name" => "大刘庄镇", "code" => "130535106000"},
      %{"name" => "东枣园乡", "code" => "130535200000"},
      %{"name" => "摇鞍镇乡", "code" => "130535203000"},
      %{"name" => "轴承工业园区", "code" => "130535400000"}
    ]

  def next(input) when input == "清河县" or input == "130534",
    do: [
      %{"name" => "葛仙庄镇", "code" => "130534100000"},
      %{"name" => "连庄镇", "code" => "130534101000"},
      %{"name" => "油坊镇", "code" => "130534102000"},
      %{"name" => "谢炉镇", "code" => "130534103000"},
      %{"name" => "王官庄镇", "code" => "130534104000"},
      %{"name" => "坝营镇", "code" => "130534105000"}
    ]

  def next(input) when input == "威县" or input == "130533",
    do: [
      %{"name" => "洺州镇", "code" => "130533100000"},
      %{"name" => "梨园屯镇", "code" => "130533101000"},
      %{"name" => "章台镇", "code" => "130533102000"},
      %{"name" => "侯贯镇", "code" => "130533103000"},
      %{"name" => "七级镇", "code" => "130533104000"},
      %{"name" => "贺营镇", "code" => "130533105000"},
      %{"name" => "方家营镇", "code" => "130533106000"},
      %{"name" => "常庄镇", "code" => "130533107000"},
      %{"name" => "第什营镇", "code" => "130533108000"},
      %{"name" => "贺钊镇", "code" => "130533109000"},
      %{"name" => "赵村镇", "code" => "130533110000"},
      %{"name" => "固献镇", "code" => "130533111000"},
      %{"name" => "枣园乡", "code" => "130533202000"},
      %{"name" => "张家营乡", "code" => "130533206000"},
      %{"name" => "常屯乡", "code" => "130533207000"},
      %{"name" => "高公庄乡", "code" => "130533209000"}
    ]

  def next(input) when input == "平乡县" or input == "130532",
    do: [
      %{"name" => "中华路街道", "code" => "130532001000"},
      %{"name" => "平乡镇", "code" => "130532101000"},
      %{"name" => "河古庙镇", "code" => "130532102000"},
      %{"name" => "田付村镇", "code" => "130532103000"},
      %{"name" => "节固镇", "code" => "130532104000"},
      %{"name" => "油召乡", "code" => "130532201000"},
      %{"name" => "寻召乡", "code" => "130532203000"}
    ]

  def next(input) when input == "广宗县" or input == "130531",
    do: [
      %{"name" => "广宗镇", "code" => "130531100000"},
      %{"name" => "冯家寨镇", "code" => "130531101000"},
      %{"name" => "北塘疃镇", "code" => "130531102000"},
      %{"name" => "核桃园镇", "code" => "130531103000"},
      %{"name" => "葫芦乡", "code" => "130531200000"},
      %{"name" => "大平台乡", "code" => "130531201000"},
      %{"name" => "件只乡", "code" => "130531202000"},
      %{"name" => "东召乡", "code" => "130531204000"}
    ]

  def next(input) when input == "新河县" or input == "130530",
    do: [
      %{"name" => "新河镇", "code" => "130530100000"},
      %{"name" => "寻寨镇", "code" => "130530101000"},
      %{"name" => "白神首乡", "code" => "130530200000"},
      %{"name" => "荆家庄乡", "code" => "130530201000"},
      %{"name" => "西流乡", "code" => "130530202000"},
      %{"name" => "仁让里乡", "code" => "130530203000"}
    ]

  def next(input) when input == "巨鹿县" or input == "130529",
    do: [
      %{"name" => "巨鹿镇", "code" => "130529100000"},
      %{"name" => "王虎寨镇", "code" => "130529101000"},
      %{"name" => "西郭城镇", "code" => "130529102000"},
      %{"name" => "官亭镇", "code" => "130529103000"},
      %{"name" => "阎疃镇", "code" => "130529104000"},
      %{"name" => "小吕寨镇", "code" => "130529105000"},
      %{"name" => "苏家营镇", "code" => "130529106000"},
      %{"name" => "观寨镇", "code" => "130529107000"},
      %{"name" => "堤村乡", "code" => "130529200000"},
      %{"name" => "张王疃乡", "code" => "130529201000"}
    ]

  def next(input) when input == "宁晋县" or input == "130528",
    do: [
      %{"name" => "宁北街道", "code" => "130528001000"},
      %{"name" => "凤凰镇", "code" => "130528100000"},
      %{"name" => "河渠镇", "code" => "130528101000"},
      %{"name" => "北河庄镇", "code" => "130528102000"},
      %{"name" => "耿庄桥镇", "code" => "130528103000"},
      %{"name" => "东汪镇", "code" => "130528104000"},
      %{"name" => "贾家口镇", "code" => "130528105000"},
      %{"name" => "四芝兰镇", "code" => "130528106000"},
      %{"name" => "大陆村镇", "code" => "130528107000"},
      %{"name" => "苏家庄镇", "code" => "130528108000"},
      %{"name" => "换马店镇", "code" => "130528109000"},
      %{"name" => "唐邱镇", "code" => "130528110000"},
      %{"name" => "大曹庄镇", "code" => "130528111000"},
      %{"name" => "侯口镇", "code" => "130528112000"},
      %{"name" => "纪昌庄镇", "code" => "130528113000"},
      %{"name" => "北鱼乡", "code" => "130528205000"},
      %{"name" => "徐家河乡", "code" => "130528208000"},
      %{"name" => "大曹庄管理区", "code" => "130528401000"}
    ]

  def next(input) when input == "隆尧县" or input == "130525",
    do: [
      %{"name" => "隆尧镇", "code" => "130525100000"},
      %{"name" => "魏家庄镇", "code" => "130525101000"},
      %{"name" => "尹村镇", "code" => "130525102000"},
      %{"name" => "山口镇", "code" => "130525103000"},
      %{"name" => "莲子镇镇", "code" => "130525104000"},
      %{"name" => "固城镇", "code" => "130525105000"},
      %{"name" => "东良镇", "code" => "130525106000"},
      %{"name" => "北楼乡", "code" => "130525200000"},
      %{"name" => "双碑乡", "code" => "130525202000"},
      %{"name" => "牛家桥乡", "code" => "130525203000"},
      %{"name" => "千户营乡", "code" => "130525204000"},
      %{"name" => "大张家庄乡", "code" => "130525205000"},
      %{"name" => "柳行农场", "code" => "130525400000"}
    ]

  def next(input) when input == "柏乡县" or input == "130524",
    do: [
      %{"name" => "柏乡镇", "code" => "130524100000"},
      %{"name" => "固城店镇", "code" => "130524101000"},
      %{"name" => "西汪镇", "code" => "130524102000"},
      %{"name" => "龙华镇", "code" => "130524103000"},
      %{"name" => "王家庄乡", "code" => "130524200000"},
      %{"name" => "内步乡", "code" => "130524203000"}
    ]

  def next(input) when input == "内丘县" or input == "130523",
    do: [
      %{"name" => "内丘镇", "code" => "130523100000"},
      %{"name" => "大孟村镇", "code" => "130523101000"},
      %{"name" => "金店镇", "code" => "130523102000"},
      %{"name" => "官庄镇", "code" => "130523103000"},
      %{"name" => "柳林镇", "code" => "130523104000"},
      %{"name" => "五郭店乡", "code" => "130523200000"},
      %{"name" => "南赛乡", "code" => "130523203000"},
      %{"name" => "獐獏乡", "code" => "130523204000"},
      %{"name" => "侯家庄乡", "code" => "130523205000"}
    ]

  def next(input) when input == "临城县" or input == "130522",
    do: [
      %{"name" => "临城镇", "code" => "130522100000"},
      %{"name" => "东镇镇", "code" => "130522101000"},
      %{"name" => "西竖镇", "code" => "130522102000"},
      %{"name" => "郝庄镇", "code" => "130522103000"},
      %{"name" => "黑城镇", "code" => "130522104000"},
      %{"name" => "鸭鸽营乡", "code" => "130522201000"},
      %{"name" => "石城乡", "code" => "130522203000"},
      %{"name" => "赵庄乡", "code" => "130522205000"}
    ]

  def next(input) when input == "南和区" or input == "130506",
    do: [
      %{"name" => "和阳镇", "code" => "130506100000"},
      %{"name" => "贾宋镇", "code" => "130506101000"},
      %{"name" => "郝桥镇", "code" => "130506102000"},
      %{"name" => "三思镇", "code" => "130506103000"},
      %{"name" => "河郭镇", "code" => "130506104000"},
      %{"name" => "东三召乡", "code" => "130506200000"},
      %{"name" => "阎里乡", "code" => "130506201000"},
      %{"name" => "史召乡", "code" => "130506203000"}
    ]

  def next(input) when input == "任泽区" or input == "130505",
    do: [
      %{"name" => "任城镇", "code" => "130505100000"},
      %{"name" => "邢家湾镇", "code" => "130505101000"},
      %{"name" => "辛店镇", "code" => "130505102000"},
      %{"name" => "天口镇", "code" => "130505103000"},
      %{"name" => "西固城镇", "code" => "130505104000"},
      %{"name" => "永福庄乡", "code" => "130505201000"},
      %{"name" => "大屯乡", "code" => "130505202000"},
      %{"name" => "骆庄乡", "code" => "130505203000"}
    ]

  def next(input) when input == "信都区" or input == "130503",
    do: [
      %{"name" => "钢铁路街道", "code" => "130503001000"},
      %{"name" => "中兴路街道", "code" => "130503002000"},
      %{"name" => "达活泉街道", "code" => "130503003000"},
      %{"name" => "张宽街道", "code" => "130503004000"},
      %{"name" => "章村街道", "code" => "130503005000"},
      %{"name" => "中华大街街道", "code" => "130503006000"},
      %{"name" => "团结路街道", "code" => "130503007000"},
      %{"name" => "泉西街道", "code" => "130503008000"},
      %{"name" => "南大郭镇", "code" => "130503100000"},
      %{"name" => "李村镇", "code" => "130503101000"},
      %{"name" => "南石门镇", "code" => "130503102000"},
      %{"name" => "羊范镇", "code" => "130503103000"},
      %{"name" => "皇寺镇", "code" => "130503104000"},
      %{"name" => "会宁镇", "code" => "130503105000"},
      %{"name" => "西黄村镇", "code" => "130503106000"},
      %{"name" => "路罗镇", "code" => "130503107000"},
      %{"name" => "将军墓镇", "code" => "130503108000"},
      %{"name" => "浆水镇", "code" => "130503109000"},
      %{"name" => "宋家庄镇", "code" => "130503110000"},
      %{"name" => "太子井乡", "code" => "130503202000"},
      %{"name" => "龙泉寺乡", "code" => "130503203000"},
      %{"name" => "北小庄乡", "code" => "130503204000"},
      %{"name" => "城计头乡", "code" => "130503205000"},
      %{"name" => "白岸乡", "code" => "130503206000"},
      %{"name" => "冀家村乡", "code" => "130503207000"}
    ]

  def next(input) when input == "襄都区" or input == "130502",
    do: [
      %{"name" => "南长街街道", "code" => "130502001000"},
      %{"name" => "北大街街道", "code" => "130502002000"},
      %{"name" => "西大街街道", "code" => "130502003000"},
      %{"name" => "西门里街道", "code" => "130502004000"},
      %{"name" => "泉东街道", "code" => "130502005000"},
      %{"name" => "豫让桥街道", "code" => "130502006000"},
      %{"name" => "东郭村镇", "code" => "130502100000"},
      %{"name" => "祝村镇", "code" => "130502101000"},
      %{"name" => "晏家屯镇", "code" => "130502103000"},
      %{"name" => "大梁庄乡", "code" => "130502200000"}
    ]

  def next(input) when input == "武安市" or input == "130481",
    do: [
      %{"name" => "武安镇", "code" => "130481100000"},
      %{"name" => "康二城镇", "code" => "130481101000"},
      %{"name" => "午汲镇", "code" => "130481102000"},
      %{"name" => "磁山镇", "code" => "130481103000"},
      %{"name" => "伯延镇", "code" => "130481104000"},
      %{"name" => "淑村镇", "code" => "130481105000"},
      %{"name" => "大同镇", "code" => "130481106000"},
      %{"name" => "邑城镇", "code" => "130481107000"},
      %{"name" => "矿山镇", "code" => "130481108000"},
      %{"name" => "贺进镇", "code" => "130481109000"},
      %{"name" => "阳邑镇", "code" => "130481110000"},
      %{"name" => "徘徊镇", "code" => "130481111000"},
      %{"name" => "冶陶镇", "code" => "130481112000"},
      %{"name" => "上团城镇", "code" => "130481113000"},
      %{"name" => "西土山镇", "code" => "130481114000"},
      %{"name" => "北安庄乡", "code" => "130481201000"},
      %{"name" => "北安乐乡", "code" => "130481202000"},
      %{"name" => "西寺庄乡", "code" => "130481204000"},
      %{"name" => "活水乡", "code" => "130481205000"},
      %{"name" => "石洞乡", "code" => "130481206000"},
      %{"name" => "管陶乡", "code" => "130481207000"},
      %{"name" => "马家庄乡", "code" => "130481208000"},
      %{"name" => "河北武安工业园区", "code" => "130481400000"}
    ]

  def next(input) when input == "邯郸冀南新区" or input == "130473",
    do: [
      %{"name" => "城南街道", "code" => "130473001000"},
      %{"name" => "高臾镇", "code" => "130473100000"},
      %{"name" => "光禄镇", "code" => "130473101000"},
      %{"name" => "林坛镇", "code" => "130473102000"},
      %{"name" => "马头镇", "code" => "130473103000"},
      %{"name" => "辛庄营乡", "code" => "130473200000"},
      %{"name" => "花官营乡", "code" => "130473201000"},
      %{"name" => "台城乡", "code" => "130473202000"},
      %{"name" => "南城乡", "code" => "130473203000"}
    ]

  def next(input) when input == "邯郸经济技术开发区" or input == "130471",
    do: [
      %{"name" => "尚璧镇", "code" => "130471100000"},
      %{"name" => "南沿村镇", "code" => "130471101000"},
      %{"name" => "小西堡乡", "code" => "130471200000"},
      %{"name" => "姚寨乡", "code" => "130471201000"},
      %{"name" => "开发区街道", "code" => "130471400000"}
    ]

  def next(input) when input == "曲周县" or input == "130435",
    do: [
      %{"name" => "曲周镇", "code" => "130435100000"},
      %{"name" => "安寨镇", "code" => "130435101000"},
      %{"name" => "侯村镇", "code" => "130435102000"},
      %{"name" => "河南疃镇", "code" => "130435103000"},
      %{"name" => "第四疃镇", "code" => "130435104000"},
      %{"name" => "白寨镇", "code" => "130435105000"},
      %{"name" => "槐桥镇", "code" => "130435106000"},
      %{"name" => "南里岳镇", "code" => "130435107000"},
      %{"name" => "大河道乡", "code" => "130435203000"},
      %{"name" => "依庄乡", "code" => "130435204000"}
    ]

  def next(input) when input == "魏县" or input == "130434",
    do: [
      %{"name" => "魏城镇", "code" => "130434100000"},
      %{"name" => "德政镇", "code" => "130434101000"},
      %{"name" => "北皋镇", "code" => "130434102000"},
      %{"name" => "双井镇", "code" => "130434103000"},
      %{"name" => "牙里镇", "code" => "130434104000"},
      %{"name" => "车往镇", "code" => "130434105000"},
      %{"name" => "回隆镇", "code" => "130434106000"},
      %{"name" => "张二庄镇", "code" => "130434107000"},
      %{"name" => "东代固镇", "code" => "130434108000"},
      %{"name" => "院堡镇", "code" => "130434109000"},
      %{"name" => "棘针寨镇", "code" => "130434110000"},
      %{"name" => "南双庙镇", "code" => "130434111000"},
      %{"name" => "边马镇", "code" => "130434112000"},
      %{"name" => "泊口镇", "code" => "130434113000"},
      %{"name" => "仕望集镇", "code" => "130434114000"},
      %{"name" => "沙口集镇", "code" => "130434115000"},
      %{"name" => "大兴庄镇", "code" => "130434116000"},
      %{"name" => "野胡拐乡", "code" => "130434203000"},
      %{"name" => "前大磨乡", "code" => "130434205000"},
      %{"name" => "大马村乡", "code" => "130434209000"},
      %{"name" => "北台头乡", "code" => "130434212000"}
    ]

  def next(input) when input == "馆陶县" or input == "130433",
    do: [
      %{"name" => "馆陶镇", "code" => "130433100000"},
      %{"name" => "房寨镇", "code" => "130433101000"},
      %{"name" => "柴堡镇", "code" => "130433102000"},
      %{"name" => "魏僧寨镇", "code" => "130433103000"},
      %{"name" => "寿山寺镇", "code" => "130433104000"},
      %{"name" => "王桥镇", "code" => "130433105000"},
      %{"name" => "南徐村乡", "code" => "130433202000"},
      %{"name" => "路桥乡", "code" => "130433203000"}
    ]

  def next(input) when input == "广平县" or input == "130432",
    do: [
      %{"name" => "广平镇", "code" => "130432100000"},
      %{"name" => "平固店镇", "code" => "130432101000"},
      %{"name" => "胜营镇", "code" => "130432102000"},
      %{"name" => "南阳堡镇", "code" => "130432103000"},
      %{"name" => "十里铺镇", "code" => "130432104000"},
      %{"name" => "南韩镇", "code" => "130432105000"},
      %{"name" => "东张孟镇", "code" => "130432106000"}
    ]

  def next(input) when input == "鸡泽县" or input == "130431",
    do: [
      %{"name" => "鸡泽镇", "code" => "130431100000"},
      %{"name" => "小寨镇", "code" => "130431101000"},
      %{"name" => "双塔镇", "code" => "130431102000"},
      %{"name" => "曹庄镇", "code" => "130431103000"},
      %{"name" => "浮图店镇", "code" => "130431104000"},
      %{"name" => "吴官营镇", "code" => "130431105000"},
      %{"name" => "风正乡", "code" => "130431202000"}
    ]

  def next(input) when input == "邱县" or input == "130430",
    do: [
      %{"name" => "新马头镇", "code" => "130430100000"},
      %{"name" => "邱城镇", "code" => "130430101000"},
      %{"name" => "梁二庄镇", "code" => "130430102000"},
      %{"name" => "香城固镇", "code" => "130430103000"},
      %{"name" => "古城营镇", "code" => "130430104000"},
      %{"name" => "南辛店乡", "code" => "130430201000"},
      %{"name" => "陈村回族乡", "code" => "130430204000"}
    ]

  def next(input) when input == "磁县" or input == "130427",
    do: [
      %{"name" => "磁州镇", "code" => "130427100000"},
      %{"name" => "讲武城镇", "code" => "130427103000"},
      %{"name" => "岳城镇", "code" => "130427104000"},
      %{"name" => "观台镇", "code" => "130427105000"},
      %{"name" => "白土镇", "code" => "130427107000"},
      %{"name" => "黄沙镇", "code" => "130427108000"},
      %{"name" => "路村营乡", "code" => "130427200000"},
      %{"name" => "时村营乡", "code" => "130427204000"},
      %{"name" => "陶泉乡", "code" => "130427207000"},
      %{"name" => "都党乡", "code" => "130427208000"},
      %{"name" => "北贾壁乡", "code" => "130427209000"}
    ]

  def next(input) when input == "涉县" or input == "130426",
    do: [
      %{"name" => "平安街道", "code" => "130426001000"},
      %{"name" => "河南店镇", "code" => "130426101000"},
      %{"name" => "索堡镇", "code" => "130426102000"},
      %{"name" => "西戌镇", "code" => "130426103000"},
      %{"name" => "井店镇", "code" => "130426104000"},
      %{"name" => "更乐镇", "code" => "130426105000"},
      %{"name" => "固新镇", "code" => "130426106000"},
      %{"name" => "西达镇", "code" => "130426107000"},
      %{"name" => "偏城镇", "code" => "130426108000"},
      %{"name" => "神头乡", "code" => "130426200000"},
      %{"name" => "辽城乡", "code" => "130426201000"},
      %{"name" => "偏店乡", "code" => "130426202000"},
      %{"name" => "龙虎乡", "code" => "130426203000"},
      %{"name" => "木井乡", "code" => "130426204000"},
      %{"name" => "关防乡", "code" => "130426205000"},
      %{"name" => "合漳乡", "code" => "130426206000"},
      %{"name" => "鹿头乡", "code" => "130426207000"},
      %{"name" => "涉城镇", "code" => "130426400000"}
    ]

  def next(input) when input == "大名县" or input == "130425",
    do: [
      %{"name" => "大名镇", "code" => "130425100000"},
      %{"name" => "杨桥镇", "code" => "130425101000"},
      %{"name" => "万堤镇", "code" => "130425102000"},
      %{"name" => "龙王庙镇", "code" => "130425103000"},
      %{"name" => "束馆镇", "code" => "130425104000"},
      %{"name" => "金滩镇", "code" => "130425105000"},
      %{"name" => "沙圪塔镇", "code" => "130425106000"},
      %{"name" => "大街镇", "code" => "130425107000"},
      %{"name" => "铺上镇", "code" => "130425108000"},
      %{"name" => "孙甘店镇", "code" => "130425109000"},
      %{"name" => "北峰镇", "code" => "130425110000"},
      %{"name" => "黄金堤镇", "code" => "130425111000"},
      %{"name" => "王村乡", "code" => "130425201000"},
      %{"name" => "旧治乡", "code" => "130425205000"},
      %{"name" => "西未庄乡", "code" => "130425206000"},
      %{"name" => "西付集乡", "code" => "130425208000"},
      %{"name" => "埝头乡", "code" => "130425209000"},
      %{"name" => "张铁集乡", "code" => "130425211000"},
      %{"name" => "红庙乡", "code" => "130425212000"},
      %{"name" => "营镇回族乡", "code" => "130425213000"}
    ]

  def next(input) when input == "成安县" or input == "130424",
    do: [
      %{"name" => "成安镇", "code" => "130424100000"},
      %{"name" => "商城镇", "code" => "130424101000"},
      %{"name" => "漳河店镇", "code" => "130424102000"},
      %{"name" => "李家疃镇", "code" => "130424103000"},
      %{"name" => "北乡义镇", "code" => "130424104000"},
      %{"name" => "道东堡镇", "code" => "130424105000"},
      %{"name" => "辛义乡", "code" => "130424200000"},
      %{"name" => "柏寺营乡", "code" => "130424201000"},
      %{"name" => "长巷乡", "code" => "130424204000"}
    ]

  def next(input) when input == "临漳县" or input == "130423",
    do: [
      %{"name" => "临漳镇", "code" => "130423100000"},
      %{"name" => "南东坊镇", "code" => "130423101000"},
      %{"name" => "孙陶集镇", "code" => "130423102000"},
      %{"name" => "柳园镇", "code" => "130423103000"},
      %{"name" => "称勾集镇", "code" => "130423104000"},
      %{"name" => "邺城镇", "code" => "130423105000"},
      %{"name" => "章里集镇", "code" => "130423106000"},
      %{"name" => "张村集镇", "code" => "130423107000"},
      %{"name" => "砖寨营镇", "code" => "130423108000"},
      %{"name" => "习文镇", "code" => "130423109000"},
      %{"name" => "狄邱乡", "code" => "130423200000"},
      %{"name" => "西羊羔乡", "code" => "130423202000"},
      %{"name" => "杜村集乡", "code" => "130423204000"},
      %{"name" => "柏鹤集乡", "code" => "130423208000"}
    ]

  def next(input) when input == "永年区" or input == "130408",
    do: [
      %{"name" => "临洺关镇", "code" => "130408100000"},
      %{"name" => "大北汪镇", "code" => "130408101000"},
      %{"name" => "张西堡镇", "code" => "130408102000"},
      %{"name" => "广府镇", "code" => "130408103000"},
      %{"name" => "永合会镇", "code" => "130408105000"},
      %{"name" => "刘营镇", "code" => "130408106000"},
      %{"name" => "西苏镇", "code" => "130408107000"},
      %{"name" => "讲武镇", "code" => "130408108000"},
      %{"name" => "东杨庄镇", "code" => "130408109000"},
      %{"name" => "界河店乡", "code" => "130408201000"},
      %{"name" => "刘汉乡", "code" => "130408203000"},
      %{"name" => "正西乡", "code" => "130408204000"},
      %{"name" => "曲陌乡", "code" => "130408206000"},
      %{"name" => "辛庄堡乡", "code" => "130408207000"},
      %{"name" => "小龙马乡", "code" => "130408208000"},
      %{"name" => "西河庄乡", "code" => "130408211000"},
      %{"name" => "西阳城乡", "code" => "130408213000"}
    ]

  def next(input) when input == "肥乡区" or input == "130407",
    do: [
      %{"name" => "肥乡镇", "code" => "130407100000"},
      %{"name" => "天台山镇", "code" => "130407101000"},
      %{"name" => "辛安镇镇", "code" => "130407102000"},
      %{"name" => "大寺上镇", "code" => "130407103000"},
      %{"name" => "东漳堡镇", "code" => "130407104000"},
      %{"name" => "毛演堡镇", "code" => "130407105000"},
      %{"name" => "西吕营镇", "code" => "130407106000"},
      %{"name" => "元固镇", "code" => "130407107000"},
      %{"name" => "北高镇", "code" => "130407108000"}
    ]

  def next(input) when input == "峰峰矿区" or input == "130406",
    do: [
      %{"name" => "滏阳东路街道", "code" => "130406001000"},
      %{"name" => "临水镇", "code" => "130406100000"},
      %{"name" => "峰峰镇", "code" => "130406101000"},
      %{"name" => "新坡镇", "code" => "130406102000"},
      %{"name" => "大社镇", "code" => "130406103000"},
      %{"name" => "和村镇", "code" => "130406104000"},
      %{"name" => "义井镇", "code" => "130406105000"},
      %{"name" => "彭城镇", "code" => "130406106000"},
      %{"name" => "界城镇", "code" => "130406107000"},
      %{"name" => "大峪镇", "code" => "130406108000"},
      %{"name" => "西固义乡", "code" => "130406200000"}
    ]

  def next(input) when input == "复兴区" or input == "130404",
    do: [
      %{"name" => "胜利桥街道", "code" => "130404001000"},
      %{"name" => "百家村街道", "code" => "130404002000"},
      %{"name" => "铁路大院街道", "code" => "130404003000"},
      %{"name" => "化林路街道", "code" => "130404004000"},
      %{"name" => "庞村街道", "code" => "130404005000"},
      %{"name" => "二六七二街道", "code" => "130404006000"},
      %{"name" => "石化街道", "code" => "130404007000"},
      %{"name" => "户村镇", "code" => "130404100000"},
      %{"name" => "彭家寨乡", "code" => "130404200000"},
      %{"name" => "康庄乡", "code" => "130404201000"}
    ]

  def next(input) when input == "丛台区" or input == "130403",
    do: [
      %{"name" => "丛台西街道", "code" => "130403001000"},
      %{"name" => "联纺西街道", "code" => "130403002000"},
      %{"name" => "联纺东街道", "code" => "130403003000"},
      %{"name" => "光明桥街道", "code" => "130403004000"},
      %{"name" => "丛台东街道", "code" => "130403005000"},
      %{"name" => "四季青街道", "code" => "130403006000"},
      %{"name" => "中华街道", "code" => "130403008000"},
      %{"name" => "人民路街道", "code" => "130403009000"},
      %{"name" => "柳林桥街道", "code" => "130403010000"},
      %{"name" => "东柳街道", "code" => "130403011000"},
      %{"name" => "黄粱梦镇", "code" => "130403101000"},
      %{"name" => "苏曹乡", "code" => "130403200000"},
      %{"name" => "三陵乡", "code" => "130403205000"},
      %{"name" => "南吕固乡", "code" => "130403206000"},
      %{"name" => "兼庄乡", "code" => "130403207000"}
    ]

  def next(input) when input == "邯山区" or input == "130402",
    do: [
      %{"name" => "火磨街道", "code" => "130402001000"},
      %{"name" => "陵园路街道", "code" => "130402002000"},
      %{"name" => "光明路街道", "code" => "130402003000"},
      %{"name" => "滏东街道", "code" => "130402004000"},
      %{"name" => "罗城头街道", "code" => "130402005000"},
      %{"name" => "渚河路街道", "code" => "130402006000"},
      %{"name" => "浴新南街道", "code" => "130402007000"},
      %{"name" => "农林路街道", "code" => "130402008000"},
      %{"name" => "贸东街道", "code" => "130402009000"},
      %{"name" => "贸西街道", "code" => "130402010000"},
      %{"name" => "盛和路街道", "code" => "130402011000"},
      %{"name" => "北张庄镇", "code" => "130402101000"},
      %{"name" => "河沙镇镇", "code" => "130402102000"},
      %{"name" => "南堡乡", "code" => "130402201000"},
      %{"name" => "代召乡", "code" => "130402202000"}
    ]

  def next(input) when input == "北戴河新区" or input == "130372",
    do: [
      %{"name" => "南戴河街道", "code" => "130372001000"},
      %{"name" => "大蒲河管理处", "code" => "130372400000"},
      %{"name" => "团林管理处", "code" => "130372401000"},
      %{"name" => "留守营管理处", "code" => "130372402000"}
    ]

  def next(input) when input == "秦皇岛市经济技术开发区" or input == "130371",
    do: [
      %{"name" => "船厂路街道", "code" => "130371005000"},
      %{"name" => "珠江道街道", "code" => "130371011000"},
      %{"name" => "黄河道街道", "code" => "130371012000"},
      %{"name" => "腾飞路街道", "code" => "130371013000"},
      %{"name" => "渤海乡", "code" => "130371200000"}
    ]

  def next(input) when input == "卢龙县" or input == "130324",
    do: [
      %{"name" => "卢龙镇", "code" => "130324100000"},
      %{"name" => "潘庄镇", "code" => "130324101000"},
      %{"name" => "燕河营镇", "code" => "130324102000"},
      %{"name" => "双望镇", "code" => "130324103000"},
      %{"name" => "刘田各庄镇", "code" => "130324104000"},
      %{"name" => "石门镇", "code" => "130324105000"},
      %{"name" => "木井镇", "code" => "130324106000"},
      %{"name" => "陈官屯镇", "code" => "130324107000"},
      %{"name" => "蛤泊镇", "code" => "130324108000"},
      %{"name" => "印庄镇", "code" => "130324109000"},
      %{"name" => "下寨乡", "code" => "130324200000"},
      %{"name" => "刘家营乡", "code" => "130324201000"}
    ]

  def next(input) when input == "昌黎县" or input == "130322",
    do: [
      %{"name" => "昌黎镇", "code" => "130322100000"},
      %{"name" => "靖安镇", "code" => "130322101000"},
      %{"name" => "安山镇", "code" => "130322102000"},
      %{"name" => "龙家店镇", "code" => "130322103000"},
      %{"name" => "泥井镇", "code" => "130322104000"},
      %{"name" => "大蒲河镇", "code" => "130322105000"},
      %{"name" => "新集镇", "code" => "130322106000"},
      %{"name" => "刘台庄镇", "code" => "130322107000"},
      %{"name" => "茹荷镇", "code" => "130322108000"},
      %{"name" => "朱各庄镇", "code" => "130322109000"},
      %{"name" => "荒佃庄镇", "code" => "130322110000"},
      %{"name" => "团林乡", "code" => "130322201000"},
      %{"name" => "葛条港乡", "code" => "130322202000"},
      %{"name" => "马坨店乡", "code" => "130322203000"},
      %{"name" => "两山乡", "code" => "130322206000"},
      %{"name" => "十里铺乡", "code" => "130322207000"}
    ]

  def next(input) when input == "青龙满族自治县" or input == "130321",
    do: [
      %{"name" => "都阳路街道", "code" => "130321001000"},
      %{"name" => "青龙镇", "code" => "130321100000"},
      %{"name" => "祖山镇", "code" => "130321101000"},
      %{"name" => "木头凳镇", "code" => "130321102000"},
      %{"name" => "双山子镇", "code" => "130321103000"},
      %{"name" => "马圈子镇", "code" => "130321104000"},
      %{"name" => "肖营子镇", "code" => "130321105000"},
      %{"name" => "大巫岚镇", "code" => "130321106000"},
      %{"name" => "土门子镇", "code" => "130321107000"},
      %{"name" => "八道河镇", "code" => "130321108000"},
      %{"name" => "隔河头镇", "code" => "130321109000"},
      %{"name" => "娄杖子镇", "code" => "130321110000"},
      %{"name" => "龙王庙镇", "code" => "130321111000"},
      %{"name" => "茨榆山镇", "code" => "130321112000"},
      %{"name" => "凤凰山乡", "code" => "130321200000"},
      %{"name" => "三星口乡", "code" => "130321202000"},
      %{"name" => "干沟乡", "code" => "130321203000"},
      %{"name" => "大石岭乡", "code" => "130321206000"},
      %{"name" => "官场乡", "code" => "130321208000"},
      %{"name" => "平方子乡", "code" => "130321210000"},
      %{"name" => "安子岭乡", "code" => "130321211000"},
      %{"name" => "朱杖子乡", "code" => "130321212000"},
      %{"name" => "草碾乡", "code" => "130321213000"},
      %{"name" => "三拨子乡", "code" => "130321217000"},
      %{"name" => "凉水河乡", "code" => "130321218000"}
    ]

  def next(input) when input == "抚宁区" or input == "130306",
    do: [
      %{"name" => "骊城街道", "code" => "130306001000"},
      %{"name" => "抚宁镇", "code" => "130306100000"},
      %{"name" => "留守营镇", "code" => "130306101000"},
      %{"name" => "榆关镇", "code" => "130306102000"},
      %{"name" => "台营镇", "code" => "130306105000"},
      %{"name" => "大新寨镇", "code" => "130306106000"},
      %{"name" => "坟坨镇", "code" => "130306109000"},
      %{"name" => "茶棚乡", "code" => "130306200000"}
    ]

  def next(input) when input == "北戴河区" or input == "130304",
    do: [
      %{"name" => "西山街道", "code" => "130304001000"},
      %{"name" => "东山街道", "code" => "130304002000"},
      %{"name" => "海滨镇", "code" => "130304100000"},
      %{"name" => "戴河镇", "code" => "130304101000"},
      %{"name" => "牛头崖镇", "code" => "130304103000"}
    ]

  def next(input) when input == "山海关区" or input == "130303",
    do: [
      %{"name" => "南关街道", "code" => "130303001000"},
      %{"name" => "古城街道", "code" => "130303002000"},
      %{"name" => "西关街道", "code" => "130303003000"},
      %{"name" => "路南街道", "code" => "130303004000"},
      %{"name" => "第一关镇", "code" => "130303100000"},
      %{"name" => "石河镇", "code" => "130303101000"},
      %{"name" => "孟姜镇", "code" => "130303102000"}
    ]

  def next(input) when input == "海港区" or input == "130302",
    do: [
      %{"name" => "文化路街道", "code" => "130302001000"},
      %{"name" => "海滨路街道", "code" => "130302002000"},
      %{"name" => "北环路街道", "code" => "130302003000"},
      %{"name" => "建设大街街道", "code" => "130302004000"},
      %{"name" => "河东街道", "code" => "130302005000"},
      %{"name" => "西港路街道", "code" => "130302006000"},
      %{"name" => "燕山大街街道", "code" => "130302007000"},
      %{"name" => "港城大街街道", "code" => "130302008000"},
      %{"name" => "东环路街道", "code" => "130302009000"},
      %{"name" => "白塔岭街道", "code" => "130302010000"},
      %{"name" => "东港镇", "code" => "130302100000"},
      %{"name" => "海港镇", "code" => "130302101000"},
      %{"name" => "西港镇", "code" => "130302102000"},
      %{"name" => "海阳镇", "code" => "130302103000"},
      %{"name" => "北港镇", "code" => "130302104000"},
      %{"name" => "杜庄镇", "code" => "130302105000"},
      %{"name" => "石门寨镇", "code" => "130302106000"},
      %{"name" => "驻操营镇", "code" => "130302107000"},
      %{"name" => "临港物流园区", "code" => "130302403000"},
      %{"name" => "海港经济开发区", "code" => "130302404000"}
    ]

  def next(input) when input == "滦州市" or input == "130284",
    do: [
      %{"name" => "滦河街道", "code" => "130284001000"},
      %{"name" => "古城街道", "code" => "130284002000"},
      %{"name" => "滦城路街道", "code" => "130284003000"},
      %{"name" => "响嘡街道", "code" => "130284004000"},
      %{"name" => "东安各庄镇", "code" => "130284102000"},
      %{"name" => "雷庄镇", "code" => "130284103000"},
      %{"name" => "茨榆坨镇", "code" => "130284104000"},
      %{"name" => "榛子镇", "code" => "130284105000"},
      %{"name" => "杨柳庄镇", "code" => "130284106000"},
      %{"name" => "油榨镇", "code" => "130284107000"},
      %{"name" => "古马镇", "code" => "130284108000"},
      %{"name" => "小马庄镇", "code" => "130284109000"},
      %{"name" => "九百户镇", "code" => "130284110000"},
      %{"name" => "王店子镇", "code" => "130284111000"}
    ]

  def next(input) when input == "迁安市" or input == "130283",
    do: [
      %{"name" => "永顺街道", "code" => "130283001000"},
      %{"name" => "兴安街道", "code" => "130283002000"},
      %{"name" => "滨河街道", "code" => "130283003000"},
      %{"name" => "杨店子街道", "code" => "130283004000"},
      %{"name" => "夏官营镇", "code" => "130283101000"},
      %{"name" => "杨各庄镇", "code" => "130283102000"},
      %{"name" => "建昌营镇", "code" => "130283103000"},
      %{"name" => "赵店子镇", "code" => "130283104000"},
      %{"name" => "野鸡坨镇", "code" => "130283105000"},
      %{"name" => "大崔庄镇", "code" => "130283106000"},
      %{"name" => "蔡园镇", "code" => "130283108000"},
      %{"name" => "马兰庄镇", "code" => "130283109000"},
      %{"name" => "沙河驿镇", "code" => "130283110000"},
      %{"name" => "木厂口镇", "code" => "130283111000"},
      %{"name" => "上射雁庄镇", "code" => "130283112000"},
      %{"name" => "太平庄镇", "code" => "130283113000"},
      %{"name" => "扣庄镇", "code" => "130283114000"},
      %{"name" => "大五里镇", "code" => "130283115000"},
      %{"name" => "五重安镇", "code" => "130283116000"},
      %{"name" => "彭店子镇", "code" => "130283117000"},
      %{"name" => "阎家店镇", "code" => "130283118000"}
    ]

  def next(input) when input == "遵化市" or input == "130281",
    do: [
      %{"name" => "华明路街道", "code" => "130281001000"},
      %{"name" => "文化路街道", "code" => "130281002000"},
      %{"name" => "遵化镇", "code" => "130281100000"},
      %{"name" => "堡子店镇", "code" => "130281101000"},
      %{"name" => "马兰峪镇", "code" => "130281102000"},
      %{"name" => "平安城镇", "code" => "130281103000"},
      %{"name" => "东新庄镇", "code" => "130281104000"},
      %{"name" => "新店子镇", "code" => "130281105000"},
      %{"name" => "党峪镇", "code" => "130281106000"},
      %{"name" => "地北头镇", "code" => "130281107000"},
      %{"name" => "东旧寨镇", "code" => "130281108000"},
      %{"name" => "铁厂镇", "code" => "130281109000"},
      %{"name" => "苏家洼镇", "code" => "130281110000"},
      %{"name" => "建明镇", "code" => "130281111000"},
      %{"name" => "石门镇", "code" => "130281112000"},
      %{"name" => "崔家庄镇", "code" => "130281113000"},
      %{"name" => "西留村镇", "code" => "130281114000"},
      %{"name" => "兴旺寨镇", "code" => "130281115000"},
      %{"name" => "西三里镇", "code" => "130281116000"},
      %{"name" => "团瓢庄镇", "code" => "130281117000"},
      %{"name" => "娘娘庄镇", "code" => "130281118000"},
      %{"name" => "侯家寨镇", "code" => "130281119000"},
      %{"name" => "西下营满族乡", "code" => "130281203000"},
      %{"name" => "汤泉满族乡", "code" => "130281204000"},
      %{"name" => "东陵满族乡", "code" => "130281205000"},
      %{"name" => "刘备寨乡", "code" => "130281206000"},
      %{"name" => "小厂乡", "code" => "130281211000"}
    ]

  def next(input) when input == "河北唐山海港经济开发区" or input == "130274",
    do: [
      %{"name" => "王滩镇", "code" => "130274103000"},
      %{"name" => "港城街道服务中心", "code" => "130274451000"}
    ]

  def next(input) when input == "唐山高新技术产业开发区" or input == "130273",
    do: [
      %{"name" => "街道", "code" => "130273001000"},
      %{"name" => "老庄子镇", "code" => "130273101000"},
      %{"name" => "庆北", "code" => "130273401000"},
      %{"name" => "三女河", "code" => "130273402000"}
    ]

  def next(input) when input == "唐山市汉沽管理区" or input == "130272",
    do: [
      %{"name" => "汉丰镇", "code" => "130272101000"},
      %{"name" => "兴农街道", "code" => "130272451000"},
      %{"name" => "振兴街道", "code" => "130272452000"}
    ]

  def next(input) when input == "河北唐山芦台经济开发区" or input == "130271",
    do: [
      %{"name" => "海北镇", "code" => "130271100000"},
      %{"name" => "新华路街道", "code" => "130271450000"}
    ]

  def next(input) when input == "玉田县" or input == "130229",
    do: [
      %{"name" => "无终街道", "code" => "130229001000"},
      %{"name" => "玉田镇", "code" => "130229100000"},
      %{"name" => "亮甲店镇", "code" => "130229101000"},
      %{"name" => "鸦鸿桥镇", "code" => "130229102000"},
      %{"name" => "窝洛沽镇", "code" => "130229103000"},
      %{"name" => "石臼窝镇", "code" => "130229104000"},
      %{"name" => "虹桥镇", "code" => "130229105000"},
      %{"name" => "散水头镇", "code" => "130229106000"},
      %{"name" => "林南仓镇", "code" => "130229107000"},
      %{"name" => "林西镇", "code" => "130229108000"},
      %{"name" => "杨家板桥镇", "code" => "130229109000"},
      %{"name" => "彩亭桥镇", "code" => "130229110000"},
      %{"name" => "孤树镇", "code" => "130229111000"},
      %{"name" => "大安镇镇", "code" => "130229112000"},
      %{"name" => "唐自头镇", "code" => "130229113000"},
      %{"name" => "郭家屯镇", "code" => "130229114000"},
      %{"name" => "杨家套镇", "code" => "130229115000"},
      %{"name" => "陈家铺镇", "code" => "130229116000"},
      %{"name" => "林头屯乡", "code" => "130229201000"},
      %{"name" => "潮洛窝乡", "code" => "130229203000"},
      %{"name" => "郭家桥乡", "code" => "130229205000"},
      %{"name" => "河北玉田经济开发区", "code" => "130229400000"},
      %{"name" => "河北唐山国家农业科技园区", "code" => "130229401000"}
    ]

  def next(input) when input == "迁西县" or input == "130227",
    do: [
      %{"name" => "栗乡街道", "code" => "130227001000"},
      %{"name" => "兴城镇", "code" => "130227100000"},
      %{"name" => "金厂峪镇", "code" => "130227101000"},
      %{"name" => "洒河桥镇", "code" => "130227102000"},
      %{"name" => "太平寨镇", "code" => "130227103000"},
      %{"name" => "罗家屯镇", "code" => "130227104000"},
      %{"name" => "东荒峪镇", "code" => "130227105000"},
      %{"name" => "新集镇", "code" => "130227106000"},
      %{"name" => "三屯营镇", "code" => "130227107000"},
      %{"name" => "滦阳镇", "code" => "130227108000"},
      %{"name" => "汉儿庄镇", "code" => "130227109000"},
      %{"name" => "新庄子镇", "code" => "130227110000"},
      %{"name" => "东莲花院镇", "code" => "130227111000"},
      %{"name" => "白庙子镇", "code" => "130227112000"},
      %{"name" => "上营镇", "code" => "130227113000"},
      %{"name" => "渔户寨乡", "code" => "130227203000"},
      %{"name" => "旧城乡", "code" => "130227204000"},
      %{"name" => "尹庄乡", "code" => "130227205000"},
      %{"name" => "河北迁西经济开发区", "code" => "130227450000"}
    ]

  def next(input) when input == "乐亭县" or input == "130225",
    do: [
      %{"name" => "乐安街道", "code" => "130225001000"},
      %{"name" => "乐亭镇", "code" => "130225100000"},
      %{"name" => "汤家河镇", "code" => "130225101000"},
      %{"name" => "胡家坨镇", "code" => "130225102000"},
      %{"name" => "闫各庄镇", "code" => "130225104000"},
      %{"name" => "马头营镇", "code" => "130225105000"},
      %{"name" => "新寨镇", "code" => "130225106000"},
      %{"name" => "汀流河镇", "code" => "130225107000"},
      %{"name" => "姜各庄镇", "code" => "130225108000"},
      %{"name" => "毛庄镇", "code" => "130225109000"},
      %{"name" => "中堡镇", "code" => "130225110000"},
      %{"name" => "大相各庄镇", "code" => "130225111000"},
      %{"name" => "庞各庄乡", "code" => "130225201000"},
      %{"name" => "古河乡", "code" => "130225203000"},
      %{"name" => "河北乐亭经济开发区", "code" => "130225453000"},
      %{"name" => "乐亭县城区工业聚集区", "code" => "130225454000"}
    ]

  def next(input) when input == "滦南县" or input == "130224",
    do: [
      %{"name" => "友谊路街道", "code" => "130224001000"},
      %{"name" => "倴城镇", "code" => "130224100000"},
      %{"name" => "宋道口镇", "code" => "130224101000"},
      %{"name" => "长凝镇", "code" => "130224102000"},
      %{"name" => "胡各庄镇", "code" => "130224103000"},
      %{"name" => "坨里镇", "code" => "130224104000"},
      %{"name" => "姚王庄镇", "code" => "130224105000"},
      %{"name" => "司各庄镇", "code" => "130224106000"},
      %{"name" => "安各庄镇", "code" => "130224107000"},
      %{"name" => "扒齿港镇", "code" => "130224108000"},
      %{"name" => "程庄镇", "code" => "130224109000"},
      %{"name" => "青坨营镇", "code" => "130224110000"},
      %{"name" => "柏各庄镇", "code" => "130224111000"},
      %{"name" => "南堡镇", "code" => "130224114000"},
      %{"name" => "方各庄镇", "code" => "130224115000"},
      %{"name" => "东黄坨镇", "code" => "130224116000"},
      %{"name" => "马城镇", "code" => "130224117000"}
    ]

  def next(input) when input == "曹妃甸区" or input == "130209",
    do: [
      %{"name" => "唐海镇", "code" => "130209100000"},
      %{"name" => "滨海镇", "code" => "130209112000"},
      %{"name" => "柳赞镇", "code" => "130209113000"},
      %{"name" => "一农场", "code" => "130209401000"},
      %{"name" => "三农场", "code" => "130209403000"},
      %{"name" => "四农场", "code" => "130209404000"},
      %{"name" => "五农场", "code" => "130209405000"},
      %{"name" => "六农场", "code" => "130209406000"},
      %{"name" => "七农场", "code" => "130209407000"},
      %{"name" => "八农场", "code" => "130209408000"},
      %{"name" => "九农场", "code" => "130209409000"},
      %{"name" => "十农场", "code" => "130209410000"},
      %{"name" => "十一农场", "code" => "130209411000"},
      %{"name" => "八里滩养殖场", "code" => "130209412000"},
      %{"name" => "十里海养殖场", "code" => "130209413000"},
      %{"name" => "唐山国际旅游岛", "code" => "130209414000"},
      %{"name" => "南堡经济开发区", "code" => "130209450000"},
      %{"name" => "曹妃甸工业区", "code" => "130209451000"},
      %{"name" => "曹妃甸新城", "code" => "130209452000"}
    ]

  def next(input) when input == "丰润区" or input == "130208",
    do: [
      %{"name" => "太平路街道", "code" => "130208001000"},
      %{"name" => "燕山路街道", "code" => "130208002000"},
      %{"name" => "浭阳街道", "code" => "130208003000"},
      %{"name" => "丰润镇", "code" => "130208100000"},
      %{"name" => "任各庄镇", "code" => "130208102000"},
      %{"name" => "左家坞镇", "code" => "130208103000"},
      %{"name" => "泉河头镇", "code" => "130208104000"},
      %{"name" => "王官营镇", "code" => "130208105000"},
      %{"name" => "火石营镇", "code" => "130208106000"},
      %{"name" => "新军屯镇", "code" => "130208109000"},
      %{"name" => "小张各庄镇", "code" => "130208110000"},
      %{"name" => "丰登坞镇", "code" => "130208111000"},
      %{"name" => "李钊庄镇", "code" => "130208112000"},
      %{"name" => "白官屯镇", "code" => "130208113000"},
      %{"name" => "石各庄镇", "code" => "130208114000"},
      %{"name" => "沙流河镇", "code" => "130208115000"},
      %{"name" => "七树庄镇", "code" => "130208116000"},
      %{"name" => "杨官林镇", "code" => "130208117000"},
      %{"name" => "银城铺镇", "code" => "130208118000"},
      %{"name" => "常庄镇", "code" => "130208119000"},
      %{"name" => "姜家营镇", "code" => "130208120000"},
      %{"name" => "欢喜庄乡", "code" => "130208205000"},
      %{"name" => "刘家营乡", "code" => "130208208000"}
    ]

  def next(input) when input == "丰南区" or input == "130207",
    do: [
      %{"name" => "青年路街道", "code" => "130207001000"},
      %{"name" => "胥各庄镇", "code" => "130207100000"},
      %{"name" => "小集镇", "code" => "130207103000"},
      %{"name" => "黄各庄镇", "code" => "130207104000"},
      %{"name" => "西葛镇", "code" => "130207105000"},
      %{"name" => "大新庄镇", "code" => "130207106000"},
      %{"name" => "钱营镇", "code" => "130207107000"},
      %{"name" => "唐坊镇", "code" => "130207108000"},
      %{"name" => "王兰庄镇", "code" => "130207109000"},
      %{"name" => "柳树瞿阝镇", "code" => "130207110000"},
      %{"name" => "黑沿子镇", "code" => "130207111000"},
      %{"name" => "大齐各庄镇", "code" => "130207114000"},
      %{"name" => "岔河镇", "code" => "130207116000"},
      %{"name" => "南孙庄镇", "code" => "130207117000"},
      %{"name" => "东田庄镇", "code" => "130207118000"},
      %{"name" => "尖字沽乡", "code" => "130207203000"}
    ]

  def next(input) when input == "开平区" or input == "130205",
    do: [
      %{"name" => "马家沟街道", "code" => "130205001000"},
      %{"name" => "开平街道", "code" => "130205002000"},
      %{"name" => "税务庄街道", "code" => "130205003000"},
      %{"name" => "陡电街道", "code" => "130205005000"},
      %{"name" => "荆各庄街道", "code" => "130205006000"},
      %{"name" => "开平镇", "code" => "130205100000"},
      %{"name" => "栗园镇", "code" => "130205101000"},
      %{"name" => "越河镇", "code" => "130205102000"},
      %{"name" => "双桥镇", "code" => "130205103000"},
      %{"name" => "郑庄子镇", "code" => "130205104000"},
      %{"name" => "洼里镇", "code" => "130205105000"}
    ]

  def next(input) when input == "古冶区" or input == "130204",
    do: [
      %{"name" => "林西街道", "code" => "130204001000"},
      %{"name" => "唐家庄街道", "code" => "130204002000"},
      %{"name" => "古冶街道", "code" => "130204003000"},
      %{"name" => "赵各庄街道", "code" => "130204004000"},
      %{"name" => "京华街道", "code" => "130204007000"},
      %{"name" => "范各庄镇", "code" => "130204100000"},
      %{"name" => "卑家店镇", "code" => "130204101000"},
      %{"name" => "王辇庄乡", "code" => "130204201000"},
      %{"name" => "习家套乡", "code" => "130204202000"},
      %{"name" => "大庄坨乡", "code" => "130204203000"}
    ]

  def next(input) when input == "路北区" or input == "130203",
    do: [
      %{"name" => "乔屯街道", "code" => "130203001000"},
      %{"name" => "文化路街道", "code" => "130203002000"},
      %{"name" => "钓鱼台街道", "code" => "130203003000"},
      %{"name" => "东新村街道", "code" => "130203004000"},
      %{"name" => "缸窑街道", "code" => "130203005000"},
      %{"name" => "机场路街道", "code" => "130203006000"},
      %{"name" => "河北路街道", "code" => "130203007000"},
      %{"name" => "龙东街道", "code" => "130203008000"},
      %{"name" => "大里街道", "code" => "130203009000"},
      %{"name" => "光明街道", "code" => "130203010000"},
      %{"name" => "翔云道街道", "code" => "130203011000"},
      %{"name" => "韩城镇", "code" => "130203100000"},
      %{"name" => "果园镇", "code" => "130203101000"}
    ]

  def next(input) when input == "路南区" or input == "130202",
    do: [
      %{"name" => "学院南路街道", "code" => "130202001000"},
      %{"name" => "友谊街道", "code" => "130202002000"},
      %{"name" => "广场街道", "code" => "130202003000"},
      %{"name" => "永红桥街道", "code" => "130202004000"},
      %{"name" => "小山街道", "code" => "130202005000"},
      %{"name" => "文化北后街街道", "code" => "130202006000"},
      %{"name" => "钱家营矿区街道", "code" => "130202007000"},
      %{"name" => "惠民道街道", "code" => "130202008000"},
      %{"name" => "梁家屯路街道", "code" => "130202009000"},
      %{"name" => "稻地镇", "code" => "130202102000"},
      %{"name" => "女织寨镇", "code" => "130202103000"}
    ]

  def next(input) when input == "新乐市" or input == "130184",
    do: [
      %{"name" => "长寿街道", "code" => "130184001000"},
      %{"name" => "化皮镇", "code" => "130184101000"},
      %{"name" => "承安镇", "code" => "130184102000"},
      %{"name" => "正莫镇", "code" => "130184103000"},
      %{"name" => "南大岳镇", "code" => "130184104000"},
      %{"name" => "杜固镇", "code" => "130184105000"},
      %{"name" => "邯邰镇", "code" => "130184106000"},
      %{"name" => "东王镇", "code" => "130184107000"},
      %{"name" => "马头铺镇", "code" => "130184108000"},
      %{"name" => "协神乡", "code" => "130184200000"},
      %{"name" => "木村乡", "code" => "130184201000"},
      %{"name" => "彭家庄回族乡", "code" => "130184202000"}
    ]

  def next(input) when input == "晋州市" or input == "130183",
    do: [
      %{"name" => "晋州镇", "code" => "130183100000"},
      %{"name" => "总十庄镇", "code" => "130183101000"},
      %{"name" => "营里镇", "code" => "130183102000"},
      %{"name" => "桃园镇", "code" => "130183103000"},
      %{"name" => "东卓宿镇", "code" => "130183104000"},
      %{"name" => "马于镇", "code" => "130183105000"},
      %{"name" => "小樵镇", "code" => "130183106000"},
      %{"name" => "槐树镇", "code" => "130183107000"},
      %{"name" => "东里庄镇", "code" => "130183108000"},
      %{"name" => "周家庄乡", "code" => "130183201000"}
    ]

  def next(input) when input == "辛集市" or input == "130181",
    do: [
      %{"name" => "辛集镇", "code" => "130181100000"},
      %{"name" => "旧城镇", "code" => "130181101000"},
      %{"name" => "张古庄镇", "code" => "130181102000"},
      %{"name" => "位伯镇", "code" => "130181103000"},
      %{"name" => "新垒头镇", "code" => "130181104000"},
      %{"name" => "新城镇", "code" => "130181105000"},
      %{"name" => "南智邱镇", "code" => "130181106000"},
      %{"name" => "王口镇", "code" => "130181107000"},
      %{"name" => "天宫营乡", "code" => "130181200000"},
      %{"name" => "前营乡", "code" => "130181201000"},
      %{"name" => "马庄乡", "code" => "130181202000"},
      %{"name" => "和睦井乡", "code" => "130181203000"},
      %{"name" => "田家庄乡", "code" => "130181204000"},
      %{"name" => "中里厢乡", "code" => "130181205000"},
      %{"name" => "小辛庄乡", "code" => "130181206000"},
      %{"name" => "辛集经济开发区", "code" => "130181500000"}
    ]

  def next(input) when input == "石家庄循环化工园区" or input == "130172",
    do: [%{"name" => "丘头镇", "code" => "130172100000"}]

  def next(input) when input == "石家庄高新技术产业开发区" or input == "130171",
    do: [
      %{"name" => "长江街道", "code" => "130171010000"},
      %{"name" => "太行街道", "code" => "130171011000"},
      %{"name" => "宋营镇", "code" => "130171100000"},
      %{"name" => "郄马镇", "code" => "130171101000"}
    ]

  def next(input) when input == "赵县" or input == "130133",
    do: [
      %{"name" => "赵州镇", "code" => "130133100000"},
      %{"name" => "范庄镇", "code" => "130133101000"},
      %{"name" => "北王里镇", "code" => "130133102000"},
      %{"name" => "新寨店镇", "code" => "130133103000"},
      %{"name" => "韩村镇", "code" => "130133104000"},
      %{"name" => "南柏舍镇", "code" => "130133105000"},
      %{"name" => "沙河店镇", "code" => "130133106000"},
      %{"name" => "王西章镇", "code" => "130133107000"},
      %{"name" => "谢庄镇", "code" => "130133108000"},
      %{"name" => "前大章乡", "code" => "130133200000"},
      %{"name" => "高村乡", "code" => "130133202000"}
    ]

  def next(input) when input == "元氏县" or input == "130132",
    do: [
      %{"name" => "槐阳镇", "code" => "130132100000"},
      %{"name" => "殷村镇", "code" => "130132101000"},
      %{"name" => "南佐镇", "code" => "130132102000"},
      %{"name" => "宋曹镇", "code" => "130132103000"},
      %{"name" => "南因镇", "code" => "130132104000"},
      %{"name" => "姬村镇", "code" => "130132105000"},
      %{"name" => "北褚镇", "code" => "130132106000"},
      %{"name" => "马村镇", "code" => "130132107000"},
      %{"name" => "东张乡", "code" => "130132201000"},
      %{"name" => "赵同乡", "code" => "130132202000"},
      %{"name" => "苏村乡", "code" => "130132204000"},
      %{"name" => "苏阳乡", "code" => "130132205000"},
      %{"name" => "北正乡", "code" => "130132206000"},
      %{"name" => "前仙乡", "code" => "130132207000"},
      %{"name" => "黑水河乡", "code" => "130132208000"}
    ]

  def next(input) when input == "平山县" or input == "130131",
    do: [
      %{"name" => "平山镇", "code" => "130131100000"},
      %{"name" => "东回舍镇", "code" => "130131101000"},
      %{"name" => "温塘镇", "code" => "130131102000"},
      %{"name" => "南甸镇", "code" => "130131103000"},
      %{"name" => "岗南镇", "code" => "130131104000"},
      %{"name" => "古月镇", "code" => "130131105000"},
      %{"name" => "下槐镇", "code" => "130131106000"},
      %{"name" => "孟家庄镇", "code" => "130131107000"},
      %{"name" => "小觉镇", "code" => "130131108000"},
      %{"name" => "蛟潭庄镇", "code" => "130131109000"},
      %{"name" => "西柏坡镇", "code" => "130131110000"},
      %{"name" => "下口镇", "code" => "130131111000"},
      %{"name" => "西大吾乡", "code" => "130131200000"},
      %{"name" => "上三汲乡", "code" => "130131201000"},
      %{"name" => "两河乡", "code" => "130131202000"},
      %{"name" => "东王坡乡", "code" => "130131203000"},
      %{"name" => "苏家庄乡", "code" => "130131204000"},
      %{"name" => "宅北乡", "code" => "130131205000"},
      %{"name" => "北冶乡", "code" => "130131207000"},
      %{"name" => "上观音堂乡", "code" => "130131209000"},
      %{"name" => "杨家桥乡", "code" => "130131210000"},
      %{"name" => "营里乡", "code" => "130131211000"},
      %{"name" => "合河口乡", "code" => "130131212000"}
    ]

  def next(input) when input == "无极县" or input == "130130",
    do: [
      %{"name" => "无极镇", "code" => "130130100000"},
      %{"name" => "七汲镇", "code" => "130130101000"},
      %{"name" => "张段固镇", "code" => "130130102000"},
      %{"name" => "北苏镇", "code" => "130130103000"},
      %{"name" => "郭庄镇", "code" => "130130104000"},
      %{"name" => "大陈镇", "code" => "130130105000"},
      %{"name" => "东侯坊镇", "code" => "130130106000"},
      %{"name" => "里城道镇", "code" => "130130107000"},
      %{"name" => "高头回族乡", "code" => "130130200000"},
      %{"name" => "郝庄乡", "code" => "130130201000"},
      %{"name" => "南流乡", "code" => "130130204000"}
    ]

  def next(input) when input == "赞皇县" or input == "130129",
    do: [
      %{"name" => "赞皇镇", "code" => "130129100000"},
      %{"name" => "院头镇", "code" => "130129101000"},
      %{"name" => "南邢郭镇", "code" => "130129102000"},
      %{"name" => "嶂石岩镇", "code" => "130129103000"},
      %{"name" => "西龙门镇", "code" => "130129104000"},
      %{"name" => "西阳泽镇", "code" => "130129105000"},
      %{"name" => "许亭镇", "code" => "130129106000"},
      %{"name" => "南清河乡", "code" => "130129202000"},
      %{"name" => "土门乡", "code" => "130129204000"},
      %{"name" => "黄北坪乡", "code" => "130129205000"},
      %{"name" => "张楞乡", "code" => "130129208000"}
    ]

  def next(input) when input == "深泽县" or input == "130128",
    do: [
      %{"name" => "深泽镇", "code" => "130128100000"},
      %{"name" => "铁杆镇", "code" => "130128101000"},
      %{"name" => "赵八镇", "code" => "130128102000"},
      %{"name" => "大桥头镇", "code" => "130128103000"},
      %{"name" => "白庄乡", "code" => "130128200000"},
      %{"name" => "留村乡", "code" => "130128201000"}
    ]

  def next(input) when input == "高邑县" or input == "130127",
    do: [
      %{"name" => "高邑镇", "code" => "130127100000"},
      %{"name" => "大营镇", "code" => "130127101000"},
      %{"name" => "富村镇", "code" => "130127102000"},
      %{"name" => "万城镇", "code" => "130127103000"},
      %{"name" => "中韩镇", "code" => "130127104000"}
    ]

  def next(input) when input == "灵寿县" or input == "130126",
    do: [
      %{"name" => "灵寿镇", "code" => "130126100000"},
      %{"name" => "青同镇", "code" => "130126101000"},
      %{"name" => "塔上镇", "code" => "130126102000"},
      %{"name" => "陈庄镇", "code" => "130126103000"},
      %{"name" => "慈峪镇", "code" => "130126104000"},
      %{"name" => "岔头镇", "code" => "130126105000"},
      %{"name" => "三圣院乡", "code" => "130126200000"},
      %{"name" => "北洼乡", "code" => "130126201000"},
      %{"name" => "牛城乡", "code" => "130126202000"},
      %{"name" => "狗台乡", "code" => "130126203000"},
      %{"name" => "南寨乡", "code" => "130126204000"},
      %{"name" => "南燕川乡", "code" => "130126205000"},
      %{"name" => "北谭庄乡", "code" => "130126206000"},
      %{"name" => "寨头乡", "code" => "130126207000"},
      %{"name" => "南营乡", "code" => "130126208000"}
    ]

  def next(input) when input == "行唐县" or input == "130125",
    do: [
      %{"name" => "龙州镇", "code" => "130125100000"},
      %{"name" => "南桥镇", "code" => "130125101000"},
      %{"name" => "上碑镇", "code" => "130125102000"},
      %{"name" => "口头镇", "code" => "130125103000"},
      %{"name" => "上方镇", "code" => "130125104000"},
      %{"name" => "独羊岗乡", "code" => "130125200000"},
      %{"name" => "安香乡", "code" => "130125201000"},
      %{"name" => "只里乡", "code" => "130125202000"},
      %{"name" => "市同乡", "code" => "130125203000"},
      %{"name" => "翟营乡", "code" => "130125204000"},
      %{"name" => "城寨乡", "code" => "130125205000"},
      %{"name" => "玉亭乡", "code" => "130125207000"},
      %{"name" => "北河乡", "code" => "130125208000"},
      %{"name" => "上阎庄乡", "code" => "130125209000"},
      %{"name" => "九口子乡", "code" => "130125210000"},
      %{"name" => "河北行唐经济开发区", "code" => "130125400000"}
    ]

  def next(input) when input == "正定县" or input == "130123",
    do: [
      %{"name" => "诸福屯街道", "code" => "130123001000"},
      %{"name" => "三里屯街道", "code" => "130123002000"},
      %{"name" => "正定镇", "code" => "130123100000"},
      %{"name" => "新城铺镇", "code" => "130123102000"},
      %{"name" => "新安镇", "code" => "130123103000"},
      %{"name" => "南岗镇", "code" => "130123104000"},
      %{"name" => "曲阳桥镇", "code" => "130123105000"},
      %{"name" => "南牛镇", "code" => "130123106000"},
      %{"name" => "南楼乡", "code" => "130123201000"},
      %{"name" => "西平乐乡", "code" => "130123202000"}
    ]

  def next(input) when input == "井陉县" or input == "130121",
    do: [
      %{"name" => "微水镇", "code" => "130121100000"},
      %{"name" => "上安镇", "code" => "130121101000"},
      %{"name" => "天长镇", "code" => "130121102000"},
      %{"name" => "秀林镇", "code" => "130121103000"},
      %{"name" => "南峪镇", "code" => "130121104000"},
      %{"name" => "威州镇", "code" => "130121105000"},
      %{"name" => "小作镇", "code" => "130121106000"},
      %{"name" => "南障城镇", "code" => "130121107000"},
      %{"name" => "苍岩山镇", "code" => "130121108000"},
      %{"name" => "测鱼镇", "code" => "130121109000"},
      %{"name" => "吴家窑乡", "code" => "130121200000"},
      %{"name" => "北正乡", "code" => "130121201000"},
      %{"name" => "于家乡", "code" => "130121202000"},
      %{"name" => "孙庄乡", "code" => "130121203000"},
      %{"name" => "南陉乡", "code" => "130121204000"},
      %{"name" => "辛庄乡", "code" => "130121205000"},
      %{"name" => "南王庄乡", "code" => "130121206000"}
    ]

  def next(input) when input == "栾城区" or input == "130111",
    do: [
      %{"name" => "栾城镇", "code" => "130111100000"},
      %{"name" => "冶河镇", "code" => "130111103000"},
      %{"name" => "窦妪镇", "code" => "130111104000"},
      %{"name" => "楼底镇", "code" => "130111105000"},
      %{"name" => "南高乡", "code" => "130111200000"},
      %{"name" => "柳林屯乡", "code" => "130111201000"},
      %{"name" => "西营乡", "code" => "130111202000"}
    ]

  def next(input) when input == "鹿泉区" or input == "130110",
    do: [
      %{"name" => "获鹿镇", "code" => "130110100000"},
      %{"name" => "铜冶镇", "code" => "130110101000"},
      %{"name" => "寺家庄镇", "code" => "130110102000"},
      %{"name" => "上庄镇", "code" => "130110103000"},
      %{"name" => "李村镇", "code" => "130110104000"},
      %{"name" => "宜安镇", "code" => "130110105000"},
      %{"name" => "黄壁庄镇", "code" => "130110106000"},
      %{"name" => "大河镇", "code" => "130110107000"},
      %{"name" => "山尹村镇", "code" => "130110108000"},
      %{"name" => "石井乡", "code" => "130110200000"},
      %{"name" => "白鹿泉乡", "code" => "130110201000"},
      %{"name" => "上寨乡", "code" => "130110202000"},
      %{"name" => "河北鹿泉经济开发区", "code" => "130110500000"}
    ]

  def next(input) when input == "藁城区" or input == "130109",
    do: [
      %{"name" => "廉州镇", "code" => "130109100000"},
      %{"name" => "兴安镇", "code" => "130109101000"},
      %{"name" => "贾市庄镇", "code" => "130109102000"},
      %{"name" => "南营镇", "code" => "130109103000"},
      %{"name" => "梅花镇", "code" => "130109104000"},
      %{"name" => "岗上镇", "code" => "130109105000"},
      %{"name" => "南董镇", "code" => "130109107000"},
      %{"name" => "张家庄镇", "code" => "130109108000"},
      %{"name" => "南孟镇", "code" => "130109109000"},
      %{"name" => "增村镇", "code" => "130109110000"},
      %{"name" => "常安镇", "code" => "130109111000"},
      %{"name" => "西关镇", "code" => "130109112000"},
      %{"name" => "九门回族乡", "code" => "130109200000"},
      %{"name" => "石家庄经济技术开发区", "code" => "130109500000"}
    ]

  def next(input) when input == "裕华区" or input == "130108",
    do: [
      %{"name" => "裕兴街道", "code" => "130108001000"},
      %{"name" => "裕强街道", "code" => "130108002000"},
      %{"name" => "东苑街道", "code" => "130108003000"},
      %{"name" => "建通街道", "code" => "130108004000"},
      %{"name" => "槐底街道", "code" => "130108005000"},
      %{"name" => "裕华路街道", "code" => "130108006000"},
      %{"name" => "裕东街道", "code" => "130108007000"},
      %{"name" => "裕翔街道", "code" => "130108008000"},
      %{"name" => "建华南街道", "code" => "130108009000"},
      %{"name" => "方村镇", "code" => "130108101000"}
    ]

  def next(input) when input == "井陉矿区" or input == "130107",
    do: [
      %{"name" => "矿市街道", "code" => "130107001000"},
      %{"name" => "四微街道", "code" => "130107002000"},
      %{"name" => "贾庄镇", "code" => "130107100000"},
      %{"name" => "凤山镇", "code" => "130107101000"},
      %{"name" => "横涧乡", "code" => "130107200000"}
    ]

  def next(input) when input == "新华区" or input == "130105",
    do: [
      %{"name" => "革新街街道", "code" => "130105001000"},
      %{"name" => "新华路街道", "code" => "130105003000"},
      %{"name" => "宁安街道", "code" => "130105004000"},
      %{"name" => "东焦街道", "code" => "130105005000"},
      %{"name" => "西苑街道", "code" => "130105006000"},
      %{"name" => "合作路街道", "code" => "130105007000"},
      %{"name" => "联盟街道", "code" => "130105008000"},
      %{"name" => "石岗街道", "code" => "130105009000"},
      %{"name" => "天苑街道", "code" => "130105011000"},
      %{"name" => "北苑街道", "code" => "130105012000"},
      %{"name" => "赵陵铺路街道", "code" => "130105013000"},
      %{"name" => "西三庄街道", "code" => "130105014000"},
      %{"name" => "大郭街道", "code" => "130105015000"},
      %{"name" => "杜北街道", "code" => "130105016000"},
      %{"name" => "赵佗路街道", "code" => "130105017000"}
    ]

  def next(input) when input == "桥西区" or input == "130104",
    do: [
      %{"name" => "东里街道", "code" => "130104001000"},
      %{"name" => "中山街道", "code" => "130104002000"},
      %{"name" => "南长街道", "code" => "130104004000"},
      %{"name" => "维明街道", "code" => "130104005000"},
      %{"name" => "友谊街道", "code" => "130104007000"},
      %{"name" => "红旗街道", "code" => "130104008000"},
      %{"name" => "新石街道", "code" => "130104009000"},
      %{"name" => "苑东街道", "code" => "130104010000"},
      %{"name" => "西里街道", "code" => "130104011000"},
      %{"name" => "振头街道", "code" => "130104012000"},
      %{"name" => "留营街道", "code" => "130104013000"},
      %{"name" => "长兴街道", "code" => "130104014000"},
      %{"name" => "彭后街道", "code" => "130104015000"},
      %{"name" => "东风街道", "code" => "130104016000"},
      %{"name" => "东华街道", "code" => "130104017000"},
      %{"name" => "休门街道", "code" => "130104018000"},
      %{"name" => "汇通街道", "code" => "130104019000"}
    ]

  def next(input) when input == "长安区" or input == "130102",
    do: [
      %{"name" => "建北街道", "code" => "130102001000"},
      %{"name" => "青园街道", "code" => "130102002000"},
      %{"name" => "广安街道", "code" => "130102003000"},
      %{"name" => "育才街道", "code" => "130102004000"},
      %{"name" => "跃进街道", "code" => "130102005000"},
      %{"name" => "河东街道", "code" => "130102007000"},
      %{"name" => "长丰街道", "code" => "130102010000"},
      %{"name" => "谈固街道", "code" => "130102011000"},
      %{"name" => "中山东路街道", "code" => "130102012000"},
      %{"name" => "阜康街道", "code" => "130102013000"},
      %{"name" => "建安街道", "code" => "130102014000"},
      %{"name" => "胜北街道", "code" => "130102015000"},
      %{"name" => "西兆通镇", "code" => "130102100000"},
      %{"name" => "南村镇", "code" => "130102101000"},
      %{"name" => "高营镇", "code" => "130102102000"},
      %{"name" => "桃园镇", "code" => "130102103000"}
    ]

  def next(_), do: nil
end