defmodule ChinaAdminDivisions.Gen.Lv3x.M14 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "汾阳市" or input == "141182",
    do: [
      %{"name" => "文峰街道", "code" => "141182001000"},
      %{"name" => "太和桥街道", "code" => "141182002000"},
      %{"name" => "西河街道", "code" => "141182003000"},
      %{"name" => "贾家庄镇", "code" => "141182100000"},
      %{"name" => "杏花村镇", "code" => "141182101000"},
      %{"name" => "冀村镇", "code" => "141182102000"},
      %{"name" => "肖家庄镇", "code" => "141182103000"},
      %{"name" => "演武镇", "code" => "141182104000"},
      %{"name" => "三泉镇", "code" => "141182105000"},
      %{"name" => "石庄镇", "code" => "141182106000"},
      %{"name" => "杨家庄镇", "code" => "141182107000"},
      %{"name" => "峪道河镇", "code" => "141182108000"},
      %{"name" => "阳城镇", "code" => "141182109000"},
      %{"name" => "栗家庄镇", "code" => "141182110000"}
    ]

  def next(input) when input == "孝义市" or input == "141181",
    do: [
      %{"name" => "新义街道", "code" => "141181001000"},
      %{"name" => "中阳楼街道", "code" => "141181002000"},
      %{"name" => "振兴街道", "code" => "141181003000"},
      %{"name" => "胜溪湖街道", "code" => "141181004000"},
      %{"name" => "崇文街道", "code" => "141181005000"},
      %{"name" => "兑镇镇", "code" => "141181100000"},
      %{"name" => "阳泉曲镇", "code" => "141181101000"},
      %{"name" => "下堡镇", "code" => "141181102000"},
      %{"name" => "西辛庄镇", "code" => "141181103000"},
      %{"name" => "高阳镇", "code" => "141181104000"},
      %{"name" => "梧桐镇", "code" => "141181105000"},
      %{"name" => "柱濮镇", "code" => "141181106000"},
      %{"name" => "大孝堡镇", "code" => "141181107000"},
      %{"name" => "下栅乡", "code" => "141181201000"},
      %{"name" => "驿马乡", "code" => "141181202000"},
      %{"name" => "杜村乡", "code" => "141181204000"}
    ]

  def next(input) when input == "交口县" or input == "141130",
    do: [
      %{"name" => "水头镇", "code" => "141130100000"},
      %{"name" => "康城镇", "code" => "141130101000"},
      %{"name" => "双池镇", "code" => "141130102000"},
      %{"name" => "桃红坡镇", "code" => "141130103000"},
      %{"name" => "石口镇", "code" => "141130104000"},
      %{"name" => "回龙镇", "code" => "141130105000"},
      %{"name" => "温泉乡", "code" => "141130202000"}
    ]

  def next(input) when input == "中阳县" or input == "141129",
    do: [
      %{"name" => "宁乡镇", "code" => "141129100000"},
      %{"name" => "金罗镇", "code" => "141129101000"},
      %{"name" => "枝柯镇", "code" => "141129102000"},
      %{"name" => "武家庄镇", "code" => "141129103000"},
      %{"name" => "暖泉镇", "code" => "141129104000"},
      %{"name" => "下枣林乡", "code" => "141129201000"}
    ]

  def next(input) when input == "方山县" or input == "141128",
    do: [
      %{"name" => "圪洞镇", "code" => "141128100000"},
      %{"name" => "马坊镇", "code" => "141128101000"},
      %{"name" => "峪口镇", "code" => "141128102000"},
      %{"name" => "大武镇", "code" => "141128103000"},
      %{"name" => "北武当镇", "code" => "141128104000"},
      %{"name" => "积翠镇", "code" => "141128105000"}
    ]

  def next(input) when input == "岚县" or input == "141127",
    do: [
      %{"name" => "东村镇", "code" => "141127100000"},
      %{"name" => "岚城镇", "code" => "141127101000"},
      %{"name" => "普明镇", "code" => "141127102000"},
      %{"name" => "界河口镇", "code" => "141127103000"},
      %{"name" => "上明乡", "code" => "141127201000"},
      %{"name" => "王狮乡", "code" => "141127202000"},
      %{"name" => "梁家庄乡", "code" => "141127203000"},
      %{"name" => "顺会乡", "code" => "141127204000"},
      %{"name" => "社科乡", "code" => "141127206000"},
      %{"name" => "岚县普明工业园区", "code" => "141127400000"}
    ]

  def next(input) when input == "石楼县" or input == "141126",
    do: [
      %{"name" => "灵泉镇", "code" => "141126100000"},
      %{"name" => "罗村镇", "code" => "141126101000"},
      %{"name" => "义牒镇", "code" => "141126102000"},
      %{"name" => "小蒜镇", "code" => "141126103000"},
      %{"name" => "辛关镇", "code" => "141126104000"},
      %{"name" => "龙交乡", "code" => "141126200000"},
      %{"name" => "和合乡", "code" => "141126201000"},
      %{"name" => "曹家垣乡", "code" => "141126203000"},
      %{"name" => "裴沟乡", "code" => "141126204000"}
    ]

  def next(input) when input == "柳林县" or input == "141125",
    do: [
      %{"name" => "柳林镇", "code" => "141125100000"},
      %{"name" => "穆村镇", "code" => "141125101000"},
      %{"name" => "薛村镇", "code" => "141125102000"},
      %{"name" => "庄上镇", "code" => "141125103000"},
      %{"name" => "留誉镇", "code" => "141125104000"},
      %{"name" => "三交镇", "code" => "141125105000"},
      %{"name" => "成家庄镇", "code" => "141125106000"},
      %{"name" => "孟门镇", "code" => "141125107000"},
      %{"name" => "陈家湾镇", "code" => "141125108000"},
      %{"name" => "金家庄镇", "code" => "141125109000"},
      %{"name" => "李家湾乡", "code" => "141125200000"},
      %{"name" => "贾家垣乡", "code" => "141125201000"},
      %{"name" => "高家沟乡", "code" => "141125204000"},
      %{"name" => "石西乡", "code" => "141125205000"},
      %{"name" => "王家沟乡", "code" => "141125206000"}
    ]

  def next(input) when input == "临县" or input == "141124",
    do: [
      %{"name" => "临泉镇", "code" => "141124100000"},
      %{"name" => "白文镇", "code" => "141124101000"},
      %{"name" => "城庄镇", "code" => "141124102000"},
      %{"name" => "兔坂镇", "code" => "141124103000"},
      %{"name" => "克虎镇", "code" => "141124104000"},
      %{"name" => "三交镇", "code" => "141124105000"},
      %{"name" => "湍水头镇", "code" => "141124106000"},
      %{"name" => "林家坪镇", "code" => "141124107000"},
      %{"name" => "招贤镇", "code" => "141124108000"},
      %{"name" => "碛口镇", "code" => "141124109000"},
      %{"name" => "刘家会镇", "code" => "141124110000"},
      %{"name" => "丛罗峪镇", "code" => "141124111000"},
      %{"name" => "曲峪镇", "code" => "141124112000"},
      %{"name" => "木瓜坪乡", "code" => "141124200000"},
      %{"name" => "安业乡", "code" => "141124201000"},
      %{"name" => "玉坪乡", "code" => "141124202000"},
      %{"name" => "青凉寺乡", "code" => "141124203000"},
      %{"name" => "石白头乡", "code" => "141124204000"},
      %{"name" => "雷家碛乡", "code" => "141124205000"},
      %{"name" => "八堡乡", "code" => "141124206000"},
      %{"name" => "大禹乡", "code" => "141124207000"},
      %{"name" => "车赶乡", "code" => "141124208000"},
      %{"name" => "安家庄乡", "code" => "141124209000"}
    ]

  def next(input) when input == "兴县" or input == "141123",
    do: [
      %{"name" => "蔚汾镇", "code" => "141123100000"},
      %{"name" => "魏家滩镇", "code" => "141123101000"},
      %{"name" => "瓦塘镇", "code" => "141123102000"},
      %{"name" => "康宁镇", "code" => "141123103000"},
      %{"name" => "高家村镇", "code" => "141123104000"},
      %{"name" => "罗峪口镇", "code" => "141123105000"},
      %{"name" => "蔡家会镇", "code" => "141123106000"},
      %{"name" => "交楼申乡", "code" => "141123200000"},
      %{"name" => "东会乡", "code" => "141123202000"},
      %{"name" => "固贤乡", "code" => "141123203000"},
      %{"name" => "奥家湾乡", "code" => "141123204000"},
      %{"name" => "蔡家崖乡", "code" => "141123205000"},
      %{"name" => "孟家坪乡", "code" => "141123207000"},
      %{"name" => "赵家坪乡", "code" => "141123208000"},
      %{"name" => "圪垯上乡", "code" => "141123209000"},
      %{"name" => "兴县经济技术开发区", "code" => "141123400000"}
    ]

  def next(input) when input == "交城县" or input == "141122",
    do: [
      %{"name" => "天宁镇", "code" => "141122100000"},
      %{"name" => "夏家营镇", "code" => "141122101000"},
      %{"name" => "西营镇", "code" => "141122102000"},
      %{"name" => "水峪贯镇", "code" => "141122103000"},
      %{"name" => "西社镇", "code" => "141122104000"},
      %{"name" => "庞泉沟镇", "code" => "141122105000"},
      %{"name" => "洪相镇", "code" => "141122106000"},
      %{"name" => "东坡底乡", "code" => "141122202000"},
      %{"name" => "夏家营生态工业园区", "code" => "141122400000"}
    ]

  def next(input) when input == "文水县" or input == "141121",
    do: [
      %{"name" => "凤城镇", "code" => "141121100000"},
      %{"name" => "开栅镇", "code" => "141121101000"},
      %{"name" => "南庄镇", "code" => "141121102000"},
      %{"name" => "南安镇", "code" => "141121103000"},
      %{"name" => "刘胡兰镇", "code" => "141121104000"},
      %{"name" => "下曲镇", "code" => "141121105000"},
      %{"name" => "孝义镇", "code" => "141121106000"},
      %{"name" => "南武乡", "code" => "141121200000"},
      %{"name" => "西城乡", "code" => "141121201000"},
      %{"name" => "北张乡", "code" => "141121202000"},
      %{"name" => "马西乡", "code" => "141121203000"},
      %{"name" => "西槽头乡", "code" => "141121204000"}
    ]

  def next(input) when input == "离石区" or input == "141102",
    do: [
      %{"name" => "滨河街道", "code" => "141102001000"},
      %{"name" => "凤山街道", "code" => "141102002000"},
      %{"name" => "莲花池街道", "code" => "141102003000"},
      %{"name" => "城北街道", "code" => "141102004000"},
      %{"name" => "田家会街道", "code" => "141102005000"},
      %{"name" => "交口街道", "code" => "141102006000"},
      %{"name" => "西属巴街道", "code" => "141102007000"},
      %{"name" => "吴城镇", "code" => "141102100000"},
      %{"name" => "信义镇", "code" => "141102101000"},
      %{"name" => "枣林乡", "code" => "141102201000"},
      %{"name" => "坪头乡", "code" => "141102202000"}
    ]

  def next(input) when input == "霍州市" or input == "141082",
    do: [
      %{"name" => "鼓楼街道", "code" => "141082001000"},
      %{"name" => "北环路街道", "code" => "141082002000"},
      %{"name" => "南环路街道", "code" => "141082003000"},
      %{"name" => "开元街道", "code" => "141082004000"},
      %{"name" => "退沙街道", "code" => "141082005000"},
      %{"name" => "白龙镇", "code" => "141082100000"},
      %{"name" => "辛置镇", "code" => "141082101000"},
      %{"name" => "大张镇", "code" => "141082102000"},
      %{"name" => "李曹镇", "code" => "141082103000"},
      %{"name" => "陶唐峪乡", "code" => "141082200000"},
      %{"name" => "三教乡", "code" => "141082201000"},
      %{"name" => "师庄乡", "code" => "141082202000"}
    ]

  def next(input) when input == "侯马市" or input == "141081",
    do: [
      %{"name" => "路东街道", "code" => "141081001000"},
      %{"name" => "路西街道", "code" => "141081002000"},
      %{"name" => "浍滨街道", "code" => "141081003000"},
      %{"name" => "上马街道", "code" => "141081004000"},
      %{"name" => "张村街道", "code" => "141081005000"},
      %{"name" => "新田乡", "code" => "141081200000"},
      %{"name" => "高村乡", "code" => "141081201000"},
      %{"name" => "凤城乡", "code" => "141081202000"}
    ]

  def next(input) when input == "汾西县" or input == "141034",
    do: [
      %{"name" => "永安镇", "code" => "141034100000"},
      %{"name" => "对竹镇", "code" => "141034101000"},
      %{"name" => "勍香镇", "code" => "141034102000"},
      %{"name" => "和平镇", "code" => "141034103000"},
      %{"name" => "僧念镇", "code" => "141034104000"},
      %{"name" => "佃坪乡", "code" => "141034200000"},
      %{"name" => "团柏乡", "code" => "141034201000"}
    ]

  def next(input) when input == "蒲县" or input == "141033",
    do: [
      %{"name" => "蒲城镇", "code" => "141033100000"},
      %{"name" => "薛关镇", "code" => "141033101000"},
      %{"name" => "黑龙关镇", "code" => "141033102000"},
      %{"name" => "克城镇", "code" => "141033103000"},
      %{"name" => "乔家湾镇", "code" => "141033104000"},
      %{"name" => "山中乡", "code" => "141033200000"},
      %{"name" => "古县乡", "code" => "141033201000"},
      %{"name" => "太林乡", "code" => "141033204000"}
    ]

  def next(input) when input == "永和县" or input == "141032",
    do: [
      %{"name" => "芝河镇", "code" => "141032100000"},
      %{"name" => "桑壁镇", "code" => "141032101000"},
      %{"name" => "坡头乡", "code" => "141032203000"},
      %{"name" => "乾坤湾乡", "code" => "141032205000"},
      %{"name" => "望海寺乡", "code" => "141032206000"},
      %{"name" => "楼山乡", "code" => "141032207000"}
    ]

  def next(input) when input == "隰县" or input == "141031",
    do: [
      %{"name" => "龙泉镇", "code" => "141031100000"},
      %{"name" => "午城镇", "code" => "141031101000"},
      %{"name" => "黄土镇", "code" => "141031102000"},
      %{"name" => "阳头升乡", "code" => "141031200000"},
      %{"name" => "寨子乡", "code" => "141031201000"},
      %{"name" => "下李乡", "code" => "141031203000"},
      %{"name" => "城南乡", "code" => "141031204000"}
    ]

  def next(input) when input == "大宁县" or input == "141030",
    do: [
      %{"name" => "昕水镇", "code" => "141030100000"},
      %{"name" => "曲峨镇", "code" => "141030101000"},
      %{"name" => "太古镇", "code" => "141030102000"},
      %{"name" => "三多乡", "code" => "141030200000"},
      %{"name" => "太德乡", "code" => "141030201000"}
    ]

  def next(input) when input == "乡宁县" or input == "141029",
    do: [
      %{"name" => "昌宁镇", "code" => "141029100000"},
      %{"name" => "光华镇", "code" => "141029101000"},
      %{"name" => "台头镇", "code" => "141029102000"},
      %{"name" => "管头镇", "code" => "141029103000"},
      %{"name" => "西坡镇", "code" => "141029104000"},
      %{"name" => "双鹤乡", "code" => "141029200000"},
      %{"name" => "关王庙乡", "code" => "141029201000"},
      %{"name" => "尉庄乡", "code" => "141029202000"},
      %{"name" => "西交口乡", "code" => "141029203000"},
      %{"name" => "枣岭乡", "code" => "141029204000"}
    ]

  def next(input) when input == "吉县" or input == "141028",
    do: [
      %{"name" => "吉昌镇", "code" => "141028100000"},
      %{"name" => "屯里镇", "code" => "141028101000"},
      %{"name" => "壶口镇", "code" => "141028102000"},
      %{"name" => "车城乡", "code" => "141028200000"},
      %{"name" => "文城乡", "code" => "141028201000"},
      %{"name" => "柏山寺乡", "code" => "141028203000"},
      %{"name" => "中垛乡", "code" => "141028204000"}
    ]

  def next(input) when input == "浮山县" or input == "141027",
    do: [
      %{"name" => "天坛镇", "code" => "141027100000"},
      %{"name" => "响水河镇", "code" => "141027101000"},
      %{"name" => "张庄镇", "code" => "141027102000"},
      %{"name" => "北王镇", "code" => "141027103000"},
      %{"name" => "东张乡", "code" => "141027201000"},
      %{"name" => "槐埝乡", "code" => "141027202000"},
      %{"name" => "寨圪塔乡", "code" => "141027206000"}
    ]

  def next(input) when input == "安泽县" or input == "141026",
    do: [
      %{"name" => "府城镇", "code" => "141026100000"},
      %{"name" => "和川镇", "code" => "141026101000"},
      %{"name" => "唐城镇", "code" => "141026102000"},
      %{"name" => "冀氏镇", "code" => "141026103000"},
      %{"name" => "良马镇", "code" => "141026104000"},
      %{"name" => "马壁镇", "code" => "141026105000"}
    ]

  def next(input) when input == "古县" or input == "141025",
    do: [
      %{"name" => "岳阳镇", "code" => "141025100000"},
      %{"name" => "北平镇", "code" => "141025101000"},
      %{"name" => "古阳镇", "code" => "141025102000"},
      %{"name" => "旧县镇", "code" => "141025103000"},
      %{"name" => "三合镇", "code" => "141025104000"},
      %{"name" => "南垣乡", "code" => "141025202000"}
    ]

  def next(input) when input == "洪洞县" or input == "141024",
    do: [
      %{"name" => "大槐树镇", "code" => "141024100000"},
      %{"name" => "甘亭镇", "code" => "141024101000"},
      %{"name" => "曲亭镇", "code" => "141024102000"},
      %{"name" => "苏堡镇", "code" => "141024103000"},
      %{"name" => "广胜寺镇", "code" => "141024104000"},
      %{"name" => "明姜镇", "code" => "141024105000"},
      %{"name" => "赵城镇", "code" => "141024106000"},
      %{"name" => "万安镇", "code" => "141024107000"},
      %{"name" => "刘家垣镇", "code" => "141024108000"},
      %{"name" => "辛村镇", "code" => "141024109000"},
      %{"name" => "淹底乡", "code" => "141024200000"},
      %{"name" => "兴唐寺乡", "code" => "141024201000"},
      %{"name" => "堤村乡", "code" => "141024202000"},
      %{"name" => "龙马乡", "code" => "141024204000"},
      %{"name" => "山目乡", "code" => "141024207000"}
    ]

  def next(input) when input == "襄汾县" or input == "141023",
    do: [
      %{"name" => "新城镇", "code" => "141023100000"},
      %{"name" => "赵康镇", "code" => "141023101000"},
      %{"name" => "汾城镇", "code" => "141023102000"},
      %{"name" => "南贾镇", "code" => "141023103000"},
      %{"name" => "古城镇", "code" => "141023104000"},
      %{"name" => "襄陵镇", "code" => "141023105000"},
      %{"name" => "邓庄镇", "code" => "141023106000"},
      %{"name" => "陶寺乡", "code" => "141023200000"},
      %{"name" => "永固乡", "code" => "141023201000"},
      %{"name" => "景毛乡", "code" => "141023202000"},
      %{"name" => "西贾乡", "code" => "141023203000"},
      %{"name" => "南辛店乡", "code" => "141023204000"},
      %{"name" => "大邓乡", "code" => "141023205000"}
    ]

  def next(input) when input == "翼城县" or input == "141022",
    do: [
      %{"name" => "唐兴镇", "code" => "141022100000"},
      %{"name" => "南梁镇", "code" => "141022101000"},
      %{"name" => "里砦镇", "code" => "141022102000"},
      %{"name" => "隆化镇", "code" => "141022103000"},
      %{"name" => "桥上镇", "code" => "141022104000"},
      %{"name" => "西阎镇", "code" => "141022105000"},
      %{"name" => "王庄镇", "code" => "141022106000"},
      %{"name" => "中卫乡", "code" => "141022200000"},
      %{"name" => "南唐乡", "code" => "141022201000"}
    ]

  def next(input) when input == "曲沃县" or input == "141021",
    do: [
      %{"name" => "乐昌镇", "code" => "141021100000"},
      %{"name" => "史村镇", "code" => "141021101000"},
      %{"name" => "曲村镇", "code" => "141021102000"},
      %{"name" => "高显镇", "code" => "141021103000"},
      %{"name" => "里村镇", "code" => "141021104000"},
      %{"name" => "北董乡", "code" => "141021200000"},
      %{"name" => "杨谈乡", "code" => "141021201000"}
    ]

  def next(input) when input == "尧都区" or input == "141002",
    do: [
      %{"name" => "解放路街道", "code" => "141002001000"},
      %{"name" => "鼓楼西街街道", "code" => "141002002000"},
      %{"name" => "水塔街街道", "code" => "141002003000"},
      %{"name" => "南街街道", "code" => "141002004000"},
      %{"name" => "乡贤街街道", "code" => "141002005000"},
      %{"name" => "辛寺街街道", "code" => "141002006000"},
      %{"name" => "铁路东街道", "code" => "141002007000"},
      %{"name" => "车站街街道", "code" => "141002008000"},
      %{"name" => "汾河街道", "code" => "141002009000"},
      %{"name" => "滨河街道", "code" => "141002010000"},
      %{"name" => "屯里镇", "code" => "141002100000"},
      %{"name" => "乔李镇", "code" => "141002101000"},
      %{"name" => "大阳镇", "code" => "141002102000"},
      %{"name" => "县底镇", "code" => "141002103000"},
      %{"name" => "刘村镇", "code" => "141002104000"},
      %{"name" => "金殿镇", "code" => "141002105000"},
      %{"name" => "吴村镇", "code" => "141002106000"},
      %{"name" => "土门镇", "code" => "141002107000"},
      %{"name" => "魏村镇", "code" => "141002108000"},
      %{"name" => "尧庙镇", "code" => "141002109000"},
      %{"name" => "段店乡", "code" => "141002200000"},
      %{"name" => "贾得乡", "code" => "141002201000"},
      %{"name" => "一平垣乡", "code" => "141002203000"},
      %{"name" => "枕头乡", "code" => "141002204000"},
      %{"name" => "临汾经济开发区", "code" => "141002401000"}
    ]

  def next(input) when input == "原平市" or input == "140981",
    do: [
      %{"name" => "北城街道", "code" => "140981001000"},
      %{"name" => "南城街道", "code" => "140981002000"},
      %{"name" => "新原街道", "code" => "140981004000"},
      %{"name" => "吉祥街道", "code" => "140981005000"},
      %{"name" => "苏龙口镇", "code" => "140981101000"},
      %{"name" => "崞阳镇", "code" => "140981102000"},
      %{"name" => "大牛店镇", "code" => "140981103000"},
      %{"name" => "闫庄镇", "code" => "140981104000"},
      %{"name" => "轩岗镇", "code" => "140981106000"},
      %{"name" => "云水镇", "code" => "140981107000"},
      %{"name" => "同川镇", "code" => "140981108000"},
      %{"name" => "子干乡", "code" => "140981202000"},
      %{"name" => "中阳乡", "code" => "140981203000"},
      %{"name" => "沿沟乡", "code" => "140981204000"},
      %{"name" => "大林乡", "code" => "140981205000"},
      %{"name" => "西镇乡", "code" => "140981206000"},
      %{"name" => "王家庄乡", "code" => "140981208000"},
      %{"name" => "段家堡乡", "code" => "140981210000"},
      %{"name" => "山西鲁能晋北铝业工矿区", "code" => "140981400000"},
      %{"name" => "原平市石豹沟煤矿工矿区", "code" => "140981401000"},
      %{"name" => "原平农场", "code" => "140981403000"},
      %{"name" => "原平经济技术开发区", "code" => "140981404000"}
    ]

  def next(input) when input == "五台山风景名胜区" or input == "140971",
    do: [
      %{"name" => "台怀镇", "code" => "140971100000"},
      %{"name" => "石咀镇", "code" => "140971101000"},
      %{"name" => "金岗库乡", "code" => "140971200000"}
    ]

  def next(input) when input == "偏关县" or input == "140932",
    do: [
      %{"name" => "新关镇", "code" => "140932100000"},
      %{"name" => "老营镇", "code" => "140932102000"},
      %{"name" => "万家寨镇", "code" => "140932103000"},
      %{"name" => "水泉镇", "code" => "140932104000"},
      %{"name" => "老牛湾镇", "code" => "140932105000"},
      %{"name" => "尚峪镇", "code" => "140932106000"},
      %{"name" => "窑头乡", "code" => "140932200000"},
      %{"name" => "楼沟乡", "code" => "140932201000"}
    ]

  def next(input) when input == "保德县" or input == "140931",
    do: [
      %{"name" => "东关镇", "code" => "140931100000"},
      %{"name" => "义门镇", "code" => "140931101000"},
      %{"name" => "桥头镇", "code" => "140931102000"},
      %{"name" => "杨家湾镇", "code" => "140931103000"},
      %{"name" => "孙家沟镇", "code" => "140931104000"},
      %{"name" => "腰庄乡", "code" => "140931200000"},
      %{"name" => "韩家川乡", "code" => "140931201000"},
      %{"name" => "林遮峪乡", "code" => "140931202000"},
      %{"name" => "冯家川乡", "code" => "140931203000"},
      %{"name" => "土崖塔乡", "code" => "140931204000"},
      %{"name" => "南河沟乡", "code" => "140931208000"}
    ]

  def next(input) when input == "河曲县" or input == "140930",
    do: [
      %{"name" => "西口镇", "code" => "140930100000"},
      %{"name" => "楼子营镇", "code" => "140930101000"},
      %{"name" => "刘家塔镇", "code" => "140930102000"},
      %{"name" => "巡镇镇", "code" => "140930103000"},
      %{"name" => "旧县镇", "code" => "140930104000"},
      %{"name" => "沙泉镇", "code" => "140930105000"},
      %{"name" => "鹿固乡", "code" => "140930200000"},
      %{"name" => "单寨乡", "code" => "140930202000"},
      %{"name" => "土沟乡", "code" => "140930203000"},
      %{"name" => "沙坪乡", "code" => "140930205000"},
      %{"name" => "社梁乡", "code" => "140930206000"}
    ]

  def next(input) when input == "岢岚县" or input == "140929",
    do: [
      %{"name" => "岚漪镇", "code" => "140929100000"},
      %{"name" => "三井镇", "code" => "140929101000"},
      %{"name" => "宋家沟镇", "code" => "140929102000"},
      %{"name" => "高家会乡", "code" => "140929201000"},
      %{"name" => "李家沟乡", "code" => "140929202000"},
      %{"name" => "水峪贯乡", "code" => "140929203000"},
      %{"name" => "西豹峪乡", "code" => "140929204000"},
      %{"name" => "温泉乡", "code" => "140929205000"},
      %{"name" => "阳坪乡", "code" => "140929206000"},
      %{"name" => "大涧乡", "code" => "140929207000"},
      %{"name" => "岢岚县居民", "code" => "140929400000"}
    ]

  def next(input) when input == "五寨县" or input == "140928",
    do: [
      %{"name" => "砚城镇", "code" => "140928100000"},
      %{"name" => "小河头镇", "code" => "140928101000"},
      %{"name" => "三岔镇", "code" => "140928102000"},
      %{"name" => "前所乡", "code" => "140928200000"},
      %{"name" => "李家坪乡", "code" => "140928201000"},
      %{"name" => "孙家坪乡", "code" => "140928202000"},
      %{"name" => "胡会乡", "code" => "140928204000"},
      %{"name" => "韩家楼乡", "code" => "140928206000"},
      %{"name" => "东秀庄乡", "code" => "140928207000"},
      %{"name" => "杏岭子乡", "code" => "140928208000"}
    ]

  def next(input) when input == "神池县" or input == "140927",
    do: [
      %{"name" => "龙泉镇", "code" => "140927100000"},
      %{"name" => "义井镇", "code" => "140927101000"},
      %{"name" => "八角镇", "code" => "140927102000"},
      %{"name" => "东湖乡", "code" => "140927200000"},
      %{"name" => "贺职乡", "code" => "140927203000"},
      %{"name" => "长畛乡", "code" => "140927204000"},
      %{"name" => "烈堡乡", "code" => "140927205000"},
      %{"name" => "大严备乡", "code" => "140927206000"}
    ]

  def next(input) when input == "静乐县" or input == "140926",
    do: [
      %{"name" => "鹅城镇", "code" => "140926100000"},
      %{"name" => "杜家村镇", "code" => "140926101000"},
      %{"name" => "康家会镇", "code" => "140926102000"},
      %{"name" => "丰润镇", "code" => "140926103000"},
      %{"name" => "双路镇", "code" => "140926104000"},
      %{"name" => "王村镇", "code" => "140926105000"},
      %{"name" => "段家寨乡", "code" => "140926204000"},
      %{"name" => "辛村乡", "code" => "140926205000"},
      %{"name" => "神峪沟乡", "code" => "140926207000"},
      %{"name" => "娘子神乡", "code" => "140926208000"},
      %{"name" => "娑婆乡", "code" => "140926209000"},
      %{"name" => "赤泥窊乡", "code" => "140926210000"},
      %{"name" => "静乐县居民", "code" => "140926400000"}
    ]

  def next(input) when input == "宁武县" or input == "140925",
    do: [
      %{"name" => "凤凰镇", "code" => "140925100000"},
      %{"name" => "阳方口镇", "code" => "140925101000"},
      %{"name" => "东寨镇", "code" => "140925102000"},
      %{"name" => "石家庄镇", "code" => "140925103000"},
      %{"name" => "宁化镇", "code" => "140925104000"},
      %{"name" => "薛家洼乡", "code" => "140925200000"},
      %{"name" => "余庄乡", "code" => "140925201000"},
      %{"name" => "涔山乡", "code" => "140925202000"},
      %{"name" => "西马坊乡", "code" => "140925204000"},
      %{"name" => "迭台寺乡", "code" => "140925206000"},
      %{"name" => "怀道乡", "code" => "140925208000"},
      %{"name" => "东马坊乡", "code" => "140925209000"},
      %{"name" => "阳方口煤矿", "code" => "140925400000"},
      %{"name" => "宁武县居民", "code" => "140925401000"}
    ]

  def next(input) when input == "繁峙县" or input == "140924",
    do: [
      %{"name" => "繁城镇", "code" => "140924100000"},
      %{"name" => "砂河镇", "code" => "140924101000"},
      %{"name" => "大营镇", "code" => "140924102000"},
      %{"name" => "平型关镇", "code" => "140924103000"},
      %{"name" => "下茹越乡", "code" => "140924200000"},
      %{"name" => "光裕堡乡", "code" => "140924202000"},
      %{"name" => "集义庄乡", "code" => "140924203000"},
      %{"name" => "东山乡", "code" => "140924204000"},
      %{"name" => "金山铺乡", "code" => "140924205000"},
      %{"name" => "神堂堡乡", "code" => "140924208000"},
      %{"name" => "岩头乡", "code" => "140924209000"}
    ]

  def next(input) when input == "代县" or input == "140923",
    do: [
      %{"name" => "上馆镇", "code" => "140923100000"},
      %{"name" => "阳明堡镇", "code" => "140923101000"},
      %{"name" => "峨口镇", "code" => "140923102000"},
      %{"name" => "聂营镇", "code" => "140923103000"},
      %{"name" => "枣林镇", "code" => "140923104000"},
      %{"name" => "雁门关镇", "code" => "140923106000"},
      %{"name" => "峪口镇", "code" => "140923107000"},
      %{"name" => "新高乡", "code" => "140923200000"},
      %{"name" => "上磨坊乡", "code" => "140923202000"},
      %{"name" => "代县党群服务中心", "code" => "140923400000"}
    ]

  def next(input) when input == "五台县" or input == "140922",
    do: [
      %{"name" => "台城镇", "code" => "140922100000"},
      %{"name" => "耿镇镇", "code" => "140922102000"},
      %{"name" => "豆村镇", "code" => "140922103000"},
      %{"name" => "白家庄镇", "code" => "140922104000"},
      %{"name" => "东冶镇", "code" => "140922105000"},
      %{"name" => "建安镇", "code" => "140922107000"},
      %{"name" => "沟南乡", "code" => "140922200000"},
      %{"name" => "东雷乡", "code" => "140922201000"},
      %{"name" => "高洪口乡", "code" => "140922202000"},
      %{"name" => "门限石乡", "code" => "140922203000"},
      %{"name" => "陈家庄乡", "code" => "140922204000"},
      %{"name" => "蒋坊乡", "code" => "140922207000"},
      %{"name" => "阳白乡", "code" => "140922209000"},
      %{"name" => "茹村乡", "code" => "140922210000"}
    ]

  def next(input) when input == "定襄县" or input == "140921",
    do: [
      %{"name" => "晋昌镇", "code" => "140921100000"},
      %{"name" => "河边镇", "code" => "140921101000"},
      %{"name" => "宏道镇", "code" => "140921102000"},
      %{"name" => "季庄镇", "code" => "140921103000"},
      %{"name" => "蒋村镇", "code" => "140921104000"},
      %{"name" => "南王乡", "code" => "140921201000"},
      %{"name" => "神山乡", "code" => "140921203000"},
      %{"name" => "受禄乡", "code" => "140921205000"},
      %{"name" => "定襄县居民", "code" => "140921400000"}
    ]

  def next(input) when input == "忻府区" or input == "140902",
    do: [
      %{"name" => "秀容街道", "code" => "140902001000"},
      %{"name" => "长征街街道", "code" => "140902002000"},
      %{"name" => "新建路街道", "code" => "140902003000"},
      %{"name" => "云中路街道", "code" => "140902004000"},
      %{"name" => "九原街街道", "code" => "140902005000"},
      %{"name" => "旭来街街道", "code" => "140902006000"},
      %{"name" => "桥西街街道", "code" => "140902007000"},
      %{"name" => "奇村镇", "code" => "140902101000"},
      %{"name" => "三交镇", "code" => "140902102000"},
      %{"name" => "庄磨镇", "code" => "140902103000"},
      %{"name" => "豆罗镇", "code" => "140902104000"},
      %{"name" => "董村镇", "code" => "140902105000"},
      %{"name" => "西张镇", "code" => "140902106000"},
      %{"name" => "忻口镇", "code" => "140902107000"},
      %{"name" => "合索镇", "code" => "140902108000"},
      %{"name" => "兰村乡", "code" => "140902206000"},
      %{"name" => "东楼乡", "code" => "140902209000"},
      %{"name" => "北义井乡", "code" => "140902210000"}
    ]

  def next(input) when input == "河津市" or input == "140882",
    do: [
      %{"name" => "城区街道", "code" => "140882001000"},
      %{"name" => "清涧街道", "code" => "140882002000"},
      %{"name" => "赵家庄街道", "code" => "140882003000"},
      %{"name" => "阳村街道", "code" => "140882004000"},
      %{"name" => "樊村镇", "code" => "140882100000"},
      %{"name" => "僧楼镇", "code" => "140882101000"},
      %{"name" => "柴家镇", "code" => "140882102000"},
      %{"name" => "小梁乡", "code" => "140882200000"},
      %{"name" => "下化乡", "code" => "140882203000"},
      %{"name" => "山西铝厂", "code" => "140882400000"}
    ]

  def next(input) when input == "永济市" or input == "140881",
    do: [
      %{"name" => "城西街道", "code" => "140881001000"},
      %{"name" => "城北街道", "code" => "140881002000"},
      %{"name" => "城东街道", "code" => "140881003000"},
      %{"name" => "虞乡镇", "code" => "140881100000"},
      %{"name" => "卿头镇", "code" => "140881101000"},
      %{"name" => "开张镇", "code" => "140881102000"},
      %{"name" => "栲栳镇", "code" => "140881103000"},
      %{"name" => "蒲州镇", "code" => "140881104000"},
      %{"name" => "韩阳镇", "code" => "140881105000"},
      %{"name" => "张营镇", "code" => "140881106000"},
      %{"name" => "永济监狱", "code" => "140881400000"},
      %{"name" => "山西省永济虞乡强制隔离戒毒所", "code" => "140881401000"},
      %{"name" => "山西省永济董村强制隔离戒毒所", "code" => "140881402000"}
    ]

  def next(input) when input == "芮城县" or input == "140830",
    do: [
      %{"name" => "古魏镇", "code" => "140830100000"},
      %{"name" => "风陵渡镇", "code" => "140830101000"},
      %{"name" => "陌南镇", "code" => "140830102000"},
      %{"name" => "西陌镇", "code" => "140830103000"},
      %{"name" => "永乐镇", "code" => "140830104000"},
      %{"name" => "大王镇", "code" => "140830105000"},
      %{"name" => "阳城镇", "code" => "140830106000"},
      %{"name" => "南磑镇", "code" => "140830107000"},
      %{"name" => "东垆乡", "code" => "140830200000"},
      %{"name" => "学张乡", "code" => "140830202000"},
      %{"name" => "山西风陵渡经济开发区", "code" => "140830402000"}
    ]

  def next(input) when input == "平陆县" or input == "140829",
    do: [
      %{"name" => "圣人涧镇", "code" => "140829100000"},
      %{"name" => "常乐镇", "code" => "140829101000"},
      %{"name" => "张店镇", "code" => "140829102000"},
      %{"name" => "张村镇", "code" => "140829103000"},
      %{"name" => "曹川镇", "code" => "140829104000"},
      %{"name" => "三门镇", "code" => "140829105000"},
      %{"name" => "部官镇", "code" => "140829106000"},
      %{"name" => "洪池镇", "code" => "140829107000"},
      %{"name" => "杜马乡", "code" => "140829201000"},
      %{"name" => "平陆县社区", "code" => "140829400000"}
    ]

  def next(input) when input == "夏县" or input == "140828",
    do: [
      %{"name" => "瑶峰镇", "code" => "140828100000"},
      %{"name" => "庙前镇", "code" => "140828101000"},
      %{"name" => "裴介镇", "code" => "140828102000"},
      %{"name" => "水头镇", "code" => "140828103000"},
      %{"name" => "埝掌镇", "code" => "140828104000"},
      %{"name" => "泗交镇", "code" => "140828105000"},
      %{"name" => "禹王镇", "code" => "140828106000"},
      %{"name" => "尉郭乡", "code" => "140828200000"},
      %{"name" => "胡张乡", "code" => "140828202000"},
      %{"name" => "南大里乡", "code" => "140828203000"},
      %{"name" => "祁家河乡", "code" => "140828204000"}
    ]

  def next(input) when input == "垣曲县" or input == "140827",
    do: [
      %{"name" => "新城镇", "code" => "140827100000"},
      %{"name" => "历山镇", "code" => "140827101000"},
      %{"name" => "古城镇", "code" => "140827102000"},
      %{"name" => "王茅镇", "code" => "140827103000"},
      %{"name" => "毛家湾镇", "code" => "140827104000"},
      %{"name" => "英言镇", "code" => "140827105000"},
      %{"name" => "蒲掌乡", "code" => "140827200000"},
      %{"name" => "解峪乡", "code" => "140827202000"},
      %{"name" => "华峰乡", "code" => "140827203000"},
      %{"name" => "长直乡", "code" => "140827204000"},
      %{"name" => "皋落乡", "code" => "140827205000"},
      %{"name" => "垣曲县社区服务中心", "code" => "140827400000"}
    ]

  def next(input) when input == "绛县" or input == "140826",
    do: [
      %{"name" => "古绛镇", "code" => "140826100000"},
      %{"name" => "横水镇", "code" => "140826101000"},
      %{"name" => "陈村镇", "code" => "140826102000"},
      %{"name" => "卫庄镇", "code" => "140826103000"},
      %{"name" => "磨里镇", "code" => "140826104000"},
      %{"name" => "南樊镇", "code" => "140826105000"},
      %{"name" => "安峪镇", "code" => "140826106000"},
      %{"name" => "大交镇", "code" => "140826107000"},
      %{"name" => "郝庄乡", "code" => "140826200000"},
      %{"name" => "冷口乡", "code" => "140826201000"},
      %{"name" => "山西绛县经济开发区", "code" => "140826402000"}
    ]

  def next(input) when input == "新绛县" or input == "140825",
    do: [
      %{"name" => "龙兴镇", "code" => "140825100000"},
      %{"name" => "三泉镇", "code" => "140825101000"},
      %{"name" => "泽掌镇", "code" => "140825102000"},
      %{"name" => "北张镇", "code" => "140825103000"},
      %{"name" => "古交镇", "code" => "140825104000"},
      %{"name" => "万安镇", "code" => "140825105000"},
      %{"name" => "阳王镇", "code" => "140825106000"},
      %{"name" => "泉掌镇", "code" => "140825107000"},
      %{"name" => "横桥镇", "code" => "140825108000"},
      %{"name" => "新绛县社区", "code" => "140825400000"},
      %{"name" => "新绛县经济技术开发区", "code" => "140825498000"}
    ]

  def next(input) when input == "稷山县" or input == "140824",
    do: [
      %{"name" => "稷峰镇", "code" => "140824100000"},
      %{"name" => "西社镇", "code" => "140824101000"},
      %{"name" => "化峪镇", "code" => "140824102000"},
      %{"name" => "翟店镇", "code" => "140824103000"},
      %{"name" => "清河镇", "code" => "140824104000"},
      %{"name" => "蔡村乡", "code" => "140824200000"},
      %{"name" => "太阳乡", "code" => "140824201000"},
      %{"name" => "稷山县社区", "code" => "140824400000"},
      %{"name" => "稷山县经济技术开发区", "code" => "140824401000"}
    ]

  def next(input) when input == "闻喜县" or input == "140823",
    do: [
      %{"name" => "桐城镇", "code" => "140823100000"},
      %{"name" => "郭家庄镇", "code" => "140823101000"},
      %{"name" => "畖底镇", "code" => "140823102000"},
      %{"name" => "薛店镇", "code" => "140823103000"},
      %{"name" => "东镇镇", "code" => "140823104000"},
      %{"name" => "礼元镇", "code" => "140823105000"},
      %{"name" => "河底镇", "code" => "140823106000"},
      %{"name" => "阳隅镇", "code" => "140823107000"},
      %{"name" => "侯村镇", "code" => "140823108000"},
      %{"name" => "裴社镇", "code" => "140823109000"},
      %{"name" => "后宫乡", "code" => "140823204000"},
      %{"name" => "石门乡", "code" => "140823205000"},
      %{"name" => "闻喜县社区", "code" => "140823400000"}
    ]

  def next(input) when input == "万荣县" or input == "140822",
    do: [
      %{"name" => "解店镇", "code" => "140822100000"},
      %{"name" => "通化镇", "code" => "140822101000"},
      %{"name" => "汉薛镇", "code" => "140822102000"},
      %{"name" => "荣河镇", "code" => "140822103000"},
      %{"name" => "裴庄镇", "code" => "140822104000"},
      %{"name" => "高村镇", "code" => "140822105000"},
      %{"name" => "万泉乡", "code" => "140822200000"},
      %{"name" => "里望乡", "code" => "140822201000"},
      %{"name" => "西村乡", "code" => "140822202000"},
      %{"name" => "南张乡", "code" => "140822203000"},
      %{"name" => "皇甫乡", "code" => "140822205000"},
      %{"name" => "贾村乡", "code" => "140822206000"},
      %{"name" => "王显乡", "code" => "140822207000"},
      %{"name" => "光华乡", "code" => "140822208000"}
    ]

  def next(input) when input == "临猗县" or input == "140821",
    do: [
      %{"name" => "猗氏镇", "code" => "140821100000"},
      %{"name" => "嵋阳镇", "code" => "140821101000"},
      %{"name" => "临晋镇", "code" => "140821102000"},
      %{"name" => "七级镇", "code" => "140821103000"},
      %{"name" => "东张镇", "code" => "140821104000"},
      %{"name" => "孙吉镇", "code" => "140821105000"},
      %{"name" => "三管镇", "code" => "140821106000"},
      %{"name" => "牛杜镇", "code" => "140821107000"},
      %{"name" => "耽子镇", "code" => "140821108000"},
      %{"name" => "角杯镇", "code" => "140821109000"},
      %{"name" => "楚侯乡", "code" => "140821200000"},
      %{"name" => "庙上乡", "code" => "140821201000"},
      %{"name" => "北辛乡", "code" => "140821203000"},
      %{"name" => "北景乡", "code" => "140821204000"}
    ]

  def next(input) when input == "盐湖区" or input == "140802",
    do: [
      %{"name" => "中城街道", "code" => "140802001000"},
      %{"name" => "东城街道", "code" => "140802002000"},
      %{"name" => "西城街道", "code" => "140802003000"},
      %{"name" => "南城街道", "code" => "140802004000"},
      %{"name" => "北城街道", "code" => "140802005000"},
      %{"name" => "安邑街道", "code" => "140802006000"},
      %{"name" => "大渠街道", "code" => "140802007000"},
      %{"name" => "姚孟街道", "code" => "140802008000"},
      %{"name" => "解州镇", "code" => "140802100000"},
      %{"name" => "龙居镇", "code" => "140802101000"},
      %{"name" => "北相镇", "code" => "140802102000"},
      %{"name" => "泓芝驿镇", "code" => "140802103000"},
      %{"name" => "三路里镇", "code" => "140802104000"},
      %{"name" => "陶村镇", "code" => "140802105000"},
      %{"name" => "东郭镇", "code" => "140802106000"},
      %{"name" => "席张乡", "code" => "140802200000"},
      %{"name" => "金井乡", "code" => "140802201000"},
      %{"name" => "王范乡", "code" => "140802202000"},
      %{"name" => "冯村乡", "code" => "140802203000"},
      %{"name" => "上郭乡", "code" => "140802204000"},
      %{"name" => "上王乡", "code" => "140802205000"},
      %{"name" => "运城经济技术开发区", "code" => "140802404000"}
    ]

  def next(input) when input == "介休市" or input == "140781",
    do: [
      %{"name" => "北关街道", "code" => "140781001000"},
      %{"name" => "西关街道", "code" => "140781002000"},
      %{"name" => "东南街道", "code" => "140781003000"},
      %{"name" => "西南街道", "code" => "140781004000"},
      %{"name" => "北坛街道", "code" => "140781005000"},
      %{"name" => "义安镇", "code" => "140781100000"},
      %{"name" => "张兰镇", "code" => "140781101000"},
      %{"name" => "连福镇", "code" => "140781102000"},
      %{"name" => "洪山镇", "code" => "140781103000"},
      %{"name" => "龙凤镇", "code" => "140781104000"},
      %{"name" => "绵山镇", "code" => "140781105000"},
      %{"name" => "义棠镇", "code" => "140781106000"},
      %{"name" => "城关乡", "code" => "140781200000"},
      %{"name" => "宋古乡", "code" => "140781201000"}
    ]

  def next(input) when input == "灵石县" or input == "140729",
    do: [
      %{"name" => "翠峰镇", "code" => "140729100000"},
      %{"name" => "静升镇", "code" => "140729101000"},
      %{"name" => "两渡镇", "code" => "140729102000"},
      %{"name" => "夏门镇", "code" => "140729103000"},
      %{"name" => "南关镇", "code" => "140729104000"},
      %{"name" => "段纯镇", "code" => "140729105000"},
      %{"name" => "王禹乡", "code" => "140729202000"},
      %{"name" => "坛镇乡", "code" => "140729203000"},
      %{"name" => "梁家焉乡", "code" => "140729204000"},
      %{"name" => "交口乡", "code" => "140729205000"},
      %{"name" => "灵石县城区社会事务服务中心", "code" => "140729403000"}
    ]

  def next(input) when input == "平遥县" or input == "140728",
    do: [
      %{"name" => "古城街道", "code" => "140728001000"},
      %{"name" => "城东街道", "code" => "140728002000"},
      %{"name" => "城西街道", "code" => "140728003000"},
      %{"name" => "古陶镇", "code" => "140728100000"},
      %{"name" => "段村镇", "code" => "140728101000"},
      %{"name" => "东泉镇", "code" => "140728102000"},
      %{"name" => "洪善镇", "code" => "140728103000"},
      %{"name" => "宁固镇", "code" => "140728104000"},
      %{"name" => "南政乡", "code" => "140728200000"},
      %{"name" => "中都乡", "code" => "140728201000"},
      %{"name" => "岳壁乡", "code" => "140728202000"},
      %{"name" => "卜宜乡", "code" => "140728203000"},
      %{"name" => "朱坑乡", "code" => "140728205000"},
      %{"name" => "襄垣乡", "code" => "140728206000"},
      %{"name" => "杜家庄乡", "code" => "140728207000"},
      %{"name" => "香乐乡", "code" => "140728208000"}
    ]

  def next(input) when input == "祁县" or input == "140727",
    do: [
      %{"name" => "昭馀镇", "code" => "140727100000"},
      %{"name" => "东观镇", "code" => "140727101000"},
      %{"name" => "古县镇", "code" => "140727102000"},
      %{"name" => "贾令镇", "code" => "140727103000"},
      %{"name" => "城赵镇", "code" => "140727104000"},
      %{"name" => "来远镇", "code" => "140727105000"},
      %{"name" => "峪口乡", "code" => "140727201000"},
      %{"name" => "祁县经济开发区", "code" => "140727400000"},
      %{"name" => "城区", "code" => "140727404000"}
    ]

  def next(input) when input == "寿阳县" or input == "140725",
    do: [
      %{"name" => "朝阳镇", "code" => "140725100000"},
      %{"name" => "南燕竹镇", "code" => "140725101000"},
      %{"name" => "宗艾镇", "code" => "140725102000"},
      %{"name" => "平头镇", "code" => "140725103000"},
      %{"name" => "松塔镇", "code" => "140725104000"},
      %{"name" => "西洛镇", "code" => "140725105000"},
      %{"name" => "尹灵芝镇", "code" => "140725106000"},
      %{"name" => "平舒乡", "code" => "140725200000"},
      %{"name" => "解愁乡", "code" => "140725201000"},
      %{"name" => "温家庄乡", "code" => "140725202000"},
      %{"name" => "景尚乡", "code" => "140725203000"},
      %{"name" => "羊头崖乡", "code" => "140725205000"}
    ]

  def next(input) when input == "昔阳县" or input == "140724",
    do: [
      %{"name" => "乐平镇", "code" => "140724100000"},
      %{"name" => "皋落镇", "code" => "140724101000"},
      %{"name" => "冶头镇", "code" => "140724102000"},
      %{"name" => "沾尚镇", "code" => "140724103000"},
      %{"name" => "大寨镇", "code" => "140724104000"},
      %{"name" => "李家庄乡", "code" => "140724200000"},
      %{"name" => "界都乡", "code" => "140724201000"},
      %{"name" => "三都乡", "code" => "140724202000"},
      %{"name" => "赵壁乡", "code" => "140724203000"},
      %{"name" => "孔氏乡", "code" => "140724204000"},
      %{"name" => "城区", "code" => "140724400000"}
    ]

  def next(input) when input == "和顺县" or input == "140723",
    do: [
      %{"name" => "义兴镇", "code" => "140723100000"},
      %{"name" => "李阳镇", "code" => "140723101000"},
      %{"name" => "松烟镇", "code" => "140723102000"},
      %{"name" => "青城镇", "code" => "140723103000"},
      %{"name" => "横岭镇", "code" => "140723104000"},
      %{"name" => "喂马乡", "code" => "140723200000"},
      %{"name" => "平松乡", "code" => "140723201000"},
      %{"name" => "马坊乡", "code" => "140723203000"},
      %{"name" => "城区", "code" => "140723400000"}
    ]

  def next(input) when input == "左权县" or input == "140722",
    do: [
      %{"name" => "辽阳镇", "code" => "140722100000"},
      %{"name" => "桐峪镇", "code" => "140722101000"},
      %{"name" => "麻田镇", "code" => "140722102000"},
      %{"name" => "芹泉镇", "code" => "140722103000"},
      %{"name" => "拐儿镇", "code" => "140722104000"},
      %{"name" => "寒王乡", "code" => "140722200000"},
      %{"name" => "石匣乡", "code" => "140722201000"},
      %{"name" => "羊角乡", "code" => "140722204000"},
      %{"name" => "城区", "code" => "140722400000"}
    ]

  def next(input) when input == "榆社县" or input == "140721",
    do: [
      %{"name" => "箕城镇", "code" => "140721100000"},
      %{"name" => "云簇镇", "code" => "140721101000"},
      %{"name" => "郝北镇", "code" => "140721102000"},
      %{"name" => "社城镇", "code" => "140721103000"},
      %{"name" => "河峪乡", "code" => "140721200000"},
      %{"name" => "北寨乡", "code" => "140721201000"},
      %{"name" => "西马乡", "code" => "140721202000"},
      %{"name" => "城区", "code" => "140721400000"}
    ]

  def next(input) when input == "太谷区" or input == "140703",
    do: [
      %{"name" => "胡村镇", "code" => "140703101000"},
      %{"name" => "范村镇", "code" => "140703102000"},
      %{"name" => "水秀镇", "code" => "140703103000"},
      %{"name" => "侯城乡", "code" => "140703200000"},
      %{"name" => "北洸乡", "code" => "140703201000"},
      %{"name" => "阳邑乡", "code" => "140703203000"},
      %{"name" => "小白乡", "code" => "140703204000"},
      %{"name" => "任村乡", "code" => "140703205000"},
      %{"name" => "白塔区", "code" => "140703401000"},
      %{"name" => "北城区", "code" => "140703402000"},
      %{"name" => "南城区", "code" => "140703403000"}
    ]

  def next(input) when input == "榆次区" or input == "140702",
    do: [
      %{"name" => "北关街道", "code" => "140702001000"},
      %{"name" => "锦纶街道", "code" => "140702002000"},
      %{"name" => "新华街道", "code" => "140702003000"},
      %{"name" => "西南街道", "code" => "140702004000"},
      %{"name" => "路西街道", "code" => "140702005000"},
      %{"name" => "经纬街道", "code" => "140702006000"},
      %{"name" => "安宁街道", "code" => "140702007000"},
      %{"name" => "新建街道", "code" => "140702008000"},
      %{"name" => "晋华街道", "code" => "140702009000"},
      %{"name" => "乌金山镇", "code" => "140702100000"},
      %{"name" => "东阳镇", "code" => "140702101000"},
      %{"name" => "长凝镇", "code" => "140702103000"},
      %{"name" => "北田镇", "code" => "140702104000"},
      %{"name" => "修文镇", "code" => "140702105000"},
      %{"name" => "郭家堡乡", "code" => "140702200000"},
      %{"name" => "张庆乡", "code" => "140702201000"},
      %{"name" => "庄子乡", "code" => "140702202000"},
      %{"name" => "东赵乡", "code" => "140702203000"},
      %{"name" => "山西转型综合改革示范区晋中开发区", "code" => "140702401000"},
      %{"name" => "榆次区使赵乡社会事务服务中心", "code" => "140702402000"}
    ]

  def next(input) when input == "怀仁市" or input == "140681",
    do: [
      %{"name" => "云东街道", "code" => "140681001000"},
      %{"name" => "云中街道", "code" => "140681002000"},
      %{"name" => "云西街道", "code" => "140681003000"},
      %{"name" => "吴家窑镇", "code" => "140681101000"},
      %{"name" => "金沙滩镇", "code" => "140681102000"},
      %{"name" => "毛家皂镇", "code" => "140681103000"},
      %{"name" => "何家堡乡", "code" => "140681200000"},
      %{"name" => "新家园乡", "code" => "140681201000"},
      %{"name" => "亲和乡", "code" => "140681202000"},
      %{"name" => "海北头乡", "code" => "140681203000"},
      %{"name" => "河头乡", "code" => "140681205000"},
      %{"name" => "金沙滩农牧场", "code" => "140681500000"},
      %{"name" => "金沙滩林场", "code" => "140681501000"}
    ]

  def next(input) when input == "山西朔州经济开发区" or input == "140671",
    do: [%{"name" => "山西朔州经济开发区街道", "code" => "140671400000"}]

  def next(input) when input == "右玉县" or input == "140623",
    do: [
      %{"name" => "新城镇", "code" => "140623100000"},
      %{"name" => "右卫镇", "code" => "140623101000"},
      %{"name" => "威远镇", "code" => "140623102000"},
      %{"name" => "元堡子镇", "code" => "140623103000"},
      %{"name" => "牛心堡乡", "code" => "140623200000"},
      %{"name" => "高家堡乡", "code" => "140623202000"},
      %{"name" => "杨千河乡", "code" => "140623204000"},
      %{"name" => "李达窑乡", "code" => "140623205000"}
    ]

  def next(input) when input == "应县" or input == "140622",
    do: [
      %{"name" => "金城镇", "code" => "140622100000"},
      %{"name" => "南河种镇", "code" => "140622101000"},
      %{"name" => "下社镇", "code" => "140622102000"},
      %{"name" => "镇子梁乡", "code" => "140622200000"},
      %{"name" => "义井乡", "code" => "140622201000"},
      %{"name" => "臧寨乡", "code" => "140622202000"},
      %{"name" => "大黄巍乡", "code" => "140622203000"},
      %{"name" => "杏寨乡", "code" => "140622204000"},
      %{"name" => "下马峪乡", "code" => "140622205000"},
      %{"name" => "南泉乡", "code" => "140622206000"},
      %{"name" => "大临河乡", "code" => "140622207000"},
      %{"name" => "白马石乡", "code" => "140622208000"}
    ]

  def next(input) when input == "山阴县" or input == "140621",
    do: [
      %{"name" => "玉井镇", "code" => "140621100000"},
      %{"name" => "北周庄镇", "code" => "140621101000"},
      %{"name" => "古城镇", "code" => "140621102000"},
      %{"name" => "岱岳镇", "code" => "140621103000"},
      %{"name" => "广武镇", "code" => "140621104000"},
      %{"name" => "吴马营乡", "code" => "140621200000"},
      %{"name" => "马营乡", "code" => "140621201000"},
      %{"name" => "下喇叭乡", "code" => "140621202000"},
      %{"name" => "合盛堡乡", "code" => "140621203000"},
      %{"name" => "安荣乡", "code" => "140621205000"},
      %{"name" => "薛圐圙乡", "code" => "140621206000"},
      %{"name" => "马营庄乡", "code" => "140621209000"}
    ]

  def next(input) when input == "平鲁区" or input == "140603",
    do: [
      %{"name" => "井坪镇", "code" => "140603100000"},
      %{"name" => "凤凰城镇", "code" => "140603101000"},
      %{"name" => "白堂乡", "code" => "140603200000"},
      %{"name" => "陶村乡", "code" => "140603201000"},
      %{"name" => "下水头乡", "code" => "140603202000"},
      %{"name" => "双碾乡", "code" => "140603203000"},
      %{"name" => "阻虎乡", "code" => "140603204000"},
      %{"name" => "高石庄乡", "code" => "140603205000"},
      %{"name" => "西水界乡", "code" => "140603206000"},
      %{"name" => "下面高乡", "code" => "140603207000"},
      %{"name" => "向阳堡乡", "code" => "140603209000"},
      %{"name" => "榆岭乡", "code" => "140603210000"}
    ]

  def next(input) when input == "朔城区" or input == "140602",
    do: [
      %{"name" => "北城街道", "code" => "140602001000"},
      %{"name" => "南城街道", "code" => "140602002000"},
      %{"name" => "神头街道", "code" => "140602003000"},
      %{"name" => "北旺庄街道", "code" => "140602004000"},
      %{"name" => "神头镇", "code" => "140602100000"},
      %{"name" => "利民镇", "code" => "140602101000"},
      %{"name" => "下团堡乡", "code" => "140602200000"},
      %{"name" => "小平易乡", "code" => "140602201000"},
      %{"name" => "滋润乡", "code" => "140602202000"},
      %{"name" => "南榆林乡", "code" => "140602204000"},
      %{"name" => "贾庄乡", "code" => "140602205000"},
      %{"name" => "沙塄河乡", "code" => "140602206000"},
      %{"name" => "窑子头乡", "code" => "140602207000"},
      %{"name" => "张蔡庄乡", "code" => "140602208000"}
    ]

  def next(input) when input == "高平市" or input == "140581",
    do: [
      %{"name" => "北城街道", "code" => "140581001000"},
      %{"name" => "东城街道", "code" => "140581002000"},
      %{"name" => "南城街道", "code" => "140581003000"},
      %{"name" => "米山镇", "code" => "140581101000"},
      %{"name" => "三甲镇", "code" => "140581102000"},
      %{"name" => "神农镇", "code" => "140581103000"},
      %{"name" => "陈区镇", "code" => "140581104000"},
      %{"name" => "北诗镇", "code" => "140581105000"},
      %{"name" => "河西镇", "code" => "140581106000"},
      %{"name" => "马村镇", "code" => "140581107000"},
      %{"name" => "野川镇", "code" => "140581108000"},
      %{"name" => "寺庄镇", "code" => "140581109000"},
      %{"name" => "建宁乡", "code" => "140581201000"},
      %{"name" => "石末乡", "code" => "140581202000"},
      %{"name" => "原村乡", "code" => "140581203000"}
    ]

  def next(input) when input == "泽州县" or input == "140525",
    do: [
      %{"name" => "南村镇", "code" => "140525100000"},
      %{"name" => "下村镇", "code" => "140525101000"},
      %{"name" => "大东沟镇", "code" => "140525102000"},
      %{"name" => "周村镇", "code" => "140525103000"},
      %{"name" => "犁川镇", "code" => "140525104000"},
      %{"name" => "晋庙铺镇", "code" => "140525105000"},
      %{"name" => "金村镇", "code" => "140525106000"},
      %{"name" => "高都镇", "code" => "140525107000"},
      %{"name" => "巴公镇", "code" => "140525108000"},
      %{"name" => "大阳镇", "code" => "140525109000"},
      %{"name" => "山河镇", "code" => "140525110000"},
      %{"name" => "大箕镇", "code" => "140525111000"},
      %{"name" => "柳树口镇", "code" => "140525112000"},
      %{"name" => "北义城镇", "code" => "140525113000"},
      %{"name" => "川底镇", "code" => "140525114000"},
      %{"name" => "南岭镇", "code" => "140525115000"}
    ]

  def next(input) when input == "陵川县" or input == "140524",
    do: [
      %{"name" => "崇文镇", "code" => "140524100000"},
      %{"name" => "礼义镇", "code" => "140524101000"},
      %{"name" => "附城镇", "code" => "140524102000"},
      %{"name" => "西河底镇", "code" => "140524103000"},
      %{"name" => "平城镇", "code" => "140524104000"},
      %{"name" => "杨村镇", "code" => "140524105000"},
      %{"name" => "潞城镇", "code" => "140524106000"},
      %{"name" => "夺火乡", "code" => "140524204000"},
      %{"name" => "马圪当乡", "code" => "140524206000"},
      %{"name" => "古郊乡", "code" => "140524207000"},
      %{"name" => "六泉乡", "code" => "140524209000"}
    ]

  def next(input) when input == "阳城县" or input == "140522",
    do: [
      %{"name" => "凤城镇", "code" => "140522100000"},
      %{"name" => "北留镇", "code" => "140522101000"},
      %{"name" => "润城镇", "code" => "140522102000"},
      %{"name" => "町店镇", "code" => "140522103000"},
      %{"name" => "芹池镇", "code" => "140522104000"},
      %{"name" => "次营镇", "code" => "140522105000"},
      %{"name" => "横河镇", "code" => "140522106000"},
      %{"name" => "河北镇", "code" => "140522107000"},
      %{"name" => "蟒河镇", "code" => "140522108000"},
      %{"name" => "东冶镇", "code" => "140522109000"},
      %{"name" => "演礼镇", "code" => "140522110000"},
      %{"name" => "白桑镇", "code" => "140522111000"},
      %{"name" => "寺头乡", "code" => "140522201000"},
      %{"name" => "西河乡", "code" => "140522202000"},
      %{"name" => "董封乡", "code" => "140522205000"}
    ]

  def next(input) when input == "沁水县" or input == "140521",
    do: [
      %{"name" => "龙港镇", "code" => "140521100000"},
      %{"name" => "中村镇", "code" => "140521101000"},
      %{"name" => "郑庄镇", "code" => "140521102000"},
      %{"name" => "端氏镇", "code" => "140521103000"},
      %{"name" => "嘉峰镇", "code" => "140521104000"},
      %{"name" => "郑村镇", "code" => "140521105000"},
      %{"name" => "柿庄镇", "code" => "140521106000"},
      %{"name" => "土沃乡", "code" => "140521201000"},
      %{"name" => "张村乡", "code" => "140521202000"},
      %{"name" => "胡底乡", "code" => "140521204000"},
      %{"name" => "固县乡", "code" => "140521205000"},
      %{"name" => "十里乡", "code" => "140521206000"}
    ]

  def next(input) when input == "城区" or input == "140502",
    do: [
      %{"name" => "东街街道", "code" => "140502001000"},
      %{"name" => "西街街道", "code" => "140502002000"},
      %{"name" => "南街街道", "code" => "140502003000"},
      %{"name" => "北街街道", "code" => "140502004000"},
      %{"name" => "钟家庄街道", "code" => "140502006000"},
      %{"name" => "西上庄街道", "code" => "140502007000"},
      %{"name" => "开发区街道", "code" => "140502009000"},
      %{"name" => "北石店镇", "code" => "140502100000"}
    ]

  def next(input) when input == "沁源县" or input == "140431",
    do: [
      %{"name" => "沁河镇", "code" => "140431100000"},
      %{"name" => "郭道镇", "code" => "140431101000"},
      %{"name" => "灵空山镇", "code" => "140431102000"},
      %{"name" => "王和镇", "code" => "140431103000"},
      %{"name" => "王陶镇", "code" => "140431105000"},
      %{"name" => "景凤镇", "code" => "140431107000"},
      %{"name" => "中峪乡", "code" => "140431200000"},
      %{"name" => "法中乡", "code" => "140431201000"},
      %{"name" => "交口乡", "code" => "140431202000"},
      %{"name" => "聪子峪乡", "code" => "140431203000"},
      %{"name" => "韩洪乡", "code" => "140431204000"},
      %{"name" => "赤石桥乡", "code" => "140431207000"},
      %{"name" => "沁源经济技术开发区", "code" => "140431400000"}
    ]

  def next(input) when input == "沁县" or input == "140430",
    do: [
      %{"name" => "定昌镇", "code" => "140430100000"},
      %{"name" => "郭村镇", "code" => "140430101000"},
      %{"name" => "故县镇", "code" => "140430102000"},
      %{"name" => "新店镇", "code" => "140430103000"},
      %{"name" => "漳源镇", "code" => "140430104000"},
      %{"name" => "册村镇", "code" => "140430105000"},
      %{"name" => "沁州黄镇", "code" => "140430106000"},
      %{"name" => "南里镇", "code" => "140430107000"},
      %{"name" => "松村镇", "code" => "140430108000"},
      %{"name" => "牛寺乡", "code" => "140430203000"},
      %{"name" => "杨安乡", "code" => "140430206000"},
      %{"name" => "沁县现代农业产业示范区", "code" => "140430400000"}
    ]

  def next(input) when input == "武乡县" or input == "140429",
    do: [
      %{"name" => "丰州镇", "code" => "140429100000"},
      %{"name" => "洪水镇", "code" => "140429101000"},
      %{"name" => "蟠龙镇", "code" => "140429102000"},
      %{"name" => "监漳镇", "code" => "140429103000"},
      %{"name" => "故城镇", "code" => "140429104000"},
      %{"name" => "韩北镇", "code" => "140429105000"},
      %{"name" => "大有乡", "code" => "140429202000"},
      %{"name" => "贾豁乡", "code" => "140429203000"},
      %{"name" => "上司乡", "code" => "140429205000"},
      %{"name" => "石北乡", "code" => "140429206000"},
      %{"name" => "涌泉乡", "code" => "140429207000"},
      %{"name" => "分水岭乡", "code" => "140429208000"},
      %{"name" => "武乡经济技术开发区", "code" => "140429400000"},
      %{"name" => "武乡县现代农业产业示范区", "code" => "140429401000"}
    ]

  def next(input) when input == "长子县" or input == "140428",
    do: [
      %{"name" => "丹朱镇", "code" => "140428100000"},
      %{"name" => "鲍店镇", "code" => "140428101000"},
      %{"name" => "石哲镇", "code" => "140428102000"},
      %{"name" => "大堡头镇", "code" => "140428103000"},
      %{"name" => "慈林镇", "code" => "140428104000"},
      %{"name" => "色头镇", "code" => "140428105000"},
      %{"name" => "南漳镇", "code" => "140428106000"},
      %{"name" => "宋村镇", "code" => "140428107000"},
      %{"name" => "南陈镇", "code" => "140428108000"},
      %{"name" => "碾张乡", "code" => "140428201000"},
      %{"name" => "常张乡", "code" => "140428202000"},
      %{"name" => "长子经济技术开发区", "code" => "140428400000"}
    ]

  def next(input) when input == "壶关县" or input == "140427",
    do: [
      %{"name" => "龙泉镇", "code" => "140427100000"},
      %{"name" => "百尺镇", "code" => "140427101000"},
      %{"name" => "店上镇", "code" => "140427102000"},
      %{"name" => "晋庄镇", "code" => "140427103000"},
      %{"name" => "树掌镇", "code" => "140427104000"},
      %{"name" => "大峡谷镇", "code" => "140427105000"},
      %{"name" => "集店镇", "code" => "140427106000"},
      %{"name" => "黄山乡", "code" => "140427201000"},
      %{"name" => "东井岭乡", "code" => "140427202000"},
      %{"name" => "石坡乡", "code" => "140427203000"},
      %{"name" => "壶关县经济技术开发区", "code" => "140427401000"}
    ]

  def next(input) when input == "黎城县" or input == "140426",
    do: [
      %{"name" => "东阳关镇", "code" => "140426101000"},
      %{"name" => "上遥镇", "code" => "140426102000"},
      %{"name" => "西井镇", "code" => "140426103000"},
      %{"name" => "黄崖洞镇", "code" => "140426104000"},
      %{"name" => "黎侯镇", "code" => "140426105000"},
      %{"name" => "洪井镇", "code" => "140426106000"},
      %{"name" => "西仵镇", "code" => "140426107000"},
      %{"name" => "程家山镇", "code" => "140426108000"},
      %{"name" => "黎城县经济技术开发区", "code" => "140426400000"}
    ]

  def next(input) when input == "平顺县" or input == "140425",
    do: [
      %{"name" => "青羊镇", "code" => "140425100000"},
      %{"name" => "龙溪镇", "code" => "140425101000"},
      %{"name" => "石城镇", "code" => "140425102000"},
      %{"name" => "苗庄镇", "code" => "140425103000"},
      %{"name" => "玉峡关镇", "code" => "140425104000"},
      %{"name" => "西沟乡", "code" => "140425200000"},
      %{"name" => "东寺头乡", "code" => "140425201000"},
      %{"name" => "虹梯关乡", "code" => "140425202000"},
      %{"name" => "阳高乡", "code" => "140425203000"},
      %{"name" => "北耽车乡", "code" => "140425204000"},
      %{"name" => "北社乡", "code" => "140425206000"},
      %{"name" => "平顺经济技术开发区", "code" => "140425400000"},
      %{"name" => "平顺生态文化旅游示范区", "code" => "140425401000"}
    ]

  def next(input) when input == "襄垣县" or input == "140423",
    do: [
      %{"name" => "古韩镇", "code" => "140423100000"},
      %{"name" => "王桥镇", "code" => "140423101000"},
      %{"name" => "侯堡镇", "code" => "140423102000"},
      %{"name" => "夏店镇", "code" => "140423103000"},
      %{"name" => "虒亭镇", "code" => "140423104000"},
      %{"name" => "西营镇", "code" => "140423105000"},
      %{"name" => "王村镇", "code" => "140423106000"},
      %{"name" => "下良镇", "code" => "140423107000"},
      %{"name" => "善福镇", "code" => "140423108000"},
      %{"name" => "襄垣经济技术开发区", "code" => "140423402000"}
    ]

  def next(input) when input == "潞城区" or input == "140406",
    do: [
      %{"name" => "潞华街道", "code" => "140406001000"},
      %{"name" => "成家川街道", "code" => "140406002000"},
      %{"name" => "翟店街道", "code" => "140406003000"},
      %{"name" => "店上镇", "code" => "140406100000"},
      %{"name" => "微子镇", "code" => "140406101000"},
      %{"name" => "辛安泉镇", "code" => "140406102000"},
      %{"name" => "史回镇", "code" => "140406104000"},
      %{"name" => "黄牛蹄乡", "code" => "140406201000"},
      %{"name" => "潞城经济技术开发区", "code" => "140406400000"}
    ]

  def next(input) when input == "屯留区" or input == "140405",
    do: [
      %{"name" => "麟绛街道", "code" => "140405001000"},
      %{"name" => "上村镇", "code" => "140405101000"},
      %{"name" => "渔泽镇", "code" => "140405102000"},
      %{"name" => "余吾镇", "code" => "140405103000"},
      %{"name" => "吾元镇", "code" => "140405104000"},
      %{"name" => "张店镇", "code" => "140405105000"},
      %{"name" => "丰宜镇", "code" => "140405106000"},
      %{"name" => "李高乡", "code" => "140405200000"},
      %{"name" => "路村乡", "code" => "140405201000"},
      %{"name" => "河神庙乡", "code" => "140405202000"},
      %{"name" => "长治市屯留区西流寨综合服务中心", "code" => "140405400000"},
      %{"name" => "长治市屯留区康庄综合服务中心", "code" => "140405401000"},
      %{"name" => "长治市屯留区上莲综合服务中心", "code" => "140405402000"},
      %{"name" => "屯留经济技术开发区", "code" => "140405403000"}
    ]

  def next(input) when input == "上党区" or input == "140404",
    do: [
      %{"name" => "韩店街道", "code" => "140404001000"},
      %{"name" => "苏店镇", "code" => "140404101000"},
      %{"name" => "荫城镇", "code" => "140404102000"},
      %{"name" => "西火镇", "code" => "140404103000"},
      %{"name" => "八义镇", "code" => "140404104000"},
      %{"name" => "郝家庄镇", "code" => "140404106000"},
      %{"name" => "南宋镇", "code" => "140404107000"},
      %{"name" => "西池乡", "code" => "140404201000"},
      %{"name" => "北呈乡", "code" => "140404202000"},
      %{"name" => "东和乡", "code" => "140404203000"},
      %{"name" => "振兴乡村生态文化旅游区", "code" => "140404400000"},
      %{"name" => "上党经济技术开发区", "code" => "140404401000"},
      %{"name" => "长治市经济技术开发区上党区部分", "code" => "140404406000"}
    ]

  def next(input) when input == "潞州区" or input == "140403",
    do: [
      %{"name" => "东街街道", "code" => "140403001000"},
      %{"name" => "西街街道", "code" => "140403002000"},
      %{"name" => "英雄南路街道", "code" => "140403003000"},
      %{"name" => "英雄中路街道", "code" => "140403004000"},
      %{"name" => "紫金街街道", "code" => "140403005000"},
      %{"name" => "太行东街街道", "code" => "140403006000"},
      %{"name" => "太行西街街道", "code" => "140403007000"},
      %{"name" => "延安南路街道", "code" => "140403008000"},
      %{"name" => "常青街道", "code" => "140403009000"},
      %{"name" => "五马街道", "code" => "140403010000"},
      %{"name" => "堠北庄街道", "code" => "140403013000"},
      %{"name" => "老顶山街道", "code" => "140403014000"},
      %{"name" => "大辛庄街道", "code" => "140403015000"},
      %{"name" => "马厂镇", "code" => "140403103000"},
      %{"name" => "黄碾镇", "code" => "140403104000"},
      %{"name" => "西白兔镇", "code" => "140403105000"},
      %{"name" => "长治市漳泽工业转型试验区管理委员会社区", "code" => "140403400000"},
      %{"name" => "长治市老顶山旅游开发管理中心", "code" => "140403401000"},
      %{"name" => "长治经济技术开发区潞州区部分", "code" => "140403403000"}
    ]

  def next(input) when input == "盂县" or input == "140322",
    do: [
      %{"name" => "秀水镇", "code" => "140322100000"},
      %{"name" => "孙家庄镇", "code" => "140322101000"},
      %{"name" => "路家村镇", "code" => "140322102000"},
      %{"name" => "南娄镇", "code" => "140322103000"},
      %{"name" => "牛村镇", "code" => "140322104000"},
      %{"name" => "苌池镇", "code" => "140322105000"},
      %{"name" => "上社镇", "code" => "140322106000"},
      %{"name" => "西烟镇", "code" => "140322107000"},
      %{"name" => "仙人乡", "code" => "140322200000"},
      %{"name" => "北下庄乡", "code" => "140322201000"},
      %{"name" => "梁家寨乡", "code" => "140322203000"},
      %{"name" => "西潘乡", "code" => "140322204000"},
      %{"name" => "东梁乡", "code" => "140322205000"}
    ]

  def next(input) when input == "平定县" or input == "140321",
    do: [
      %{"name" => "冠山镇", "code" => "140321100000"},
      %{"name" => "冶西镇", "code" => "140321101000"},
      %{"name" => "锁簧镇", "code" => "140321102000"},
      %{"name" => "张庄镇", "code" => "140321103000"},
      %{"name" => "东回镇", "code" => "140321104000"},
      %{"name" => "柏井镇", "code" => "140321105000"},
      %{"name" => "娘子关镇", "code" => "140321106000"},
      %{"name" => "巨城镇", "code" => "140321107000"},
      %{"name" => "石门口乡", "code" => "140321200000"},
      %{"name" => "岔口乡", "code" => "140321201000"}
    ]

  def next(input) when input == "郊区" or input == "140311",
    do: [
      %{"name" => "荫营镇", "code" => "140311100000"},
      %{"name" => "河底镇", "code" => "140311101000"},
      %{"name" => "平坦镇", "code" => "140311103000"},
      %{"name" => "西南舁乡", "code" => "140311200000"},
      %{"name" => "杨家庄乡", "code" => "140311201000"},
      %{"name" => "李家庄乡", "code" => "140311202000"},
      %{"name" => "旧街乡", "code" => "140311203000"},
      %{"name" => "开发区", "code" => "140311400000"}
    ]

  def next(input) when input == "矿区" or input == "140303",
    do: [
      %{"name" => "平潭街街道", "code" => "140303001000"},
      %{"name" => "蔡洼街道", "code" => "140303003000"},
      %{"name" => "赛鱼街道", "code" => "140303004000"},
      %{"name" => "沙坪街道", "code" => "140303005000"},
      %{"name" => "贵石沟街道", "code" => "140303006000"},
      %{"name" => "桥头街道", "code" => "140303007000"}
    ]

  def next(input) when input == "城区" or input == "140302",
    do: [
      %{"name" => "上站街道", "code" => "140302001000"},
      %{"name" => "下站街道", "code" => "140302002000"},
      %{"name" => "北大街街道", "code" => "140302003000"},
      %{"name" => "南山路街道", "code" => "140302004000"},
      %{"name" => "义井街道", "code" => "140302005000"},
      %{"name" => "义井镇", "code" => "140302100000"}
    ]

  def next(input) when input == "山西大同经济开发区" or input == "140271",
    do: [%{"name" => "经济技术开发区乡级单位", "code" => "140271400000"}]

  def next(input) when input == "左云县" or input == "140226",
    do: [
      %{"name" => "云兴镇", "code" => "140226100000"},
      %{"name" => "鹊儿山镇", "code" => "140226101000"},
      %{"name" => "店湾镇", "code" => "140226102000"},
      %{"name" => "管家堡乡", "code" => "140226200000"},
      %{"name" => "张家场乡", "code" => "140226201000"},
      %{"name" => "三屯乡", "code" => "140226205000"},
      %{"name" => "马道头乡", "code" => "140226206000"},
      %{"name" => "小京庄乡", "code" => "140226207000"}
    ]

  def next(input) when input == "浑源县" or input == "140225",
    do: [
      %{"name" => "永安镇", "code" => "140225100000"},
      %{"name" => "西坊城镇", "code" => "140225101000"},
      %{"name" => "蔡村镇", "code" => "140225102000"},
      %{"name" => "沙圪坨镇", "code" => "140225103000"},
      %{"name" => "王庄堡镇", "code" => "140225104000"},
      %{"name" => "青磁窑镇", "code" => "140225106000"},
      %{"name" => "东坊城乡", "code" => "140225201000"},
      %{"name" => "裴村乡", "code" => "140225203000"},
      %{"name" => "驼峰乡", "code" => "140225204000"},
      %{"name" => "西留村乡", "code" => "140225205000"},
      %{"name" => "下韩村乡", "code" => "140225206000"},
      %{"name" => "南榆林乡", "code" => "140225208000"},
      %{"name" => "吴城乡", "code" => "140225210000"},
      %{"name" => "大仁庄乡", "code" => "140225213000"},
      %{"name" => "千佛岭乡", "code" => "140225215000"},
      %{"name" => "官儿乡", "code" => "140225218000"}
    ]

  def next(input) when input == "灵丘县" or input == "140224",
    do: [
      %{"name" => "武灵镇", "code" => "140224100000"},
      %{"name" => "东河南镇", "code" => "140224101000"},
      %{"name" => "上寨镇", "code" => "140224102000"},
      %{"name" => "落水河乡", "code" => "140224200000"},
      %{"name" => "赵北乡", "code" => "140224205000"},
      %{"name" => "石家田乡", "code" => "140224206000"},
      %{"name" => "柳科乡", "code" => "140224207000"},
      %{"name" => "白崖台乡", "code" => "140224208000"},
      %{"name" => "红石塄乡", "code" => "140224210000"},
      %{"name" => "下关乡", "code" => "140224212000"},
      %{"name" => "独峪乡", "code" => "140224213000"}
    ]

  def next(input) when input == "广灵县" or input == "140223",
    do: [
      %{"name" => "壶泉镇", "code" => "140223100000"},
      %{"name" => "南村镇", "code" => "140223101000"},
      %{"name" => "加斗镇", "code" => "140223102000"},
      %{"name" => "作疃镇", "code" => "140223103000"},
      %{"name" => "梁庄镇", "code" => "140223104000"},
      %{"name" => "一斗泉乡", "code" => "140223200000"},
      %{"name" => "蕉山乡", "code" => "140223202000"},
      %{"name" => "宜兴乡", "code" => "140223206000"}
    ]

  def next(input) when input == "天镇县" or input == "140222",
    do: [
      %{"name" => "玉泉镇", "code" => "140222100000"},
      %{"name" => "谷前堡镇", "code" => "140222101000"},
      %{"name" => "米薪关镇", "code" => "140222102000"},
      %{"name" => "逯家湾镇", "code" => "140222103000"},
      %{"name" => "新平堡镇", "code" => "140222104000"},
      %{"name" => "卅里铺乡", "code" => "140222200000"},
      %{"name" => "贾家屯乡", "code" => "140222204000"},
      %{"name" => "赵家沟乡", "code" => "140222206000"},
      %{"name" => "南高崖乡", "code" => "140222208000"},
      %{"name" => "张西河乡", "code" => "140222209000"},
      %{"name" => "马家皂乡", "code" => "140222210000"}
    ]

  def next(input) when input == "阳高县" or input == "140221",
    do: [
      %{"name" => "龙泉镇", "code" => "140221100000"},
      %{"name" => "罗文皂镇", "code" => "140221101000"},
      %{"name" => "大白登镇", "code" => "140221102000"},
      %{"name" => "王官屯镇", "code" => "140221103000"},
      %{"name" => "古城镇", "code" => "140221104000"},
      %{"name" => "东小村镇", "code" => "140221105000"},
      %{"name" => "友宰镇", "code" => "140221106000"},
      %{"name" => "长城乡", "code" => "140221201000"},
      %{"name" => "狮子屯乡", "code" => "140221204000"},
      %{"name" => "下深井乡", "code" => "140221209000"},
      %{"name" => "鳌石乡", "code" => "140221212000"}
    ]

  def next(input) when input == "云州区" or input == "140215",
    do: [
      %{"name" => "西坪镇", "code" => "140215100000"},
      %{"name" => "倍加造镇", "code" => "140215101000"},
      %{"name" => "周士庄镇", "code" => "140215102000"},
      %{"name" => "吉家庄乡", "code" => "140215201000"},
      %{"name" => "峰峪乡", "code" => "140215202000"},
      %{"name" => "杜庄乡", "code" => "140215204000"},
      %{"name" => "党留庄乡", "code" => "140215205000"},
      %{"name" => "聚乐乡", "code" => "140215209000"},
      %{"name" => "许堡乡", "code" => "140215211000"}
    ]

  def next(input) when input == "云冈区" or input == "140214",
    do: [
      %{"name" => "新胜街道", "code" => "140214001000"},
      %{"name" => "新平旺街道", "code" => "140214002000"},
      %{"name" => "新泉路街道", "code" => "140214016000"},
      %{"name" => "民胜街道", "code" => "140214017000"},
      %{"name" => "口泉街道", "code" => "140214018000"},
      %{"name" => "平泉路街道", "code" => "140214023000"},
      %{"name" => "和顺街道", "code" => "140214025000"},
      %{"name" => "和瑞街道", "code" => "140214026000"},
      %{"name" => "平盛路街道", "code" => "140214027000"},
      %{"name" => "清泉街街道", "code" => "140214028000"},
      %{"name" => "西花园街道", "code" => "140214029000"},
      %{"name" => "老平旺街道", "code" => "140214030000"},
      %{"name" => "新文街道", "code" => "140214031000"},
      %{"name" => "和旺街道", "code" => "140214032000"},
      %{"name" => "玉龙街道", "code" => "140214033000"},
      %{"name" => "云武街道", "code" => "140214034000"},
      %{"name" => "云燕街道", "code" => "140214035000"},
      %{"name" => "玉泉街道", "code" => "140214036000"},
      %{"name" => "平德街道", "code" => "140214037000"},
      %{"name" => "平喜街道", "code" => "140214038000"},
      %{"name" => "平源街道", "code" => "140214039000"},
      %{"name" => "高山镇", "code" => "140214101000"},
      %{"name" => "云冈镇", "code" => "140214102000"},
      %{"name" => "口泉乡", "code" => "140214200000"},
      %{"name" => "西韩岭乡", "code" => "140214206000"},
      %{"name" => "平旺乡", "code" => "140214207000"},
      %{"name" => "鸦儿崖乡", "code" => "140214210000"}
    ]

  def next(input) when input == "平城区" or input == "140213",
    do: [
      %{"name" => "永泰街道", "code" => "140213050000"},
      %{"name" => "古城街道", "code" => "140213051000"},
      %{"name" => "新旺街道", "code" => "140213052000"},
      %{"name" => "迎宾街道", "code" => "140213053000"},
      %{"name" => "振华街道", "code" => "140213054000"},
      %{"name" => "清远街道", "code" => "140213055000"},
      %{"name" => "武定街道", "code" => "140213056000"},
      %{"name" => "御河街道", "code" => "140213057000"},
      %{"name" => "开源街道", "code" => "140213058000"},
      %{"name" => "大庆路街道", "code" => "140213059000"},
      %{"name" => "马军营街道", "code" => "140213060000"},
      %{"name" => "卧虎湾街道", "code" => "140213061000"},
      %{"name" => "新华街道", "code" => "140213062000"},
      %{"name" => "鹿苑街道", "code" => "140213063000"},
      %{"name" => "白登山街道", "code" => "140213064000"},
      %{"name" => "文瀛湖街道", "code" => "140213065000"},
      %{"name" => "水泊寺街道", "code" => "140213066000"},
      %{"name" => "小南头街道", "code" => "140213067000"}
    ]

  def next(input) when input == "新荣区" or input == "140212",
    do: [
      %{"name" => "新荣镇", "code" => "140212100000"},
      %{"name" => "古店镇", "code" => "140212101000"},
      %{"name" => "花园屯镇", "code" => "140212102000"},
      %{"name" => "破鲁堡乡", "code" => "140212200000"},
      %{"name" => "郭家窑乡", "code" => "140212202000"},
      %{"name" => "西村乡", "code" => "140212206000"},
      %{"name" => "堡子湾乡", "code" => "140212209000"}
    ]

  def next(input) when input == "古交市" or input == "140181",
    do: [
      %{"name" => "东曲街道", "code" => "140181001000"},
      %{"name" => "西曲街道", "code" => "140181002000"},
      %{"name" => "桃园街道", "code" => "140181003000"},
      %{"name" => "屯兰街道", "code" => "140181004000"},
      %{"name" => "河口镇", "code" => "140181100000"},
      %{"name" => "镇城底镇", "code" => "140181101000"},
      %{"name" => "马兰镇", "code" => "140181102000"},
      %{"name" => "嘉乐泉乡", "code" => "140181201000"},
      %{"name" => "梭峪乡", "code" => "140181202000"},
      %{"name" => "岔口乡", "code" => "140181203000"},
      %{"name" => "常安乡", "code" => "140181204000"},
      %{"name" => "原相乡", "code" => "140181205000"},
      %{"name" => "邢家社乡", "code" => "140181206000"}
    ]

  def next(input) when input == "山西转型综合改革示范区" or input == "140171",
    do: [
      %{"name" => "唐槐园区街道", "code" => "140171401000"},
      %{"name" => "学府园区街道", "code" => "140171402000"},
      %{"name" => "阳曲产业园区街道", "code" => "140171403000"},
      %{"name" => "潇河园区街道", "code" => "140171404000"},
      %{"name" => "科创城街道", "code" => "140171405000"},
      %{"name" => "太原武宿综合保税区街道", "code" => "140171406000"}
    ]

  def next(input) when input == "娄烦县" or input == "140123",
    do: [
      %{"name" => "娄烦镇", "code" => "140123100000"},
      %{"name" => "静游镇", "code" => "140123101000"},
      %{"name" => "杜交曲镇", "code" => "140123102000"},
      %{"name" => "马家庄乡", "code" => "140123201000"},
      %{"name" => "盖家庄乡", "code" => "140123202000"},
      %{"name" => "米峪镇乡", "code" => "140123203000"},
      %{"name" => "天池店乡", "code" => "140123204000"}
    ]

  def next(input) when input == "阳曲县" or input == "140122",
    do: [
      %{"name" => "黄寨镇", "code" => "140122100000"},
      %{"name" => "大盂镇", "code" => "140122101000"},
      %{"name" => "东黄水镇", "code" => "140122102000"},
      %{"name" => "泥屯镇", "code" => "140122103000"},
      %{"name" => "高村乡", "code" => "140122200000"},
      %{"name" => "侯村乡", "code" => "140122201000"},
      %{"name" => "凌井店乡", "code" => "140122202000"},
      %{"name" => "西凌井乡", "code" => "140122203000"},
      %{"name" => "杨兴乡", "code" => "140122205000"},
      %{"name" => "中心镇", "code" => "140122400000"}
    ]

  def next(input) when input == "清徐县" or input == "140121",
    do: [
      %{"name" => "清源镇", "code" => "140121100000"},
      %{"name" => "徐沟镇", "code" => "140121101000"},
      %{"name" => "东于镇", "code" => "140121102000"},
      %{"name" => "孟封镇", "code" => "140121103000"},
      %{"name" => "马峪乡", "code" => "140121200000"},
      %{"name" => "柳杜乡", "code" => "140121201000"},
      %{"name" => "西谷乡", "code" => "140121202000"},
      %{"name" => "王答乡", "code" => "140121203000"},
      %{"name" => "集义乡", "code" => "140121204000"}
    ]

  def next(input) when input == "晋源区" or input == "140110",
    do: [
      %{"name" => "义井街道", "code" => "140110001000"},
      %{"name" => "罗城街道", "code" => "140110002000"},
      %{"name" => "晋源街道", "code" => "140110003000"},
      %{"name" => "金胜镇", "code" => "140110100000"},
      %{"name" => "晋祠镇", "code" => "140110101000"},
      %{"name" => "姚村镇", "code" => "140110102000"}
    ]

  def next(input) when input == "万柏林区" or input == "140109",
    do: [
      %{"name" => "千峰街道", "code" => "140109001000"},
      %{"name" => "下元街道", "code" => "140109002000"},
      %{"name" => "和平街道", "code" => "140109003000"},
      %{"name" => "兴华街道", "code" => "140109004000"},
      %{"name" => "万柏林街道", "code" => "140109005000"},
      %{"name" => "杜儿坪街道", "code" => "140109006000"},
      %{"name" => "白家庄街道", "code" => "140109007000"},
      %{"name" => "南寒街道", "code" => "140109008000"},
      %{"name" => "东社街道", "code" => "140109009000"},
      %{"name" => "小井峪街道", "code" => "140109011000"},
      %{"name" => "西铭街道", "code" => "140109012000"},
      %{"name" => "长风西街街道", "code" => "140109013000"},
      %{"name" => "神堂沟街道", "code" => "140109014000"},
      %{"name" => "王化街道", "code" => "140109015000"}
    ]

  def next(input) when input == "尖草坪区" or input == "140108",
    do: [
      %{"name" => "尖草坪街道", "code" => "140108001000"},
      %{"name" => "光社街道", "code" => "140108002000"},
      %{"name" => "上兰街道", "code" => "140108003000"},
      %{"name" => "南寨街道", "code" => "140108004000"},
      %{"name" => "迎新街街道", "code" => "140108005000"},
      %{"name" => "古城街道", "code" => "140108006000"},
      %{"name" => "汇丰街道", "code" => "140108007000"},
      %{"name" => "柴村街道", "code" => "140108008000"},
      %{"name" => "新城街道", "code" => "140108009000"},
      %{"name" => "向阳镇", "code" => "140108100000"},
      %{"name" => "阳曲镇", "code" => "140108101000"},
      %{"name" => "柏板乡", "code" => "140108201000"},
      %{"name" => "西墕乡", "code" => "140108202000"},
      %{"name" => "太原中北高新技术产业开发区", "code" => "140108400000"}
    ]

  def next(input) when input == "杏花岭区" or input == "140107",
    do: [
      %{"name" => "巨轮街道", "code" => "140107001000"},
      %{"name" => "三桥街道", "code" => "140107002000"},
      %{"name" => "鼓楼街道", "code" => "140107003000"},
      %{"name" => "杏花岭街道", "code" => "140107004000"},
      %{"name" => "坝陵桥街道", "code" => "140107005000"},
      %{"name" => "大东关街道", "code" => "140107006000"},
      %{"name" => "职工新街街道", "code" => "140107007000"},
      %{"name" => "敦化坊街道", "code" => "140107008000"},
      %{"name" => "涧河街道", "code" => "140107009000"},
      %{"name" => "杨家峪街道", "code" => "140107010000"},
      %{"name" => "享堂街道", "code" => "140107011000"},
      %{"name" => "中涧河镇", "code" => "140107100000"}
    ]

  def next(input) when input == "迎泽区" or input == "140106",
    do: [
      %{"name" => "柳巷街道", "code" => "140106001000"},
      %{"name" => "文庙街道", "code" => "140106002000"},
      %{"name" => "庙前街道", "code" => "140106003000"},
      %{"name" => "迎泽街道", "code" => "140106004000"},
      %{"name" => "桥东街道", "code" => "140106005000"},
      %{"name" => "老军营街道", "code" => "140106006000"},
      %{"name" => "郝庄镇", "code" => "140106100000"}
    ]

  def next(input) when input == "小店区" or input == "140105",
    do: [
      %{"name" => "坞城街道", "code" => "140105001000"},
      %{"name" => "营盘街道", "code" => "140105002000"},
      %{"name" => "北营街道", "code" => "140105003000"},
      %{"name" => "平阳路街道", "code" => "140105004000"},
      %{"name" => "黄陵街道", "code" => "140105005000"},
      %{"name" => "小店街道", "code" => "140105006000"},
      %{"name" => "龙城街道", "code" => "140105007000"},
      %{"name" => "北格镇", "code" => "140105100000"},
      %{"name" => "西温庄乡", "code" => "140105200000"},
      %{"name" => "刘家堡乡", "code" => "140105201000"}
    ]

  def next(_), do: nil
end