defmodule ChinaAdminDivisions.Gen.Lv3x.M15 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "内蒙古阿拉善高新技术产业开发区" or input == "152971",
    do: [%{"name" => "乌斯太镇", "code" => "152971100000"}]

  def next(input) when input == "额济纳旗" or input == "152923",
    do: [
      %{"name" => "航空街道", "code" => "152923001000"},
      %{"name" => "东风街道", "code" => "152923002000"},
      %{"name" => "达来呼布镇", "code" => "152923100000"},
      %{"name" => "东风镇", "code" => "152923101000"},
      %{"name" => "哈日布日格德音乌拉镇", "code" => "152923102000"},
      %{"name" => "策克镇", "code" => "152923104000"},
      %{"name" => "赛汉陶来苏木", "code" => "152923200000"},
      %{"name" => "马鬃山苏木", "code" => "152923201000"},
      %{"name" => "苏泊淖尔苏木", "code" => "152923202000"},
      %{"name" => "巴彦陶来苏木", "code" => "152923203000"},
      %{"name" => "温图高勒苏木", "code" => "152923204000"},
      %{"name" => "巴音陶海苏木", "code" => "152923205000"}
    ]

  def next(input) when input == "阿拉善右旗" or input == "152922",
    do: [
      %{"name" => "巴丹吉林镇", "code" => "152922103000"},
      %{"name" => "雅布赖镇", "code" => "152922104000"},
      %{"name" => "阿拉腾敖包镇", "code" => "152922105000"},
      %{"name" => "曼德拉苏木", "code" => "152922211000"},
      %{"name" => "阿拉腾朝格苏木", "code" => "152922212000"},
      %{"name" => "巴彦高勒苏木", "code" => "152922213000"},
      %{"name" => "塔木素布拉格苏木", "code" => "152922214000"}
    ]

  def next(input) when input == "阿拉善左旗" or input == "152921",
    do: [
      %{"name" => "温都尔勒图镇", "code" => "152921102000"},
      %{"name" => "巴润别立镇", "code" => "152921105000"},
      %{"name" => "巴彦浩特镇", "code" => "152921110000"},
      %{"name" => "嘉尔嘎勒赛汉镇", "code" => "152921111000"},
      %{"name" => "吉兰泰镇", "code" => "152921112000"},
      %{"name" => "宗别立镇", "code" => "152921113000"},
      %{"name" => "敖伦布拉格镇", "code" => "152921114000"},
      %{"name" => "腾格里额里斯镇", "code" => "152921115000"},
      %{"name" => "巴彦木仁苏木", "code" => "152921203000"},
      %{"name" => "乌力吉苏木", "code" => "152921213000"},
      %{"name" => "巴彦诺日公苏木", "code" => "152921214000"},
      %{"name" => "额尔克哈什哈苏木", "code" => "152921215000"},
      %{"name" => "银根苏木", "code" => "152921216000"},
      %{"name" => "超格图呼热苏木", "code" => "152921217000"},
      %{"name" => "孪井滩生态移民示范区", "code" => "152921401000"},
      %{"name" => "额鲁特街道", "code" => "152921402000"},
      %{"name" => "南环街道", "code" => "152921403000"},
      %{"name" => "新华街道", "code" => "152921404000"},
      %{"name" => "王府街道", "code" => "152921405000"}
    ]

  def next(input) when input == "乌拉盖管理区管委会" or input == "152571",
    do: [
      %{"name" => "巴彦胡硕镇", "code" => "152571101000"},
      %{"name" => "哈拉盖图农牧场", "code" => "152571500000"},
      %{"name" => "贺斯格乌拉牧场", "code" => "152571501000"},
      %{"name" => "乌拉盖牧场", "code" => "152571502000"}
    ]

  def next(input) when input == "多伦县" or input == "152531",
    do: [
      %{"name" => "大北沟镇", "code" => "152531100000"},
      %{"name" => "多伦诺尔镇", "code" => "152531101000"},
      %{"name" => "滦源镇", "code" => "152531102000"},
      %{"name" => "蔡木山乡", "code" => "152531201000"},
      %{"name" => "西干沟乡", "code" => "152531202000"},
      %{"name" => "内蒙古锡林郭勒多伦经济开发区", "code" => "152531400000"}
    ]

  def next(input) when input == "正蓝旗" or input == "152530",
    do: [
      %{"name" => "上都镇", "code" => "152530100000"},
      %{"name" => "桑根达来镇", "code" => "152530101000"},
      %{"name" => "哈毕日嘎镇", "code" => "152530102000"},
      %{"name" => "宝绍岱苏木", "code" => "152530200000"},
      %{"name" => "那日图苏木", "code" => "152530201000"},
      %{"name" => "赛音呼都嘎苏木", "code" => "152530202000"},
      %{"name" => "扎格斯台苏木", "code" => "152530203000"},
      %{"name" => "内蒙古自治区五一种畜场", "code" => "152530500000"},
      %{"name" => "黑城子示范区", "code" => "152530501000"}
    ]

  def next(input) when input == "正镶白旗" or input == "152529",
    do: [
      %{"name" => "明安图镇", "code" => "152529100000"},
      %{"name" => "星耀镇", "code" => "152529101000"},
      %{"name" => "伊和淖尔苏木", "code" => "152529200000"},
      %{"name" => "乌兰查布苏木", "code" => "152529201000"},
      %{"name" => "宝拉根陶海苏木", "code" => "152529202000"},
      %{"name" => "额里图种畜场", "code" => "152529500000"},
      %{"name" => "哲日根图林场", "code" => "152529502000"}
    ]

  def next(input) when input == "镶黄旗" or input == "152528",
    do: [
      %{"name" => "新宝拉格镇", "code" => "152528100000"},
      %{"name" => "巴彦塔拉镇", "code" => "152528101000"},
      %{"name" => "翁贡乌拉苏木", "code" => "152528200000"},
      %{"name" => "宝格达音髙勒苏木", "code" => "152528201000"}
    ]

  def next(input) when input == "太仆寺旗" or input == "152527",
    do: [
      %{"name" => "宝昌镇", "code" => "152527100000"},
      %{"name" => "千斤沟镇", "code" => "152527101000"},
      %{"name" => "红旗镇", "code" => "152527102000"},
      %{"name" => "骆驼山镇", "code" => "152527103000"},
      %{"name" => "永丰镇", "code" => "152527104000"},
      %{"name" => "幸福乡", "code" => "152527200000"},
      %{"name" => "贡宝拉格苏木", "code" => "152527201000"},
      %{"name" => "万寿滩良种场", "code" => "152527500000"}
    ]

  def next(input) when input == "西乌珠穆沁旗" or input == "152526",
    do: [
      %{"name" => "巴拉嘎尔高勒镇", "code" => "152526100000"},
      %{"name" => "巴彦花镇", "code" => "152526101000"},
      %{"name" => "吉仁高勒镇", "code" => "152526102000"},
      %{"name" => "浩勒图高勒镇", "code" => "152526103000"},
      %{"name" => "高日罕镇", "code" => "152526104000"},
      %{"name" => "巴彦胡舒苏木", "code" => "152526200000"},
      %{"name" => "乌兰哈拉嘎苏木", "code" => "152526201000"}
    ]

  def next(input) when input == "东乌珠穆沁旗" or input == "152525",
    do: [
      %{"name" => "乌里雅斯太镇", "code" => "152525100000"},
      %{"name" => "道特淖尔镇", "code" => "152525101000"},
      %{"name" => "嘎达布其镇", "code" => "152525102000"},
      %{"name" => "满都呼宝拉格镇", "code" => "152525103000"},
      %{"name" => "额吉淖尔镇", "code" => "152525104000"},
      %{"name" => "呼热图淖尔苏木", "code" => "152525200000"},
      %{"name" => "萨麦苏木", "code" => "152525201000"},
      %{"name" => "嘎海乐苏木", "code" => "152525202000"},
      %{"name" => "阿拉坦合力苏木", "code" => "152525203000"},
      %{"name" => "宝格达乌拉总场", "code" => "152525503000"}
    ]

  def next(input) when input == "苏尼特右旗" or input == "152524",
    do: [
      %{"name" => "赛汉塔拉镇", "code" => "152524100000"},
      %{"name" => "朱日和镇", "code" => "152524101000"},
      %{"name" => "乌日根塔拉镇", "code" => "152524102000"},
      %{"name" => "桑宝拉格苏木", "code" => "152524200000"},
      %{"name" => "额仁淖尔苏木", "code" => "152524201000"},
      %{"name" => "赛罕乌力吉苏木", "code" => "152524202000"},
      %{"name" => "阿其图乌拉苏木", "code" => "152524203000"},
      %{"name" => "苏尼特右旗朱日和工业园", "code" => "152524400000"}
    ]

  def next(input) when input == "苏尼特左旗" or input == "152523",
    do: [
      %{"name" => "满都拉图镇", "code" => "152523100000"},
      %{"name" => "查干敖包镇", "code" => "152523101000"},
      %{"name" => "巴彦淖尔镇", "code" => "152523102000"},
      %{"name" => "巴彦乌拉苏木", "code" => "152523200000"},
      %{"name" => "赛罕高毕苏木", "code" => "152523201000"},
      %{"name" => "洪格尔苏木", "code" => "152523202000"},
      %{"name" => "达来苏木", "code" => "152523203000"},
      %{"name" => "苏尼特左旗芒来循环经济产业园区", "code" => "152523400000"},
      %{"name" => "恩格尔河灌区", "code" => "152523500000"}
    ]

  def next(input) when input == "阿巴嘎旗" or input == "152522",
    do: [
      %{"name" => "别力古台镇", "code" => "152522100000"},
      %{"name" => "洪格尔高勒镇", "code" => "152522101000"},
      %{"name" => "查干淖尔镇", "code" => "152522102000"},
      %{"name" => "那仁宝拉格苏木", "code" => "152522200000"},
      %{"name" => "伊和高勒苏木", "code" => "152522201000"},
      %{"name" => "吉尔嘎郎图苏木", "code" => "152522202000"},
      %{"name" => "巴彦图嘎苏木", "code" => "152522203000"},
      %{"name" => "玛尼图煤矿", "code" => "152522400000"}
    ]

  def next(input) when input == "锡林浩特市" or input == "152502",
    do: [
      %{"name" => "希日塔拉街道", "code" => "152502001000"},
      %{"name" => "宝力根街道", "code" => "152502002000"},
      %{"name" => "杭盖街道", "code" => "152502003000"},
      %{"name" => "楚古兰街道", "code" => "152502004000"},
      %{"name" => "额尔敦街道", "code" => "152502005000"},
      %{"name" => "南郊街道", "code" => "152502006000"},
      %{"name" => "巴彦查干街道", "code" => "152502007000"},
      %{"name" => "巴彦锡勒街道", "code" => "152502008000"},
      %{"name" => "阿尔善宝拉格镇", "code" => "152502100000"},
      %{"name" => "宝力根苏木", "code" => "152502200000"},
      %{"name" => "朝克乌拉苏木", "code" => "152502201000"},
      %{"name" => "巴彦宝拉格苏木", "code" => "152502203000"},
      %{"name" => "锡林郭勒盟经济技术开发区", "code" => "152502400000"},
      %{"name" => "白银库伦牧场", "code" => "152502500000"},
      %{"name" => "贝力克牧场", "code" => "152502501000"},
      %{"name" => "毛登牧场", "code" => "152502502000"}
    ]

  def next(input) when input == "二连浩特市" or input == "152501",
    do: [
      %{"name" => "格日勒敖都苏木", "code" => "152501200000"},
      %{"name" => "二连浩特市社区建设管理局", "code" => "152501400000"},
      %{"name" => "二连边境经济技术合作区", "code" => "152501401000"}
    ]

  def next(input) when input == "突泉县" or input == "152224",
    do: [
      %{"name" => "突泉镇", "code" => "152224100000"},
      %{"name" => "六户镇", "code" => "152224101000"},
      %{"name" => "东杜尔基镇", "code" => "152224102000"},
      %{"name" => "永安镇", "code" => "152224103000"},
      %{"name" => "水泉镇", "code" => "152224104000"},
      %{"name" => "宝石镇", "code" => "152224105000"},
      %{"name" => "学田乡", "code" => "152224200000"},
      %{"name" => "九龙乡", "code" => "152224201000"},
      %{"name" => "太平乡", "code" => "152224202000"},
      %{"name" => "内蒙古自治区国营杜尔基农场", "code" => "152224400000"}
    ]

  def next(input) when input == "扎赉特旗" or input == "152223",
    do: [
      %{"name" => "音德尔镇", "code" => "152223100000"},
      %{"name" => "新林镇", "code" => "152223101000"},
      %{"name" => "巴彦高勒镇", "code" => "152223102000"},
      %{"name" => "胡尔勒镇", "code" => "152223103000"},
      %{"name" => "阿尔本格勒镇", "code" => "152223104000"},
      %{"name" => "巴达尔胡镇", "code" => "152223105000"},
      %{"name" => "图牧吉镇", "code" => "152223106000"},
      %{"name" => "好力保镇", "code" => "152223107000"},
      %{"name" => "巴彦乌兰苏木", "code" => "152223201000"},
      %{"name" => "宝力根花苏木", "code" => "152223202000"},
      %{"name" => "阿拉达尔吐苏木", "code" => "152223203000"},
      %{"name" => "巴彦扎拉嘎乡", "code" => "152223204000"},
      %{"name" => "努文木仁乡", "code" => "152223205000"},
      %{"name" => "内蒙古自治区图牧吉强制隔离戒毒所", "code" => "152223400000"},
      %{"name" => "内蒙古自治区监狱管理局东部分局", "code" => "152223401000"},
      %{"name" => "种畜场", "code" => "152223404000"},
      %{"name" => "八一牧场", "code" => "152223405000"},
      %{"name" => "巴达尔胡农场", "code" => "152223406000"}
    ]

  def next(input) when input == "科尔沁右翼中旗" or input == "152222",
    do: [
      %{"name" => "巴彦呼舒镇", "code" => "152222100000"},
      %{"name" => "巴仁哲里木镇", "code" => "152222101000"},
      %{"name" => "吐列毛杜镇", "code" => "152222102000"},
      %{"name" => "杜尔基镇", "code" => "152222103000"},
      %{"name" => "高力板镇", "code" => "152222104000"},
      %{"name" => "好腰苏木镇", "code" => "152222105000"},
      %{"name" => "代钦塔拉苏木", "code" => "152222200000"},
      %{"name" => "新佳木苏木", "code" => "152222201000"},
      %{"name" => "哈日诺尔苏木", "code" => "152222202000"},
      %{"name" => "额木庭高勒苏木", "code" => "152222203000"},
      %{"name" => "巴彦茫哈苏木", "code" => "152222204000"},
      %{"name" => "巴彦淖尔苏木", "code" => "152222205000"},
      %{"name" => "布敦化牧场", "code" => "152222400000"},
      %{"name" => "吐列毛杜农场", "code" => "152222401000"},
      %{"name" => "孟恩套力盖矿区", "code" => "152222402000"},
      %{"name" => "布敦化矿区", "code" => "152222403000"}
    ]

  def next(input) when input == "科尔沁右翼前旗" or input == "152221",
    do: [
      %{"name" => "科尔沁镇", "code" => "152221100000"},
      %{"name" => "索伦镇", "code" => "152221101000"},
      %{"name" => "德伯斯镇", "code" => "152221102000"},
      %{"name" => "大石寨镇", "code" => "152221103000"},
      %{"name" => "归流河镇", "code" => "152221104000"},
      %{"name" => "居力很镇", "code" => "152221105000"},
      %{"name" => "察尔森镇", "code" => "152221106000"},
      %{"name" => "额尔格图镇", "code" => "152221107000"},
      %{"name" => "俄体镇", "code" => "152221108000"},
      %{"name" => "满族屯满族乡", "code" => "152221200000"},
      %{"name" => "乌兰毛都苏木", "code" => "152221201000"},
      %{"name" => "阿力得尔苏木", "code" => "152221202000"},
      %{"name" => "巴日嘎斯台乡", "code" => "152221203000"},
      %{"name" => "桃合木苏木", "code" => "152221204000"},
      %{"name" => "跃进马场", "code" => "152221400000"},
      %{"name" => "索伦牧场", "code" => "152221401000"},
      %{"name" => "阿力得尔牧场", "code" => "152221403000"},
      %{"name" => "公主陵牧场", "code" => "152221404000"},
      %{"name" => "绿水种畜繁育中心", "code" => "152221405000"},
      %{"name" => "科右前旗工业园区", "code" => "152221407000"},
      %{"name" => "科右前旗现代农牧业园区", "code" => "152221408000"}
    ]

  def next(input) when input == "阿尔山市" or input == "152202",
    do: [
      %{"name" => "林海街道", "code" => "152202001000"},
      %{"name" => "新城街道", "code" => "152202002000"},
      %{"name" => "温泉街道", "code" => "152202003000"},
      %{"name" => "伊尔施街道", "code" => "152202004000"},
      %{"name" => "天池镇", "code" => "152202100000"},
      %{"name" => "白狼镇", "code" => "152202101000"},
      %{"name" => "五岔沟镇", "code" => "152202102000"},
      %{"name" => "明水河镇", "code" => "152202103000"}
    ]

  def next(input) when input == "乌兰浩特市" or input == "152201",
    do: [
      %{"name" => "爱国街道", "code" => "152201001000"},
      %{"name" => "和平街道", "code" => "152201002000"},
      %{"name" => "兴安街道", "code" => "152201003000"},
      %{"name" => "胜利街道", "code" => "152201004000"},
      %{"name" => "铁西街道", "code" => "152201005000"},
      %{"name" => "都林街道", "code" => "152201006000"},
      %{"name" => "五一街道", "code" => "152201007000"},
      %{"name" => "城郊街道", "code" => "152201008000"},
      %{"name" => "新城街道", "code" => "152201009000"},
      %{"name" => "天骄街道", "code" => "152201010000"},
      %{"name" => "乌兰哈达镇", "code" => "152201100000"},
      %{"name" => "葛根庙镇", "code" => "152201101000"},
      %{"name" => "太本站镇", "code" => "152201102000"},
      %{"name" => "义勒力特镇", "code" => "152201103000"},
      %{"name" => "呼和马场", "code" => "152201401000"},
      %{"name" => "乌兰浩特绿色产业园", "code" => "152201402000"},
      %{"name" => "兴安盟经济技术开发区", "code" => "152201403000"}
    ]

  def next(input) when input == "丰镇市" or input == "150981",
    do: [
      %{"name" => "新城区街道", "code" => "150981005000"},
      %{"name" => "旧城区街道", "code" => "150981006000"},
      %{"name" => "北城区街道", "code" => "150981007000"},
      %{"name" => "工业区街道", "code" => "150981008000"},
      %{"name" => "南城区街道", "code" => "150981009000"},
      %{"name" => "隆盛庄镇", "code" => "150981107000"},
      %{"name" => "黑土台镇", "code" => "150981108000"},
      %{"name" => "红砂坝镇", "code" => "150981109000"},
      %{"name" => "巨宝庄镇", "code" => "150981110000"},
      %{"name" => "三义泉镇", "code" => "150981111000"},
      %{"name" => "浑源窑乡", "code" => "150981207000"},
      %{"name" => "元山子乡", "code" => "150981208000"},
      %{"name" => "官屯堡乡", "code" => "150981209000"},
      %{"name" => "内蒙古乌兰察布丰川循环经济开发区", "code" => "150981400000"}
    ]

  def next(input) when input == "四子王旗" or input == "150929",
    do: [
      %{"name" => "乌兰花镇", "code" => "150929100000"},
      %{"name" => "吉生太镇", "code" => "150929101000"},
      %{"name" => "库伦图镇", "code" => "150929102000"},
      %{"name" => "供济堂镇", "code" => "150929103000"},
      %{"name" => "白音朝克图镇", "code" => "150929104000"},
      %{"name" => "红格尔苏木", "code" => "150929200000"},
      %{"name" => "江岸苏木", "code" => "150929201000"},
      %{"name" => "查干补力格苏木", "code" => "150929202000"},
      %{"name" => "脑木更苏木", "code" => "150929203000"},
      %{"name" => "东八号乡", "code" => "150929204000"},
      %{"name" => "忽鸡图乡", "code" => "150929205000"},
      %{"name" => "大黑河乡", "code" => "150929206000"},
      %{"name" => "巴音敖包苏木", "code" => "150929207000"},
      %{"name" => "乌兰牧场", "code" => "150929400000"}
    ]

  def next(input) when input == "察哈尔右翼后旗" or input == "150928",
    do: [
      %{"name" => "白音察干镇", "code" => "150928105000"},
      %{"name" => "土牧尔台镇", "code" => "150928106000"},
      %{"name" => "红格尔图镇", "code" => "150928107000"},
      %{"name" => "贲红镇", "code" => "150928108000"},
      %{"name" => "大六号镇", "code" => "150928109000"},
      %{"name" => "当郎忽洞苏木", "code" => "150928209000"},
      %{"name" => "乌兰哈达苏木", "code" => "150928210000"},
      %{"name" => "锡勒乡", "code" => "150928211000"}
    ]

  def next(input) when input == "察哈尔右翼中旗" or input == "150927",
    do: [
      %{"name" => "科布尔镇", "code" => "150927103000"},
      %{"name" => "铁沙盖镇", "code" => "150927104000"},
      %{"name" => "黄羊城镇", "code" => "150927105000"},
      %{"name" => "广益隆镇", "code" => "150927106000"},
      %{"name" => "乌素图镇", "code" => "150927107000"},
      %{"name" => "大滩乡", "code" => "150927216000"},
      %{"name" => "宏盘乡", "code" => "150927217000"},
      %{"name" => "巴音乡", "code" => "150927218000"},
      %{"name" => "库伦苏木", "code" => "150927219000"},
      %{"name" => "乌兰哈页苏木", "code" => "150927220000"},
      %{"name" => "土城子乡", "code" => "150927221000"},
      %{"name" => "辉腾锡勒园区", "code" => "150927400000"}
    ]

  def next(input) when input == "察哈尔右翼前旗" or input == "150926",
    do: [
      %{"name" => "土贵乌拉镇", "code" => "150926105000"},
      %{"name" => "平地泉镇", "code" => "150926106000"},
      %{"name" => "玫瑰营镇", "code" => "150926107000"},
      %{"name" => "巴音塔拉镇", "code" => "150926108000"},
      %{"name" => "黄旗海镇", "code" => "150926109000"},
      %{"name" => "乌拉哈乌拉乡", "code" => "150926209000"},
      %{"name" => "黄茂营乡", "code" => "150926210000"},
      %{"name" => "三岔口乡", "code" => "150926211000"},
      %{"name" => "老圈沟乡", "code" => "150926212000"},
      %{"name" => "内蒙古乌兰察布京蒙合作产业开发区", "code" => "150926401000"}
    ]

  def next(input) when input == "凉城县" or input == "150925",
    do: [
      %{"name" => "鸿茅镇", "code" => "150925103000"},
      %{"name" => "六苏木镇", "code" => "150925104000"},
      %{"name" => "麦胡图镇", "code" => "150925105000"},
      %{"name" => "永兴镇", "code" => "150925106000"},
      %{"name" => "蛮汉镇", "code" => "150925107000"},
      %{"name" => "岱海镇", "code" => "150925108000"},
      %{"name" => "天成乡", "code" => "150925218000"},
      %{"name" => "曹碾满族乡", "code" => "150925220000"}
    ]

  def next(input) when input == "兴和县" or input == "150924",
    do: [
      %{"name" => "城关镇", "code" => "150924106000"},
      %{"name" => "张皋镇", "code" => "150924107000"},
      %{"name" => "赛乌素镇", "code" => "150924108000"},
      %{"name" => "鄂尔栋镇", "code" => "150924109000"},
      %{"name" => "店子镇", "code" => "150924110000"},
      %{"name" => "大库联乡", "code" => "150924209000"},
      %{"name" => "民族团结乡", "code" => "150924210000"},
      %{"name" => "大同夭乡", "code" => "150924211000"},
      %{"name" => "五股泉乡", "code" => "150924212000"}
    ]

  def next(input) when input == "商都县" or input == "150923",
    do: [
      %{"name" => "七台镇", "code" => "150923101000"},
      %{"name" => "十八顷镇", "code" => "150923102000"},
      %{"name" => "大黑沙土镇", "code" => "150923103000"},
      %{"name" => "西井子镇", "code" => "150923104000"},
      %{"name" => "屯垦队镇", "code" => "150923105000"},
      %{"name" => "小海子镇", "code" => "150923106000"},
      %{"name" => "大库伦乡", "code" => "150923200000"},
      %{"name" => "卯都乡", "code" => "150923201000"},
      %{"name" => "玻璃忽镜乡", "code" => "150923202000"},
      %{"name" => "三大顷乡", "code" => "150923203000"}
    ]

  def next(input) when input == "化德县" or input == "150922",
    do: [
      %{"name" => "长顺镇", "code" => "150922103000"},
      %{"name" => "朝阳镇", "code" => "150922104000"},
      %{"name" => "七号镇", "code" => "150922105000"},
      %{"name" => "德包图乡", "code" => "150922200000"},
      %{"name" => "公腊胡洞乡", "code" => "150922201000"},
      %{"name" => "白音特拉乡", "code" => "150922218000"},
      %{"name" => "内蒙古乌兰察布京蒙合作产业开发区化德产业园", "code" => "150922401000"}
    ]

  def next(input) when input == "卓资县" or input == "150921",
    do: [
      %{"name" => "卓资山镇", "code" => "150921106000"},
      %{"name" => "旗下营镇", "code" => "150921107000"},
      %{"name" => "十八台镇", "code" => "150921108000"},
      %{"name" => "巴音锡勒镇", "code" => "150921109000"},
      %{"name" => "梨花镇", "code" => "150921110000"},
      %{"name" => "大榆树乡", "code" => "150921210000"},
      %{"name" => "红召乡", "code" => "150921211000"},
      %{"name" => "复兴乡", "code" => "150921212000"}
    ]

  def next(input) when input == "集宁区" or input == "150902",
    do: [
      %{"name" => "新体路街道", "code" => "150902001000"},
      %{"name" => "桥东街道", "code" => "150902002000"},
      %{"name" => "前进路街道", "code" => "150902003000"},
      %{"name" => "常青街道", "code" => "150902004000"},
      %{"name" => "虎山街道", "code" => "150902005000"},
      %{"name" => "桥西街道", "code" => "150902006000"},
      %{"name" => "新华街街道", "code" => "150902007000"},
      %{"name" => "泉山街道", "code" => "150902008000"},
      %{"name" => "白海子镇", "code" => "150902105000"},
      %{"name" => "马莲渠乡", "code" => "150902205000"}
    ]

  def next(input) when input == "杭锦后旗" or input == "150826",
    do: [
      %{"name" => "陕坝镇", "code" => "150826100000"},
      %{"name" => "头道桥镇", "code" => "150826101000"},
      %{"name" => "二道桥镇", "code" => "150826102000"},
      %{"name" => "三道桥镇", "code" => "150826103000"},
      %{"name" => "蛮会镇", "code" => "150826104000"},
      %{"name" => "团结镇", "code" => "150826105000"},
      %{"name" => "双庙镇", "code" => "150826106000"},
      %{"name" => "沙海镇", "code" => "150826107000"},
      %{"name" => "蒙海镇", "code" => "150826108000"},
      %{"name" => "太阳庙农场", "code" => "150826500000"}
    ]

  def next(input) when input == "乌拉特后旗" or input == "150825",
    do: [
      %{"name" => "巴音宝力格镇", "code" => "150825100000"},
      %{"name" => "呼和温都尔镇", "code" => "150825101000"},
      %{"name" => "潮格温都尔镇", "code" => "150825102000"},
      %{"name" => "获各琦苏木", "code" => "150825200000"},
      %{"name" => "巴音前达门苏木", "code" => "150825201000"},
      %{"name" => "乌盖苏木", "code" => "150825202000"}
    ]

  def next(input) when input == "乌拉特中旗" or input == "150824",
    do: [
      %{"name" => "海流图镇", "code" => "150824100000"},
      %{"name" => "乌加河镇", "code" => "150824101000"},
      %{"name" => "德岭山镇", "code" => "150824102000"},
      %{"name" => "石哈河镇", "code" => "150824103000"},
      %{"name" => "甘其毛都镇", "code" => "150824104000"},
      %{"name" => "温更镇", "code" => "150824105000"},
      %{"name" => "呼勒斯太苏木", "code" => "150824200000"},
      %{"name" => "川井苏木", "code" => "150824201000"},
      %{"name" => "巴音乌兰苏木", "code" => "150824202000"},
      %{"name" => "新忽热苏木", "code" => "150824203000"},
      %{"name" => "巴彦淖尔市牧洋海牧场有限公司", "code" => "150824400000"},
      %{"name" => "巴彦淖尔市同和太种畜繁育中心", "code" => "150824401000"}
    ]

  def next(input) when input == "乌拉特前旗" or input == "150823",
    do: [
      %{"name" => "乌拉山镇", "code" => "150823100000"},
      %{"name" => "白彦花镇", "code" => "150823101000"},
      %{"name" => "先锋镇", "code" => "150823102000"},
      %{"name" => "新安镇", "code" => "150823103000"},
      %{"name" => "西小召镇", "code" => "150823104000"},
      %{"name" => "大佘太镇", "code" => "150823105000"},
      %{"name" => "明安镇", "code" => "150823106000"},
      %{"name" => "小佘太镇", "code" => "150823107000"},
      %{"name" => "苏独仑镇", "code" => "150823108000"},
      %{"name" => "额尔登布拉格苏木", "code" => "150823200000"},
      %{"name" => "沙德格苏木", "code" => "150823201000"},
      %{"name" => "巴彦淖尔市中滩农场有限公司", "code" => "150823400000"},
      %{"name" => "巴彦淖尔市西山嘴农场有限公司", "code" => "150823401000"},
      %{"name" => "巴彦淖尔市新安农场有限公司", "code" => "150823402000"},
      %{"name" => "巴彦淖尔市苏独隆农场有限公司", "code" => "150823403000"},
      %{"name" => "巴彦淖尔市大佘太牧场有限公司", "code" => "150823404000"},
      %{"name" => "巴彦淖尔市乌梁素海渔场", "code" => "150823405000"}
    ]

  def next(input) when input == "磴口县" or input == "150822",
    do: [
      %{"name" => "巴彦高勒镇", "code" => "150822100000"},
      %{"name" => "隆盛合镇", "code" => "150822101000"},
      %{"name" => "渡口镇", "code" => "150822102000"},
      %{"name" => "补隆淖镇", "code" => "150822103000"},
      %{"name" => "沙金套海苏木", "code" => "150822200000"},
      %{"name" => "磴口县农垦乌兰布和农场有限责任公司", "code" => "150822400000"},
      %{"name" => "磴口县农垦巴彦套海农场有限责任公司", "code" => "150822401000"},
      %{"name" => "磴口县农垦哈腾套海农场有限责任公司", "code" => "150822402000"},
      %{"name" => "磴口县农垦包尔盖农场有限责任公司", "code" => "150822403000"},
      %{"name" => "磴口县农垦纳林套海农场有限责任公司", "code" => "150822404000"},
      %{"name" => "中国林业科学研究院沙漠林业实验中心", "code" => "150822405000"}
    ]

  def next(input) when input == "五原县" or input == "150821",
    do: [
      %{"name" => "隆兴昌镇", "code" => "150821100000"},
      %{"name" => "塔尔湖镇", "code" => "150821101000"},
      %{"name" => "巴彦套海镇", "code" => "150821102000"},
      %{"name" => "新公中镇", "code" => "150821103000"},
      %{"name" => "天吉泰镇", "code" => "150821104000"},
      %{"name" => "胜丰镇", "code" => "150821105000"},
      %{"name" => "银定图镇", "code" => "150821106000"},
      %{"name" => "复兴镇", "code" => "150821107000"},
      %{"name" => "和胜乡", "code" => "150821200000"},
      %{"name" => "巴彦淖尔农垦建沣农场有限公司", "code" => "150821400000"},
      %{"name" => "五原县隆兴昌镇荣丰", "code" => "150821402000"}
    ]

  def next(input) when input == "临河区" or input == "150802",
    do: [
      %{"name" => "团结街道", "code" => "150802001000"},
      %{"name" => "车站街道", "code" => "150802002000"},
      %{"name" => "先锋街道", "code" => "150802003000"},
      %{"name" => "解放街道", "code" => "150802004000"},
      %{"name" => "新华街道", "code" => "150802005000"},
      %{"name" => "东环街道", "code" => "150802006000"},
      %{"name" => "铁南街道", "code" => "150802007000"},
      %{"name" => "西环街道", "code" => "150802008000"},
      %{"name" => "北环街道", "code" => "150802009000"},
      %{"name" => "金川街道", "code" => "150802013000"},
      %{"name" => "汇丰街道", "code" => "150802014000"},
      %{"name" => "狼山镇", "code" => "150802100000"},
      %{"name" => "新华镇", "code" => "150802101000"},
      %{"name" => "干召庙镇", "code" => "150802102000"},
      %{"name" => "乌兰图克镇", "code" => "150802103000"},
      %{"name" => "双河镇", "code" => "150802104000"},
      %{"name" => "城关镇", "code" => "150802105000"},
      %{"name" => "白脑包镇", "code" => "150802106000"},
      %{"name" => "曙光乡", "code" => "150802200000"},
      %{"name" => "八一乡", "code" => "150802201000"},
      %{"name" => "巴彦淖尔市狼山农场农牧业发展有限公司", "code" => "150802400000"},
      %{"name" => "巴彦淖尔市临农农牧业发展有限公司", "code" => "150802401000"}
    ]

  def next(input) when input == "根河市" or input == "150785",
    do: [
      %{"name" => "河东街道", "code" => "150785001000"},
      %{"name" => "河西街道", "code" => "150785002000"},
      %{"name" => "森工街道", "code" => "150785003000"},
      %{"name" => "好里堡街道", "code" => "150785004000"},
      %{"name" => "金河镇", "code" => "150785101000"},
      %{"name" => "阿龙山镇", "code" => "150785102000"},
      %{"name" => "满归镇", "code" => "150785103000"},
      %{"name" => "得耳布尔镇", "code" => "150785104000"},
      %{"name" => "敖鲁古雅鄂温克民族乡", "code" => "150785200000"}
    ]

  def next(input) when input == "额尔古纳市" or input == "150784",
    do: [
      %{"name" => "拉布大林街道", "code" => "150784001000"},
      %{"name" => "上库力街道", "code" => "150784002000"},
      %{"name" => "黑山头镇", "code" => "150784101000"},
      %{"name" => "莫尔道嘎镇", "code" => "150784103000"},
      %{"name" => "恩和哈达镇", "code" => "150784104000"},
      %{"name" => "三河回族乡", "code" => "150784200000"},
      %{"name" => "恩和俄罗斯族民族乡", "code" => "150784210000"},
      %{"name" => "蒙兀室韦苏木", "code" => "150784211000"},
      %{"name" => "奇乾乡", "code" => "150784212000"},
      %{"name" => "呼伦贝尔农垦拉布大林农牧场有限公司", "code" => "150784400000"},
      %{"name" => "呼伦贝尔农垦三河农牧场有限公司", "code" => "150784401000"},
      %{"name" => "呼伦贝尔农垦上库力农牧场有限公司", "code" => "150784402000"},
      %{"name" => "呼伦贝尔农垦苏沁农牧场有限公司", "code" => "150784403000"}
    ]

  def next(input) when input == "扎兰屯市" or input == "150783",
    do: [
      %{"name" => "兴华街道", "code" => "150783001000"},
      %{"name" => "正阳街道", "code" => "150783002000"},
      %{"name" => "繁荣街道", "code" => "150783003000"},
      %{"name" => "向阳街道", "code" => "150783004000"},
      %{"name" => "高台子街道", "code" => "150783005000"},
      %{"name" => "铁东街道", "code" => "150783006000"},
      %{"name" => "河西街道", "code" => "150783007000"},
      %{"name" => "蘑菇气镇", "code" => "150783100000"},
      %{"name" => "卧牛河镇", "code" => "150783102000"},
      %{"name" => "成吉思汗镇", "code" => "150783103000"},
      %{"name" => "大河湾镇", "code" => "150783104000"},
      %{"name" => "浩饶山镇", "code" => "150783105000"},
      %{"name" => "柴河镇", "code" => "150783106000"},
      %{"name" => "中和镇", "code" => "150783107000"},
      %{"name" => "哈多河镇", "code" => "150783108000"},
      %{"name" => "达斡尔民族乡", "code" => "150783200000"},
      %{"name" => "鄂伦春民族乡", "code" => "150783201000"},
      %{"name" => "萨马街鄂温克民族乡", "code" => "150783202000"},
      %{"name" => "洼堤乡", "code" => "150783203000"}
    ]

  def next(input) when input == "牙克石市" or input == "150782",
    do: [
      %{"name" => "胜利街道", "code" => "150782001000"},
      %{"name" => "红旗街道", "code" => "150782002000"},
      %{"name" => "新工街道", "code" => "150782003000"},
      %{"name" => "永兴街道", "code" => "150782004000"},
      %{"name" => "建设街道", "code" => "150782005000"},
      %{"name" => "暖泉街道", "code" => "150782006000"},
      %{"name" => "免渡河镇", "code" => "150782100000"},
      %{"name" => "博克图镇", "code" => "150782101000"},
      %{"name" => "绰河源镇", "code" => "150782102000"},
      %{"name" => "乌尔其汉镇", "code" => "150782103000"},
      %{"name" => "库都尔镇", "code" => "150782104000"},
      %{"name" => "图里河镇", "code" => "150782105000"},
      %{"name" => "乌奴耳镇", "code" => "150782106000"},
      %{"name" => "塔尔气镇", "code" => "150782107000"},
      %{"name" => "伊图里河镇", "code" => "150782108000"},
      %{"name" => "牧原镇", "code" => "150782109000"},
      %{"name" => "莫拐农场", "code" => "150782400000"},
      %{"name" => "牙克石农场", "code" => "150782401000"},
      %{"name" => "免渡河农场", "code" => "150782402000"}
    ]

  def next(input) when input == "满洲里市" or input == "150781",
    do: [
      %{"name" => "东山街道", "code" => "150781001000"},
      %{"name" => "南区街道", "code" => "150781002000"},
      %{"name" => "北区街道", "code" => "150781003000"},
      %{"name" => "兴华街道", "code" => "150781004000"},
      %{"name" => "敖尔金街道", "code" => "150781012000"},
      %{"name" => "新开河镇", "code" => "150781100000"},
      %{"name" => "满洲里市互市贸易区", "code" => "150781400000"},
      %{"name" => "满洲里市经济合作区", "code" => "150781401000"},
      %{"name" => "满洲里综合保税区", "code" => "150781406000"},
      %{"name" => "扎赉诺尔矿区", "code" => "150781407000"}
    ]

  def next(input) when input == "新巴尔虎右旗" or input == "150727",
    do: [
      %{"name" => "阿拉坦额莫勒镇", "code" => "150727100000"},
      %{"name" => "阿日哈沙特镇", "code" => "150727101000"},
      %{"name" => "呼伦镇", "code" => "150727102000"},
      %{"name" => "贝尔苏木", "code" => "150727200000"},
      %{"name" => "克尔伦苏木", "code" => "150727201000"},
      %{"name" => "达赉苏木", "code" => "150727202000"},
      %{"name" => "宝格德乌拉苏木", "code" => "150727203000"}
    ]

  def next(input) when input == "新巴尔虎左旗" or input == "150726",
    do: [
      %{"name" => "嵯岗镇", "code" => "150726101000"},
      %{"name" => "阿木古郎镇", "code" => "150726102000"},
      %{"name" => "新宝力格苏木", "code" => "150726202000"},
      %{"name" => "乌布尔宝力格苏木", "code" => "150726203000"},
      %{"name" => "罕达盖苏木", "code" => "150726204000"},
      %{"name" => "吉布胡郎图苏木", "code" => "150726205000"},
      %{"name" => "甘珠尔苏木", "code" => "150726206000"}
    ]

  def next(input) when input == "陈巴尔虎旗" or input == "150725",
    do: [
      %{"name" => "巴彦库仁镇", "code" => "150725100000"},
      %{"name" => "宝日希勒镇", "code" => "150725101000"},
      %{"name" => "呼和诺尔镇", "code" => "150725102000"},
      %{"name" => "西乌珠尔苏木", "code" => "150725200000"},
      %{"name" => "鄂温克民族苏木", "code" => "150725201000"},
      %{"name" => "东乌珠尔苏木", "code" => "150725202000"},
      %{"name" => "巴彦哈达苏木", "code" => "150725203000"},
      %{"name" => "陈巴尔虎旗哈达图国营农牧场", "code" => "150725501000"},
      %{"name" => "内蒙古自治区国有浩特陶海牧场", "code" => "150725502000"},
      %{"name" => "陈巴尔虎旗特泥河农牧场", "code" => "150725503000"}
    ]

  def next(input) when input == "鄂温克族自治旗" or input == "150724",
    do: [
      %{"name" => "巴彦托海镇", "code" => "150724100000"},
      %{"name" => "大雁镇", "code" => "150724110000"},
      %{"name" => "伊敏河镇", "code" => "150724111000"},
      %{"name" => "红花尔基镇", "code" => "150724112000"},
      %{"name" => "巴彦嵯岗苏木", "code" => "150724210000"},
      %{"name" => "锡尼河西苏木", "code" => "150724211000"},
      %{"name" => "锡尼河东苏木", "code" => "150724212000"},
      %{"name" => "巴彦塔拉达斡尔民族乡", "code" => "150724213000"},
      %{"name" => "伊敏苏木", "code" => "150724214000"},
      %{"name" => "辉苏木", "code" => "150724215000"},
      %{"name" => "巴彦托海经济开发区", "code" => "150724400000"}
    ]

  def next(input) when input == "鄂伦春自治旗" or input == "150723",
    do: [
      %{"name" => "阿里河镇", "code" => "150723100000"},
      %{"name" => "大杨树镇", "code" => "150723101000"},
      %{"name" => "甘河镇", "code" => "150723102000"},
      %{"name" => "吉文镇", "code" => "150723103000"},
      %{"name" => "诺敏镇", "code" => "150723104000"},
      %{"name" => "乌鲁布铁镇", "code" => "150723105000"},
      %{"name" => "宜里镇", "code" => "150723106000"},
      %{"name" => "克一河镇", "code" => "150723107000"},
      %{"name" => "古里乡", "code" => "150723200000"},
      %{"name" => "托扎敏乡", "code" => "150723201000"}
    ]

  def next(input) when input == "莫力达瓦达斡尔族自治旗" or input == "150722",
    do: [
      %{"name" => "尼尔基镇", "code" => "150722100000"},
      %{"name" => "宝山镇", "code" => "150722102000"},
      %{"name" => "哈达阳镇", "code" => "150722103000"},
      %{"name" => "阿尔拉镇", "code" => "150722104000"},
      %{"name" => "汉古尔河镇", "code" => "150722105000"},
      %{"name" => "西瓦尔图镇", "code" => "150722106000"},
      %{"name" => "腾克镇", "code" => "150722108000"},
      %{"name" => "奎勒河镇", "code" => "150722109000"},
      %{"name" => "塔温敖宝镇", "code" => "150722110000"},
      %{"name" => "登特科镇", "code" => "150722111000"},
      %{"name" => "红彦镇", "code" => "150722112000"},
      %{"name" => "库如奇乡", "code" => "150722201000"},
      %{"name" => "额尔和乡", "code" => "150722202000"},
      %{"name" => "杜拉尔鄂温克民族乡", "code" => "150722203000"},
      %{"name" => "巴彦鄂温克民族乡", "code" => "150722205000"}
    ]

  def next(input) when input == "阿荣旗" or input == "150721",
    do: [
      %{"name" => "那吉镇", "code" => "150721100000"},
      %{"name" => "六合镇", "code" => "150721101000"},
      %{"name" => "亚东镇", "code" => "150721102000"},
      %{"name" => "霍尔奇镇", "code" => "150721103000"},
      %{"name" => "向阳峪镇", "code" => "150721104000"},
      %{"name" => "三岔河镇", "code" => "150721105000"},
      %{"name" => "复兴镇", "code" => "150721106000"},
      %{"name" => "兴安镇", "code" => "150721108000"},
      %{"name" => "得力其尔鄂温克民族乡", "code" => "150721200000"},
      %{"name" => "查巴奇鄂温克民族乡", "code" => "150721201000"},
      %{"name" => "音河达斡尔鄂温克民族乡", "code" => "150721202000"},
      %{"name" => "新发朝鲜民族乡", "code" => "150721203000"},
      %{"name" => "阿荣旗林业和草原局", "code" => "150721402000"}
    ]

  def next(input) when input == "扎赉诺尔区" or input == "150703",
    do: [
      %{"name" => "第三街道", "code" => "150703001000"},
      %{"name" => "第一街道", "code" => "150703002000"},
      %{"name" => "第二街道", "code" => "150703003000"},
      %{"name" => "第四街道", "code" => "150703004000"},
      %{"name" => "第五街道", "code" => "150703005000"},
      %{"name" => "灵泉镇", "code" => "150703100000"}
    ]

  def next(input) when input == "海拉尔区" or input == "150702",
    do: [
      %{"name" => "正阳街道", "code" => "150702001000"},
      %{"name" => "健康街道", "code" => "150702002000"},
      %{"name" => "靠山街道", "code" => "150702003000"},
      %{"name" => "胜利街道", "code" => "150702004000"},
      %{"name" => "呼伦街道", "code" => "150702005000"},
      %{"name" => "建设街道", "code" => "150702007000"},
      %{"name" => "东山街道", "code" => "150702008000"},
      %{"name" => "哈克镇", "code" => "150702100000"},
      %{"name" => "奋斗镇", "code" => "150702101000"}
    ]

  def next(input) when input == "伊金霍洛旗" or input == "150627",
    do: [
      %{"name" => "阿勒腾席热镇", "code" => "150627100000"},
      %{"name" => "札萨克镇", "code" => "150627101000"},
      %{"name" => "乌兰木伦镇", "code" => "150627102000"},
      %{"name" => "纳林陶亥镇", "code" => "150627103000"},
      %{"name" => "苏布尔嘎镇", "code" => "150627104000"},
      %{"name" => "红庆河镇", "code" => "150627105000"},
      %{"name" => "伊金霍洛镇", "code" => "150627106000"},
      %{"name" => "鄂尔多斯蒙苏经济开发区", "code" => "150627400000"},
      %{"name" => "鄂尔多斯空港物流园区", "code" => "150627407000"}
    ]

  def next(input) when input == "乌审旗" or input == "150626",
    do: [
      %{"name" => "嘎鲁图镇", "code" => "150626100000"},
      %{"name" => "乌审召镇", "code" => "150626101000"},
      %{"name" => "图克镇", "code" => "150626102000"},
      %{"name" => "乌兰陶勒盖镇", "code" => "150626103000"},
      %{"name" => "无定河镇", "code" => "150626104000"},
      %{"name" => "苏力德苏木", "code" => "150626200000"},
      %{"name" => "苏里格经济开发区", "code" => "150626410000"}
    ]

  def next(input) when input == "杭锦旗" or input == "150625",
    do: [
      %{"name" => "锡尼镇", "code" => "150625100000"},
      %{"name" => "巴拉贡镇", "code" => "150625101000"},
      %{"name" => "吉日嘎朗图镇", "code" => "150625102000"},
      %{"name" => "独贵塔拉镇", "code" => "150625103000"},
      %{"name" => "呼和木独镇", "code" => "150625104000"},
      %{"name" => "伊和乌素苏木", "code" => "150625200000"},
      %{"name" => "内蒙古鄂尔多斯杭锦经济开发区", "code" => "150625400000"}
    ]

  def next(input) when input == "鄂托克旗" or input == "150624",
    do: [
      %{"name" => "乌兰镇", "code" => "150624100000"},
      %{"name" => "棋盘井镇", "code" => "150624101000"},
      %{"name" => "蒙西镇", "code" => "150624102000"},
      %{"name" => "木凯淖尔镇", "code" => "150624103000"},
      %{"name" => "苏米图苏木", "code" => "150624200000"},
      %{"name" => "阿尔巴斯苏木", "code" => "150624201000"},
      %{"name" => "内蒙古鄂托克经济开发区", "code" => "150624404000"}
    ]

  def next(input) when input == "鄂托克前旗" or input == "150623",
    do: [
      %{"name" => "敖勒召其镇", "code" => "150623100000"},
      %{"name" => "上海庙镇", "code" => "150623101000"},
      %{"name" => "城川镇", "code" => "150623102000"},
      %{"name" => "昂素镇", "code" => "150623103000"},
      %{"name" => "上海庙经济开发区", "code" => "150623400000"}
    ]

  def next(input) when input == "准格尔旗" or input == "150622",
    do: [
      %{"name" => "兴隆街道", "code" => "150622001000"},
      %{"name" => "迎泽街道", "code" => "150622002000"},
      %{"name" => "蓝天街道", "code" => "150622003000"},
      %{"name" => "友谊街道", "code" => "150622004000"},
      %{"name" => "薛家湾镇", "code" => "150622100000"},
      %{"name" => "沙圪堵镇", "code" => "150622101000"},
      %{"name" => "大路镇", "code" => "150622102000"},
      %{"name" => "纳日松镇", "code" => "150622103000"},
      %{"name" => "龙口镇", "code" => "150622104000"},
      %{"name" => "准格尔召镇", "code" => "150622105000"},
      %{"name" => "魏家峁镇", "code" => "150622106000"},
      %{"name" => "暖水乡", "code" => "150622200000"},
      %{"name" => "十二连城乡", "code" => "150622201000"},
      %{"name" => "布尔陶亥苏木", "code" => "150622202000"},
      %{"name" => "准格尔经济开发区", "code" => "150622400000"}
    ]

  def next(input) when input == "达拉特旗" or input == "150621",
    do: [
      %{"name" => "工业街道", "code" => "150621001000"},
      %{"name" => "昭君街道", "code" => "150621002000"},
      %{"name" => "锡尼街道", "code" => "150621003000"},
      %{"name" => "白塔街道", "code" => "150621004000"},
      %{"name" => "西园街道", "code" => "150621005000"},
      %{"name" => "平原街道", "code" => "150621006000"},
      %{"name" => "树林召镇", "code" => "150621100000"},
      %{"name" => "吉格斯太镇", "code" => "150621101000"},
      %{"name" => "白泥井镇", "code" => "150621102000"},
      %{"name" => "王爱召镇", "code" => "150621103000"},
      %{"name" => "昭君镇", "code" => "150621104000"},
      %{"name" => "恩格贝镇", "code" => "150621105000"},
      %{"name" => "中和西镇", "code" => "150621106000"},
      %{"name" => "风水梁镇", "code" => "150621107000"},
      %{"name" => "展旦召苏木", "code" => "150621200000"},
      %{"name" => "达拉特经济开发区", "code" => "150621400000"},
      %{"name" => "鄂尔多斯市生态示范区", "code" => "150621401000"}
    ]

  def next(input) when input == "康巴什区" or input == "150603",
    do: [
      %{"name" => "哈巴格希街道", "code" => "150603001000"},
      %{"name" => "青春山街道", "code" => "150603002000"},
      %{"name" => "滨河街道", "code" => "150603003000"},
      %{"name" => "康新街道", "code" => "150603008000"},
      %{"name" => "鄂尔多斯市高新技术产业园区", "code" => "150603400000"}
    ]

  def next(input) when input == "东胜区" or input == "150602",
    do: [
      %{"name" => "交通街道", "code" => "150602001000"},
      %{"name" => "公园街道", "code" => "150602002000"},
      %{"name" => "林荫街道", "code" => "150602003000"},
      %{"name" => "建设街道", "code" => "150602004000"},
      %{"name" => "富兴街道", "code" => "150602005000"},
      %{"name" => "天骄街道", "code" => "150602006000"},
      %{"name" => "诃额伦街道", "code" => "150602007000"},
      %{"name" => "巴音门克街道", "code" => "150602008000"},
      %{"name" => "幸福街道", "code" => "150602010000"},
      %{"name" => "纺织街道", "code" => "150602011000"},
      %{"name" => "兴胜街道", "code" => "150602012000"},
      %{"name" => "民族街道", "code" => "150602013000"},
      %{"name" => "泊尔江海子镇", "code" => "150602100000"},
      %{"name" => "罕台镇", "code" => "150602101000"},
      %{"name" => "铜川镇", "code" => "150602102000"},
      %{"name" => "鄂尔多斯高新技术产业开发区", "code" => "150602405000"}
    ]

  def next(input) when input == "霍林郭勒市" or input == "150581",
    do: [
      %{"name" => "珠斯花街道", "code" => "150581001000"},
      %{"name" => "莫斯台街道", "code" => "150581002000"},
      %{"name" => "宝日呼吉尔街道", "code" => "150581003000"},
      %{"name" => "沙尔呼热街道", "code" => "150581004000"},
      %{"name" => "达来胡硕苏木", "code" => "150581200000"},
      %{"name" => "霍林郭勒市军马场生态保护区", "code" => "150581400000"}
    ]

  def next(input) when input == "通辽经济技术开发区" or input == "150571",
    do: [
      %{"name" => "河西街道", "code" => "150571001000"},
      %{"name" => "电厂街道", "code" => "150571002000"},
      %{"name" => "新城街道", "code" => "150571003000"},
      %{"name" => "滨河街道", "code" => "150571004000"},
      %{"name" => "辽河镇", "code" => "150571100000"}
    ]

  def next(input) when input == "扎鲁特旗" or input == "150526",
    do: [
      %{"name" => "鲁北镇", "code" => "150526100000"},
      %{"name" => "黄花山镇", "code" => "150526101000"},
      %{"name" => "嘎亥图镇", "code" => "150526102000"},
      %{"name" => "巨日合镇", "code" => "150526103000"},
      %{"name" => "巴雅尔吐胡硕镇", "code" => "150526104000"},
      %{"name" => "香山镇", "code" => "150526105000"},
      %{"name" => "阿日昆都楞镇", "code" => "150526106000"},
      %{"name" => "巴彦塔拉苏木", "code" => "150526200000"},
      %{"name" => "乌力吉木仁苏木", "code" => "150526201000"},
      %{"name" => "道老杜苏木", "code" => "150526202000"},
      %{"name" => "格日朝鲁苏木", "code" => "150526203000"},
      %{"name" => "前德门苏木", "code" => "150526204000"},
      %{"name" => "乌兰哈达苏木", "code" => "150526205000"},
      %{"name" => "查布嘎图苏木", "code" => "150526206000"},
      %{"name" => "乌额格其苏木", "code" => "150526207000"},
      %{"name" => "乌额格其牧场", "code" => "150526400000"},
      %{"name" => "香山农场", "code" => "150526401000"},
      %{"name" => "乌日根塔拉农场", "code" => "150526402000"},
      %{"name" => "通辽市嘎达苏种畜繁育中心", "code" => "150526403000"}
    ]

  def next(input) when input == "奈曼旗" or input == "150525",
    do: [
      %{"name" => "大沁他拉镇", "code" => "150525100000"},
      %{"name" => "八仙筒镇", "code" => "150525101000"},
      %{"name" => "青龙山镇", "code" => "150525102000"},
      %{"name" => "新镇", "code" => "150525103000"},
      %{"name" => "治安镇", "code" => "150525104000"},
      %{"name" => "东明镇", "code" => "150525105000"},
      %{"name" => "沙日浩来镇", "code" => "150525106000"},
      %{"name" => "义隆永镇", "code" => "150525107000"},
      %{"name" => "固日班花苏木", "code" => "150525200000"},
      %{"name" => "白音他拉苏木", "code" => "150525201000"},
      %{"name" => "明仁苏木", "code" => "150525202000"},
      %{"name" => "黄花塔拉苏木", "code" => "150525203000"},
      %{"name" => "土城子乡", "code" => "150525204000"},
      %{"name" => "苇莲苏乡", "code" => "150525205000"},
      %{"name" => "国有六号农场", "code" => "150525400000"},
      %{"name" => "大沁他拉街道", "code" => "150525401000"}
    ]

  def next(input) when input == "库伦旗" or input == "150524",
    do: [
      %{"name" => "库伦镇", "code" => "150524100000"},
      %{"name" => "扣河子镇", "code" => "150524101000"},
      %{"name" => "白音花镇", "code" => "150524102000"},
      %{"name" => "六家子镇", "code" => "150524103000"},
      %{"name" => "额勒顺镇", "code" => "150524104000"},
      %{"name" => "茫汗苏木", "code" => "150524200000"},
      %{"name" => "先进苏木", "code" => "150524201000"},
      %{"name" => "水泉乡", "code" => "150524202000"},
      %{"name" => "库伦街道", "code" => "150524400000"}
    ]

  def next(input) when input == "开鲁县" or input == "150523",
    do: [
      %{"name" => "开鲁镇", "code" => "150523100000"},
      %{"name" => "大榆树镇", "code" => "150523101000"},
      %{"name" => "黑龙坝镇", "code" => "150523102000"},
      %{"name" => "麦新镇", "code" => "150523103000"},
      %{"name" => "义和塔拉镇", "code" => "150523104000"},
      %{"name" => "建华镇", "code" => "150523105000"},
      %{"name" => "小街基镇", "code" => "150523106000"},
      %{"name" => "东风镇", "code" => "150523107000"},
      %{"name" => "吉日嘎郎吐镇", "code" => "150523108000"},
      %{"name" => "东来镇", "code" => "150523109000"},
      %{"name" => "清河牧场", "code" => "150523400000"},
      %{"name" => "辽河农场", "code" => "150523401000"},
      %{"name" => "保安农场", "code" => "150523402000"}
    ]

  def next(input) when input == "科尔沁左翼后旗" or input == "150522",
    do: [
      %{"name" => "甘旗卡镇", "code" => "150522100000"},
      %{"name" => "吉尔嘎朗镇", "code" => "150522101000"},
      %{"name" => "金宝屯镇", "code" => "150522102000"},
      %{"name" => "常胜镇", "code" => "150522103000"},
      %{"name" => "查日苏镇", "code" => "150522104000"},
      %{"name" => "双胜镇", "code" => "150522105000"},
      %{"name" => "阿古拉镇", "code" => "150522106000"},
      %{"name" => "朝鲁吐镇", "code" => "150522107000"},
      %{"name" => "努古斯台镇", "code" => "150522108000"},
      %{"name" => "海鲁吐镇", "code" => "150522109000"},
      %{"name" => "阿都沁苏木", "code" => "150522200000"},
      %{"name" => "茂道吐苏木", "code" => "150522201000"},
      %{"name" => "巴胡塔苏木", "code" => "150522202000"},
      %{"name" => "散都苏木", "code" => "150522203000"},
      %{"name" => "巴彦毛都苏木", "code" => "150522204000"},
      %{"name" => "通辽市国有胜利农场", "code" => "150522400000"},
      %{"name" => "通辽市国有孟根达坝牧场", "code" => "150522401000"},
      %{"name" => "通辽市国有查金台牧场", "code" => "150522402000"},
      %{"name" => "原种繁育中心", "code" => "150522403000"},
      %{"name" => "大青沟国家级自然保护区管理局", "code" => "150522404000"},
      %{"name" => "科尔沁左翼后旗畜牧水产技术服务中心", "code" => "150522405000"},
      %{"name" => "乌兰敖道渔场", "code" => "150522406000"},
      %{"name" => "金宝屯机械化林场", "code" => "150522407000"},
      %{"name" => "朝鲁吐林场", "code" => "150522408000"},
      %{"name" => "茂道吐林场", "code" => "150522409000"},
      %{"name" => "伊胡塔林场", "code" => "150522410000"},
      %{"name" => "乌旦塔拉林场", "code" => "150522411000"}
    ]

  def next(input) when input == "科尔沁左翼中旗" or input == "150521",
    do: [
      %{"name" => "保康镇", "code" => "150521100000"},
      %{"name" => "宝龙山镇", "code" => "150521101000"},
      %{"name" => "舍伯吐镇", "code" => "150521102000"},
      %{"name" => "巴彦塔拉镇", "code" => "150521103000"},
      %{"name" => "门达镇", "code" => "150521104000"},
      %{"name" => "架玛吐镇", "code" => "150521105000"},
      %{"name" => "腰林毛都镇", "code" => "150521106000"},
      %{"name" => "希伯花镇", "code" => "150521107000"},
      %{"name" => "花吐古拉镇", "code" => "150521108000"},
      %{"name" => "代力吉镇", "code" => "150521109000"},
      %{"name" => "努日木镇", "code" => "150521110000"},
      %{"name" => "花胡硕苏木", "code" => "150521200000"},
      %{"name" => "协代苏木", "code" => "150521201000"},
      %{"name" => "白兴吐苏木", "code" => "150521202000"},
      %{"name" => "图布信苏木", "code" => "150521203000"},
      %{"name" => "敖包苏木", "code" => "150521204000"},
      %{"name" => "胜利乡", "code" => "150521205000"},
      %{"name" => "白音塔拉农场", "code" => "150521400000"},
      %{"name" => "珠日河牧场", "code" => "150521401000"},
      %{"name" => "丰库牧场", "code" => "150521402000"},
      %{"name" => "保康街道", "code" => "150521403000"}
    ]

  def next(input) when input == "科尔沁区" or input == "150502",
    do: [
      %{"name" => "科尔沁街道", "code" => "150502001000"},
      %{"name" => "西门街道", "code" => "150502002000"},
      %{"name" => "永清街道", "code" => "150502003000"},
      %{"name" => "明仁街道", "code" => "150502004000"},
      %{"name" => "施介街道", "code" => "150502005000"},
      %{"name" => "团结街道", "code" => "150502006000"},
      %{"name" => "东郊街道", "code" => "150502007000"},
      %{"name" => "铁路街道", "code" => "150502008000"},
      %{"name" => "红星街道", "code" => "150502009000"},
      %{"name" => "霍林河街道", "code" => "150502010000"},
      %{"name" => "建国街道", "code" => "150502011000"},
      %{"name" => "大林镇", "code" => "150502100000"},
      %{"name" => "钱家店镇", "code" => "150502101000"},
      %{"name" => "余粮堡镇", "code" => "150502102000"},
      %{"name" => "木里图镇", "code" => "150502103000"},
      %{"name" => "丰田镇", "code" => "150502104000"},
      %{"name" => "清河镇", "code" => "150502105000"},
      %{"name" => "育新镇", "code" => "150502106000"},
      %{"name" => "庆和镇", "code" => "150502107000"},
      %{"name" => "敖力布皋镇", "code" => "150502108000"},
      %{"name" => "莫力庙苏木", "code" => "150502200000"},
      %{"name" => "国有哲南农场", "code" => "150502400000"},
      %{"name" => "三义堂农场", "code" => "150502401000"},
      %{"name" => "通辽市高林屯种畜繁育中心", "code" => "150502402000"},
      %{"name" => "胡力海原种繁殖场", "code" => "150502403000"},
      %{"name" => "莫力庙种羊场", "code" => "150502404000"},
      %{"name" => "半截店牧场", "code" => "150502405000"}
    ]

  def next(input) when input == "敖汉旗" or input == "150430",
    do: [
      %{"name" => "新惠镇", "code" => "150430100000"},
      %{"name" => "四家子镇", "code" => "150430101000"},
      %{"name" => "长胜镇", "code" => "150430102000"},
      %{"name" => "贝子府镇", "code" => "150430103000"},
      %{"name" => "四道湾子镇", "code" => "150430104000"},
      %{"name" => "下洼镇", "code" => "150430105000"},
      %{"name" => "金厂沟梁镇", "code" => "150430106000"},
      %{"name" => "兴隆洼镇", "code" => "150430107000"},
      %{"name" => "黄羊洼镇", "code" => "150430108000"},
      %{"name" => "古鲁板蒿镇", "code" => "150430109000"},
      %{"name" => "牛古吐镇", "code" => "150430110000"},
      %{"name" => "木头营子乡", "code" => "150430202000"},
      %{"name" => "丰收乡", "code" => "150430204000"},
      %{"name" => "玛尼罕乡", "code" => "150430205000"},
      %{"name" => "萨力巴乡", "code" => "150430206000"},
      %{"name" => "敖润苏莫苏木", "code" => "150430207000"},
      %{"name" => "敖汉旗工业园区", "code" => "150430401000"},
      %{"name" => "敖汉旗人民政府新州街道", "code" => "150430404000"},
      %{"name" => "敖汉旗惠州街道", "code" => "150430405000"}
    ]

  def next(input) when input == "宁城县" or input == "150429",
    do: [
      %{"name" => "天义镇", "code" => "150429100000"},
      %{"name" => "小城子镇", "code" => "150429101000"},
      %{"name" => "大城子镇", "code" => "150429102000"},
      %{"name" => "八里罕镇", "code" => "150429103000"},
      %{"name" => "黑里河镇", "code" => "150429104000"},
      %{"name" => "右北平镇", "code" => "150429105000"},
      %{"name" => "大双庙镇", "code" => "150429106000"},
      %{"name" => "汐子镇", "code" => "150429107000"},
      %{"name" => "大明镇", "code" => "150429108000"},
      %{"name" => "忙农镇", "code" => "150429109000"},
      %{"name" => "五化镇", "code" => "150429110000"},
      %{"name" => "三座店镇", "code" => "150429111000"},
      %{"name" => "必斯营子镇", "code" => "150429112000"},
      %{"name" => "一肯中乡", "code" => "150429202000"},
      %{"name" => "存金沟乡", "code" => "150429203000"},
      %{"name" => "中京工业园", "code" => "150429400000"},
      %{"name" => "塞飞亚食品工业园", "code" => "150429401000"},
      %{"name" => "八里罕酒业园区", "code" => "150429402000"},
      %{"name" => "再生资源产业园", "code" => "150429403000"},
      %{"name" => "生物科技产业园区", "code" => "150429404000"},
      %{"name" => "汐子工业园", "code" => "150429405000"},
      %{"name" => "农机产业园区", "code" => "150429406000"},
      %{"name" => "宁城县铁西街道", "code" => "150429407000"},
      %{"name" => "宁城县铁东街道", "code" => "150429408000"},
      %{"name" => "宁城县温泉街道", "code" => "150429409000"}
    ]

  def next(input) when input == "喀喇沁旗" or input == "150428",
    do: [
      %{"name" => "锦山镇", "code" => "150428100000"},
      %{"name" => "美林镇", "code" => "150428101000"},
      %{"name" => "王爷府镇", "code" => "150428102000"},
      %{"name" => "小牛群镇", "code" => "150428103000"},
      %{"name" => "牛家营子镇", "code" => "150428104000"},
      %{"name" => "乃林镇", "code" => "150428105000"},
      %{"name" => "西桥镇", "code" => "150428106000"},
      %{"name" => "十家满族乡", "code" => "150428200000"},
      %{"name" => "南台子乡", "code" => "150428201000"},
      %{"name" => "乃林果树农场", "code" => "150428400000"},
      %{"name" => "马鞍山羊场", "code" => "150428401000"},
      %{"name" => "喀喇沁经济开发区", "code" => "150428402000"},
      %{"name" => "河北街道", "code" => "150428404000"},
      %{"name" => "河南街道", "code" => "150428405000"}
    ]

  def next(input) when input == "翁牛特旗" or input == "150426",
    do: [
      %{"name" => "乌丹镇", "code" => "150426100000"},
      %{"name" => "乌敦套海镇", "code" => "150426101000"},
      %{"name" => "五分地镇", "code" => "150426102000"},
      %{"name" => "桥头镇", "code" => "150426103000"},
      %{"name" => "广德公镇", "code" => "150426104000"},
      %{"name" => "梧桐花镇", "code" => "150426105000"},
      %{"name" => "海拉苏镇", "code" => "150426106000"},
      %{"name" => "亿合公镇", "code" => "150426107000"},
      %{"name" => "解放营子乡", "code" => "150426200000"},
      %{"name" => "阿什罕苏木", "code" => "150426201000"},
      %{"name" => "新苏莫苏木", "code" => "150426202000"},
      %{"name" => "白音套海苏木", "code" => "150426203000"},
      %{"name" => "毛山东乡", "code" => "150426204000"},
      %{"name" => "格日僧苏木", "code" => "150426205000"},
      %{"name" => "玉龙工业园区", "code" => "150426400000"},
      %{"name" => "紫城街道", "code" => "150426402000"},
      %{"name" => "全宁街道", "code" => "150426403000"}
    ]

  def next(input) when input == "克什克腾旗" or input == "150425",
    do: [
      %{"name" => "经棚镇", "code" => "150425100000"},
      %{"name" => "宇宙地镇", "code" => "150425101000"},
      %{"name" => "土城子镇", "code" => "150425102000"},
      %{"name" => "同兴镇", "code" => "150425103000"},
      %{"name" => "万合永镇", "code" => "150425104000"},
      %{"name" => "芝瑞镇", "code" => "150425105000"},
      %{"name" => "达来诺日镇", "code" => "150425106000"},
      %{"name" => "新开地乡", "code" => "150425200000"},
      %{"name" => "红山子乡", "code" => "150425201000"},
      %{"name" => "达日罕乌拉苏木", "code" => "150425202000"},
      %{"name" => "巴彦查干苏木", "code" => "150425203000"},
      %{"name" => "浩来呼热苏木", "code" => "150425204000"},
      %{"name" => "乌兰布统苏木", "code" => "150425205000"},
      %{"name" => "应昌街道", "code" => "150425400000"},
      %{"name" => "热水塘街道", "code" => "150425401000"},
      %{"name" => "西拉沐沦街道", "code" => "150425403000"}
    ]

  def next(input) when input == "林西县" or input == "150424",
    do: [
      %{"name" => "林西镇", "code" => "150424100000"},
      %{"name" => "新城子镇", "code" => "150424101000"},
      %{"name" => "新林镇", "code" => "150424102000"},
      %{"name" => "五十家子镇", "code" => "150424103000"},
      %{"name" => "官地镇", "code" => "150424104000"},
      %{"name" => "大井镇", "code" => "150424105000"},
      %{"name" => "统部镇", "code" => "150424106000"},
      %{"name" => "大营子乡", "code" => "150424200000"},
      %{"name" => "十二吐乡", "code" => "150424201000"},
      %{"name" => "城北街道", "code" => "150424400000"},
      %{"name" => "城南街道", "code" => "150424401000"},
      %{"name" => "内蒙古林西工业园区", "code" => "150424402000"}
    ]

  def next(input) when input == "巴林右旗" or input == "150423",
    do: [
      %{"name" => "大板镇", "code" => "150423100000"},
      %{"name" => "索博日嘎镇", "code" => "150423101000"},
      %{"name" => "宝日勿苏镇", "code" => "150423102000"},
      %{"name" => "查干诺尔镇", "code" => "150423103000"},
      %{"name" => "巴彦琥硕镇", "code" => "150423105000"},
      %{"name" => "西拉沐沦苏木", "code" => "150423200000"},
      %{"name" => "巴彦塔拉苏木", "code" => "150423201000"},
      %{"name" => "幸福之路苏木", "code" => "150423202000"},
      %{"name" => "查干沐沦苏木", "code" => "150423203000"},
      %{"name" => "内蒙古赤峰冶金化工开发区管理委员会巴林右旗产业园", "code" => "150423400000"},
      %{"name" => "赛罕街道", "code" => "150423401000"},
      %{"name" => "达尔罕街道", "code" => "150423402000"}
    ]

  def next(input) when input == "巴林左旗" or input == "150422",
    do: [
      %{"name" => "林东镇", "code" => "150422100000"},
      %{"name" => "隆昌镇", "code" => "150422101000"},
      %{"name" => "十三敖包镇", "code" => "150422102000"},
      %{"name" => "碧流台镇", "code" => "150422103000"},
      %{"name" => "富河镇", "code" => "150422104000"},
      %{"name" => "白音勿拉镇", "code" => "150422105000"},
      %{"name" => "哈拉哈达镇", "code" => "150422106000"},
      %{"name" => "查干哈达苏木", "code" => "150422200000"},
      %{"name" => "乌兰达坝苏木", "code" => "150422201000"},
      %{"name" => "三山乡", "code" => "150422202000"},
      %{"name" => "花加拉嘎乡", "code" => "150422203000"},
      %{"name" => "林东西城街道", "code" => "150422403000"},
      %{"name" => "林东东城街道", "code" => "150422404000"},
      %{"name" => "林东产业园", "code" => "150422405000"}
    ]

  def next(input) when input == "阿鲁科尔沁旗" or input == "150421",
    do: [
      %{"name" => "天山镇", "code" => "150421100000"},
      %{"name" => "天山口镇", "code" => "150421101000"},
      %{"name" => "双胜镇", "code" => "150421102000"},
      %{"name" => "坤都镇", "code" => "150421103000"},
      %{"name" => "巴彦花镇", "code" => "150421104000"},
      %{"name" => "绍根镇", "code" => "150421105000"},
      %{"name" => "扎嘎斯台镇", "code" => "150421106000"},
      %{"name" => "新民乡", "code" => "150421200000"},
      %{"name" => "先锋乡", "code" => "150421201000"},
      %{"name" => "罕苏木苏木", "code" => "150421202000"},
      %{"name" => "赛罕塔拉苏木", "code" => "150421203000"},
      %{"name" => "巴拉奇如德苏木", "code" => "150421204000"},
      %{"name" => "乌兰哈达乡", "code" => "150421205000"},
      %{"name" => "巴彦温都尔苏木", "code" => "150421206000"},
      %{"name" => "轻工食品产业园", "code" => "150421400000"},
      %{"name" => "新能源产业园", "code" => "150421401000"},
      %{"name" => "绍根煤碳及煤化工产业园", "code" => "150421402000"},
      %{"name" => "罕乌拉街道", "code" => "150421403000"},
      %{"name" => "欧沐沦街道", "code" => "150421404000"}
    ]

  def next(input) when input == "松山区" or input == "150404",
    do: [
      %{"name" => "振兴街道", "code" => "150404001000"},
      %{"name" => "向阳街道", "code" => "150404002000"},
      %{"name" => "松州街道", "code" => "150404003000"},
      %{"name" => "铁东街道", "code" => "150404004000"},
      %{"name" => "穆家营子镇", "code" => "150404100000"},
      %{"name" => "初头朗镇", "code" => "150404101000"},
      %{"name" => "大庙镇", "code" => "150404102000"},
      %{"name" => "王府镇", "code" => "150404103000"},
      %{"name" => "老府镇", "code" => "150404104000"},
      %{"name" => "哈拉道口镇", "code" => "150404105000"},
      %{"name" => "上官地镇", "code" => "150404106000"},
      %{"name" => "安庆镇", "code" => "150404107000"},
      %{"name" => "太平地镇", "code" => "150404108000"},
      %{"name" => "当铺地满族乡", "code" => "150404200000"},
      %{"name" => "夏家店乡", "code" => "150404201000"},
      %{"name" => "城子乡", "code" => "150404202000"},
      %{"name" => "大夫营子乡", "code" => "150404203000"},
      %{"name" => "岗子乡", "code" => "150404204000"},
      %{"name" => "玉龙街道", "code" => "150404400000"},
      %{"name" => "全宁街道", "code" => "150404401000"},
      %{"name" => "兴安街道", "code" => "150404407000"},
      %{"name" => "松城街道筹备处", "code" => "150404408000"}
    ]

  def next(input) when input == "元宝山区" or input == "150403",
    do: [
      %{"name" => "西露天街道", "code" => "150403001000"},
      %{"name" => "平庄城区街道", "code" => "150403002000"},
      %{"name" => "平庄东城街道", "code" => "150403003000"},
      %{"name" => "平庄西城街道", "code" => "150403004000"},
      %{"name" => "马林街道", "code" => "150403005000"},
      %{"name" => "云杉路街道", "code" => "150403006000"},
      %{"name" => "风水沟镇", "code" => "150403100000"},
      %{"name" => "元宝山镇", "code" => "150403101000"},
      %{"name" => "美丽河镇", "code" => "150403102000"},
      %{"name" => "平庄镇", "code" => "150403103000"},
      %{"name" => "五家镇", "code" => "150403104000"},
      %{"name" => "小五家乡", "code" => "150403200000"}
    ]

  def next(input) when input == "红山区" or input == "150402",
    do: [
      %{"name" => "西屯街道", "code" => "150402001000"},
      %{"name" => "三中街街道", "code" => "150402002000"},
      %{"name" => "永巨街道", "code" => "150402003000"},
      %{"name" => "东城街道", "code" => "150402004000"},
      %{"name" => "南新街街道", "code" => "150402005000"},
      %{"name" => "站前街道", "code" => "150402006000"},
      %{"name" => "铁南街道", "code" => "150402007000"},
      %{"name" => "长青街道", "code" => "150402008000"},
      %{"name" => "哈达街道", "code" => "150402009000"},
      %{"name" => "西城街道", "code" => "150402010000"},
      %{"name" => "桥北街道", "code" => "150402011000"},
      %{"name" => "红庙子镇", "code" => "150402100000"},
      %{"name" => "文钟镇", "code" => "150402102000"},
      %{"name" => "内蒙古赤峰高新技术产业开发区管理委员会红山产业园", "code" => "150402400000"},
      %{"name" => "内蒙古赤峰商贸服务物流园区", "code" => "150402401000"}
    ]

  def next(input) when input == "乌达区" or input == "150304",
    do: [
      %{"name" => "三道坎街道", "code" => "150304002000"},
      %{"name" => "五虎山街道", "code" => "150304003000"},
      %{"name" => "新达街道", "code" => "150304008000"},
      %{"name" => "巴音赛街道", "code" => "150304009000"},
      %{"name" => "梁家沟街道", "code" => "150304010000"},
      %{"name" => "苏海图街道", "code" => "150304011000"},
      %{"name" => "滨海街道", "code" => "150304012000"},
      %{"name" => "乌兰淖尔镇", "code" => "150304101000"},
      %{"name" => "乌达经济开发区", "code" => "150304400000"}
    ]

  def next(input) when input == "海南区" or input == "150303",
    do: [
      %{"name" => "拉僧仲街道", "code" => "150303001000"},
      %{"name" => "西卓子山街道", "code" => "150303002000"},
      %{"name" => "公乌素镇", "code" => "150303102000"},
      %{"name" => "拉僧庙镇", "code" => "150303103000"},
      %{"name" => "巴音陶亥镇", "code" => "150303104000"}
    ]

  def next(input) when input == "海勃湾区" or input == "150302",
    do: [
      %{"name" => "凤凰岭街道", "code" => "150302001000"},
      %{"name" => "海北街道", "code" => "150302002000"},
      %{"name" => "新华街道", "code" => "150302003000"},
      %{"name" => "新华西街道", "code" => "150302004000"},
      %{"name" => "滨河街道", "code" => "150302007000"},
      %{"name" => "林荫街道", "code" => "150302008000"},
      %{"name" => "千里山镇", "code" => "150302101000"},
      %{"name" => "乌海高新技术产业开发区海勃湾产业园", "code" => "150302400000"}
    ]

  def next(input) when input == "包头稀土高新技术产业开发区" or input == "150271",
    do: [
      %{"name" => "稀土路街道", "code" => "150271010000"},
      %{"name" => "民馨路街道", "code" => "150271020000"},
      %{"name" => "万水泉镇", "code" => "150271102000"}
    ]

  def next(input) when input == "达尔罕茂明安联合旗" or input == "150223",
    do: [
      %{"name" => "满都拉镇", "code" => "150223102000"},
      %{"name" => "希拉穆仁镇", "code" => "150223103000"},
      %{"name" => "百灵庙镇", "code" => "150223104000"},
      %{"name" => "石宝镇", "code" => "150223105000"},
      %{"name" => "乌克忽洞镇", "code" => "150223106000"},
      %{"name" => "明安镇", "code" => "150223107000"},
      %{"name" => "巴音花镇", "code" => "150223108000"},
      %{"name" => "达尔汗苏木", "code" => "150223213000"},
      %{"name" => "查干哈达苏木", "code" => "150223214000"},
      %{"name" => "巴音敖包苏木", "code" => "150223215000"},
      %{"name" => "西河乡", "code" => "150223216000"},
      %{"name" => "小文公乡", "code" => "150223217000"}
    ]

  def next(input) when input == "固阳县" or input == "150222",
    do: [
      %{"name" => "金山镇", "code" => "150222102000"},
      %{"name" => "西斗铺镇", "code" => "150222103000"},
      %{"name" => "下湿壕镇", "code" => "150222104000"},
      %{"name" => "银号镇", "code" => "150222105000"},
      %{"name" => "怀朔镇", "code" => "150222106000"},
      %{"name" => "兴顺西镇", "code" => "150222107000"}
    ]

  def next(input) when input == "土默特右旗" or input == "150221",
    do: [
      %{"name" => "萨拉齐镇", "code" => "150221104000"},
      %{"name" => "双龙镇", "code" => "150221105000"},
      %{"name" => "美岱召镇", "code" => "150221106000"},
      %{"name" => "沟门镇", "code" => "150221107000"},
      %{"name" => "将军尧镇", "code" => "150221108000"},
      %{"name" => "海子乡", "code" => "150221213000"},
      %{"name" => "明沙淖乡", "code" => "150221214000"},
      %{"name" => "苏波盖乡", "code" => "150221215000"},
      %{"name" => "九峰山生态管理区", "code" => "150221500000"}
    ]

  def next(input) when input == "九原区" or input == "150207",
    do: [
      %{"name" => "沙河街道", "code" => "150207001000"},
      %{"name" => "赛汗街道", "code" => "150207002000"},
      %{"name" => "萨如拉街道", "code" => "150207003000"},
      %{"name" => "白音席勒街道", "code" => "150207004000"},
      %{"name" => "麻池镇", "code" => "150207103000"},
      %{"name" => "哈林格尔镇", "code" => "150207105000"},
      %{"name" => "哈业胡同镇", "code" => "150207110000"},
      %{"name" => "阿嘎如泰苏木", "code" => "150207202000"}
    ]

  def next(input) when input == "白云鄂博矿区" or input == "150206",
    do: [
      %{"name" => "矿山路街道", "code" => "150206001000"},
      %{"name" => "通阳道街道", "code" => "150206002000"}
    ]

  def next(input) when input == "石拐区" or input == "150205",
    do: [
      %{"name" => "石拐街道", "code" => "150205001000"},
      %{"name" => "大发街道", "code" => "150205002000"},
      %{"name" => "大磁街道", "code" => "150205003000"},
      %{"name" => "五当沟街道", "code" => "150205004000"},
      %{"name" => "白狐沟街道", "code" => "150205005000"},
      %{"name" => "大德恒街道", "code" => "150205006000"},
      %{"name" => "五当召镇", "code" => "150205101000"},
      %{"name" => "吉忽伦图苏木", "code" => "150205202000"},
      %{"name" => "内蒙古包头钢铁冶金开发区管委会石拐产业园", "code" => "150205400000"}
    ]

  def next(input) when input == "青山区" or input == "150204",
    do: [
      %{"name" => "先锋道街道", "code" => "150204001000"},
      %{"name" => "幸福路街道", "code" => "150204002000"},
      %{"name" => "万青路街道", "code" => "150204003000"},
      %{"name" => "富强路街道", "code" => "150204004000"},
      %{"name" => "科学路街道", "code" => "150204005000"},
      %{"name" => "青山路街道", "code" => "150204006000"},
      %{"name" => "自由路街道", "code" => "150204007000"},
      %{"name" => "乌素图街道", "code" => "150204008000"},
      %{"name" => "青福镇", "code" => "150204100000"},
      %{"name" => "兴胜镇", "code" => "150204101000"},
      %{"name" => "包头市装备制造产业园区", "code" => "150204401000"}
    ]

  def next(input) when input == "昆都仑区" or input == "150203",
    do: [
      %{"name" => "少先路街道", "code" => "150203001000"},
      %{"name" => "沼潭街道", "code" => "150203003000"},
      %{"name" => "林荫路街道", "code" => "150203004000"},
      %{"name" => "友谊大街街道", "code" => "150203005000"},
      %{"name" => "阿尔丁大街街道", "code" => "150203006000"},
      %{"name" => "团结大街街道", "code" => "150203007000"},
      %{"name" => "鞍山道街道", "code" => "150203008000"},
      %{"name" => "前进道街道", "code" => "150203009000"},
      %{"name" => "市府东路街道", "code" => "150203010000"},
      %{"name" => "白云路街道", "code" => "150203011000"},
      %{"name" => "黄河西路街道", "code" => "150203012000"},
      %{"name" => "昆工路街道", "code" => "150203013000"},
      %{"name" => "昆北街道", "code" => "150203014000"},
      %{"name" => "昆河镇", "code" => "150203100000"},
      %{"name" => "卜尔汉图镇", "code" => "150203102000"},
      %{"name" => "包钢厂区", "code" => "150203400000"}
    ]

  def next(input) when input == "东河区" or input == "150202",
    do: [
      %{"name" => "和平路街道", "code" => "150202001000"},
      %{"name" => "财神庙街道", "code" => "150202002000"},
      %{"name" => "西脑包街道", "code" => "150202003000"},
      %{"name" => "南门外街道", "code" => "150202004000"},
      %{"name" => "南圪洞街道", "code" => "150202005000"},
      %{"name" => "东站街道", "code" => "150202006000"},
      %{"name" => "回民街道", "code" => "150202007000"},
      %{"name" => "天骄街道", "code" => "150202008000"},
      %{"name" => "河东街道", "code" => "150202009000"},
      %{"name" => "铁西街道", "code" => "150202010000"},
      %{"name" => "东兴街道", "code" => "150202011000"},
      %{"name" => "杨圪塄街道", "code" => "150202012000"},
      %{"name" => "河东镇", "code" => "150202100000"},
      %{"name" => "沙尔沁镇", "code" => "150202101000"},
      %{"name" => "铝业产业园区", "code" => "150202400000"}
    ]

  def next(input) when input == "呼和浩特经济技术开发区" or input == "150172",
    do: [
      %{"name" => "如意工业园区", "code" => "150172401000"},
      %{"name" => "金川工业园区", "code" => "150172402000"},
      %{"name" => "呼和浩特综合保税区", "code" => "150172403000"},
      %{"name" => "呼和浩特留学人员创业园", "code" => "150172404000"},
      %{"name" => "沙尔沁工业区（如意南区）", "code" => "150172405000"},
      %{"name" => "呼和浩特白塔空港物流园区", "code" => "150172406000"}
    ]

  def next(input) when input == "武川县" or input == "150125",
    do: [
      %{"name" => "可可以力更镇", "code" => "150125100000"},
      %{"name" => "哈乐镇", "code" => "150125101000"},
      %{"name" => "西乌兰不浪镇", "code" => "150125102000"},
      %{"name" => "大青山乡", "code" => "150125200000"},
      %{"name" => "上秃亥乡", "code" => "150125205000"},
      %{"name" => "得胜沟乡", "code" => "150125207000"},
      %{"name" => "二份子乡", "code" => "150125211000"},
      %{"name" => "哈拉合少乡", "code" => "150125213000"},
      %{"name" => "耗赖山乡", "code" => "150125214000"},
      %{"name" => "内蒙古武川经济开发区", "code" => "150125402000"},
      %{"name" => "武川金三角经济开发区", "code" => "150125403000"}
    ]

  def next(input) when input == "清水河县" or input == "150124",
    do: [
      %{"name" => "城关镇", "code" => "150124100000"},
      %{"name" => "宏河镇", "code" => "150124101000"},
      %{"name" => "喇嘛湾镇", "code" => "150124102000"},
      %{"name" => "老牛湾镇", "code" => "150124103000"},
      %{"name" => "窑沟乡", "code" => "150124200000"},
      %{"name" => "北堡乡", "code" => "150124201000"},
      %{"name" => "韭菜庄乡", "code" => "150124202000"},
      %{"name" => "五良太乡", "code" => "150124203000"},
      %{"name" => "内蒙古清水河工业园区", "code" => "150124401000"}
    ]

  def next(input) when input == "和林格尔县" or input == "150123",
    do: [
      %{"name" => "城关镇", "code" => "150123100000"},
      %{"name" => "盛乐镇", "code" => "150123101000"},
      %{"name" => "新店子镇", "code" => "150123102000"},
      %{"name" => "巧什营镇", "code" => "150123103000"},
      %{"name" => "舍必崖乡", "code" => "150123203000"},
      %{"name" => "大红城乡", "code" => "150123205000"},
      %{"name" => "羊群沟乡", "code" => "150123206000"},
      %{"name" => "黑老夭乡", "code" => "150123207000"},
      %{"name" => "盛乐经济工业园区", "code" => "150123400000"},
      %{"name" => "内蒙古和林格尔新区", "code" => "150123401000"}
    ]

  def next(input) when input == "托克托县" or input == "150122",
    do: [
      %{"name" => "双河镇", "code" => "150122100000"},
      %{"name" => "新营子镇", "code" => "150122101000"},
      %{"name" => "五申镇", "code" => "150122102000"},
      %{"name" => "伍什家镇", "code" => "150122103000"},
      %{"name" => "古城镇", "code" => "150122104000"},
      %{"name" => "托县工业园区", "code" => "150122400000"},
      %{"name" => "黄河湿地管护中心", "code" => "150122401000"}
    ]

  def next(input) when input == "土默特左旗" or input == "150121",
    do: [
      %{"name" => "察素齐镇", "code" => "150121100000"},
      %{"name" => "毕克齐镇", "code" => "150121101000"},
      %{"name" => "善岱镇", "code" => "150121102000"},
      %{"name" => "台阁牧镇", "code" => "150121103000"},
      %{"name" => "白庙子镇", "code" => "150121104000"},
      %{"name" => "沙尔沁镇", "code" => "150121105000"},
      %{"name" => "敕勒川镇", "code" => "150121106000"},
      %{"name" => "北什轴乡", "code" => "150121207000"},
      %{"name" => "塔布赛乡", "code" => "150121208000"},
      %{"name" => "呼和浩特金山经济技术开发区", "code" => "150121401000"},
      %{"name" => "金浩区域服务中心", "code" => "150121407000"},
      %{"name" => "汇金区域服务中心", "code" => "150121408000"},
      %{"name" => "金海区域服务中心", "code" => "150121409000"}
    ]

  def next(input) when input == "赛罕区" or input == "150105",
    do: [
      %{"name" => "人民路街道", "code" => "150105001000"},
      %{"name" => "大学西路街道", "code" => "150105002000"},
      %{"name" => "乌兰察布东路街道", "code" => "150105003000"},
      %{"name" => "大学东路街道", "code" => "150105004000"},
      %{"name" => "中专路街道", "code" => "150105005000"},
      %{"name" => "昭乌达南路街道", "code" => "150105006000"},
      %{"name" => "巴彦街道", "code" => "150105007000"},
      %{"name" => "敕勒川路街道", "code" => "150105008000"},
      %{"name" => "榆林镇", "code" => "150105101000"},
      %{"name" => "黄合少镇", "code" => "150105103000"},
      %{"name" => "金河镇", "code" => "150105104000"}
    ]

  def next(input) when input == "玉泉区" or input == "150104",
    do: [
      %{"name" => "小召前街街道", "code" => "150104001000"},
      %{"name" => "兴隆巷街道", "code" => "150104002000"},
      %{"name" => "长和廊街道", "code" => "150104003000"},
      %{"name" => "石东路街道", "code" => "150104004000"},
      %{"name" => "大南街街道", "code" => "150104005000"},
      %{"name" => "鄂尔多斯路街道", "code" => "150104006000"},
      %{"name" => "西菜园街道", "code" => "150104007000"},
      %{"name" => "昭君路街道", "code" => "150104008000"},
      %{"name" => "小黑河镇", "code" => "150104100000"},
      %{"name" => "裕隆工业园区", "code" => "150104400000"}
    ]

  def next(input) when input == "回民区" or input == "150103",
    do: [
      %{"name" => "新华西路街道", "code" => "150103001000"},
      %{"name" => "中山西路街道", "code" => "150103002000"},
      %{"name" => "光明路街道", "code" => "150103003000"},
      %{"name" => "海拉尔西路街道", "code" => "150103004000"},
      %{"name" => "环河街街道", "code" => "150103005000"},
      %{"name" => "通道街街道", "code" => "150103006000"},
      %{"name" => "钢铁路街道", "code" => "150103007000"},
      %{"name" => "攸攸板镇", "code" => "150103100000"},
      %{"name" => "阿拉善北路街道", "code" => "150103400000"}
    ]

  def next(input) when input == "新城区" or input == "150102",
    do: [
      %{"name" => "海拉尔东路街道", "code" => "150102001000"},
      %{"name" => "锡林北路街道", "code" => "150102002000"},
      %{"name" => "中山东路街道", "code" => "150102003000"},
      %{"name" => "东街街道", "code" => "150102004000"},
      %{"name" => "西街街道", "code" => "150102005000"},
      %{"name" => "东风路街道", "code" => "150102006000"},
      %{"name" => "迎新路街道", "code" => "150102007000"},
      %{"name" => "成吉思汗大街街道", "code" => "150102008000"},
      %{"name" => "保合少镇", "code" => "150102101000"},
      %{"name" => "新城区鸿盛高科技园区", "code" => "150102400000"},
      %{"name" => "呼伦路街道", "code" => "150102401000"},
      %{"name" => "丁香路街道", "code" => "150102402000"},
      %{"name" => "东河街道", "code" => "150102403000"}
    ]

  def next(_), do: nil
end