defmodule ChinaAdminDivisions.Gen.Lv3x.M21 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "连山区" or input == "211402",
    do: [
      %{"name" => "连山街道", "code" => "211402001000"},
      %{"name" => "站前街道", "code" => "211402002000"},
      %{"name" => "渤海街道", "code" => "211402003000"},
      %{"name" => "兴工街道", "code" => "211402004000"},
      %{"name" => "石油街道", "code" => "211402005000"},
      %{"name" => "化工街道", "code" => "211402006000"},
      %{"name" => "锦郊街道", "code" => "211402011000"},
      %{"name" => "钢屯镇", "code" => "211402104000"},
      %{"name" => "寺儿堡镇", "code" => "211402105000"},
      %{"name" => "新台门镇", "code" => "211402106000"},
      %{"name" => "沙河营乡", "code" => "211402201000"},
      %{"name" => "孤竹营子乡", "code" => "211402202000"},
      %{"name" => "白马石乡", "code" => "211402203000"},
      %{"name" => "山神庙子乡", "code" => "211402205000"},
      %{"name" => "塔山乡", "code" => "211402206000"},
      %{"name" => "杨郊乡", "code" => "211402210000"},
      %{"name" => "杨家杖子经济开发区", "code" => "211402400000"},
      %{"name" => "连山飞地经济区", "code" => "211402401000"},
      %{"name" => "葫芦岛打渔山经济开发区", "code" => "211402402000"}
    ]

  def next(input) when input == "龙港区" or input == "211403",
    do: [
      %{"name" => "葫芦岛街道", "code" => "211403001000"},
      %{"name" => "马仗房街道", "code" => "211403003000"},
      %{"name" => "龙湾街道", "code" => "211403005000"},
      %{"name" => "滨海街道", "code" => "211403006000"},
      %{"name" => "双龙街道", "code" => "211403007000"},
      %{"name" => "玉皇街道", "code" => "211403008000"},
      %{"name" => "连湾街道", "code" => "211403009000"},
      %{"name" => "北港街道", "code" => "211403010000"},
      %{"name" => "双树乡", "code" => "211403201000"},
      %{"name" => "葫芦岛经济开发区", "code" => "211403400000"},
      %{"name" => "葫芦岛高新技术产业开发区", "code" => "211403401000"},
      %{"name" => "龙港飞地经济区", "code" => "211403402000"}
    ]

  def next(input) when input == "南票区" or input == "211404",
    do: [
      %{"name" => "沙锅屯街道", "code" => "211404002000"},
      %{"name" => "九龙街道", "code" => "211404008000"},
      %{"name" => "龙腾街道", "code" => "211404010000"},
      %{"name" => "缸窑岭镇", "code" => "211404101000"},
      %{"name" => "暖池塘镇", "code" => "211404102000"},
      %{"name" => "高桥镇", "code" => "211404103000"},
      %{"name" => "虹螺岘镇", "code" => "211404104000"},
      %{"name" => "金星镇", "code" => "211404105000"},
      %{"name" => "台集屯镇", "code" => "211404106000"},
      %{"name" => "沙锅屯乡", "code" => "211404201000"},
      %{"name" => "黄土坎乡", "code" => "211404203000"},
      %{"name" => "大兴乡", "code" => "211404204000"},
      %{"name" => "张相公屯乡", "code" => "211404205000"},
      %{"name" => "乌金塘水库", "code" => "211404400000"},
      %{"name" => "南票飞地经济区", "code" => "211404401000"},
      %{"name" => "葫芦岛市南票循环产业园区", "code" => "211404402000"}
    ]

  def next(input) when input == "绥中县" or input == "211421",
    do: [
      %{"name" => "绥中镇", "code" => "211421100000"},
      %{"name" => "西甸子镇", "code" => "211421101000"},
      %{"name" => "宽邦镇", "code" => "211421102000"},
      %{"name" => "大王庙镇", "code" => "211421103000"},
      %{"name" => "万家镇", "code" => "211421104000"},
      %{"name" => "前所镇", "code" => "211421105000"},
      %{"name" => "高岭镇", "code" => "211421106000"},
      %{"name" => "前卫镇", "code" => "211421107000"},
      %{"name" => "荒地镇", "code" => "211421108000"},
      %{"name" => "塔山屯镇", "code" => "211421109000"},
      %{"name" => "高台镇", "code" => "211421113000"},
      %{"name" => "王宝镇", "code" => "211421114000"},
      %{"name" => "沙河镇", "code" => "211421115000"},
      %{"name" => "小庄子镇", "code" => "211421116000"},
      %{"name" => "西平坡满族乡", "code" => "211421201000"},
      %{"name" => "葛家满族乡", "code" => "211421202000"},
      %{"name" => "高甸子满族乡", "code" => "211421204000"},
      %{"name" => "范家满族乡", "code" => "211421206000"},
      %{"name" => "明水满族乡", "code" => "211421207000"},
      %{"name" => "秋子沟乡", "code" => "211421208000"},
      %{"name" => "加碑岩乡", "code" => "211421210000"},
      %{"name" => "永安堡乡", "code" => "211421211000"},
      %{"name" => "李家堡乡", "code" => "211421212000"},
      %{"name" => "网户满族乡", "code" => "211421214000"},
      %{"name" => "城郊乡", "code" => "211421217000"},
      %{"name" => "大台山果树农场", "code" => "211421400000"},
      %{"name" => "前所果树农场", "code" => "211421401000"},
      %{"name" => "绥中飞地经济区", "code" => "211421402000"},
      %{"name" => "绥中高新技术产业开发区", "code" => "211421403000"}
    ]

  def next(input) when input == "建昌县" or input == "211422",
    do: [
      %{"name" => "建昌镇", "code" => "211422100000"},
      %{"name" => "八家子镇", "code" => "211422101000"},
      %{"name" => "喇嘛洞镇", "code" => "211422102000"},
      %{"name" => "药王庙镇", "code" => "211422103000"},
      %{"name" => "汤神庙镇", "code" => "211422104000"},
      %{"name" => "玲珑塔镇", "code" => "211422105000"},
      %{"name" => "大屯镇", "code" => "211422106000"},
      %{"name" => "牤牛营子乡", "code" => "211422201000"},
      %{"name" => "素珠营子乡", "code" => "211422203000"},
      %{"name" => "石佛乡", "code" => "211422204000"},
      %{"name" => "王宝营子乡", "code" => "211422206000"},
      %{"name" => "老大杖子乡", "code" => "211422207000"},
      %{"name" => "要路沟乡", "code" => "211422208000"},
      %{"name" => "魏家岭乡", "code" => "211422209000"},
      %{"name" => "西碱厂乡", "code" => "211422210000"},
      %{"name" => "头道营子乡", "code" => "211422211000"},
      %{"name" => "新开岭乡", "code" => "211422212000"},
      %{"name" => "贺杖子乡", "code" => "211422213000"},
      %{"name" => "养马甸子乡", "code" => "211422214000"},
      %{"name" => "和尚房子乡", "code" => "211422215000"},
      %{"name" => "杨树湾子乡", "code" => "211422218000"},
      %{"name" => "黑山科乡", "code" => "211422219000"},
      %{"name" => "雷家店乡", "code" => "211422220000"},
      %{"name" => "小德营子乡", "code" => "211422222000"},
      %{"name" => "二道湾子蒙古族乡", "code" => "211422223000"},
      %{"name" => "巴什罕乡", "code" => "211422224000"},
      %{"name" => "娘娘庙乡", "code" => "211422225000"},
      %{"name" => "谷杖子乡", "code" => "211422226000"},
      %{"name" => "建昌飞地经济区", "code" => "211422401000"},
      %{"name" => "辽宁葫芦岛八家子经济开发区", "code" => "211422402000"}
    ]

  def next(input) when input == "兴城市" or input == "211481",
    do: [
      %{"name" => "古城街道", "code" => "211481001000"},
      %{"name" => "宁远街道", "code" => "211481002000"},
      %{"name" => "温泉街道", "code" => "211481004000"},
      %{"name" => "四家屯街道", "code" => "211481007000"},
      %{"name" => "菊花街道", "code" => "211481008000"},
      %{"name" => "曹庄镇", "code" => "211481101000"},
      %{"name" => "沙后所满族镇", "code" => "211481103000"},
      %{"name" => "东辛庄满族镇", "code" => "211481104000"},
      %{"name" => "郭家满族镇", "code" => "211481105000"},
      %{"name" => "红崖子镇", "code" => "211481106000"},
      %{"name" => "徐大堡镇", "code" => "211481107000"},
      %{"name" => "高家岭满族镇", "code" => "211481108000"},
      %{"name" => "羊安满族乡", "code" => "211481201000"},
      %{"name" => "元台子满族乡", "code" => "211481203000"},
      %{"name" => "白塔满族乡", "code" => "211481204000"},
      %{"name" => "望海满族乡", "code" => "211481206000"},
      %{"name" => "刘台子满族乡", "code" => "211481207000"},
      %{"name" => "大寨满族乡", "code" => "211481208000"},
      %{"name" => "南大满族乡", "code" => "211481209000"},
      %{"name" => "围屏满族乡", "code" => "211481210000"},
      %{"name" => "碱厂满族乡", "code" => "211481212000"},
      %{"name" => "三道沟满族乡", "code" => "211481213000"},
      %{"name" => "旧门满族乡", "code" => "211481215000"},
      %{"name" => "药王满族乡", "code" => "211481216000"},
      %{"name" => "兴城飞地经济区", "code" => "211481400000"},
      %{"name" => "兴城滨海经济区", "code" => "211481401000"}
    ]

  def next(input) when input == "双塔区" or input == "211302",
    do: [
      %{"name" => "双塔街道", "code" => "211302001000"},
      %{"name" => "前进街道", "code" => "211302003000"},
      %{"name" => "凌河街道", "code" => "211302004000"},
      %{"name" => "光明街道", "code" => "211302005000"},
      %{"name" => "凌凤街道", "code" => "211302006000"},
      %{"name" => "龙山街道", "code" => "211302007000"},
      %{"name" => "站南街道", "code" => "211302008000"},
      %{"name" => "红旗街道", "code" => "211302009000"},
      %{"name" => "燕北街道", "code" => "211302010000"},
      %{"name" => "桃花吐镇", "code" => "211302100000"},
      %{"name" => "他拉皋镇", "code" => "211302101000"},
      %{"name" => "孙家湾镇", "code" => "211302102000"},
      %{"name" => "长宝营子乡", "code" => "211302205000"}
    ]

  def next(input) when input == "龙城区" or input == "211303",
    do: [
      %{"name" => "新华街道", "code" => "211303004000"},
      %{"name" => "海龙街道", "code" => "211303005000"},
      %{"name" => "龙泉街道", "code" => "211303070000"},
      %{"name" => "七道泉子镇", "code" => "211303101000"},
      %{"name" => "西大营子镇", "code" => "211303102000"},
      %{"name" => "召都巴镇", "code" => "211303103000"},
      %{"name" => "大平房镇", "code" => "211303105000"},
      %{"name" => "联合镇", "code" => "211303106000"},
      %{"name" => "边杖子镇", "code" => "211303107000"}
    ]

  def next(input) when input == "朝阳县" or input == "211321",
    do: [
      %{"name" => "柳城街道", "code" => "211321001000"},
      %{"name" => "波罗赤镇", "code" => "211321102000"},
      %{"name" => "木头城子镇", "code" => "211321103000"},
      %{"name" => "二十家子镇", "code" => "211321104000"},
      %{"name" => "羊山镇", "code" => "211321105000"},
      %{"name" => "六家子镇", "code" => "211321106000"},
      %{"name" => "瓦房子镇", "code" => "211321107000"},
      %{"name" => "大庙镇", "code" => "211321108000"},
      %{"name" => "古山子镇", "code" => "211321110000"},
      %{"name" => "南双庙镇", "code" => "211321111000"},
      %{"name" => "台子镇", "code" => "211321112000"},
      %{"name" => "清风岭镇", "code" => "211321113000"},
      %{"name" => "胜利镇", "code" => "211321114000"},
      %{"name" => "七道岭镇", "code" => "211321115000"},
      %{"name" => "杨树湾镇", "code" => "211321116000"},
      %{"name" => "西五家子乡", "code" => "211321211000"},
      %{"name" => "北沟门子乡", "code" => "211321212000"},
      %{"name" => "东大道乡", "code" => "211321214000"},
      %{"name" => "乌兰河硕蒙古族乡", "code" => "211321215000"},
      %{"name" => "东大屯乡", "code" => "211321220000"},
      %{"name" => "松岭门蒙古族乡", "code" => "211321221000"},
      %{"name" => "根德营子乡", "code" => "211321222000"},
      %{"name" => "西营子乡", "code" => "211321224000"},
      %{"name" => "北四家子乡", "code" => "211321228000"},
      %{"name" => "王营子乡", "code" => "211321230000"},
      %{"name" => "黑牛营子乡", "code" => "211321231000"},
      %{"name" => "尚志乡", "code" => "211321232000"},
      %{"name" => "国营朝阳县贾家店农场", "code" => "211321400000"}
    ]

  def next(input) when input == "建平县" or input == "211322",
    do: [
      %{"name" => "叶柏寿街道", "code" => "211322001000"},
      %{"name" => "红山街道", "code" => "211322002000"},
      %{"name" => "铁南街道", "code" => "211322003000"},
      %{"name" => "万寿街道", "code" => "211322004000"},
      %{"name" => "朱碌科镇", "code" => "211322101000"},
      %{"name" => "建平镇", "code" => "211322102000"},
      %{"name" => "黑水镇", "code" => "211322103000"},
      %{"name" => "喀喇沁镇", "code" => "211322104000"},
      %{"name" => "北二十家子镇", "code" => "211322105000"},
      %{"name" => "沙海镇", "code" => "211322106000"},
      %{"name" => "哈拉道口镇", "code" => "211322108000"},
      %{"name" => "榆树林子镇", "code" => "211322109000"},
      %{"name" => "老官地镇", "code" => "211322110000"},
      %{"name" => "深井镇", "code" => "211322111000"},
      %{"name" => "奎德素镇", "code" => "211322112000"},
      %{"name" => "小塘镇", "code" => "211322113000"},
      %{"name" => "马场镇", "code" => "211322114000"},
      %{"name" => "昌隆镇", "code" => "211322115000"},
      %{"name" => "张家营子镇", "code" => "211322117000"},
      %{"name" => "青峰山镇", "code" => "211322118000"},
      %{"name" => "太平庄镇", "code" => "211322119000"},
      %{"name" => "青松岭乡", "code" => "211322205000"},
      %{"name" => "杨树岭乡", "code" => "211322206000"},
      %{"name" => "罗福沟乡", "code" => "211322209000"},
      %{"name" => "烧锅营子乡", "code" => "211322211000"},
      %{"name" => "白山乡", "code" => "211322214000"},
      %{"name" => "三家蒙古族乡", "code" => "211322218000"},
      %{"name" => "义成功乡", "code" => "211322220000"},
      %{"name" => "八家国营农场", "code" => "211322400000"},
      %{"name" => "热水国营畜牧农场", "code" => "211322401000"}
    ]

  def next(input) when input == "喀喇沁左翼蒙古族自治县" or input == "211324",
    do: [
      %{"name" => "大城子街道", "code" => "211324001000"},
      %{"name" => "利州街道", "code" => "211324002000"},
      %{"name" => "南公营子镇", "code" => "211324101000"},
      %{"name" => "山嘴子镇", "code" => "211324102000"},
      %{"name" => "公营子镇", "code" => "211324104000"},
      %{"name" => "白塔子镇", "code" => "211324105000"},
      %{"name" => "中三家镇", "code" => "211324106000"},
      %{"name" => "老爷庙镇", "code" => "211324107000"},
      %{"name" => "六官营子镇", "code" => "211324108000"},
      %{"name" => "平房子镇", "code" => "211324109000"},
      %{"name" => "十二德堡镇", "code" => "211324110000"},
      %{"name" => "羊角沟镇", "code" => "211324111000"},
      %{"name" => "兴隆庄镇", "code" => "211324112000"},
      %{"name" => "甘招镇", "code" => "211324113000"},
      %{"name" => "东哨镇", "code" => "211324114000"},
      %{"name" => "水泉镇", "code" => "211324115000"},
      %{"name" => "尤杖子乡", "code" => "211324204000"},
      %{"name" => "草场乡", "code" => "211324207000"},
      %{"name" => "坤都营子乡", "code" => "211324210000"},
      %{"name" => "大营子乡", "code" => "211324211000"},
      %{"name" => "卧虎沟乡", "code" => "211324214000"},
      %{"name" => "国营官大海农场", "code" => "211324400000"}
    ]

  def next(input) when input == "北票市" or input == "211381",
    do: [
      %{"name" => "城关街道", "code" => "211381001000"},
      %{"name" => "南山街道", "code" => "211381002000"},
      %{"name" => "冠山街道", "code" => "211381003000"},
      %{"name" => "台吉街道", "code" => "211381006000"},
      %{"name" => "西官营镇", "code" => "211381101000"},
      %{"name" => "大板镇", "code" => "211381102000"},
      %{"name" => "上园镇", "code" => "211381103000"},
      %{"name" => "宝国老镇", "code" => "211381104000"},
      %{"name" => "黑城子镇", "code" => "211381105000"},
      %{"name" => "五间房镇", "code" => "211381107000"},
      %{"name" => "台吉镇", "code" => "211381108000"},
      %{"name" => "东官营镇", "code" => "211381109000"},
      %{"name" => "龙潭镇", "code" => "211381110000"},
      %{"name" => "北塔镇", "code" => "211381111000"},
      %{"name" => "蒙古营镇", "code" => "211381112000"},
      %{"name" => "大三家镇", "code" => "211381113000"},
      %{"name" => "长皋乡", "code" => "211381201000"},
      %{"name" => "常河营乡", "code" => "211381202000"},
      %{"name" => "小塔子乡", "code" => "211381203000"},
      %{"name" => "马友营蒙古族乡", "code" => "211381204000"},
      %{"name" => "泉巨永乡", "code" => "211381206000"},
      %{"name" => "哈尔脑乡", "code" => "211381212000"},
      %{"name" => "南八家子乡", "code" => "211381213000"},
      %{"name" => "章吉营乡", "code" => "211381214000"},
      %{"name" => "三宝营乡", "code" => "211381215000"},
      %{"name" => "巴图营乡", "code" => "211381216000"},
      %{"name" => "台吉营乡", "code" => "211381218000"},
      %{"name" => "娄家店乡", "code" => "211381220000"},
      %{"name" => "北四家乡", "code" => "211381221000"},
      %{"name" => "凉水河蒙古族乡", "code" => "211381223000"},
      %{"name" => "三宝乡", "code" => "211381228000"},
      %{"name" => "国营兴顺德畜牧农场", "code" => "211381400000"},
      %{"name" => "下府经济开发区", "code" => "211381470000"},
      %{"name" => "大黑山特别管理区", "code" => "211381471000"}
    ]

  def next(input) when input == "凌源市" or input == "211382",
    do: [
      %{"name" => "东城街道", "code" => "211382001000"},
      %{"name" => "北街街道", "code" => "211382002000"},
      %{"name" => "南街街道", "code" => "211382003000"},
      %{"name" => "红山街道", "code" => "211382008000"},
      %{"name" => "城关街道", "code" => "211382009000"},
      %{"name" => "万元店镇", "code" => "211382101000"},
      %{"name" => "宋杖子镇", "code" => "211382102000"},
      %{"name" => "三十家子镇", "code" => "211382103000"},
      %{"name" => "杨杖子镇", "code" => "211382104000"},
      %{"name" => "刀尔登镇", "code" => "211382105000"},
      %{"name" => "松岭子镇", "code" => "211382106000"},
      %{"name" => "四官营子镇", "code" => "211382107000"},
      %{"name" => "沟门子镇", "code" => "211382108000"},
      %{"name" => "小城子镇", "code" => "211382110000"},
      %{"name" => "四合当镇", "code" => "211382111000"},
      %{"name" => "乌兰白镇", "code" => "211382113000"},
      %{"name" => "瓦房店镇", "code" => "211382114000"},
      %{"name" => "大河北镇", "code" => "211382115000"},
      %{"name" => "牛营子镇", "code" => "211382116000"},
      %{"name" => "三道河子镇", "code" => "211382117000"},
      %{"name" => "刘杖子镇", "code" => "211382118000"},
      %{"name" => "大王杖子乡", "code" => "211382204000"},
      %{"name" => "前进乡", "code" => "211382206000"},
      %{"name" => "北炉乡", "code" => "211382210000"},
      %{"name" => "三家子蒙古族乡", "code" => "211382217000"},
      %{"name" => "佛爷洞乡", "code" => "211382219000"},
      %{"name" => "河坎子乡", "code" => "211382220000"}
    ]

  def next(input) when input == "银州区" or input == "211202",
    do: [
      %{"name" => "红旗街道", "code" => "211202001000"},
      %{"name" => "工人街道", "code" => "211202002000"},
      %{"name" => "铁西街道", "code" => "211202003000"},
      %{"name" => "铜钟街道", "code" => "211202004000"},
      %{"name" => "柴河街道", "code" => "211202005000"},
      %{"name" => "岭东街道", "code" => "211202006000"},
      %{"name" => "辽海街道", "code" => "211202007000"},
      %{"name" => "龙山乡", "code" => "211202201000"},
      %{"name" => "铁岭经济技术开发区", "code" => "211202401000"}
    ]

  def next(input) when input == "清河区" or input == "211204",
    do: [
      %{"name" => "红旗街道", "code" => "211204001000"},
      %{"name" => "向阳街道", "code" => "211204002000"},
      %{"name" => "张相镇", "code" => "211204101000"},
      %{"name" => "杨木林子镇", "code" => "211204102000"},
      %{"name" => "聂家满族乡", "code" => "211204203000"}
    ]

  def next(input) when input == "铁岭县" or input == "211221",
    do: [
      %{"name" => "新台子镇", "code" => "211221101000"},
      %{"name" => "阿吉镇", "code" => "211221102000"},
      %{"name" => "平顶堡镇", "code" => "211221103000"},
      %{"name" => "大甸子镇", "code" => "211221104000"},
      %{"name" => "凡河镇", "code" => "211221105000"},
      %{"name" => "腰堡镇", "code" => "211221106000"},
      %{"name" => "镇西堡镇", "code" => "211221107000"},
      %{"name" => "蔡牛镇", "code" => "211221108000"},
      %{"name" => "李千户镇", "code" => "211221109000"},
      %{"name" => "熊官屯镇", "code" => "211221110000"},
      %{"name" => "横道河子镇", "code" => "211221111000"},
      %{"name" => "双井子镇", "code" => "211221112000"},
      %{"name" => "鸡冠山乡", "code" => "211221208000"},
      %{"name" => "白旗寨满族乡", "code" => "211221209000"},
      %{"name" => "如意湖街道", "code" => "211221400000"},
      %{"name" => "莲花湖街道", "code" => "211221402000"}
    ]

  def next(input) when input == "西丰县" or input == "211223",
    do: [
      %{"name" => "西丰镇", "code" => "211223100000"},
      %{"name" => "平岗镇", "code" => "211223101000"},
      %{"name" => "郜家店镇", "code" => "211223102000"},
      %{"name" => "凉泉镇", "code" => "211223103000"},
      %{"name" => "振兴镇", "code" => "211223104000"},
      %{"name" => "安民镇", "code" => "211223105000"},
      %{"name" => "天德镇", "code" => "211223106000"},
      %{"name" => "房木镇", "code" => "211223107000"},
      %{"name" => "柏榆镇", "code" => "211223108000"},
      %{"name" => "陶然镇", "code" => "211223109000"},
      %{"name" => "钓鱼镇", "code" => "211223110000"},
      %{"name" => "更刻镇", "code" => "211223111000"},
      %{"name" => "德兴满族乡", "code" => "211223204000"},
      %{"name" => "明德满族乡", "code" => "211223206000"},
      %{"name" => "成平满族乡", "code" => "211223209000"},
      %{"name" => "和隆满族乡", "code" => "211223211000"},
      %{"name" => "营厂满族乡", "code" => "211223212000"},
      %{"name" => "金星满族乡", "code" => "211223213000"}
    ]

  def next(input) when input == "昌图县" or input == "211224",
    do: [
      %{"name" => "昌图镇", "code" => "211224100000"},
      %{"name" => "老城镇", "code" => "211224101000"},
      %{"name" => "八面城镇", "code" => "211224102000"},
      %{"name" => "三江口镇", "code" => "211224103000"},
      %{"name" => "金家镇", "code" => "211224104000"},
      %{"name" => "宝力镇", "code" => "211224105000"},
      %{"name" => "泉头镇", "code" => "211224106000"},
      %{"name" => "双庙子镇", "code" => "211224107000"},
      %{"name" => "亮中桥镇", "code" => "211224108000"},
      %{"name" => "马仲河镇", "code" => "211224109000"},
      %{"name" => "毛家店镇", "code" => "211224110000"},
      %{"name" => "老四平镇", "code" => "211224111000"},
      %{"name" => "大洼镇", "code" => "211224112000"},
      %{"name" => "头道镇", "code" => "211224113000"},
      %{"name" => "鴜鷺树镇", "code" => "211224114000"},
      %{"name" => "傅家镇", "code" => "211224115000"},
      %{"name" => "四合镇", "code" => "211224117000"},
      %{"name" => "朝阳镇", "code" => "211224118000"},
      %{"name" => "古榆树镇", "code" => "211224119000"},
      %{"name" => "七家子镇", "code" => "211224120000"},
      %{"name" => "东嘎镇", "code" => "211224121000"},
      %{"name" => "四面城镇", "code" => "211224122000"},
      %{"name" => "前双井镇", "code" => "211224123000"},
      %{"name" => "通江口镇", "code" => "211224124000"},
      %{"name" => "大四家子镇", "code" => "211224125000"},
      %{"name" => "曲家店镇", "code" => "211224126000"},
      %{"name" => "十八家子镇", "code" => "211224127000"},
      %{"name" => "太平镇", "code" => "211224128000"},
      %{"name" => "下二台镇", "code" => "211224129000"},
      %{"name" => "平安堡镇", "code" => "211224130000"},
      %{"name" => "大兴镇", "code" => "211224131000"},
      %{"name" => "后窑镇", "code" => "211224132000"},
      %{"name" => "长发镇", "code" => "211224133000"}
    ]

  def next(input) when input == "调兵山市" or input == "211281",
    do: [
      %{"name" => "兀术街街道", "code" => "211281001000"},
      %{"name" => "调兵山街道", "code" => "211281002000"},
      %{"name" => "晓明镇", "code" => "211281102000"},
      %{"name" => "大明镇", "code" => "211281103000"},
      %{"name" => "晓南镇", "code" => "211281105000"}
    ]

  def next(input) when input == "开原市" or input == "211282",
    do: [
      %{"name" => "新城街道", "code" => "211282001000"},
      %{"name" => "老城街道", "code" => "211282002000"},
      %{"name" => "开原街道", "code" => "211282003000"},
      %{"name" => "威远堡镇", "code" => "211282102000"},
      %{"name" => "庆云堡镇", "code" => "211282103000"},
      %{"name" => "中固镇", "code" => "211282104000"},
      %{"name" => "八棵树镇", "code" => "211282105000"},
      %{"name" => "金沟子镇", "code" => "211282106000"},
      %{"name" => "八宝镇", "code" => "211282107000"},
      %{"name" => "业民镇", "code" => "211282108000"},
      %{"name" => "莲花镇", "code" => "211282109000"},
      %{"name" => "靠山镇", "code" => "211282110000"},
      %{"name" => "马家寨镇", "code" => "211282111000"},
      %{"name" => "下肥镇", "code" => "211282112000"},
      %{"name" => "松山镇", "code" => "211282113000"},
      %{"name" => "城东镇", "code" => "211282114000"},
      %{"name" => "李家台镇", "code" => "211282115000"},
      %{"name" => "上肥镇", "code" => "211282116000"},
      %{"name" => "黄旗寨镇", "code" => "211282117000"},
      %{"name" => "林丰满族乡", "code" => "211282217000"}
    ]

  def next(input) when input == "双台子区" or input == "211102",
    do: [
      %{"name" => "胜利街道", "code" => "211102002000"},
      %{"name" => "建设街道", "code" => "211102003000"},
      %{"name" => "红旗街道", "code" => "211102004000"},
      %{"name" => "辽河街道", "code" => "211102005000"},
      %{"name" => "铁东街道", "code" => "211102008000"},
      %{"name" => "双盛街道", "code" => "211102009000"},
      %{"name" => "统一镇", "code" => "211102100000"},
      %{"name" => "陆家镇", "code" => "211102101000"}
    ]

  def next(input) when input == "兴隆台区" or input == "211103",
    do: [
      %{"name" => "振兴街道", "code" => "211103001000"},
      %{"name" => "兴隆街道", "code" => "211103002000"},
      %{"name" => "渤海街道", "code" => "211103003000"},
      %{"name" => "新工街道", "code" => "211103004000"},
      %{"name" => "曙光街道", "code" => "211103007000"},
      %{"name" => "欢喜岭街道", "code" => "211103008000"},
      %{"name" => "沈采街道", "code" => "211103013000"},
      %{"name" => "创新街道", "code" => "211103016000"},
      %{"name" => "兴盛街道", "code" => "211103017000"},
      %{"name" => "兴海街道", "code" => "211103018000"},
      %{"name" => "惠宾街道", "code" => "211103019000"},
      %{"name" => "盘锦高新技术产业开发区", "code" => "211103400000"}
    ]

  def next(input) when input == "大洼区" or input == "211104",
    do: [
      %{"name" => "二界沟街道", "code" => "211104002000"},
      %{"name" => "大洼街道", "code" => "211104004000"},
      %{"name" => "田家街道", "code" => "211104005000"},
      %{"name" => "榆树街道", "code" => "211104006000"},
      %{"name" => "王家街道", "code" => "211104007000"},
      %{"name" => "于楼街道", "code" => "211104009000"},
      %{"name" => "田庄台镇", "code" => "211104101000"},
      %{"name" => "东风镇", "code" => "211104103000"},
      %{"name" => "新开镇", "code" => "211104104000"},
      %{"name" => "清水镇", "code" => "211104106000"},
      %{"name" => "新兴镇", "code" => "211104107000"},
      %{"name" => "西安镇", "code" => "211104108000"},
      %{"name" => "新立镇", "code" => "211104109000"},
      %{"name" => "唐家镇", "code" => "211104112000"},
      %{"name" => "平安镇", "code" => "211104113000"},
      %{"name" => "赵圈河镇", "code" => "211104114000"}
    ]

  def next(input) when input == "盘山县" or input == "211122",
    do: [
      %{"name" => "太平街道", "code" => "211122001000"},
      %{"name" => "高升街道", "code" => "211122002000"},
      %{"name" => "得胜街道", "code" => "211122003000"},
      %{"name" => "东郭街道", "code" => "211122004000"},
      %{"name" => "沙岭镇", "code" => "211122101000"},
      %{"name" => "胡家镇", "code" => "211122103000"},
      %{"name" => "石新镇", "code" => "211122104000"},
      %{"name" => "羊圈子镇", "code" => "211122106000"},
      %{"name" => "古城子镇", "code" => "211122107000"},
      %{"name" => "坝墙子镇", "code" => "211122108000"},
      %{"name" => "陈家镇", "code" => "211122110000"},
      %{"name" => "甜水镇", "code" => "211122111000"},
      %{"name" => "吴家镇", "code" => "211122112000"},
      %{"name" => "盘山县林场", "code" => "211122400000"}
    ]

  def next(input) when input == "白塔区" or input == "211002",
    do: [
      %{"name" => "文圣街道", "code" => "211002016000"},
      %{"name" => "武圣街道", "code" => "211002017000"},
      %{"name" => "南门街道", "code" => "211002018000"},
      %{"name" => "襄平街道", "code" => "211002019000"}
    ]

  def next(input) when input == "文圣区" or input == "211003",
    do: [
      %{"name" => "庆阳街道", "code" => "211003004000"},
      %{"name" => "东京陵街道", "code" => "211003008000"},
      %{"name" => "小屯镇", "code" => "211003101000"},
      %{"name" => "罗大台镇", "code" => "211003102000"}
    ]

  def next(input) when input == "宏伟区" or input == "211004",
    do: [
      %{"name" => "工农街道", "code" => "211004001000"},
      %{"name" => "长征街道", "code" => "211004004000"},
      %{"name" => "曙光镇", "code" => "211004101000"},
      %{"name" => "兰家镇", "code" => "211004102000"}
    ]

  def next(input) when input == "弓长岭区" or input == "211005",
    do: [
      %{"name" => "苏家街道", "code" => "211005001000"},
      %{"name" => "安平街道", "code" => "211005003000"},
      %{"name" => "汤河镇", "code" => "211005101000"},
      %{"name" => "安平乡", "code" => "211005201000"}
    ]

  def next(input) when input == "太子河区" or input == "211011",
    do: [
      %{"name" => "铁西街道", "code" => "211011003000"},
      %{"name" => "祁家镇", "code" => "211011101000"},
      %{"name" => "沙岭镇", "code" => "211011102000"},
      %{"name" => "王家镇", "code" => "211011103000"},
      %{"name" => "东宁卫乡", "code" => "211011204000"}
    ]

  def next(input) when input == "辽阳县" or input == "211021",
    do: [
      %{"name" => "首山镇", "code" => "211021100000"},
      %{"name" => "刘二堡镇", "code" => "211021101000"},
      %{"name" => "小北河镇", "code" => "211021103000"},
      %{"name" => "黄泥洼镇", "code" => "211021104000"},
      %{"name" => "唐马寨镇", "code" => "211021106000"},
      %{"name" => "穆家镇", "code" => "211021107000"},
      %{"name" => "柳壕镇", "code" => "211021108000"},
      %{"name" => "河栏镇", "code" => "211021110000"},
      %{"name" => "隆昌镇", "code" => "211021111000"},
      %{"name" => "八会镇", "code" => "211021112000"},
      %{"name" => "寒岭镇", "code" => "211021113000"},
      %{"name" => "兴隆镇", "code" => "211021114000"},
      %{"name" => "下达河乡", "code" => "211021201000"},
      %{"name" => "吉洞峪满族乡", "code" => "211021202000"},
      %{"name" => "甜水满族乡", "code" => "211021206000"}
    ]

  def next(input) when input == "灯塔市" or input == "211081",
    do: [
      %{"name" => "烟台街道", "code" => "211081001000"},
      %{"name" => "万宝桥街道", "code" => "211081002000"},
      %{"name" => "古城街道", "code" => "211081003000"},
      %{"name" => "佟二堡镇", "code" => "211081101000"},
      %{"name" => "铧子镇", "code" => "211081102000"},
      %{"name" => "张台子镇", "code" => "211081103000"},
      %{"name" => "西大窑镇", "code" => "211081104000"},
      %{"name" => "沈旦堡镇", "code" => "211081105000"},
      %{"name" => "西马峰镇", "code" => "211081106000"},
      %{"name" => "柳条寨镇", "code" => "211081107000"},
      %{"name" => "柳河子镇", "code" => "211081108000"},
      %{"name" => "大河南镇", "code" => "211081111000"},
      %{"name" => "五星镇", "code" => "211081114000"},
      %{"name" => "鸡冠山乡", "code" => "211081205000"}
    ]

  def next(input) when input == "海州区" or input == "210902",
    do: [
      %{"name" => "和平街道", "code" => "210902003000"},
      %{"name" => "西山街道", "code" => "210902004000"},
      %{"name" => "河北街道", "code" => "210902005000"},
      %{"name" => "站前街道", "code" => "210902006000"},
      %{"name" => "五龙街道", "code" => "210902008000"},
      %{"name" => "平安西部街道", "code" => "210902009000"},
      %{"name" => "韩家店镇", "code" => "210902101000"}
    ]

  def next(input) when input == "新邱区" or input == "210903",
    do: [
      %{"name" => "街基街道", "code" => "210903005000"},
      %{"name" => "新发屯街道", "code" => "210903006000"},
      %{"name" => "长营子镇", "code" => "210903101000"}
    ]

  def next(input) when input == "太平区" or input == "210904",
    do: [
      %{"name" => "红树街道", "code" => "210904001000"},
      %{"name" => "高德街道", "code" => "210904003000"},
      %{"name" => "孙家湾街道", "code" => "210904004000"},
      %{"name" => "水泉镇", "code" => "210904101000"}
    ]

  def next(input) when input == "清河门区" or input == "210905",
    do: [
      %{"name" => "清河街道", "code" => "210905001000"},
      %{"name" => "新北街道", "code" => "210905004000"},
      %{"name" => "河西镇", "code" => "210905101000"},
      %{"name" => "乌龙坝镇", "code" => "210905102000"}
    ]

  def next(input) when input == "细河区" or input == "210911",
    do: [
      %{"name" => "玉新街道", "code" => "210911001000"},
      %{"name" => "玉龙街道", "code" => "210911007000"},
      %{"name" => "玉丰街道", "code" => "210911008000"},
      %{"name" => "四合镇", "code" => "210911102000"},
      %{"name" => "六家子街道", "code" => "210911401000"}
    ]

  def next(input) when input == "阜新蒙古族自治县" or input == "210921",
    do: [
      %{"name" => "城区街道", "code" => "210921001000"},
      %{"name" => "阜新镇", "code" => "210921100000"},
      %{"name" => "东梁镇", "code" => "210921102000"},
      %{"name" => "佛寺镇", "code" => "210921103000"},
      %{"name" => "伊吗图镇", "code" => "210921104000"},
      %{"name" => "旧庙镇", "code" => "210921105000"},
      %{"name" => "务欢池镇", "code" => "210921106000"},
      %{"name" => "建设镇", "code" => "210921107000"},
      %{"name" => "大巴镇", "code" => "210921108000"},
      %{"name" => "泡子镇", "code" => "210921109000"},
      %{"name" => "十家子镇", "code" => "210921110000"},
      %{"name" => "王府镇", "code" => "210921111000"},
      %{"name" => "于寺镇", "code" => "210921112000"},
      %{"name" => "富荣镇", "code" => "210921113000"},
      %{"name" => "新民镇", "code" => "210921114000"},
      %{"name" => "福兴地镇", "code" => "210921115000"},
      %{"name" => "平安地镇", "code" => "210921116000"},
      %{"name" => "沙拉镇", "code" => "210921117000"},
      %{"name" => "大固本镇", "code" => "210921118000"},
      %{"name" => "大五家子镇", "code" => "210921119000"},
      %{"name" => "大板镇", "code" => "210921120000"},
      %{"name" => "招束沟镇", "code" => "210921121000"},
      %{"name" => "八家子镇", "code" => "210921122000"},
      %{"name" => "蜘蛛山镇", "code" => "210921123000"},
      %{"name" => "塔营子镇", "code" => "210921124000"},
      %{"name" => "扎兰营子镇", "code" => "210921125000"},
      %{"name" => "七家子镇", "code" => "210921126000"},
      %{"name" => "红帽子镇", "code" => "210921127000"},
      %{"name" => "紫都台镇", "code" => "210921128000"},
      %{"name" => "化石戈镇", "code" => "210921129000"},
      %{"name" => "哈达户稍镇", "code" => "210921130000"},
      %{"name" => "老河土镇", "code" => "210921131000"},
      %{"name" => "太平镇", "code" => "210921132000"},
      %{"name" => "卧凤沟乡", "code" => "210921203000"},
      %{"name" => "苍土乡", "code" => "210921211000"},
      %{"name" => "国华乡", "code" => "210921222000"}
    ]

  def next(input) when input == "彰武县" or input == "210922",
    do: [
      %{"name" => "彰武镇", "code" => "210922100000"},
      %{"name" => "哈尔套镇", "code" => "210922101000"},
      %{"name" => "章古台镇", "code" => "210922102000"},
      %{"name" => "五峰镇", "code" => "210922103000"},
      %{"name" => "冯家镇", "code" => "210922104000"},
      %{"name" => "后新秋镇", "code" => "210922105000"},
      %{"name" => "东六家子镇", "code" => "210922106000"},
      %{"name" => "阿尔乡镇", "code" => "210922107000"},
      %{"name" => "前福兴地镇", "code" => "210922108000"},
      %{"name" => "双庙镇", "code" => "210922109000"},
      %{"name" => "大四家子镇", "code" => "210922110000"},
      %{"name" => "苇子沟镇", "code" => "210922111000"},
      %{"name" => "兴隆山镇", "code" => "210922112000"},
      %{"name" => "满堂红镇", "code" => "210922113000"},
      %{"name" => "四合城镇", "code" => "210922114000"},
      %{"name" => "大冷镇", "code" => "210922115000"},
      %{"name" => "两家子镇", "code" => "210922116000"},
      %{"name" => "平安镇", "code" => "210922117000"},
      %{"name" => "四堡子镇", "code" => "210922118000"},
      %{"name" => "西六家子镇", "code" => "210922119000"},
      %{"name" => "大德镇", "code" => "210922120000"},
      %{"name" => "兴隆堡镇", "code" => "210922121000"},
      %{"name" => "二道河子蒙古族乡", "code" => "210922202000"},
      %{"name" => "丰田乡", "code" => "210922209000"}
    ]

  def next(input) when input == "站前区" or input == "210802",
    do: [
      %{"name" => "八田地街道", "code" => "210802001000"},
      %{"name" => "建丰街道", "code" => "210802002000"},
      %{"name" => "建设街道", "code" => "210802003000"},
      %{"name" => "跃进街道", "code" => "210802004000"},
      %{"name" => "新建街道", "code" => "210802007000"},
      %{"name" => "东兴街道", "code" => "210802008000"}
    ]

  def next(input) when input == "西市区" or input == "210803",
    do: [
      %{"name" => "清华街道", "code" => "210803002000"},
      %{"name" => "滨海街道", "code" => "210803003000"},
      %{"name" => "得胜街道", "code" => "210803004000"},
      %{"name" => "五台子街道", "code" => "210803005000"},
      %{"name" => "渔市街道", "code" => "210803006000"},
      %{"name" => "辽宁自贸区营口片区", "code" => "210803400000"},
      %{"name" => "辽宁（营口）沿海产业基地", "code" => "210803401000"}
    ]

  def next(input) when input == "鲅鱼圈区" or input == "210804",
    do: [
      %{"name" => "红海街道", "code" => "210804001000"},
      %{"name" => "海星街道", "code" => "210804002000"},
      %{"name" => "望海街道", "code" => "210804003000"},
      %{"name" => "熊岳镇", "code" => "210804100000"},
      %{"name" => "芦屯镇", "code" => "210804101000"},
      %{"name" => "红旗镇", "code" => "210804102000"}
    ]

  def next(input) when input == "老边区" or input == "210811",
    do: [
      %{"name" => "老边街道", "code" => "210811001000"},
      %{"name" => "路南镇", "code" => "210811101000"},
      %{"name" => "柳树镇", "code" => "210811102000"},
      %{"name" => "边城镇", "code" => "210811103000"},
      %{"name" => "营口辽河经济开发区", "code" => "210811400000"}
    ]

  def next(input) when input == "盖州市" or input == "210881",
    do: [
      %{"name" => "鼓楼街道", "code" => "210881001000"},
      %{"name" => "西城街道", "code" => "210881002000"},
      %{"name" => "东城街道", "code" => "210881003000"},
      %{"name" => "太阳升街道", "code" => "210881004000"},
      %{"name" => "团山街道", "code" => "210881005000"},
      %{"name" => "西海街道", "code" => "210881006000"},
      %{"name" => "九垄地街道", "code" => "210881007000"},
      %{"name" => "归州街道", "code" => "210881008000"},
      %{"name" => "高屯镇", "code" => "210881102000"},
      %{"name" => "沙岗镇", "code" => "210881105000"},
      %{"name" => "九寨镇", "code" => "210881109000"},
      %{"name" => "万福镇", "code" => "210881110000"},
      %{"name" => "卧龙泉镇", "code" => "210881111000"},
      %{"name" => "青石岭镇", "code" => "210881112000"},
      %{"name" => "暖泉镇", "code" => "210881113000"},
      %{"name" => "榜式堡镇", "code" => "210881116000"},
      %{"name" => "团甸镇", "code" => "210881117000"},
      %{"name" => "双台镇", "code" => "210881118000"},
      %{"name" => "杨运镇", "code" => "210881119000"},
      %{"name" => "徐屯镇", "code" => "210881120000"},
      %{"name" => "什字街镇", "code" => "210881121000"},
      %{"name" => "矿洞沟镇", "code" => "210881122000"},
      %{"name" => "陈屯镇", "code" => "210881123000"},
      %{"name" => "梁屯镇", "code" => "210881124000"},
      %{"name" => "小石棚乡", "code" => "210881216000"},
      %{"name" => "果园乡", "code" => "210881217000"},
      %{"name" => "二台乡", "code" => "210881218000"}
    ]

  def next(input) when input == "大石桥市" or input == "210882",
    do: [
      %{"name" => "金桥街道", "code" => "210882003000"},
      %{"name" => "钢都街道", "code" => "210882004000"},
      %{"name" => "百寨街道", "code" => "210882005000"},
      %{"name" => "镁都街道", "code" => "210882006000"},
      %{"name" => "水源镇", "code" => "210882101000"},
      %{"name" => "沟沿镇", "code" => "210882102000"},
      %{"name" => "石佛镇", "code" => "210882103000"},
      %{"name" => "高坎镇", "code" => "210882104000"},
      %{"name" => "旗口镇", "code" => "210882105000"},
      %{"name" => "虎庄镇", "code" => "210882106000"},
      %{"name" => "官屯镇", "code" => "210882107000"},
      %{"name" => "博洛铺镇", "code" => "210882112000"},
      %{"name" => "永安镇", "code" => "210882113000"},
      %{"name" => "汤池镇", "code" => "210882114000"},
      %{"name" => "建一镇", "code" => "210882115000"},
      %{"name" => "黄土岭镇", "code" => "210882116000"},
      %{"name" => "周家镇", "code" => "210882117000"},
      %{"name" => "大石桥市水稻良种场", "code" => "210882400000"},
      %{"name" => "大石桥市示范场", "code" => "210882401000"}
    ]

  def next(input) when input == "古塔区" or input == "210702",
    do: [
      %{"name" => "石油街道", "code" => "210702002000"},
      %{"name" => "古城街道", "code" => "210702003000"},
      %{"name" => "敬业街道", "code" => "210702004000"},
      %{"name" => "保安街道", "code" => "210702005000"},
      %{"name" => "士英街道", "code" => "210702009000"}
    ]

  def next(input) when input == "凌河区" or input == "210703",
    do: [
      %{"name" => "石桥子街道", "code" => "210703002000"},
      %{"name" => "龙江街道", "code" => "210703003000"},
      %{"name" => "榴花街道", "code" => "210703004000"},
      %{"name" => "康宁街道", "code" => "210703008000"},
      %{"name" => "锦铁街道", "code" => "210703009000"},
      %{"name" => "紫荆街道", "code" => "210703011000"},
      %{"name" => "锦州北山农工商总公司", "code" => "210703403000"}
    ]

  def next(input) when input == "太和区" or input == "210711",
    do: [
      %{"name" => "太和街道", "code" => "210711004000"},
      %{"name" => "大薛街道", "code" => "210711008000"},
      %{"name" => "新民街道", "code" => "210711011000"},
      %{"name" => "营盘街道", "code" => "210711012000"},
      %{"name" => "女儿河街道", "code" => "210711013000"},
      %{"name" => "天桥街道", "code" => "210711071000"},
      %{"name" => "杏山街道", "code" => "210711072000"},
      %{"name" => "娘娘宫街道", "code" => "210711073000"},
      %{"name" => "凌南街道", "code" => "210711080000"},
      %{"name" => "松山街道", "code" => "210711081000"},
      %{"name" => "锦州市果树农场", "code" => "210711480000"}
    ]

  def next(input) when input == "黑山县" or input == "210726",
    do: [
      %{"name" => "黑山街道", "code" => "210726001000"},
      %{"name" => "大虎山街道", "code" => "210726002000"},
      %{"name" => "芳山镇", "code" => "210726101000"},
      %{"name" => "白厂门镇", "code" => "210726102000"},
      %{"name" => "常兴镇", "code" => "210726103000"},
      %{"name" => "姜屯镇", "code" => "210726104000"},
      %{"name" => "励家镇", "code" => "210726105000"},
      %{"name" => "绕阳河镇", "code" => "210726106000"},
      %{"name" => "半拉门镇", "code" => "210726107000"},
      %{"name" => "无梁殿镇", "code" => "210726108000"},
      %{"name" => "胡家镇", "code" => "210726109000"},
      %{"name" => "新立屯镇", "code" => "210726110000"},
      %{"name" => "八道壕镇", "code" => "210726111000"},
      %{"name" => "四家子镇", "code" => "210726113000"},
      %{"name" => "新兴镇", "code" => "210726114000"},
      %{"name" => "太和镇", "code" => "210726116000"},
      %{"name" => "镇安镇", "code" => "210726117000"},
      %{"name" => "英城子乡", "code" => "210726201000"},
      %{"name" => "段家乡", "code" => "210726209000"},
      %{"name" => "大兴乡", "code" => "210726210000"},
      %{"name" => "薛屯乡", "code" => "210726212000"},
      %{"name" => "辽宁省锦州市小东种畜场", "code" => "210726400000"}
    ]

  def next(input) when input == "义县" or input == "210727",
    do: [
      %{"name" => "义州街道", "code" => "210727001000"},
      %{"name" => "城关街道", "code" => "210727002000"},
      %{"name" => "刘龙台镇", "code" => "210727101000"},
      %{"name" => "七里河镇", "code" => "210727102000"},
      %{"name" => "大榆树堡镇", "code" => "210727103000"},
      %{"name" => "稍户营子镇", "code" => "210727104000"},
      %{"name" => "九道岭镇", "code" => "210727105000"},
      %{"name" => "高台子镇", "code" => "210727106000"},
      %{"name" => "瓦子峪镇", "code" => "210727108000"},
      %{"name" => "头台镇", "code" => "210727109000"},
      %{"name" => "前杨镇", "code" => "210727110000"},
      %{"name" => "张家堡镇", "code" => "210727111000"},
      %{"name" => "头道河镇", "code" => "210727112000"},
      %{"name" => "留龙沟镇", "code" => "210727113000"},
      %{"name" => "聚粮屯镇", "code" => "210727114000"},
      %{"name" => "地藏寺满族乡", "code" => "210727203000"},
      %{"name" => "大定堡满族乡", "code" => "210727205000"},
      %{"name" => "白庙子乡", "code" => "210727207000"}
    ]

  def next(input) when input == "凌海市" or input == "210781",
    do: [
      %{"name" => "大凌河街道", "code" => "210781001000"},
      %{"name" => "金城街道", "code" => "210781002000"},
      %{"name" => "八千街道", "code" => "210781003000"},
      %{"name" => "石山镇", "code" => "210781101000"},
      %{"name" => "余积镇", "code" => "210781102000"},
      %{"name" => "双羊镇", "code" => "210781103000"},
      %{"name" => "班吉塔镇", "code" => "210781104000"},
      %{"name" => "沈家台镇", "code" => "210781105000"},
      %{"name" => "三台子镇", "code" => "210781106000"},
      %{"name" => "右卫镇", "code" => "210781107000"},
      %{"name" => "阎家镇", "code" => "210781108000"},
      %{"name" => "新庄子镇", "code" => "210781109000"},
      %{"name" => "翠岩镇", "code" => "210781112000"},
      %{"name" => "安屯镇", "code" => "210781113000"},
      %{"name" => "大业镇", "code" => "210781114000"},
      %{"name" => "建业镇", "code" => "210781116000"},
      %{"name" => "温滴楼镇", "code" => "210781117000"},
      %{"name" => "白台子镇", "code" => "210781118000"},
      %{"name" => "板石沟乡", "code" => "210781212000"},
      %{"name" => "谢屯乡", "code" => "210781217000"},
      %{"name" => "辽宁省金城原种场", "code" => "210781401000"}
    ]

  def next(input) when input == "北镇市" or input == "210782",
    do: [
      %{"name" => "北镇街道", "code" => "210782004000"},
      %{"name" => "富屯街道", "code" => "210782006000"},
      %{"name" => "广宁街道", "code" => "210782007000"},
      %{"name" => "沟帮子街道", "code" => "210782008000"},
      %{"name" => "大市镇", "code" => "210782101000"},
      %{"name" => "罗罗堡镇", "code" => "210782102000"},
      %{"name" => "常兴店镇", "code" => "210782103000"},
      %{"name" => "正安镇", "code" => "210782104000"},
      %{"name" => "闾阳镇", "code" => "210782105000"},
      %{"name" => "中安镇", "code" => "210782106000"},
      %{"name" => "廖屯镇", "code" => "210782107000"},
      %{"name" => "赵屯镇", "code" => "210782109000"},
      %{"name" => "青堆子镇", "code" => "210782110000"},
      %{"name" => "高山子镇", "code" => "210782111000"},
      %{"name" => "吴家镇", "code" => "210782113000"},
      %{"name" => "鲍家乡", "code" => "210782203000"},
      %{"name" => "大屯乡", "code" => "210782206000"},
      %{"name" => "柳家乡", "code" => "210782209000"},
      %{"name" => "辽宁省北镇市高山子监狱", "code" => "210782402000"},
      %{"name" => "新立农场", "code" => "210782403000"}
    ]

  def next(input) when input == "元宝区" or input == "210602",
    do: [
      %{"name" => "七道街道", "code" => "210602002000"},
      %{"name" => "广济街道", "code" => "210602003000"},
      %{"name" => "九道街道", "code" => "210602004000"},
      %{"name" => "兴东街道", "code" => "210602006000"},
      %{"name" => "金山镇", "code" => "210602101000"}
    ]

  def next(input) when input == "振兴区" or input == "210603",
    do: [
      %{"name" => "站前街道", "code" => "210603002000"},
      %{"name" => "临江街道", "code" => "210603003000"},
      %{"name" => "帽盔山街道", "code" => "210603005000"},
      %{"name" => "纤维街道", "code" => "210603006000"},
      %{"name" => "永昌街道", "code" => "210603007000"},
      %{"name" => "花园街道", "code" => "210603008000"},
      %{"name" => "江海街道", "code" => "210603009000"},
      %{"name" => "浪头镇", "code" => "210603101000"},
      %{"name" => "安民镇", "code" => "210603102000"},
      %{"name" => "汤池镇", "code" => "210603103000"}
    ]

  def next(input) when input == "振安区" or input == "210604",
    do: [
      %{"name" => "鸭绿江街道", "code" => "210604001000"},
      %{"name" => "珍珠街道", "code" => "210604004000"},
      %{"name" => "太平湾街道", "code" => "210604005000"},
      %{"name" => "同兴镇", "code" => "210604102000"},
      %{"name" => "五龙背镇", "code" => "210604104000"},
      %{"name" => "楼房镇", "code" => "210604105000"},
      %{"name" => "九连城镇", "code" => "210604106000"},
      %{"name" => "汤山城镇", "code" => "210604107000"}
    ]

  def next(input) when input == "宽甸满族自治县" or input == "210624",
    do: [
      %{"name" => "宽甸镇", "code" => "210624100000"},
      %{"name" => "灌水镇", "code" => "210624101000"},
      %{"name" => "硼海镇", "code" => "210624102000"},
      %{"name" => "红石镇", "code" => "210624103000"},
      %{"name" => "毛甸子镇", "code" => "210624104000"},
      %{"name" => "长甸镇", "code" => "210624105000"},
      %{"name" => "永甸镇", "code" => "210624106000"},
      %{"name" => "太平哨镇", "code" => "210624108000"},
      %{"name" => "青山沟镇", "code" => "210624109000"},
      %{"name" => "牛毛坞镇", "code" => "210624110000"},
      %{"name" => "大川头镇", "code" => "210624111000"},
      %{"name" => "青椅山镇", "code" => "210624112000"},
      %{"name" => "杨木川镇", "code" => "210624113000"},
      %{"name" => "虎山镇", "code" => "210624114000"},
      %{"name" => "振江镇", "code" => "210624115000"},
      %{"name" => "步达远镇", "code" => "210624116000"},
      %{"name" => "大西岔镇", "code" => "210624117000"},
      %{"name" => "八河川镇", "code" => "210624118000"},
      %{"name" => "双山子镇", "code" => "210624119000"},
      %{"name" => "石湖沟乡", "code" => "210624201000"},
      %{"name" => "古楼子乡", "code" => "210624206000"},
      %{"name" => "下露河朝鲜族乡", "code" => "210624212000"}
    ]

  def next(input) when input == "东港市" or input == "210681",
    do: [
      %{"name" => "大东街道", "code" => "210681001000"},
      %{"name" => "新兴街道", "code" => "210681002000"},
      %{"name" => "新城街道", "code" => "210681003000"},
      %{"name" => "孤山镇", "code" => "210681101000"},
      %{"name" => "前阳镇", "code" => "210681104000"},
      %{"name" => "长安镇", "code" => "210681105000"},
      %{"name" => "十字街镇", "code" => "210681106000"},
      %{"name" => "长山镇", "code" => "210681107000"},
      %{"name" => "北井子镇", "code" => "210681108000"},
      %{"name" => "椅圈镇", "code" => "210681109000"},
      %{"name" => "黄土坎镇", "code" => "210681110000"},
      %{"name" => "马家店镇", "code" => "210681113000"},
      %{"name" => "龙王庙镇", "code" => "210681114000"},
      %{"name" => "小甸子镇", "code" => "210681115000"},
      %{"name" => "菩萨庙镇", "code" => "210681117000"},
      %{"name" => "黑沟镇", "code" => "210681118000"},
      %{"name" => "新农镇", "code" => "210681119000"},
      %{"name" => "合隆满族乡", "code" => "210681206000"},
      %{"name" => "示范农场", "code" => "210681401000"},
      %{"name" => "黄土坎农场", "code" => "210681402000"},
      %{"name" => "海洋红农场", "code" => "210681403000"},
      %{"name" => "兴隆农场", "code" => "210681404000"},
      %{"name" => "五四农场", "code" => "210681405000"}
    ]

  def next(input) when input == "凤城市" or input == "210682",
    do: [
      %{"name" => "凤凰城街道", "code" => "210682001000"},
      %{"name" => "凤山街道", "code" => "210682002000"},
      %{"name" => "草河街道", "code" => "210682003000"},
      %{"name" => "宝山镇", "code" => "210682101000"},
      %{"name" => "白旗镇", "code" => "210682102000"},
      %{"name" => "沙里寨镇", "code" => "210682103000"},
      %{"name" => "红旗镇", "code" => "210682104000"},
      %{"name" => "蓝旗镇", "code" => "210682105000"},
      %{"name" => "边门镇", "code" => "210682107000"},
      %{"name" => "东汤镇", "code" => "210682110000"},
      %{"name" => "石城镇", "code" => "210682111000"},
      %{"name" => "大兴镇", "code" => "210682112000"},
      %{"name" => "爱阳镇", "code" => "210682113000"},
      %{"name" => "赛马镇", "code" => "210682114000"},
      %{"name" => "弟兄山镇", "code" => "210682115000"},
      %{"name" => "鸡冠山镇", "code" => "210682116000"},
      %{"name" => "刘家河镇", "code" => "210682117000"},
      %{"name" => "通远堡镇", "code" => "210682118000"},
      %{"name" => "四门子镇", "code" => "210682119000"},
      %{"name" => "青城子镇", "code" => "210682120000"},
      %{"name" => "大堡蒙古族乡", "code" => "210682200000"}
    ]

  def next(input) when input == "平山区" or input == "210502",
    do: [
      %{"name" => "南地街道", "code" => "210502001000"},
      %{"name" => "平山街道", "code" => "210502003000"},
      %{"name" => "东明街道", "code" => "210502004000"},
      %{"name" => "崔东街道", "code" => "210502005000"},
      %{"name" => "站前街道", "code" => "210502007000"},
      %{"name" => "千金街道", "code" => "210502008000"},
      %{"name" => "桥北街道", "code" => "210502012000"}
    ]

  def next(input) when input == "溪湖区" or input == "210503",
    do: [
      %{"name" => "河东街道", "code" => "210503001000"},
      %{"name" => "河西街道", "code" => "210503003000"},
      %{"name" => "彩屯街道", "code" => "210503005000"},
      %{"name" => "东风街道", "code" => "210503009000"},
      %{"name" => "石桥子街道", "code" => "210503010000"},
      %{"name" => "日月岛街道", "code" => "210503011000"},
      %{"name" => "火连寨街道", "code" => "210503013000"}
    ]

  def next(input) when input == "明山区" or input == "210504",
    do: [
      %{"name" => "北地街道", "code" => "210504002000"},
      %{"name" => "高峪街道", "code" => "210504004000"},
      %{"name" => "明山街道", "code" => "210504005000"},
      %{"name" => "新明街道", "code" => "210504008000"},
      %{"name" => "牛心台街道", "code" => "210504009000"},
      %{"name" => "卧龙街道", "code" => "210504010000"},
      %{"name" => "高台子街道", "code" => "210504011000"}
    ]

  def next(input) when input == "南芬区" or input == "210505",
    do: [
      %{"name" => "南芬街道", "code" => "210505001000"},
      %{"name" => "思山岭街道", "code" => "210505004000"},
      %{"name" => "下马塘街道", "code" => "210505005000"}
    ]

  def next(input) when input == "本溪满族自治县" or input == "210521",
    do: [
      %{"name" => "观音阁街道", "code" => "210521001000"},
      %{"name" => "小市镇", "code" => "210521100000"},
      %{"name" => "草河掌镇", "code" => "210521101000"},
      %{"name" => "草河城镇", "code" => "210521102000"},
      %{"name" => "草河口镇", "code" => "210521103000"},
      %{"name" => "连山关镇", "code" => "210521104000"},
      %{"name" => "清河城镇", "code" => "210521106000"},
      %{"name" => "田师傅镇", "code" => "210521109000"},
      %{"name" => "南甸子镇", "code" => "210521110000"},
      %{"name" => "碱厂镇", "code" => "210521111000"},
      %{"name" => "高官镇", "code" => "210521112000"},
      %{"name" => "东营坊乡", "code" => "210521202000"}
    ]

  def next(input) when input == "桓仁满族自治县" or input == "210522",
    do: [
      %{"name" => "八卦城街道", "code" => "210522001000"},
      %{"name" => "桓仁镇", "code" => "210522100000"},
      %{"name" => "普乐堡镇", "code" => "210522101000"},
      %{"name" => "二棚甸子镇", "code" => "210522102000"},
      %{"name" => "沙尖子镇", "code" => "210522103000"},
      %{"name" => "五里甸子镇", "code" => "210522104000"},
      %{"name" => "八里甸子镇", "code" => "210522108000"},
      %{"name" => "华来镇", "code" => "210522110000"},
      %{"name" => "古城镇", "code" => "210522111000"},
      %{"name" => "雅河朝鲜族乡", "code" => "210522201000"},
      %{"name" => "向阳乡", "code" => "210522202000"},
      %{"name" => "黑沟乡", "code" => "210522206000"},
      %{"name" => "北甸子乡", "code" => "210522208000"}
    ]

  def next(input) when input == "新抚区" or input == "210402",
    do: [
      %{"name" => "站前街道", "code" => "210402001000"},
      %{"name" => "福民街道", "code" => "210402005000"},
      %{"name" => "新抚街道", "code" => "210402007000"},
      %{"name" => "榆林街道", "code" => "210402009000"},
      %{"name" => "永安台街道", "code" => "210402011000"},
      %{"name" => "刘山街道", "code" => "210402019000"},
      %{"name" => "千金乡", "code" => "210402201000"}
    ]

  def next(input) when input == "东洲区" or input == "210403",
    do: [
      %{"name" => "东洲街道", "code" => "210403002000"},
      %{"name" => "搭连街道", "code" => "210403004000"},
      %{"name" => "龙凤街道", "code" => "210403005000"},
      %{"name" => "新屯街道", "code" => "210403006000"},
      %{"name" => "万新街道", "code" => "210403007000"},
      %{"name" => "老虎台街道", "code" => "210403008000"},
      %{"name" => "章党街道", "code" => "210403012000"},
      %{"name" => "章党镇", "code" => "210403103000"},
      %{"name" => "哈达镇", "code" => "210403104000"},
      %{"name" => "碾盘乡", "code" => "210403202000"},
      %{"name" => "兰山乡", "code" => "210403215000"}
    ]

  def next(input) when input == "望花区" or input == "210404",
    do: [
      %{"name" => "工农街道", "code" => "210404002000"},
      %{"name" => "建设街道", "code" => "210404003000"},
      %{"name" => "和平街道", "code" => "210404004000"},
      %{"name" => "光明街道", "code" => "210404005000"},
      %{"name" => "朴屯街道", "code" => "210404006000"},
      %{"name" => "演武街道", "code" => "210404007000"},
      %{"name" => "李石街道", "code" => "210404011000"},
      %{"name" => "塔峪镇", "code" => "210404101000"},
      %{"name" => "拉古满族乡", "code" => "210404201000"}
    ]

  def next(input) when input == "顺城区" or input == "210411",
    do: [
      %{"name" => "长春街道", "code" => "210411002000"},
      %{"name" => "葛布街道", "code" => "210411003000"},
      %{"name" => "将军堡街道", "code" => "210411004000"},
      %{"name" => "新华街道", "code" => "210411005000"},
      %{"name" => "抚顺城街道", "code" => "210411007000"},
      %{"name" => "前甸镇", "code" => "210411102000"},
      %{"name" => "河北乡", "code" => "210411201000"},
      %{"name" => "会元乡", "code" => "210411205000"}
    ]

  def next(input) when input == "抚顺县" or input == "210421",
    do: [
      %{"name" => "石文镇", "code" => "210421101000"},
      %{"name" => "后安镇", "code" => "210421102000"},
      %{"name" => "上马镇", "code" => "210421105000"},
      %{"name" => "救兵镇", "code" => "210421106000"},
      %{"name" => "马圈子乡", "code" => "210421204000"},
      %{"name" => "峡河乡", "code" => "210421209000"},
      %{"name" => "海浪乡", "code" => "210421211000"},
      %{"name" => "汤图满族乡", "code" => "210421216000"}
    ]

  def next(input) when input == "新宾满族自治县" or input == "210422",
    do: [
      %{"name" => "新宾镇", "code" => "210422100000"},
      %{"name" => "旺清门镇", "code" => "210422101000"},
      %{"name" => "永陵镇", "code" => "210422102000"},
      %{"name" => "平顶山镇", "code" => "210422103000"},
      %{"name" => "大四平镇", "code" => "210422104000"},
      %{"name" => "苇子峪镇", "code" => "210422105000"},
      %{"name" => "木奇镇", "code" => "210422106000"},
      %{"name" => "上夹河镇", "code" => "210422108000"},
      %{"name" => "南杂木镇", "code" => "210422109000"},
      %{"name" => "红升乡", "code" => "210422202000"},
      %{"name" => "响水河子乡", "code" => "210422203000"},
      %{"name" => "红庙子乡", "code" => "210422204000"},
      %{"name" => "北四平乡", "code" => "210422205000"},
      %{"name" => "榆树乡", "code" => "210422207000"},
      %{"name" => "下夹河乡", "code" => "210422208000"}
    ]

  def next(input) when input == "清原满族自治县" or input == "210423",
    do: [
      %{"name" => "清原镇", "code" => "210423100000"},
      %{"name" => "红透山镇", "code" => "210423101000"},
      %{"name" => "草市镇", "code" => "210423103000"},
      %{"name" => "英额门镇", "code" => "210423104000"},
      %{"name" => "南口前镇", "code" => "210423105000"},
      %{"name" => "南山城镇", "code" => "210423106000"},
      %{"name" => "湾甸子镇", "code" => "210423107000"},
      %{"name" => "大孤家镇", "code" => "210423108000"},
      %{"name" => "夏家堡镇", "code" => "210423109000"},
      %{"name" => "北三家镇", "code" => "210423110000"},
      %{"name" => "土口子乡", "code" => "210423203000"},
      %{"name" => "敖家堡乡", "code" => "210423206000"},
      %{"name" => "大苏河乡", "code" => "210423207000"},
      %{"name" => "枸乃甸乡", "code" => "210423208000"}
    ]

  def next(input) when input == "铁东区" or input == "210302",
    do: [
      %{"name" => "解放街道", "code" => "210302002000"},
      %{"name" => "山南街道", "code" => "210302003000"},
      %{"name" => "园林街道", "code" => "210302004000"},
      %{"name" => "站前街道", "code" => "210302006000"},
      %{"name" => "和平街道", "code" => "210302008000"},
      %{"name" => "湖南街道", "code" => "210302011000"},
      %{"name" => "新兴街道", "code" => "210302013000"},
      %{"name" => "旧堡街道", "code" => "210302014000"},
      %{"name" => "大孤山街道", "code" => "210302015000"},
      %{"name" => "长甸街道", "code" => "210302017000"},
      %{"name" => "玉佛山风景区", "code" => "210302400000"}
    ]

  def next(input) when input == "铁西区" or input == "210303",
    do: [
      %{"name" => "繁荣街道", "code" => "210303002000"},
      %{"name" => "八家子街道", "code" => "210303003000"},
      %{"name" => "共和街道", "code" => "210303005000"},
      %{"name" => "永乐街道", "code" => "210303006000"},
      %{"name" => "南华街道", "code" => "210303008000"},
      %{"name" => "大陆街道", "code" => "210303009000"},
      %{"name" => "永发街道", "code" => "210303012000"},
      %{"name" => "宁远街道", "code" => "210303013000"},
      %{"name" => "达道湾街道", "code" => "210303014000"}
    ]

  def next(input) when input == "立山区" or input == "210304",
    do: [
      %{"name" => "友好街道", "code" => "210304001000"},
      %{"name" => "双山街道", "code" => "210304004000"},
      %{"name" => "立山街道", "code" => "210304006000"},
      %{"name" => "曙光街道", "code" => "210304008000"},
      %{"name" => "灵山街道", "code" => "210304009000"},
      %{"name" => "深沟寺街道", "code" => "210304014000"},
      %{"name" => "沙河街道", "code" => "210304015000"},
      %{"name" => "千山街道", "code" => "210304017000"},
      %{"name" => "齐大山街道", "code" => "210304019000"}
    ]

  def next(input) when input == "千山区" or input == "210311",
    do: [
      %{"name" => "汤岗子街道", "code" => "210311006000"},
      %{"name" => "东鞍山街道", "code" => "210311007000"},
      %{"name" => "唐家房镇", "code" => "210311102000"},
      %{"name" => "大屯镇", "code" => "210311103000"},
      %{"name" => "甘泉镇", "code" => "210311104000"}
    ]

  def next(input) when input == "台安县" or input == "210321",
    do: [
      %{"name" => "八角台街道", "code" => "210321001000"},
      %{"name" => "台东街道", "code" => "210321002000"},
      %{"name" => "西佛镇", "code" => "210321101000"},
      %{"name" => "新开河镇", "code" => "210321102000"},
      %{"name" => "黄沙坨镇", "code" => "210321103000"},
      %{"name" => "高力房镇", "code" => "210321104000"},
      %{"name" => "桑林镇", "code" => "210321105000"},
      %{"name" => "富家镇", "code" => "210321106000"},
      %{"name" => "达牛镇", "code" => "210321107000"},
      %{"name" => "韭菜台镇", "code" => "210321109000"},
      %{"name" => "新台镇", "code" => "210321110000"},
      %{"name" => "桓洞镇", "code" => "210321111000"}
    ]

  def next(input) when input == "岫岩满族自治县" or input == "210323",
    do: [
      %{"name" => "阜昌街道", "code" => "210323001000"},
      %{"name" => "兴隆街道", "code" => "210323003000"},
      %{"name" => "雅河街道", "code" => "210323004000"},
      %{"name" => "三家子镇", "code" => "210323101000"},
      %{"name" => "石庙子镇", "code" => "210323102000"},
      %{"name" => "黄花甸镇", "code" => "210323103000"},
      %{"name" => "大营子镇", "code" => "210323104000"},
      %{"name" => "苏子沟镇", "code" => "210323105000"},
      %{"name" => "偏岭镇", "code" => "210323106000"},
      %{"name" => "哈达碑镇", "code" => "210323107000"},
      %{"name" => "新甸镇", "code" => "210323108000"},
      %{"name" => "洋河镇", "code" => "210323109000"},
      %{"name" => "杨家堡镇", "code" => "210323111000"},
      %{"name" => "清凉山镇", "code" => "210323112000"},
      %{"name" => "石灰窑镇", "code" => "210323113000"},
      %{"name" => "前营镇", "code" => "210323114000"},
      %{"name" => "龙潭镇", "code" => "210323115000"},
      %{"name" => "牧牛镇", "code" => "210323116000"},
      %{"name" => "药山镇", "code" => "210323117000"},
      %{"name" => "大房身镇", "code" => "210323118000"},
      %{"name" => "朝阳镇", "code" => "210323119000"},
      %{"name" => "红旗营子乡", "code" => "210323206000"},
      %{"name" => "岭沟乡", "code" => "210323211000"},
      %{"name" => "哨子河乡", "code" => "210323212000"}
    ]

  def next(input) when input == "海城市" or input == "210381",
    do: [
      %{"name" => "海州街道", "code" => "210381001000"},
      %{"name" => "兴海街道", "code" => "210381002000"},
      %{"name" => "响堂街道", "code" => "210381003000"},
      %{"name" => "东四街道", "code" => "210381004000"},
      %{"name" => "东四方台街道", "code" => "210381006000"},
      %{"name" => "孤山镇", "code" => "210381101000"},
      %{"name" => "岔沟镇", "code" => "210381102000"},
      %{"name" => "接文镇", "code" => "210381103000"},
      %{"name" => "析木镇", "code" => "210381104000"},
      %{"name" => "马风镇", "code" => "210381105000"},
      %{"name" => "牌楼镇", "code" => "210381107000"},
      %{"name" => "八里镇", "code" => "210381108000"},
      %{"name" => "毛祁镇", "code" => "210381109000"},
      %{"name" => "英落镇", "code" => "210381110000"},
      %{"name" => "感王镇", "code" => "210381111000"},
      %{"name" => "西柳镇", "code" => "210381112000"},
      %{"name" => "中小镇", "code" => "210381113000"},
      %{"name" => "王石镇", "code" => "210381114000"},
      %{"name" => "南台镇", "code" => "210381115000"},
      %{"name" => "腾鳌镇", "code" => "210381118000"},
      %{"name" => "耿庄镇", "code" => "210381121000"},
      %{"name" => "牛庄镇", "code" => "210381123000"},
      %{"name" => "西四镇", "code" => "210381124000"},
      %{"name" => "望台镇", "code" => "210381125000"},
      %{"name" => "温香镇", "code" => "210381126000"},
      %{"name" => "高坨镇", "code" => "210381127000"}
    ]

  def next(input) when input == "中山区" or input == "210202",
    do: [
      %{"name" => "海军广场街道", "code" => "210202001000"},
      %{"name" => "人民路街道", "code" => "210202005000"},
      %{"name" => "青泥洼桥街道", "code" => "210202008000"},
      %{"name" => "葵英街道", "code" => "210202010000"},
      %{"name" => "桃源街道", "code" => "210202011000"},
      %{"name" => "老虎滩街道", "code" => "210202012000"}
    ]

  def next(input) when input == "西岗区" or input == "210203",
    do: [
      %{"name" => "香炉礁街道", "code" => "210203001000"},
      %{"name" => "日新街道", "code" => "210203004000"},
      %{"name" => "八一路街道", "code" => "210203010000"},
      %{"name" => "人民广场街道", "code" => "210203011000"},
      %{"name" => "白云街道", "code" => "210203013000"}
    ]

  def next(input) when input == "沙河口区" or input == "210204",
    do: [
      %{"name" => "春柳街道", "code" => "210204006000"},
      %{"name" => "马栏街道", "code" => "210204008000"},
      %{"name" => "南沙河口街道", "code" => "210204009000"},
      %{"name" => "黑石礁街道", "code" => "210204010000"},
      %{"name" => "李家街道", "code" => "210204011000"},
      %{"name" => "星海湾街道", "code" => "210204017000"},
      %{"name" => "西安路街道", "code" => "210204018000"}
    ]

  def next(input) when input == "甘井子区" or input == "210211",
    do: [
      %{"name" => "周水子街道", "code" => "210211001000"},
      %{"name" => "椒金山街道", "code" => "210211002000"},
      %{"name" => "甘井子街道", "code" => "210211004000"},
      %{"name" => "南关岭街道", "code" => "210211006000"},
      %{"name" => "泡崖街道", "code" => "210211007000"},
      %{"name" => "中华路街道", "code" => "210211008000"},
      %{"name" => "机场街道", "code" => "210211010000"},
      %{"name" => "辛寨子街道", "code" => "210211014000"},
      %{"name" => "红旗街道", "code" => "210211015000"},
      %{"name" => "凌水街道", "code" => "210211016000"},
      %{"name" => "大连湾街道", "code" => "210211017000"},
      %{"name" => "泉水街道", "code" => "210211018000"},
      %{"name" => "革镇堡街道", "code" => "210211019000"},
      %{"name" => "营城子街道", "code" => "210211020000"},
      %{"name" => "七贤岭街道", "code" => "210211021000"},
      %{"name" => "大连华侨果树农场", "code" => "210211400000"}
    ]

  def next(input) when input == "旅顺口区" or input == "210212",
    do: [
      %{"name" => "登峰街道", "code" => "210212001000"},
      %{"name" => "得胜街道", "code" => "210212003000"},
      %{"name" => "水师营街道", "code" => "210212005000"},
      %{"name" => "龙王塘街道", "code" => "210212006000"},
      %{"name" => "铁山街道", "code" => "210212007000"},
      %{"name" => "双岛湾街道", "code" => "210212009000"},
      %{"name" => "三涧堡街道", "code" => "210212010000"},
      %{"name" => "长城街道", "code" => "210212011000"},
      %{"name" => "龙头街道", "code" => "210212012000"},
      %{"name" => "江西街道", "code" => "210212014000"},
      %{"name" => "大连奶牛场", "code" => "210212401000"},
      %{"name" => "龙头分园", "code" => "210212402000"}
    ]

  def next(input) when input == "金州区" or input == "210213",
    do: [
      %{"name" => "拥政街道", "code" => "210213001000"},
      %{"name" => "友谊街道", "code" => "210213002000"},
      %{"name" => "马桥子街道", "code" => "210213004000"},
      %{"name" => "海青岛街道", "code" => "210213005000"},
      %{"name" => "大孤山街道", "code" => "210213006000"},
      %{"name" => "站前街道", "code" => "210213008000"},
      %{"name" => "先进街道", "code" => "210213009000"},
      %{"name" => "董家沟街道", "code" => "210213011000"},
      %{"name" => "金石滩街道", "code" => "210213012000"},
      %{"name" => "湾里街道", "code" => "210213013000"},
      %{"name" => "二十里堡街道", "code" => "210213014000"},
      %{"name" => "亮甲店街道", "code" => "210213016000"},
      %{"name" => "登沙河街道", "code" => "210213017000"},
      %{"name" => "大魏家街道", "code" => "210213019000"},
      %{"name" => "杏树街道", "code" => "210213020000"},
      %{"name" => "七顶山街道", "code" => "210213021000"},
      %{"name" => "华家街道", "code" => "210213022000"},
      %{"name" => "向应街道", "code" => "210213023000"},
      %{"name" => "大李家街道", "code" => "210213024000"},
      %{"name" => "得胜街道", "code" => "210213025000"},
      %{"name" => "炮台街道", "code" => "210213027000"},
      %{"name" => "复州湾街道", "code" => "210213028000"},
      %{"name" => "三十里堡街道", "code" => "210213029000"},
      %{"name" => "石河街道", "code" => "210213030000"},
      %{"name" => "光中街道", "code" => "210213031000"}
    ]

  def next(input) when input == "普兰店区" or input == "210214",
    do: [
      %{"name" => "丰荣街道", "code" => "210214001000"},
      %{"name" => "铁西街道", "code" => "210214002000"},
      %{"name" => "太平街道", "code" => "210214003000"},
      %{"name" => "皮口街道", "code" => "210214005000"},
      %{"name" => "城子坦街道", "code" => "210214006000"},
      %{"name" => "大刘家街道", "code" => "210214007000"},
      %{"name" => "杨树房街道", "code" => "210214008000"},
      %{"name" => "大谭街道", "code" => "210214009000"},
      %{"name" => "唐家房街道", "code" => "210214010000"},
      %{"name" => "莲山街道", "code" => "210214011000"},
      %{"name" => "安波街道", "code" => "210214012000"},
      %{"name" => "沙包街道", "code" => "210214013000"},
      %{"name" => "星台街道", "code" => "210214014000"},
      %{"name" => "墨盘街道", "code" => "210214015000"},
      %{"name" => "同益街道", "code" => "210214016000"},
      %{"name" => "乐甲街道", "code" => "210214017000"},
      %{"name" => "双塔街道", "code" => "210214018000"},
      %{"name" => "四平街道", "code" => "210214019000"}
    ]

  def next(input) when input == "长海县" or input == "210224",
    do: [
      %{"name" => "大长山岛镇", "code" => "210224100000"},
      %{"name" => "獐子岛镇", "code" => "210224101000"},
      %{"name" => "广鹿岛镇", "code" => "210224102000"},
      %{"name" => "小长山岛镇", "code" => "210224103000"},
      %{"name" => "海洋岛镇", "code" => "210224104000"}
    ]

  def next(input) when input == "瓦房店市" or input == "210281",
    do: [
      %{"name" => "新华街道", "code" => "210281001000"},
      %{"name" => "文兰街道", "code" => "210281002000"},
      %{"name" => "岭东街道", "code" => "210281003000"},
      %{"name" => "共济街道", "code" => "210281004000"},
      %{"name" => "铁东街道", "code" => "210281005000"},
      %{"name" => "祝华街道", "code" => "210281006000"},
      %{"name" => "岗店街道", "code" => "210281007000"},
      %{"name" => "太阳街道", "code" => "210281008000"},
      %{"name" => "长兴岛街道", "code" => "210281009000"},
      %{"name" => "九龙街道", "code" => "210281010000"},
      %{"name" => "交流岛街道", "code" => "210281011000"},
      %{"name" => "复州城镇", "code" => "210281101000"},
      %{"name" => "松树镇", "code" => "210281103000"},
      %{"name" => "得利寺镇", "code" => "210281105000"},
      %{"name" => "万家岭镇", "code" => "210281106000"},
      %{"name" => "许屯镇", "code" => "210281107000"},
      %{"name" => "永宁镇", "code" => "210281108000"},
      %{"name" => "谢屯镇", "code" => "210281109000"},
      %{"name" => "老虎屯镇", "code" => "210281112000"},
      %{"name" => "红沿河镇", "code" => "210281113000"},
      %{"name" => "李官镇", "code" => "210281115000"},
      %{"name" => "仙浴湾镇", "code" => "210281116000"},
      %{"name" => "元台镇", "code" => "210281117000"},
      %{"name" => "瓦窝镇", "code" => "210281118000"},
      %{"name" => "赵屯乡", "code" => "210281201000"},
      %{"name" => "土城乡", "code" => "210281203000"},
      %{"name" => "阎店乡", "code" => "210281204000"},
      %{"name" => "西杨乡", "code" => "210281205000"},
      %{"name" => "驼山乡", "code" => "210281206000"},
      %{"name" => "三台满族乡", "code" => "210281208000"},
      %{"name" => "泡崖乡", "code" => "210281210000"},
      %{"name" => "杨家满族乡", "code" => "210281212000"}
    ]

  def next(input) when input == "庄河市" or input == "210283",
    do: [
      %{"name" => "城关街道", "code" => "210283001000"},
      %{"name" => "新华街道", "code" => "210283002000"},
      %{"name" => "兴达街道", "code" => "210283003000"},
      %{"name" => "昌盛街道", "code" => "210283004000"},
      %{"name" => "明阳街道", "code" => "210283005000"},
      %{"name" => "青堆镇", "code" => "210283101000"},
      %{"name" => "徐岭镇", "code" => "210283102000"},
      %{"name" => "黑岛镇", "code" => "210283104000"},
      %{"name" => "栗子房镇", "code" => "210283105000"},
      %{"name" => "大营镇", "code" => "210283107000"},
      %{"name" => "塔岭镇", "code" => "210283108000"},
      %{"name" => "仙人洞镇", "code" => "210283109000"},
      %{"name" => "蓉花山镇", "code" => "210283110000"},
      %{"name" => "长岭镇", "code" => "210283111000"},
      %{"name" => "荷花山镇", "code" => "210283112000"},
      %{"name" => "城山镇", "code" => "210283113000"},
      %{"name" => "光明山镇", "code" => "210283114000"},
      %{"name" => "大郑镇", "code" => "210283115000"},
      %{"name" => "吴炉镇", "code" => "210283118000"},
      %{"name" => "王家镇", "code" => "210283120000"},
      %{"name" => "鞍子山乡", "code" => "210283204000"},
      %{"name" => "太平岭满族乡", "code" => "210283208000"},
      %{"name" => "步云山乡", "code" => "210283209000"},
      %{"name" => "桂云花满族乡", "code" => "210283211000"},
      %{"name" => "兰店乡", "code" => "210283214000"},
      %{"name" => "石城乡", "code" => "210283216000"}
    ]

  def next(input) when input == "和平区" or input == "210102",
    do: [
      %{"name" => "浑河湾街道", "code" => "210102001000"},
      %{"name" => "新华街道", "code" => "210102002000"},
      %{"name" => "马路湾街道", "code" => "210102016000"},
      %{"name" => "南湖街道", "code" => "210102019000"},
      %{"name" => "长白街道", "code" => "210102021000"},
      %{"name" => "太原街街道", "code" => "210102022000"},
      %{"name" => "北市场街道", "code" => "210102023000"},
      %{"name" => "南市场街道", "code" => "210102025000"},
      %{"name" => "沈水湾街道", "code" => "210102027000"},
      %{"name" => "浑河站西街道", "code" => "210102028000"}
    ]

  def next(input) when input == "沈河区" or input == "210103",
    do: [
      %{"name" => "滨河街道", "code" => "210103005000"},
      %{"name" => "万莲街道", "code" => "210103006000"},
      %{"name" => "朱剪炉街道", "code" => "210103013000"},
      %{"name" => "北站街道", "code" => "210103014000"},
      %{"name" => "风雨坛街道", "code" => "210103015000"},
      %{"name" => "皇城街道", "code" => "210103017000"},
      %{"name" => "五里河街道", "code" => "210103018000"},
      %{"name" => "南塔街道", "code" => "210103019000"},
      %{"name" => "泉园街道", "code" => "210103020000"},
      %{"name" => "马官桥街道", "code" => "210103022000"},
      %{"name" => "东陵街道", "code" => "210103023000"}
    ]

  def next(input) when input == "大东区" or input == "210104",
    do: [
      %{"name" => "大北街道", "code" => "210104002000"},
      %{"name" => "万泉街道", "code" => "210104003000"},
      %{"name" => "文官街道", "code" => "210104006000"},
      %{"name" => "二台子街道", "code" => "210104007000"},
      %{"name" => "津桥街道", "code" => "210104008000"},
      %{"name" => "东站街道", "code" => "210104009000"},
      %{"name" => "长安街道", "code" => "210104012000"},
      %{"name" => "东塔街道", "code" => "210104015000"},
      %{"name" => "上园街道", "code" => "210104017000"},
      %{"name" => "前进街道", "code" => "210104018000"}
    ]

  def next(input) when input == "皇姑区" or input == "210105",
    do: [
      %{"name" => "三台子街道", "code" => "210105001000"},
      %{"name" => "黄河街道", "code" => "210105008000"},
      %{"name" => "华山街道", "code" => "210105013000"},
      %{"name" => "明廉街道", "code" => "210105017000"},
      %{"name" => "新乐街道", "code" => "210105019000"},
      %{"name" => "舍利塔街道", "code" => "210105020000"},
      %{"name" => "北塔街道", "code" => "210105021000"},
      %{"name" => "陵东街道", "code" => "210105022000"},
      %{"name" => "鸭绿江街道", "code" => "210105023000"},
      %{"name" => "四台子街道", "code" => "210105024000"}
    ]

  def next(input) when input == "铁西区" or input == "210106",
    do: [
      %{"name" => "昆明湖街道", "code" => "210106001000"},
      %{"name" => "工人村街道", "code" => "210106003000"},
      %{"name" => "启工街道", "code" => "210106007000"},
      %{"name" => "笃工街道", "code" => "210106013000"},
      %{"name" => "兴华街道", "code" => "210106015000"},
      %{"name" => "霁虹街道", "code" => "210106019000"},
      %{"name" => "凌空街道", "code" => "210106020000"},
      %{"name" => "重工街道", "code" => "210106021000"},
      %{"name" => "兴顺街道", "code" => "210106024000"},
      %{"name" => "大青中朝友谊街道", "code" => "210106026000"},
      %{"name" => "翟家街道", "code" => "210106027000"},
      %{"name" => "大潘街道", "code" => "210106029000"},
      %{"name" => "彰驿站街道", "code" => "210106030000"},
      %{"name" => "高花街道", "code" => "210106031000"},
      %{"name" => "沈阳市经济技术开发区", "code" => "210106401000"}
    ]

  def next(input) when input == "苏家屯区" or input == "210111",
    do: [
      %{"name" => "解放街道", "code" => "210111001000"},
      %{"name" => "民主街道", "code" => "210111003000"},
      %{"name" => "中兴街道", "code" => "210111005000"},
      %{"name" => "林盛街道", "code" => "210111009000"},
      %{"name" => "沙河街道", "code" => "210111010000"},
      %{"name" => "十里河街道", "code" => "210111011000"},
      %{"name" => "陈相街道", "code" => "210111012000"},
      %{"name" => "永乐街道", "code" => "210111015000"},
      %{"name" => "佟沟街道", "code" => "210111018000"},
      %{"name" => "八一红菱街道", "code" => "210111019000"},
      %{"name" => "沈水街道", "code" => "210111020000"},
      %{"name" => "白清姚千街道", "code" => "210111021000"}
    ]

  def next(input) when input == "浑南区" or input == "210112",
    do: [
      %{"name" => "东湖街道", "code" => "210112009000"},
      %{"name" => "五三街道", "code" => "210112010000"},
      %{"name" => "浑河站东街道", "code" => "210112012000"},
      %{"name" => "高坎街道", "code" => "210112014000"},
      %{"name" => "满堂街道", "code" => "210112015000"},
      %{"name" => "深井子街道", "code" => "210112016000"},
      %{"name" => "祝家街道", "code" => "210112017000"},
      %{"name" => "白塔街道", "code" => "210112018000"},
      %{"name" => "桃仙街道", "code" => "210112019000"},
      %{"name" => "李相街道", "code" => "210112020000"},
      %{"name" => "汪家街道", "code" => "210112022000"},
      %{"name" => "王滨街道", "code" => "210112023000"}
    ]

  def next(input) when input == "沈北新区" or input == "210113",
    do: [
      %{"name" => "新城子街道", "code" => "210113001000"},
      %{"name" => "清水台街道", "code" => "210113002000"},
      %{"name" => "辉山街道", "code" => "210113003000"},
      %{"name" => "道义街道", "code" => "210113004000"},
      %{"name" => "虎石台街道", "code" => "210113006000"},
      %{"name" => "财落街道", "code" => "210113007000"},
      %{"name" => "马刚街道", "code" => "210113010000"},
      %{"name" => "黄家街道", "code" => "210113012000"},
      %{"name" => "兴隆台街道", "code" => "210113014000"},
      %{"name" => "正良街道", "code" => "210113016000"},
      %{"name" => "青年农场", "code" => "210113401000"},
      %{"name" => "前进农场", "code" => "210113402000"},
      %{"name" => "育新农场", "code" => "210113403000"},
      %{"name" => "沈北新区马刚林场", "code" => "210113404000"},
      %{"name" => "沈北新区示范农场", "code" => "210113405000"},
      %{"name" => "沈北新区种畜场", "code" => "210113406000"}
    ]

  def next(input) when input == "于洪区" or input == "210114",
    do: [
      %{"name" => "迎宾路街道", "code" => "210114001000"},
      %{"name" => "陵西街道", "code" => "210114003000"},
      %{"name" => "北陵街道", "code" => "210114007000"},
      %{"name" => "沙岭街道", "code" => "210114009000"},
      %{"name" => "南阳湖街道", "code" => "210114010000"},
      %{"name" => "城东湖街道", "code" => "210114011000"},
      %{"name" => "平罗街道", "code" => "210114012000"},
      %{"name" => "马三家街道", "code" => "210114013000"},
      %{"name" => "造化街道", "code" => "210114014000"},
      %{"name" => "光辉街道", "code" => "210114016000"},
      %{"name" => "监狱城", "code" => "210114404000"}
    ]

  def next(input) when input == "辽中区" or input == "210115",
    do: [
      %{"name" => "蒲西街道", "code" => "210115001000"},
      %{"name" => "蒲东街道", "code" => "210115002000"},
      %{"name" => "茨榆坨街道", "code" => "210115003000"},
      %{"name" => "城郊街道", "code" => "210115004000"},
      %{"name" => "于家房镇", "code" => "210115101000"},
      %{"name" => "朱家房镇", "code" => "210115102000"},
      %{"name" => "冷子堡镇", "code" => "210115103000"},
      %{"name" => "刘二堡镇", "code" => "210115104000"},
      %{"name" => "新民屯镇", "code" => "210115106000"},
      %{"name" => "满都户镇", "code" => "210115107000"},
      %{"name" => "杨士岗镇", "code" => "210115108000"},
      %{"name" => "肖寨门镇", "code" => "210115109000"},
      %{"name" => "长滩镇", "code" => "210115110000"},
      %{"name" => "四方台镇", "code" => "210115111000"},
      %{"name" => "六间房镇", "code" => "210115113000"},
      %{"name" => "养士堡镇", "code" => "210115114000"},
      %{"name" => "潘家堡镇", "code" => "210115115000"},
      %{"name" => "老大房镇", "code" => "210115117000"},
      %{"name" => "大黑岗子镇", "code" => "210115118000"},
      %{"name" => "牛心坨镇", "code" => "210115119000"},
      %{"name" => "四方台农场", "code" => "210115401000"}
    ]

  def next(input) when input == "康平县" or input == "210123",
    do: [
      %{"name" => "北三家子街道", "code" => "210123001000"},
      %{"name" => "胜利街道", "code" => "210123002000"},
      %{"name" => "东关街道", "code" => "210123003000"},
      %{"name" => "小城子镇", "code" => "210123101000"},
      %{"name" => "张强镇", "code" => "210123102000"},
      %{"name" => "方家屯镇", "code" => "210123103000"},
      %{"name" => "郝官屯镇", "code" => "210123105000"},
      %{"name" => "二牛所口镇", "code" => "210123106000"},
      %{"name" => "北四家子乡", "code" => "210123203000"},
      %{"name" => "两家子乡", "code" => "210123204000"},
      %{"name" => "海洲窝堡乡", "code" => "210123206000"},
      %{"name" => "沙金台蒙古族满族乡", "code" => "210123208000"},
      %{"name" => "柳树屯蒙古族满族乡", "code" => "210123209000"},
      %{"name" => "西关屯蒙古族满族乡", "code" => "210123210000"},
      %{"name" => "东升满族蒙古族乡", "code" => "210123211000"}
    ]

  def next(input) when input == "法库县" or input == "210124",
    do: [
      %{"name" => "吉祥街道", "code" => "210124001000"},
      %{"name" => "龙山街道", "code" => "210124002000"},
      %{"name" => "大孤家子镇", "code" => "210124101000"},
      %{"name" => "三面船镇", "code" => "210124102000"},
      %{"name" => "秀水河子镇", "code" => "210124103000"},
      %{"name" => "叶茂台镇", "code" => "210124104000"},
      %{"name" => "登仕堡子镇", "code" => "210124105000"},
      %{"name" => "柏家沟镇", "code" => "210124106000"},
      %{"name" => "丁家房镇", "code" => "210124107000"},
      %{"name" => "孟家镇", "code" => "210124108000"},
      %{"name" => "十间房镇", "code" => "210124109000"},
      %{"name" => "冯贝堡镇", "code" => "210124110000"},
      %{"name" => "依牛堡子镇", "code" => "210124111000"},
      %{"name" => "包家屯镇", "code" => "210124113000"},
      %{"name" => "慈恩寺乡", "code" => "210124201000"},
      %{"name" => "和平乡", "code" => "210124203000"},
      %{"name" => "四家子蒙古族乡", "code" => "210124208000"},
      %{"name" => "双台子乡", "code" => "210124209000"},
      %{"name" => "卧牛石乡", "code" => "210124210000"}
    ]

  def next(input) when input == "新民市" or input == "210181",
    do: [
      %{"name" => "东城街道", "code" => "210181001000"},
      %{"name" => "辽滨街道", "code" => "210181002000"},
      %{"name" => "西城街道", "code" => "210181003000"},
      %{"name" => "新柳街道", "code" => "210181004000"},
      %{"name" => "大红旗镇", "code" => "210181101000"},
      %{"name" => "梁山镇", "code" => "210181102000"},
      %{"name" => "公主屯镇", "code" => "210181103000"},
      %{"name" => "兴隆镇", "code" => "210181104000"},
      %{"name" => "前当堡镇", "code" => "210181105000"},
      %{"name" => "大民屯镇", "code" => "210181106000"},
      %{"name" => "大柳屯镇", "code" => "210181107000"},
      %{"name" => "兴隆堡镇", "code" => "210181108000"},
      %{"name" => "胡台镇", "code" => "210181109000"},
      %{"name" => "法哈牛镇", "code" => "210181110000"},
      %{"name" => "柳河沟镇", "code" => "210181111000"},
      %{"name" => "高台子镇", "code" => "210181112000"},
      %{"name" => "张家屯镇", "code" => "210181113000"},
      %{"name" => "罗家房镇", "code" => "210181114000"},
      %{"name" => "三道岗子镇", "code" => "210181115000"},
      %{"name" => "东蛇山子镇", "code" => "210181116000"},
      %{"name" => "陶家屯镇", "code" => "210181117000"},
      %{"name" => "周坨子镇", "code" => "210181118000"},
      %{"name" => "金五台子镇", "code" => "210181119000"},
      %{"name" => "新农村镇", "code" => "210181120000"},
      %{"name" => "红旗乡", "code" => "210181205000"},
      %{"name" => "卢家屯乡", "code" => "210181206000"},
      %{"name" => "姚堡乡", "code" => "210181207000"},
      %{"name" => "于家窝堡乡", "code" => "210181209000"}
    ]

  def next(_), do: nil
end