defmodule ChinaAdminDivisions.Gen.Lv3x.M22 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "延吉市" or input == "222401",
    do: [
      %{"name" => "进学街道", "code" => "222401001"},
      %{"name" => "北山街道", "code" => "222401002"},
      %{"name" => "新兴街道", "code" => "222401003"},
      %{"name" => "公园街道", "code" => "222401004"},
      %{"name" => "河南街道", "code" => "222401005"},
      %{"name" => "建工街道", "code" => "222401006"},
      %{"name" => "小营镇", "code" => "222401100"},
      %{"name" => "依兰镇", "code" => "222401101"},
      %{"name" => "三道湾镇", "code" => "222401102"},
      %{"name" => "朝阳川镇", "code" => "222401105"},
      %{"name" => "延吉市林业局", "code" => "222401400"},
      %{"name" => "东山农场", "code" => "222401401"},
      %{"name" => "延边原种场", "code" => "222401402"},
      %{"name" => "延边新兴工业集中区", "code" => "222401404"}
    ]

  def next(input) when input == "图们市" or input == "222402",
    do: [
      %{"name" => "向上街道", "code" => "222402001"},
      %{"name" => "新华街道", "code" => "222402002"},
      %{"name" => "月宫街道", "code" => "222402003"},
      %{"name" => "月晴镇", "code" => "222402100"},
      %{"name" => "石岘镇", "code" => "222402101"},
      %{"name" => "长安镇", "code" => "222402102"},
      %{"name" => "凉水镇", "code" => "222402103"}
    ]

  def next(input) when input == "敦化市" or input == "222403",
    do: [
      %{"name" => "渤海街道", "code" => "222403001"},
      %{"name" => "胜利街道", "code" => "222403002"},
      %{"name" => "民主街道", "code" => "222403003"},
      %{"name" => "丹江街道", "code" => "222403004"},
      %{"name" => "大石头镇", "code" => "222403100"},
      %{"name" => "黄泥河镇", "code" => "222403101"},
      %{"name" => "官地镇", "code" => "222403102"},
      %{"name" => "沙河沿镇", "code" => "222403103"},
      %{"name" => "秋梨沟镇", "code" => "222403104"},
      %{"name" => "额穆镇", "code" => "222403105"},
      %{"name" => "贤儒镇", "code" => "222403106"},
      %{"name" => "大蒲柴河镇", "code" => "222403107"},
      %{"name" => "雁鸣湖镇", "code" => "222403108"},
      %{"name" => "江源镇", "code" => "222403109"},
      %{"name" => "江南镇", "code" => "222403110"},
      %{"name" => "大桥乡", "code" => "222403200"},
      %{"name" => "黑石乡", "code" => "222403201"},
      %{"name" => "青沟子乡", "code" => "222403202"},
      %{"name" => "翰章乡", "code" => "222403203"},
      %{"name" => "红石乡", "code" => "222403204"},
      %{"name" => "长白山森工集团敦化林业有限公司", "code" => "222403400"},
      %{"name" => "长白山森工集团黄泥河林业有限公司", "code" => "222403401"},
      %{"name" => "长白山森工集团大石头林业有限公司", "code" => "222403402"},
      %{"name" => "敦化市林业局", "code" => "222403403"},
      %{"name" => "敖东鹿场", "code" => "222403404"}
    ]

  def next(input) when input == "珲春市" or input == "222404",
    do: [
      %{"name" => "靖和街道", "code" => "222404001"},
      %{"name" => "新安街道", "code" => "222404002"},
      %{"name" => "河南街道", "code" => "222404003"},
      %{"name" => "海东街道", "code" => "222404006"},
      %{"name" => "近海街道", "code" => "222404060"},
      %{"name" => "春化镇", "code" => "222404100"},
      %{"name" => "敬信镇", "code" => "222404101"},
      %{"name" => "板石镇", "code" => "222404102"},
      %{"name" => "英安镇", "code" => "222404103"},
      %{"name" => "马川子乡", "code" => "222404200"},
      %{"name" => "杨泡满族乡", "code" => "222404201"},
      %{"name" => "三家子满族乡", "code" => "222404202"},
      %{"name" => "密江乡", "code" => "222404203"},
      %{"name" => "哈达门乡", "code" => "222404204"},
      %{"name" => "珲春林业局", "code" => "222404400"}
    ]

  def next(input) when input == "龙井市" or input == "222405",
    do: [
      %{"name" => "安民街道", "code" => "222405001"},
      %{"name" => "龙门街道", "code" => "222405002"},
      %{"name" => "梨园街道", "code" => "222405005"},
      %{"name" => "开山屯镇", "code" => "222405100"},
      %{"name" => "老头沟镇", "code" => "222405102"},
      %{"name" => "三合镇", "code" => "222405103"},
      %{"name" => "东盛涌镇", "code" => "222405104"},
      %{"name" => "智新镇", "code" => "222405105"},
      %{"name" => "德新乡", "code" => "222405200"},
      %{"name" => "白金乡", "code" => "222405201"},
      %{"name" => "龙井市林业局", "code" => "222405400"},
      %{"name" => "龙井大苏果树农场", "code" => "222405401"}
    ]

  def next(input) when input == "和龙市" or input == "222406",
    do: [
      %{"name" => "民慧街道", "code" => "222406001"},
      %{"name" => "光明街道", "code" => "222406002"},
      %{"name" => "文化街道", "code" => "222406003"},
      %{"name" => "八家子镇", "code" => "222406100"},
      %{"name" => "福洞镇", "code" => "222406101"},
      %{"name" => "头道镇", "code" => "222406102"},
      %{"name" => "西城镇", "code" => "222406103"},
      %{"name" => "南坪镇", "code" => "222406104"},
      %{"name" => "东城镇", "code" => "222406105"},
      %{"name" => "崇善镇", "code" => "222406106"},
      %{"name" => "龙城镇", "code" => "222406107"},
      %{"name" => "和龙林业局", "code" => "222406400"},
      %{"name" => "八家子林业局", "code" => "222406401"},
      %{"name" => "和龙市林业局", "code" => "222406402"}
    ]

  def next(input) when input == "汪清县" or input == "222424",
    do: [
      %{"name" => "大川街道", "code" => "222424011"},
      %{"name" => "新民街道", "code" => "222424012"},
      %{"name" => "长荣街道", "code" => "222424013"},
      %{"name" => "汪清镇", "code" => "222424100"},
      %{"name" => "大兴沟镇", "code" => "222424101"},
      %{"name" => "天桥岭镇", "code" => "222424102"},
      %{"name" => "罗子沟镇", "code" => "222424103"},
      %{"name" => "百草沟镇", "code" => "222424104"},
      %{"name" => "春阳镇", "code" => "222424105"},
      %{"name" => "复兴镇", "code" => "222424106"},
      %{"name" => "东光镇", "code" => "222424107"},
      %{"name" => "鸡冠乡", "code" => "222424200"},
      %{"name" => "汪清林业局", "code" => "222424400"},
      %{"name" => "天桥岭林业局", "code" => "222424401"},
      %{"name" => "大兴沟林业局", "code" => "222424402"}
    ]

  def next(input) when input == "安图县" or input == "222426",
    do: [
      %{"name" => "长兴街道", "code" => "222426001"},
      %{"name" => "瓮声街道", "code" => "222426002"},
      %{"name" => "九龙街道", "code" => "222426003"},
      %{"name" => "明月镇", "code" => "222426100"},
      %{"name" => "松江镇", "code" => "222426101"},
      %{"name" => "二道白河镇", "code" => "222426102"},
      %{"name" => "两江镇", "code" => "222426103"},
      %{"name" => "石门镇", "code" => "222426104"},
      %{"name" => "万宝镇", "code" => "222426105"},
      %{"name" => "亮兵镇", "code" => "222426106"},
      %{"name" => "长白山保护开发区池北区特殊乡镇", "code" => "222426120"},
      %{"name" => "新合乡", "code" => "222426200"},
      %{"name" => "永庆乡", "code" => "222426201"},
      %{"name" => "白河林业局", "code" => "222426400"},
      %{"name" => "安图林业有限公司", "code" => "222426401"},
      %{"name" => "安图县林业局", "code" => "222426402"}
    ]

  def next(input) when input == "洮北区" or input == "220802",
    do: [
      %{"name" => "海明街道", "code" => "220802001"},
      %{"name" => "长庆街道", "code" => "220802002"},
      %{"name" => "瑞光街道", "code" => "220802003"},
      %{"name" => "明仁街道", "code" => "220802004"},
      %{"name" => "铁东街道", "code" => "220802005"},
      %{"name" => "（工业园区）城南街道", "code" => "220802006"},
      %{"name" => "新立街道", "code" => "220802007"},
      %{"name" => "新华街道", "code" => "220802009"},
      %{"name" => "（白城市生态新区）官银号街道", "code" => "220802012"},
      %{"name" => "平安镇", "code" => "220802100"},
      %{"name" => "青山镇", "code" => "220802101"},
      %{"name" => "林海镇", "code" => "220802102"},
      %{"name" => "洮河镇", "code" => "220802103"},
      %{"name" => "平台镇", "code" => "220802104"},
      %{"name" => "到保镇", "code" => "220802105"},
      %{"name" => "岭下镇", "code" => "220802170"},
      %{"name" => "东风乡", "code" => "220802200"},
      %{"name" => "三合乡", "code" => "220802201"},
      %{"name" => "东胜乡", "code" => "220802202"},
      %{"name" => "金祥乡", "code" => "220802203"},
      %{"name" => "德顺蒙古族乡", "code" => "220802204"},
      %{"name" => "镇南种羊场", "code" => "220802402"},
      %{"name" => "白城牧场", "code" => "220802403"},
      %{"name" => "洮儿河农场", "code" => "220802404"},
      %{"name" => "保民农场", "code" => "220802405"}
    ]

  def next(input) when input == "镇赉县" or input == "220821",
    do: [
      %{"name" => "鹤城街道", "code" => "220821001"},
      %{"name" => "镇东街道", "code" => "220821002"},
      %{"name" => "赉北街道", "code" => "220821003"},
      %{"name" => "镇赉镇", "code" => "220821100"},
      %{"name" => "坦途镇", "code" => "220821101"},
      %{"name" => "东屏镇", "code" => "220821102"},
      %{"name" => "大屯镇", "code" => "220821103"},
      %{"name" => "沿江镇", "code" => "220821104"},
      %{"name" => "五棵树镇", "code" => "220821105"},
      %{"name" => "黑鱼泡镇", "code" => "220821106"},
      %{"name" => "哈吐气蒙古族乡", "code" => "220821200"},
      %{"name" => "莫莫格蒙古族乡", "code" => "220821201"},
      %{"name" => "建平乡", "code" => "220821202"},
      %{"name" => "嘎什根乡", "code" => "220821203"},
      %{"name" => "四方坨子农场", "code" => "220821400"},
      %{"name" => "良种繁育场", "code" => "220821402"},
      %{"name" => "九龙山马场", "code" => "220821403"},
      %{"name" => "国营渔场", "code" => "220821406"}
    ]

  def next(input) when input == "通榆县" or input == "220822",
    do: [
      %{"name" => "树满街道", "code" => "220822001"},
      %{"name" => "八区街道", "code" => "220822002"},
      %{"name" => "迎新街道", "code" => "220822003"},
      %{"name" => "开通镇", "code" => "220822100"},
      %{"name" => "瞻榆镇", "code" => "220822101"},
      %{"name" => "双岗镇", "code" => "220822102"},
      %{"name" => "兴隆山镇", "code" => "220822103"},
      %{"name" => "边昭镇", "code" => "220822104"},
      %{"name" => "鸿兴镇", "code" => "220822105"},
      %{"name" => "新华镇", "code" => "220822106"},
      %{"name" => "乌兰花镇", "code" => "220822107"},
      %{"name" => "新发乡", "code" => "220822200"},
      %{"name" => "新兴乡", "code" => "220822201"},
      %{"name" => "向海蒙古族乡", "code" => "220822202"},
      %{"name" => "包拉温都蒙古族乡", "code" => "220822203"},
      %{"name" => "团结乡", "code" => "220822204"},
      %{"name" => "十花道乡", "code" => "220822205"},
      %{"name" => "八面乡", "code" => "220822206"},
      %{"name" => "苏公坨乡", "code" => "220822207"},
      %{"name" => "通榆经济开发区", "code" => "220822400"},
      %{"name" => "三家子种牛场", "code" => "220822401"},
      %{"name" => "新华牛场", "code" => "220822405"}
    ]

  def next(input) when input == "吉林白城经济开发区" or input == "220871",
    do: [
      %{"name" => "幸福街道", "code" => "220871001"},
      %{"name" => "保平街道", "code" => "220871002"},
      %{"name" => "西郊街道", "code" => "220871003"}
    ]

  def next(input) when input == "洮南市" or input == "220881",
    do: [
      %{"name" => "团结街道", "code" => "220881001"},
      %{"name" => "富文街道", "code" => "220881002"},
      %{"name" => "光明街道", "code" => "220881003"},
      %{"name" => "兴隆街道", "code" => "220881004"},
      %{"name" => "永康街道", "code" => "220881005"},
      %{"name" => "通达街道", "code" => "220881006"},
      %{"name" => "洮府街道", "code" => "220881007"},
      %{"name" => "向阳街道", "code" => "220881008"},
      %{"name" => "瓦房镇", "code" => "220881100"},
      %{"name" => "万宝镇", "code" => "220881101"},
      %{"name" => "黑水镇", "code" => "220881102"},
      %{"name" => "那金镇", "code" => "220881103"},
      %{"name" => "安定镇", "code" => "220881104"},
      %{"name" => "福顺镇", "code" => "220881105"},
      %{"name" => "胡力吐蒙古族乡", "code" => "220881200"},
      %{"name" => "万宝乡", "code" => "220881201"},
      %{"name" => "聚宝乡", "code" => "220881202"},
      %{"name" => "东升乡", "code" => "220881203"},
      %{"name" => "野马乡", "code" => "220881204"},
      %{"name" => "永茂乡", "code" => "220881205"},
      %{"name" => "蛟流河乡", "code" => "220881206"},
      %{"name" => "大通乡", "code" => "220881207"},
      %{"name" => "二龙乡", "code" => "220881209"},
      %{"name" => "呼和车力蒙古族乡", "code" => "220881210"},
      %{"name" => "市原种场", "code" => "220881402"}
    ]

  def next(input) when input == "大安市" or input == "220882",
    do: [
      %{"name" => "慧阳街道", "code" => "220882001"},
      %{"name" => "临江街道", "code" => "220882002"},
      %{"name" => "长虹街道", "code" => "220882003"},
      %{"name" => "锦华街道", "code" => "220882004"},
      %{"name" => "安北街道", "code" => "220882005"},
      %{"name" => "月亮泡镇", "code" => "220882100"},
      %{"name" => "安广镇", "code" => "220882101"},
      %{"name" => "丰收镇", "code" => "220882102"},
      %{"name" => "新平安镇", "code" => "220882103"},
      %{"name" => "两家子镇", "code" => "220882104"},
      %{"name" => "舍力镇", "code" => "220882105"},
      %{"name" => "大岗子镇", "code" => "220882106"},
      %{"name" => "叉干镇", "code" => "220882107"},
      %{"name" => "龙沼镇", "code" => "220882108"},
      %{"name" => "太山镇", "code" => "220882109"},
      %{"name" => "四棵树乡", "code" => "220882200"},
      %{"name" => "联合乡", "code" => "220882201"},
      %{"name" => "大赉乡", "code" => "220882202"},
      %{"name" => "红岗子乡", "code" => "220882203"},
      %{"name" => "海坨乡", "code" => "220882204"},
      %{"name" => "新艾里蒙古族乡", "code" => "220882205"},
      %{"name" => "烧锅镇乡", "code" => "220882206"},
      %{"name" => "乐胜乡", "code" => "220882207"},
      %{"name" => "大安经济开发区（省级）", "code" => "220882400"},
      %{"name" => "新荒渔场", "code" => "220882401"},
      %{"name" => "东方红农场", "code" => "220882402"},
      %{"name" => "五间房水库", "code" => "220882404"},
      %{"name" => "风水山牧场", "code" => "220882406"},
      %{"name" => "东风马场", "code" => "220882407"},
      %{"name" => "良种繁育场", "code" => "220882408"},
      %{"name" => "大安马场", "code" => "220882409"},
      %{"name" => "安广猪场", "code" => "220882410"},
      %{"name" => "红旗饲养场", "code" => "220882411"}
    ]

  def next(input) when input == "宁江区" or input == "220702",
    do: [
      %{"name" => "团结街道", "code" => "220702001"},
      %{"name" => "文化街道", "code" => "220702002"},
      %{"name" => "民主街道", "code" => "220702003"},
      %{"name" => "临江街道", "code" => "220702004"},
      %{"name" => "新区街道", "code" => "220702005"},
      %{"name" => "前进街道", "code" => "220702006"},
      %{"name" => "和平街道", "code" => "220702007"},
      %{"name" => "工农街道", "code" => "220702008"},
      %{"name" => "沿江街道", "code" => "220702009"},
      %{"name" => "铁西街道", "code" => "220702010"},
      %{"name" => "繁荣街道", "code" => "220702011"},
      %{"name" => "建设街道", "code" => "220702012"},
      %{"name" => "石化街道", "code" => "220702013"},
      %{"name" => "伯都讷街道", "code" => "220702014"},
      %{"name" => "长宁街道", "code" => "220702015"},
      %{"name" => "滨江街道", "code" => "220702016"},
      %{"name" => "镜湖街道", "code" => "220702017"},
      %{"name" => "大洼镇", "code" => "220702100"},
      %{"name" => "善友镇", "code" => "220702101"},
      %{"name" => "毛都站镇", "code" => "220702102"},
      %{"name" => "哈达山镇", "code" => "220702103"},
      %{"name" => "新城乡", "code" => "220702200"},
      %{"name" => "伯都乡", "code" => "220702202"},
      %{"name" => "大洼商业渔场", "code" => "220702401"},
      %{"name" => "松原市善友国有林保护中心", "code" => "220702402"},
      %{"name" => "松原市宁江区八家子国有林保护中心", "code" => "220702403"},
      %{"name" => "良种繁育场", "code" => "220702404"},
      %{"name" => "松原市哈达山国有林保护中心", "code" => "220702405"},
      %{"name" => "吉林宁江经济开发区", "code" => "220702406"}
    ]

  def next(input) when input == "前郭尔罗斯蒙古族自治县" or input == "220721",
    do: [
      %{"name" => "阿穆尔街道", "code" => "220721001"},
      %{"name" => "萨日朗街道", "code" => "220721002"},
      %{"name" => "哈达街道", "code" => "220721003"},
      %{"name" => "前郭尔罗斯镇", "code" => "220721100"},
      %{"name" => "长山镇", "code" => "220721101"},
      %{"name" => "海渤日戈镇", "code" => "220721102"},
      %{"name" => "乌兰图嘎镇", "code" => "220721103"},
      %{"name" => "查干花镇", "code" => "220721104"},
      %{"name" => "王府站镇", "code" => "220721105"},
      %{"name" => "八郎镇", "code" => "220721106"},
      %{"name" => "哈拉毛都镇", "code" => "220721107"},
      %{"name" => "查干湖镇", "code" => "220721108"},
      %{"name" => "宝甸乡", "code" => "220721200"},
      %{"name" => "平凤乡", "code" => "220721201"},
      %{"name" => "达里巴乡", "code" => "220721203"},
      %{"name" => "吉拉吐乡", "code" => "220721204"},
      %{"name" => "白依拉嘎乡", "code" => "220721205"},
      %{"name" => "洪泉乡", "code" => "220721206"},
      %{"name" => "额如乡", "code" => "220721207"},
      %{"name" => "套浩太乡", "code" => "220721208"},
      %{"name" => "长龙乡", "code" => "220721209"},
      %{"name" => "乌兰塔拉乡", "code" => "220721210"},
      %{"name" => "东三家子乡", "code" => "220721211"},
      %{"name" => "浩特芒哈乡", "code" => "220721212"},
      %{"name" => "乌兰敖都乡", "code" => "220721213"},
      %{"name" => "红旗农场", "code" => "220721400"},
      %{"name" => "红光农场", "code" => "220721401"},
      %{"name" => "红星牧场", "code" => "220721402"},
      %{"name" => "查干花种畜场", "code" => "220721403"},
      %{"name" => "莲花泡农场", "code" => "220721404"},
      %{"name" => "深井子牧场", "code" => "220721405"},
      %{"name" => "前郭尔罗斯蒙古族自治县国有林总场", "code" => "220721406"},
      %{"name" => "查干湖旅游经济开发区", "code" => "220721407"},
      %{"name" => "八郎农场", "code" => "220721408"},
      %{"name" => "查干湖渔场", "code" => "220721409"},
      %{"name" => "长山余热鱼苗繁殖场", "code" => "220721411"},
      %{"name" => "库里渔场", "code" => "220721412"},
      %{"name" => "哈拉毛都良种场", "code" => "220721413"},
      %{"name" => "新庙泡渔场", "code" => "220721415"},
      %{"name" => "吉林前郭经济技术开发区", "code" => "220721417"}
    ]

  def next(input) when input == "长岭县" or input == "220722",
    do: [
      %{"name" => "长盛街道", "code" => "220722001"},
      %{"name" => "长治街道", "code" => "220722002"},
      %{"name" => "长久街道", "code" => "220722003"},
      %{"name" => "长岭镇", "code" => "220722100"},
      %{"name" => "太平川镇", "code" => "220722101"},
      %{"name" => "巨宝山镇", "code" => "220722102"},
      %{"name" => "太平山镇", "code" => "220722103"},
      %{"name" => "前七号镇", "code" => "220722104"},
      %{"name" => "新安镇", "code" => "220722105"},
      %{"name" => "三青山镇", "code" => "220722106"},
      %{"name" => "大兴镇", "code" => "220722107"},
      %{"name" => "北正镇", "code" => "220722108"},
      %{"name" => "流水镇", "code" => "220722109"},
      %{"name" => "永久镇", "code" => "220722110"},
      %{"name" => "利发盛镇", "code" => "220722111"},
      %{"name" => "集体乡", "code" => "220722200"},
      %{"name" => "光明乡", "code" => "220722201"},
      %{"name" => "三县堡乡", "code" => "220722202"},
      %{"name" => "海青乡", "code" => "220722203"},
      %{"name" => "前进乡", "code" => "220722204"},
      %{"name" => "东岭乡", "code" => "220722205"},
      %{"name" => "腰坨子乡", "code" => "220722206"},
      %{"name" => "八十八乡", "code" => "220722207"},
      %{"name" => "三团乡", "code" => "220722208"},
      %{"name" => "三十号乡", "code" => "220722209"},
      %{"name" => "长岭种马场", "code" => "220722400"},
      %{"name" => "长岭环城工业集中区", "code" => "220722401"},
      %{"name" => "太平川机械林场", "code" => "220722405"},
      %{"name" => "三团机械林场", "code" => "220722406"},
      %{"name" => "东岭机械林场", "code" => "220722407"},
      %{"name" => "十四号种畜场", "code" => "220722408"},
      %{"name" => "良种繁育场", "code" => "220722409"},
      %{"name" => "前七号机械林场", "code" => "220722410"}
    ]

  def next(input) when input == "乾安县" or input == "220723",
    do: [
      %{"name" => "荣业街道", "code" => "220723001"},
      %{"name" => "驰誉街道", "code" => "220723002"},
      %{"name" => "如松街道", "code" => "220723003"},
      %{"name" => "乾安镇", "code" => "220723100"},
      %{"name" => "大布苏镇", "code" => "220723101"},
      %{"name" => "水字镇", "code" => "220723102"},
      %{"name" => "让字镇", "code" => "220723103"},
      %{"name" => "所字镇", "code" => "220723104"},
      %{"name" => "安字镇", "code" => "220723105"},
      %{"name" => "余字乡", "code" => "220723200"},
      %{"name" => "道字乡", "code" => "220723201"},
      %{"name" => "严字乡", "code" => "220723202"},
      %{"name" => "赞字乡", "code" => "220723203"},
      %{"name" => "国营林场", "code" => "220723400"},
      %{"name" => "腾字种畜场", "code" => "220723401"},
      %{"name" => "大遐畜牧场", "code" => "220723402"},
      %{"name" => "乾安鹿场", "code" => "220723403"},
      %{"name" => "来字良种繁育基地", "code" => "220723404"},
      %{"name" => "地字种畜场", "code" => "220723405"}
    ]

  def next(input) when input == "吉林松原经济开发区" or input == "220771",
    do: [
      %{"name" => "兴原乡", "code" => "220771200"},
      %{"name" => "松原经济技术开发区特殊乡镇", "code" => "220771599"}
    ]

  def next(input) when input == "扶余市" or input == "220781",
    do: [
      %{"name" => "和兴街道", "code" => "220781001"},
      %{"name" => "育才街道", "code" => "220781002"},
      %{"name" => "联盟街道", "code" => "220781003"},
      %{"name" => "士英街道", "code" => "220781004"},
      %{"name" => "铁西街道", "code" => "220781005"},
      %{"name" => "三岔河镇", "code" => "220781100"},
      %{"name" => "长春岭镇", "code" => "220781101"},
      %{"name" => "五家站镇", "code" => "220781102"},
      %{"name" => "陶赖昭镇", "code" => "220781103"},
      %{"name" => "蔡家沟镇", "code" => "220781104"},
      %{"name" => "弓棚子镇", "code" => "220781105"},
      %{"name" => "三井子镇", "code" => "220781106"},
      %{"name" => "增盛镇", "code" => "220781107"},
      %{"name" => "新万发镇", "code" => "220781108"},
      %{"name" => "大林子镇", "code" => "220781109"},
      %{"name" => "新源镇", "code" => "220781110"},
      %{"name" => "得胜镇", "code" => "220781111"},
      %{"name" => "三骏满族蒙古族锡伯族乡", "code" => "220781200"},
      %{"name" => "永平乡", "code" => "220781201"},
      %{"name" => "新站乡", "code" => "220781203"},
      %{"name" => "更新乡", "code" => "220781204"},
      %{"name" => "肖家乡", "code" => "220781206"},
      %{"name" => "拉林灌区管理局", "code" => "220781401"},
      %{"name" => "下岱吉灌区管理局", "code" => "220781402"}
    ]

  def next(input) when input == "浑江区" or input == "220602",
    do: [
      %{"name" => "新建街道", "code" => "220602001"},
      %{"name" => "通沟街道", "code" => "220602002"},
      %{"name" => "东兴街道", "code" => "220602003"},
      %{"name" => "红旗街道", "code" => "220602004"},
      %{"name" => "城南街道", "code" => "220602005"},
      %{"name" => "江北街道", "code" => "220602006"},
      %{"name" => "河口街道", "code" => "220602007"},
      %{"name" => "板石街道", "code" => "220602008"},
      %{"name" => "七道江镇", "code" => "220602100"},
      %{"name" => "六道江镇", "code" => "220602101"},
      %{"name" => "红土崖镇", "code" => "220602102"},
      %{"name" => "三道沟镇", "code" => "220602103"}
    ]

  def next(input) when input == "江源区" or input == "220605",
    do: [
      %{"name" => "孙家堡子街道", "code" => "220605001"},
      %{"name" => "江源街道", "code" => "220605002"},
      %{"name" => "正岔街道", "code" => "220605003"},
      %{"name" => "城墙街道", "code" => "220605004"},
      %{"name" => "湾沟镇", "code" => "220605102"},
      %{"name" => "松树镇", "code" => "220605103"},
      %{"name" => "砟子镇", "code" => "220605104"},
      %{"name" => "石人镇", "code" => "220605105"},
      %{"name" => "大阳岔镇", "code" => "220605106"},
      %{"name" => "大石人镇", "code" => "220605107"}
    ]

  def next(input) when input == "抚松县" or input == "220621",
    do: [
      %{"name" => "抚松镇", "code" => "220621100"},
      %{"name" => "松江河镇", "code" => "220621101"},
      %{"name" => "泉阳镇", "code" => "220621102"},
      %{"name" => "露水河镇", "code" => "220621103"},
      %{"name" => "仙人桥镇", "code" => "220621104"},
      %{"name" => "万良镇", "code" => "220621105"},
      %{"name" => "新屯子镇", "code" => "220621106"},
      %{"name" => "东岗镇", "code" => "220621107"},
      %{"name" => "漫江镇", "code" => "220621108"},
      %{"name" => "北岗镇", "code" => "220621109"},
      %{"name" => "兴参镇", "code" => "220621110"},
      %{"name" => "长白山保护开发区池西区特殊乡镇", "code" => "220621120"},
      %{"name" => "长白山保护开发区池南区特殊乡镇", "code" => "220621121"},
      %{"name" => "兴隆乡", "code" => "220621200"},
      %{"name" => "抽水乡", "code" => "220621201"},
      %{"name" => "沿江乡", "code" => "220621202"}
    ]

  def next(input) when input == "靖宇县" or input == "220622",
    do: [
      %{"name" => "靖宇镇", "code" => "220622100"},
      %{"name" => "三道湖镇", "code" => "220622101"},
      %{"name" => "龙泉镇", "code" => "220622102"},
      %{"name" => "那尔轰镇", "code" => "220622103"},
      %{"name" => "花园口镇", "code" => "220622104"},
      %{"name" => "景山镇", "code" => "220622105"},
      %{"name" => "赤松镇", "code" => "220622106"},
      %{"name" => "濛江乡", "code" => "220622201"}
    ]

  def next(input) when input == "长白朝鲜族自治县" or input == "220623",
    do: [
      %{"name" => "长白镇", "code" => "220623100"},
      %{"name" => "八道沟镇", "code" => "220623101"},
      %{"name" => "十四道沟镇", "code" => "220623102"},
      %{"name" => "马鹿沟镇", "code" => "220623103"},
      %{"name" => "宝泉山镇", "code" => "220623104"},
      %{"name" => "新房子镇", "code" => "220623105"},
      %{"name" => "十二道沟镇", "code" => "220623106"},
      %{"name" => "金华乡", "code" => "220623200"}
    ]

  def next(input) when input == "临江市" or input == "220681",
    do: [
      %{"name" => "建国街道", "code" => "220681001"},
      %{"name" => "新市街道", "code" => "220681002"},
      %{"name" => "兴隆街道", "code" => "220681003"},
      %{"name" => "大湖街道", "code" => "220681004"},
      %{"name" => "森工街道", "code" => "220681005"},
      %{"name" => "大栗子街道", "code" => "220681006"},
      %{"name" => "桦树镇", "code" => "220681100"},
      %{"name" => "六道沟镇", "code" => "220681101"},
      %{"name" => "苇沙河镇", "code" => "220681102"},
      %{"name" => "花山镇", "code" => "220681103"},
      %{"name" => "闹枝镇", "code" => "220681104"},
      %{"name" => "四道沟镇", "code" => "220681105"},
      %{"name" => "蚂蚁河乡", "code" => "220681200"}
    ]

  def next(input) when input == "东昌区" or input == "220502",
    do: [
      %{"name" => "东昌街道", "code" => "220502001"},
      %{"name" => "民主街道", "code" => "220502002"},
      %{"name" => "老站街道", "code" => "220502003"},
      %{"name" => "团结街道", "code" => "220502004"},
      %{"name" => "新站街道", "code" => "220502005"},
      %{"name" => "光明街道", "code" => "220502006"},
      %{"name" => "龙泉街道", "code" => "220502007"},
      %{"name" => "陆港街道", "code" => "220502008"},
      %{"name" => "滨江街道", "code" => "220502009"},
      %{"name" => "金厂镇", "code" => "220502100"},
      %{"name" => "通化经济开发区特殊乡镇", "code" => "220502120"},
      %{"name" => "环通乡", "code" => "220502200"},
      %{"name" => "江东乡", "code" => "220502201"}
    ]

  def next(input) when input == "二道江区" or input == "220503",
    do: [
      %{"name" => "桃园街道", "code" => "220503001"},
      %{"name" => "东通化街道", "code" => "220503002"},
      %{"name" => "鸭园镇", "code" => "220503100"},
      %{"name" => "铁厂镇", "code" => "220503101"},
      %{"name" => "五道江镇", "code" => "220503102"},
      %{"name" => "二道江乡", "code" => "220503200"}
    ]

  def next(input) when input == "通化县" or input == "220521",
    do: [
      %{"name" => "茂山街道", "code" => "220521001"},
      %{"name" => "东安街道", "code" => "220521002"},
      %{"name" => "快大茂镇", "code" => "220521100"},
      %{"name" => "二密镇", "code" => "220521101"},
      %{"name" => "果松镇", "code" => "220521102"},
      %{"name" => "石湖镇", "code" => "220521103"},
      %{"name" => "大安镇", "code" => "220521104"},
      %{"name" => "光华镇", "code" => "220521105"},
      %{"name" => "兴林镇", "code" => "220521106"},
      %{"name" => "英额布镇", "code" => "220521107"},
      %{"name" => "三棵榆树镇", "code" => "220521108"},
      %{"name" => "西江镇", "code" => "220521109"},
      %{"name" => "通化聚鑫经济开发区特殊乡镇", "code" => "220521120"},
      %{"name" => "富江乡", "code" => "220521200"},
      %{"name" => "四棚乡", "code" => "220521201"},
      %{"name" => "东来乡", "code" => "220521202"},
      %{"name" => "大泉源满族朝鲜族乡", "code" => "220521203"},
      %{"name" => "金斗朝鲜族满族乡", "code" => "220521204"},
      %{"name" => "东宝新村", "code" => "220521401"}
    ]

  def next(input) when input == "辉南县" or input == "220523",
    do: [
      %{"name" => "东凤街道", "code" => "220523001"},
      %{"name" => "朝辉街道", "code" => "220523002"},
      %{"name" => "西凤街道", "code" => "220523003"},
      %{"name" => "朝阳镇", "code" => "220523100"},
      %{"name" => "辉南镇", "code" => "220523101"},
      %{"name" => "样子哨镇", "code" => "220523102"},
      %{"name" => "杉松岗镇", "code" => "220523103"},
      %{"name" => "石道河镇", "code" => "220523104"},
      %{"name" => "辉发城镇", "code" => "220523105"},
      %{"name" => "抚民镇", "code" => "220523106"},
      %{"name" => "金川镇", "code" => "220523107"},
      %{"name" => "团林镇", "code" => "220523108"},
      %{"name" => "庆阳镇", "code" => "220523109"},
      %{"name" => "楼街朝鲜族乡", "code" => "220523200"}
    ]

  def next(input) when input == "柳河县" or input == "220524",
    do: [
      %{"name" => "采胜街道", "code" => "220524001"},
      %{"name" => "中岗街道", "code" => "220524002"},
      %{"name" => "导航街道", "code" => "220524003"},
      %{"name" => "柳河镇", "code" => "220524100"},
      %{"name" => "三源浦朝鲜族镇", "code" => "220524101"},
      %{"name" => "五道沟镇", "code" => "220524102"},
      %{"name" => "驼腰岭镇", "code" => "220524103"},
      %{"name" => "孤山子镇", "code" => "220524104"},
      %{"name" => "圣水镇", "code" => "220524105"},
      %{"name" => "罗通山镇", "code" => "220524106"},
      %{"name" => "安口镇", "code" => "220524107"},
      %{"name" => "向阳镇", "code" => "220524108"},
      %{"name" => "红石镇", "code" => "220524109"},
      %{"name" => "凉水河子镇", "code" => "220524110"},
      %{"name" => "亨通镇", "code" => "220524111"},
      %{"name" => "柳南乡", "code" => "220524200"},
      %{"name" => "时家店乡", "code" => "220524201"},
      %{"name" => "姜家店朝鲜族乡", "code" => "220524202"}
    ]

  def next(input) when input == "梅河口市" or input == "220581",
    do: [
      %{"name" => "新华街道", "code" => "220581001"},
      %{"name" => "光明街道", "code" => "220581002"},
      %{"name" => "和平街道", "code" => "220581070"},
      %{"name" => "解放街道", "code" => "220581071"},
      %{"name" => "福民街道", "code" => "220581072"},
      %{"name" => "山城镇", "code" => "220581100"},
      %{"name" => "红梅镇", "code" => "220581101"},
      %{"name" => "海龙镇", "code" => "220581102"},
      %{"name" => "新合镇", "code" => "220581103"},
      %{"name" => "曙光镇", "code" => "220581104"},
      %{"name" => "中和镇", "code" => "220581105"},
      %{"name" => "黑山头镇", "code" => "220581106"},
      %{"name" => "水道镇", "code" => "220581107"},
      %{"name" => "进化镇", "code" => "220581108"},
      %{"name" => "一座营镇", "code" => "220581109"},
      %{"name" => "康大营镇", "code" => "220581110"},
      %{"name" => "牛心顶镇", "code" => "220581111"},
      %{"name" => "杏岭镇", "code" => "220581112"},
      %{"name" => "湾龙镇", "code" => "220581113"},
      %{"name" => "兴华镇", "code" => "220581114"},
      %{"name" => "双兴镇", "code" => "220581115"},
      %{"name" => "李炉乡", "code" => "220581201"},
      %{"name" => "小杨满族朝鲜族乡", "code" => "220581205"},
      %{"name" => "吉乐乡", "code" => "220581206"}
    ]

  def next(input) when input == "集安市" or input == "220582",
    do: [
      %{"name" => "团结街道", "code" => "220582001"},
      %{"name" => "黎明街道", "code" => "220582002"},
      %{"name" => "通胜街道", "code" => "220582003"},
      %{"name" => "城东街道", "code" => "220582004"},
      %{"name" => "青石镇", "code" => "220582100"},
      %{"name" => "榆林镇", "code" => "220582101"},
      %{"name" => "花甸镇", "code" => "220582102"},
      %{"name" => "头道镇", "code" => "220582103"},
      %{"name" => "清河镇", "code" => "220582104"},
      %{"name" => "台上镇", "code" => "220582105"},
      %{"name" => "财源镇", "code" => "220582106"},
      %{"name" => "大路镇", "code" => "220582107"},
      %{"name" => "太王镇", "code" => "220582108"},
      %{"name" => "麻线乡", "code" => "220582200"},
      %{"name" => "凉水朝鲜族乡", "code" => "220582201"}
    ]

  def next(input) when input == "龙山区" or input == "220402",
    do: [
      %{"name" => "东吉街道", "code" => "220402001"},
      %{"name" => "南康街道", "code" => "220402002"},
      %{"name" => "北寿街道", "code" => "220402003"},
      %{"name" => "西宁街道", "code" => "220402004"},
      %{"name" => "站前街道", "code" => "220402005"},
      %{"name" => "向阳街道", "code" => "220402006"},
      %{"name" => "新兴街道", "code" => "220402007"},
      %{"name" => "福镇街道", "code" => "220402008"},
      %{"name" => "辽源高新技术产业开发区特殊街道", "code" => "220402070"},
      %{"name" => "寿山镇", "code" => "220402100"},
      %{"name" => "工农乡", "code" => "220402200"}
    ]

  def next(input) when input == "西安区" or input == "220403",
    do: [
      %{"name" => "太安街道", "code" => "220403001"},
      %{"name" => "仙城街道", "code" => "220403002"},
      %{"name" => "东山街道", "code" => "220403003"},
      %{"name" => "先锋街道", "code" => "220403004"},
      %{"name" => "富国街道", "code" => "220403005"},
      %{"name" => "安家街道", "code" => "220403006"},
      %{"name" => "灯塔镇", "code" => "220403100"}
    ]

  def next(input) when input == "东丰县" or input == "220421",
    do: [
      %{"name" => "吉鹿街道", "code" => "220421001"},
      %{"name" => "祥鹿街道", "code" => "220421002"},
      %{"name" => "福鹿街道", "code" => "220421003"},
      %{"name" => "东丰镇", "code" => "220421100"},
      %{"name" => "大阳镇", "code" => "220421101"},
      %{"name" => "横道河镇", "code" => "220421102"},
      %{"name" => "那丹伯镇", "code" => "220421103"},
      %{"name" => "猴石镇", "code" => "220421104"},
      %{"name" => "杨木林镇", "code" => "220421105"},
      %{"name" => "小四平镇", "code" => "220421106"},
      %{"name" => "黄河镇", "code" => "220421107"},
      %{"name" => "拉拉河镇", "code" => "220421108"},
      %{"name" => "沙河镇", "code" => "220421109"},
      %{"name" => "南屯基镇", "code" => "220421110"},
      %{"name" => "大兴镇", "code" => "220421111"},
      %{"name" => "三合满族朝鲜族乡", "code" => "220421200"},
      %{"name" => "二龙山乡", "code" => "220421201"}
    ]

  def next(input) when input == "东辽县" or input == "220422",
    do: [
      %{"name" => "白泉镇", "code" => "220422100"},
      %{"name" => "渭津镇", "code" => "220422101"},
      %{"name" => "安石镇", "code" => "220422102"},
      %{"name" => "辽河源镇", "code" => "220422103"},
      %{"name" => "泉太镇", "code" => "220422104"},
      %{"name" => "建安镇", "code" => "220422105"},
      %{"name" => "安恕镇", "code" => "220422106"},
      %{"name" => "平岗镇", "code" => "220422107"},
      %{"name" => "云顶镇", "code" => "220422108"},
      %{"name" => "凌云乡", "code" => "220422200"},
      %{"name" => "甲山乡", "code" => "220422201"},
      %{"name" => "足民乡", "code" => "220422202"},
      %{"name" => "金州乡", "code" => "220422203"}
    ]

  def next(input) when input == "铁西区" or input == "220302",
    do: [
      %{"name" => "仁兴街道", "code" => "220302001"},
      %{"name" => "英雄街道", "code" => "220302002"},
      %{"name" => "站前街道", "code" => "220302003"},
      %{"name" => "北沟街道", "code" => "220302004"},
      %{"name" => "地直街道", "code" => "220302005"},
      %{"name" => "平西乡", "code" => "220302200"},
      %{"name" => "红嘴高新技术开发区", "code" => "220302400"}
    ]

  def next(input) when input == "铁东区" or input == "220303",
    do: [
      %{"name" => "四平市铁东区平东街道", "code" => "220303001"},
      %{"name" => "四平市铁东区北市场街道", "code" => "220303002"},
      %{"name" => "四平市铁东区七马路街道", "code" => "220303003"},
      %{"name" => "四平市铁东区四马路街道", "code" => "220303004"},
      %{"name" => "四平市铁东区解放街道", "code" => "220303005"},
      %{"name" => "四平市铁东区北门街道", "code" => "220303006"},
      %{"name" => "四平市铁东区黄土坑街道", "code" => "220303007"},
      %{"name" => "四平市铁东区平南街道", "code" => "220303008"},
      %{"name" => "四平市铁东区山门镇", "code" => "220303100"},
      %{"name" => "四平市铁东区石岭镇", "code" => "220303101"},
      %{"name" => "四平市铁东区叶赫满族镇", "code" => "220303102"},
      %{"name" => "四平市铁东区城东乡", "code" => "220303200"}
    ]

  def next(input) when input == "梨树县" or input == "220322",
    do: [
      %{"name" => "富强街道", "code" => "220322001"},
      %{"name" => "康平街道", "code" => "220322002"},
      %{"name" => "霍家店街道", "code" => "220322003"},
      %{"name" => "梨树镇", "code" => "220322100"},
      %{"name" => "郭家店镇", "code" => "220322101"},
      %{"name" => "榆树台镇", "code" => "220322102"},
      %{"name" => "孤家子镇", "code" => "220322103"},
      %{"name" => "小城子镇", "code" => "220322104"},
      %{"name" => "喇嘛甸镇", "code" => "220322105"},
      %{"name" => "蔡家镇", "code" => "220322106"},
      %{"name" => "刘家馆子镇", "code" => "220322107"},
      %{"name" => "十家堡镇", "code" => "220322108"},
      %{"name" => "孟家岭镇", "code" => "220322109"},
      %{"name" => "万发镇", "code" => "220322110"},
      %{"name" => "东河镇", "code" => "220322111"},
      %{"name" => "沈洋镇", "code" => "220322112"},
      %{"name" => "林海镇", "code" => "220322113"},
      %{"name" => "小宽镇", "code" => "220322114"},
      %{"name" => "白山乡", "code" => "220322200"},
      %{"name" => "泉眼岭乡", "code" => "220322201"},
      %{"name" => "胜利乡", "code" => "220322202"},
      %{"name" => "四棵树乡", "code" => "220322203"},
      %{"name" => "双河乡", "code" => "220322204"},
      %{"name" => "金山乡", "code" => "220322205"}
    ]

  def next(input) when input == "伊通满族自治县" or input == "220323",
    do: [
      %{"name" => "永盛街道", "code" => "220323001"},
      %{"name" => "永宁街道", "code" => "220323002"},
      %{"name" => "伊通镇", "code" => "220323100"},
      %{"name" => "二道镇", "code" => "220323101"},
      %{"name" => "伊丹镇", "code" => "220323102"},
      %{"name" => "马鞍山镇", "code" => "220323103"},
      %{"name" => "景台镇", "code" => "220323104"},
      %{"name" => "靠山镇", "code" => "220323105"},
      %{"name" => "大孤山镇", "code" => "220323106"},
      %{"name" => "小孤山镇", "code" => "220323107"},
      %{"name" => "营城子镇", "code" => "220323108"},
      %{"name" => "西苇镇", "code" => "220323109"},
      %{"name" => "河源镇", "code" => "220323110"},
      %{"name" => "黄岭子镇", "code" => "220323111"},
      %{"name" => "新兴乡", "code" => "220323200"},
      %{"name" => "莫里青乡", "code" => "220323201"},
      %{"name" => "三道乡", "code" => "220323202"}
    ]

  def next(input) when input == "双辽市" or input == "220382",
    do: [
      %{"name" => "郑家屯街道", "code" => "220382001"},
      %{"name" => "辽西街道", "code" => "220382002"},
      %{"name" => "辽南街道", "code" => "220382003"},
      %{"name" => "辽北街道", "code" => "220382004"},
      %{"name" => "辽东街道", "code" => "220382005"},
      %{"name" => "红旗街道", "code" => "220382006"},
      %{"name" => "茂林镇", "code" => "220382100"},
      %{"name" => "双山镇", "code" => "220382101"},
      %{"name" => "卧虎镇", "code" => "220382102"},
      %{"name" => "服先镇", "code" => "220382103"},
      %{"name" => "王奔镇", "code" => "220382104"},
      %{"name" => "玻璃山镇", "code" => "220382105"},
      %{"name" => "兴隆镇", "code" => "220382106"},
      %{"name" => "东明镇", "code" => "220382107"},
      %{"name" => "那木乡", "code" => "220382200"},
      %{"name" => "柳条乡", "code" => "220382201"},
      %{"name" => "新立乡", "code" => "220382202"},
      %{"name" => "永加乡", "code" => "220382203"},
      %{"name" => "吉林双辽经济开发区", "code" => "220382402"}
    ]

  def next(input) when input == "昌邑区" or input == "220202",
    do: [
      %{"name" => "兴华街道", "code" => "220202001"},
      %{"name" => "文庙街道", "code" => "220202002"},
      %{"name" => "东局子街道", "code" => "220202003"},
      %{"name" => "新地号街道", "code" => "220202004"},
      %{"name" => "延安街道", "code" => "220202005"},
      %{"name" => "站前街道", "code" => "220202006"},
      %{"name" => "民主街道", "code" => "220202007"},
      %{"name" => "莲花街道", "code" => "220202008"},
      %{"name" => "通江街道", "code" => "220202009"},
      %{"name" => "哈达湾街道", "code" => "220202010"},
      %{"name" => "新建街道", "code" => "220202011"},
      %{"name" => "延江街道", "code" => "220202012"},
      %{"name" => "孤店子镇", "code" => "220202100"},
      %{"name" => "桦皮厂镇", "code" => "220202101"},
      %{"name" => "左家镇", "code" => "220202102"},
      %{"name" => "两家子满族乡", "code" => "220202200"},
      %{"name" => "土城子满族朝鲜族乡", "code" => "220202201"},
      %{"name" => "幸福开发区", "code" => "220202401"},
      %{"name" => "哈达湾经济开发区", "code" => "220202402"}
    ]

  def next(input) when input == "龙潭区" or input == "220203",
    do: [
      %{"name" => "龙华街道", "code" => "220203001"},
      %{"name" => "湘潭街道", "code" => "220203002"},
      %{"name" => "铁东街道", "code" => "220203003"},
      %{"name" => "泡子沿街道", "code" => "220203004"},
      %{"name" => "龙潭街道", "code" => "220203005"},
      %{"name" => "新吉林街道", "code" => "220203006"},
      %{"name" => "山前街道", "code" => "220203007"},
      %{"name" => "新安街道", "code" => "220203008"},
      %{"name" => "遵义街道", "code" => "220203009"},
      %{"name" => "榆树街道", "code" => "220203010"},
      %{"name" => "东城街道", "code" => "220203012"},
      %{"name" => "承德街道", "code" => "220203013"},
      %{"name" => "靠山街道", "code" => "220203014"},
      %{"name" => "乌拉街镇", "code" => "220203100"},
      %{"name" => "缸窑镇", "code" => "220203101"},
      %{"name" => "江密峰镇", "code" => "220203102"},
      %{"name" => "大口钦镇", "code" => "220203103"},
      %{"name" => "金珠镇", "code" => "220203104"},
      %{"name" => "江北乡", "code" => "220203200"},
      %{"name" => "龙潭经济开发区", "code" => "220203400"},
      %{"name" => "金珠工业区", "code" => "220203401"}
    ]

  def next(input) when input == "船营区" or input == "220204",
    do: [
      %{"name" => "德胜街道", "code" => "220204001"},
      %{"name" => "南京街道", "code" => "220204002"},
      %{"name" => "大东街道", "code" => "220204003"},
      %{"name" => "青岛街道", "code" => "220204004"},
      %{"name" => "向阳街道", "code" => "220204005"},
      %{"name" => "北极街道", "code" => "220204006"},
      %{"name" => "致和街道", "code" => "220204007"},
      %{"name" => "长春路街道", "code" => "220204008"},
      %{"name" => "临江街道", "code" => "220204009"},
      %{"name" => "北山街道", "code" => "220204010"},
      %{"name" => "黄旗街道", "code" => "220204011"},
      %{"name" => "大绥河镇", "code" => "220204100"},
      %{"name" => "搜登站镇", "code" => "220204101"},
      %{"name" => "越北镇", "code" => "220204102"},
      %{"name" => "欢喜乡", "code" => "220204200"},
      %{"name" => "吉林船营经济开发区", "code" => "220204400"}
    ]

  def next(input) when input == "丰满区" or input == "220211",
    do: [
      %{"name" => "泰山街道", "code" => "220211001"},
      %{"name" => "江南街道", "code" => "220211002"},
      %{"name" => "石井街道", "code" => "220211003"},
      %{"name" => "沿丰街道", "code" => "220211004"},
      %{"name" => "丰满街道", "code" => "220211005"},
      %{"name" => "建华街道", "code" => "220211008"},
      %{"name" => "红旗街道", "code" => "220211071"},
      %{"name" => "旺起镇", "code" => "220211100"},
      %{"name" => "江南乡", "code" => "220211200"},
      %{"name" => "前二道乡", "code" => "220211201"},
      %{"name" => "小白山乡", "code" => "220211270"}
    ]

  def next(input) when input == "永吉县" or input == "220221",
    do: [
      %{"name" => "口前镇", "code" => "220221100"},
      %{"name" => "双河镇", "code" => "220221101"},
      %{"name" => "西阳镇", "code" => "220221102"},
      %{"name" => "北大湖镇", "code" => "220221103"},
      %{"name" => "一拉溪镇", "code" => "220221104"},
      %{"name" => "万昌镇", "code" => "220221171"},
      %{"name" => "永吉经济开发区特殊乡镇", "code" => "220221172"},
      %{"name" => "金家乡", "code" => "220221200"},
      %{"name" => "黄榆乡", "code" => "220221201"}
    ]

  def next(input) when input == "吉林经济开发区" or input == "220271",
    do: [%{"name" => "九站街道", "code" => "220271001"}, %{"name" => "双吉街道", "code" => "220271013"}]

  def next(input) when input == "吉林高新技术产业开发区" or input == "220272",
    do: [%{"name" => "高新街道", "code" => "220272001"}, %{"name" => "新北街道", "code" => "220272002"}]

  def next(input) when input == "吉林中国新加坡食品区" or input == "220273",
    do: [%{"name" => "岔路河镇", "code" => "220273100"}]

  def next(input) when input == "蛟河市" or input == "220281",
    do: [
      %{"name" => "民主街道", "code" => "220281001"},
      %{"name" => "长安街道", "code" => "220281002"},
      %{"name" => "河南街道", "code" => "220281003"},
      %{"name" => "奶子山街道", "code" => "220281004"},
      %{"name" => "拉法街道", "code" => "220281005"},
      %{"name" => "河北街道", "code" => "220281006"},
      %{"name" => "新农街道", "code" => "220281007"},
      %{"name" => "新站镇", "code" => "220281100"},
      %{"name" => "天岗镇", "code" => "220281101"},
      %{"name" => "白石山镇", "code" => "220281102"},
      %{"name" => "漂河镇", "code" => "220281103"},
      %{"name" => "黄松甸镇", "code" => "220281104"},
      %{"name" => "天北镇", "code" => "220281105"},
      %{"name" => "松江镇", "code" => "220281106"},
      %{"name" => "庆岭镇", "code" => "220281107"},
      %{"name" => "乌林朝鲜族乡", "code" => "220281200"},
      %{"name" => "前进乡", "code" => "220281201"}
    ]

  def next(input) when input == "桦甸市" or input == "220282",
    do: [
      %{"name" => "明桦街道", "code" => "220282001"},
      %{"name" => "永吉街道", "code" => "220282002"},
      %{"name" => "胜利街道", "code" => "220282003"},
      %{"name" => "新华街道", "code" => "220282004"},
      %{"name" => "启新街道", "code" => "220282005"},
      %{"name" => "夹皮沟镇", "code" => "220282100"},
      %{"name" => "二道甸子镇", "code" => "220282101"},
      %{"name" => "红石砬子镇", "code" => "220282102"},
      %{"name" => "八道河子镇", "code" => "220282103"},
      %{"name" => "常山镇", "code" => "220282104"},
      %{"name" => "金沙镇", "code" => "220282105"},
      %{"name" => "桦郊乡", "code" => "220282200"},
      %{"name" => "横道河子乡", "code" => "220282201"},
      %{"name" => "公吉乡", "code" => "220282204"}
    ]

  def next(input) when input == "舒兰市" or input == "220283",
    do: [
      %{"name" => "北城街道", "code" => "220283001"},
      %{"name" => "南城街道", "code" => "220283002"},
      %{"name" => "环城街道", "code" => "220283003"},
      %{"name" => "吉舒街道", "code" => "220283004"},
      %{"name" => "滨河街道", "code" => "220283005"},
      %{"name" => "法特镇", "code" => "220283100"},
      %{"name" => "白旗镇", "code" => "220283101"},
      %{"name" => "溪河镇", "code" => "220283102"},
      %{"name" => "朝阳镇", "code" => "220283103"},
      %{"name" => "小城镇", "code" => "220283104"},
      %{"name" => "上营镇", "code" => "220283105"},
      %{"name" => "水曲柳镇", "code" => "220283106"},
      %{"name" => "平安镇", "code" => "220283107"},
      %{"name" => "金马镇", "code" => "220283108"},
      %{"name" => "开原镇", "code" => "220283109"},
      %{"name" => "莲花乡", "code" => "220283200"},
      %{"name" => "亮甲山乡", "code" => "220283201"},
      %{"name" => "新安乡", "code" => "220283202"},
      %{"name" => "七里乡", "code" => "220283203"},
      %{"name" => "天德乡", "code" => "220283204"}
    ]

  def next(input) when input == "磐石市" or input == "220284",
    do: [
      %{"name" => "福安街道", "code" => "220284001"},
      %{"name" => "东宁街道", "code" => "220284002"},
      %{"name" => "河南街道", "code" => "220284003"},
      %{"name" => "磐石经济开发区特殊街道", "code" => "220284070"},
      %{"name" => "烟筒山镇", "code" => "220284100"},
      %{"name" => "红旗岭镇", "code" => "220284101"},
      %{"name" => "明城镇", "code" => "220284102"},
      %{"name" => "石嘴镇", "code" => "220284103"},
      %{"name" => "驿马镇", "code" => "220284104"},
      %{"name" => "牛心镇", "code" => "220284105"},
      %{"name" => "呼兰镇", "code" => "220284106"},
      %{"name" => "吉昌镇", "code" => "220284107"},
      %{"name" => "松山镇", "code" => "220284108"},
      %{"name" => "黑石镇", "code" => "220284109"},
      %{"name" => "朝阳山镇", "code" => "220284110"},
      %{"name" => "富太镇", "code" => "220284111"},
      %{"name" => "取柴河镇", "code" => "220284112"},
      %{"name" => "宝山乡", "code" => "220284200"}
    ]

  def next(input) when input == "南关区" or input == "220102",
    do: [
      %{"name" => "南岭街道", "code" => "220102001"},
      %{"name" => "自强街道", "code" => "220102002"},
      %{"name" => "民康街道", "code" => "220102003"},
      %{"name" => "新春街道", "code" => "220102004"},
      %{"name" => "长通街道", "code" => "220102005"},
      %{"name" => "全安街道", "code" => "220102006"},
      %{"name" => "曙光街道", "code" => "220102007"},
      %{"name" => "永吉街道", "code" => "220102008"},
      %{"name" => "桃源街道", "code" => "220102009"},
      %{"name" => "鸿城街道", "code" => "220102010"},
      %{"name" => "明珠街道", "code" => "220102011"},
      %{"name" => "富裕街道", "code" => "220102012"},
      %{"name" => "盛世街道", "code" => "220102013"},
      %{"name" => "幸福乡", "code" => "220102200"}
    ]

  def next(input) when input == "宽城区" or input == "220103",
    do: [
      %{"name" => "站前街道", "code" => "220103002"},
      %{"name" => "群英街道", "code" => "220103005"},
      %{"name" => "兴业街道", "code" => "220103006"},
      %{"name" => "凯旋街道", "code" => "220103007"},
      %{"name" => "团山街道", "code" => "220103008"},
      %{"name" => "柳影街道", "code" => "220103009"},
      %{"name" => "欣园街道", "code" => "220103010"},
      %{"name" => "长德街道", "code" => "220103011"},
      %{"name" => "新广街道", "code" => "220103013"},
      %{"name" => "新隆街道", "code" => "220103014"},
      %{"name" => "长新街道", "code" => "220103015"},
      %{"name" => "兰家镇", "code" => "220103100"},
      %{"name" => "米沙子镇", "code" => "220103101"},
      %{"name" => "万宝镇", "code" => "220103102"},
      %{"name" => "合隆镇", "code" => "220103171"}
    ]

  def next(input) when input == "朝阳区" or input == "220104",
    do: [
      %{"name" => "前进街道", "code" => "220104001"},
      %{"name" => "桂林街道", "code" => "220104002"},
      %{"name" => "南湖街道", "code" => "220104003"},
      %{"name" => "永昌街道", "code" => "220104004"},
      %{"name" => "重庆街道", "code" => "220104005"},
      %{"name" => "清和街道", "code" => "220104006"},
      %{"name" => "红旗街道", "code" => "220104007"},
      %{"name" => "湖西街道", "code" => "220104008"},
      %{"name" => "富锋街道", "code" => "220104009"},
      %{"name" => "乐山镇", "code" => "220104100"},
      %{"name" => "永春镇", "code" => "220104101"}
    ]

  def next(input) when input == "二道区" or input == "220105",
    do: [
      %{"name" => "东盛街道", "code" => "220105001"},
      %{"name" => "吉林街道", "code" => "220105002"},
      %{"name" => "荣光街道", "code" => "220105003"},
      %{"name" => "东站街道", "code" => "220105004"},
      %{"name" => "远达街道", "code" => "220105005"},
      %{"name" => "八里堡街道", "code" => "220105006"},
      %{"name" => "长青街道", "code" => "220105007"},
      %{"name" => "东惠街道", "code" => "220105010"},
      %{"name" => "英俊镇", "code" => "220105100"},
      %{"name" => "劝农山镇", "code" => "220105173"},
      %{"name" => "泉眼镇", "code" => "220105174"},
      %{"name" => "四家乡", "code" => "220105270"}
    ]

  def next(input) when input == "绿园区" or input == "220106",
    do: [
      %{"name" => "正阳街道", "code" => "220106001"},
      %{"name" => "春城街道", "code" => "220106003"},
      %{"name" => "青年路街道", "code" => "220106005"},
      %{"name" => "普阳街道", "code" => "220106006"},
      %{"name" => "铁西街道", "code" => "220106007"},
      %{"name" => "林园街道", "code" => "220106010"},
      %{"name" => "同心街道", "code" => "220106011"},
      %{"name" => "迎宾街道", "code" => "220106012"},
      %{"name" => "自立街道", "code" => "220106013"},
      %{"name" => "合心镇", "code" => "220106100"},
      %{"name" => "西新镇", "code" => "220106101"},
      %{"name" => "城西镇", "code" => "220106102"},
      %{"name" => "绿园经济开发区", "code" => "220106400"},
      %{"name" => "皓月产业园区", "code" => "220106401"}
    ]

  def next(input) when input == "双阳区" or input == "220112",
    do: [
      %{"name" => "云山街道", "code" => "220112001"},
      %{"name" => "平湖街道", "code" => "220112002"},
      %{"name" => "奢岭街道", "code" => "220112003"},
      %{"name" => "山河街道", "code" => "220112004"},
      %{"name" => "鹿乡镇", "code" => "220112102"},
      %{"name" => "齐家镇", "code" => "220112104"},
      %{"name" => "太平镇", "code" => "220112105"},
      %{"name" => "双营子回族乡", "code" => "220112203"}
    ]

  def next(input) when input == "九台区" or input == "220113",
    do: [
      %{"name" => "九台街道", "code" => "220113001"},
      %{"name" => "营城街道", "code" => "220113002"},
      %{"name" => "九郊街道", "code" => "220113003"},
      %{"name" => "西营城街道", "code" => "220113004"},
      %{"name" => "土们岭街道", "code" => "220113005"},
      %{"name" => "苇子沟街道", "code" => "220113006"},
      %{"name" => "兴隆街道", "code" => "220113007"},
      %{"name" => "纪家街道", "code" => "220113008"},
      %{"name" => "波泥河街道", "code" => "220113009"},
      %{"name" => "卡伦湖街道", "code" => "220113010"},
      %{"name" => "东湖街道", "code" => "220113011"},
      %{"name" => "龙嘉街道", "code" => "220113012"},
      %{"name" => "兴港街道", "code" => "220113013"},
      %{"name" => "沐石河街道", "code" => "220113014"},
      %{"name" => "城子街街道", "code" => "220113015"},
      %{"name" => "南山街道", "code" => "220113016"},
      %{"name" => "其塔木镇", "code" => "220113102"},
      %{"name" => "上河湾镇", "code" => "220113103"},
      %{"name" => "胡家回族乡", "code" => "220113200"},
      %{"name" => "莽卡满族乡", "code" => "220113201"}
    ]

  def next(input) when input == "农安县" or input == "220122",
    do: [
      %{"name" => "兴农街道", "code" => "220122001"},
      %{"name" => "宝塔街道", "code" => "220122002"},
      %{"name" => "和谐街道", "code" => "220122003"},
      %{"name" => "黄龙街道", "code" => "220122004"},
      %{"name" => "农安镇", "code" => "220122100"},
      %{"name" => "伏龙泉镇", "code" => "220122101"},
      %{"name" => "哈拉海镇", "code" => "220122102"},
      %{"name" => "靠山镇", "code" => "220122103"},
      %{"name" => "开安镇", "code" => "220122104"},
      %{"name" => "烧锅镇", "code" => "220122105"},
      %{"name" => "高家店镇", "code" => "220122106"},
      %{"name" => "华家镇", "code" => "220122107"},
      %{"name" => "三盛玉镇", "code" => "220122108"},
      %{"name" => "巴吉垒镇", "code" => "220122109"},
      %{"name" => "三岗镇", "code" => "220122110"},
      %{"name" => "前岗乡", "code" => "220122200"},
      %{"name" => "龙王乡", "code" => "220122201"},
      %{"name" => "万顺乡", "code" => "220122203"},
      %{"name" => "杨树林乡", "code" => "220122204"},
      %{"name" => "永安乡", "code" => "220122205"},
      %{"name" => "青山口乡", "code" => "220122206"},
      %{"name" => "黄鱼圈乡", "code" => "220122207"},
      %{"name" => "新农乡", "code" => "220122208"},
      %{"name" => "万金塔乡", "code" => "220122209"},
      %{"name" => "小城子乡", "code" => "220122210"},
      %{"name" => "洼中高农场", "code" => "220122400"}
    ]

  def next(input) when input == "长春经济技术开发区" or input == "220171",
    do: [
      %{"name" => "临河街道", "code" => "220171001"},
      %{"name" => "东方广场街道", "code" => "220171002"},
      %{"name" => "会展街道", "code" => "220171003"},
      %{"name" => "世纪街道", "code" => "220171004"},
      %{"name" => "兴隆山镇", "code" => "220171100"}
    ]

  def next(input) when input == "长春净月高新技术产业开发区" or input == "220172",
    do: [
      %{"name" => "永兴街道", "code" => "220172001"},
      %{"name" => "净月街道", "code" => "220172002"},
      %{"name" => "福祉街道", "code" => "220172003"},
      %{"name" => "德正街道", "code" => "220172004"},
      %{"name" => "彩织街道", "code" => "220172005"},
      %{"name" => "德容街道", "code" => "220172006"},
      %{"name" => "博硕街道", "code" => "220172007"},
      %{"name" => "德馨街道", "code" => "220172008"},
      %{"name" => "永顺街道", "code" => "220172009"},
      %{"name" => "新立城镇", "code" => "220172100"},
      %{"name" => "新湖镇", "code" => "220172101"},
      %{"name" => "玉潭镇", "code" => "220172102"}
    ]

  def next(input) when input == "长春高新技术产业开发区" or input == "220173",
    do: [
      %{"name" => "硅谷街道", "code" => "220173001"},
      %{"name" => "北湖街道", "code" => "220173002"},
      %{"name" => "超越街道", "code" => "220173003"},
      %{"name" => "飞跃街道", "code" => "220173004"},
      %{"name" => "双德街道", "code" => "220173005"},
      %{"name" => "奋进乡", "code" => "220173200"}
    ]

  def next(input) when input == "长春汽车经济技术开发区" or input == "220174",
    do: [
      %{"name" => "锦程街道", "code" => "220174001"},
      %{"name" => "东风街道", "code" => "220174002"},
      %{"name" => "富民街道", "code" => "220174003"},
      %{"name" => "前程街道", "code" => "220174004"},
      %{"name" => "广兴街道", "code" => "220174005"},
      %{"name" => "锦绣街道", "code" => "220174006"}
    ]

  def next(input) when input == "榆树市" or input == "220182",
    do: [
      %{"name" => "华昌街道", "code" => "220182001"},
      %{"name" => "正阳街道", "code" => "220182002"},
      %{"name" => "培英街道", "code" => "220182003"},
      %{"name" => "城郊街道", "code" => "220182004"},
      %{"name" => "五棵树镇", "code" => "220182100"},
      %{"name" => "弓棚镇", "code" => "220182101"},
      %{"name" => "闵家镇", "code" => "220182102"},
      %{"name" => "大坡镇", "code" => "220182103"},
      %{"name" => "黑林镇", "code" => "220182104"},
      %{"name" => "土桥镇", "code" => "220182105"},
      %{"name" => "新立镇", "code" => "220182106"},
      %{"name" => "大岭镇", "code" => "220182107"},
      %{"name" => "于家镇", "code" => "220182108"},
      %{"name" => "泗河镇", "code" => "220182109"},
      %{"name" => "八号镇", "code" => "220182110"},
      %{"name" => "刘家镇", "code" => "220182111"},
      %{"name" => "秀水镇", "code" => "220182112"},
      %{"name" => "保寿镇", "code" => "220182113"},
      %{"name" => "新庄镇", "code" => "220182114"},
      %{"name" => "育民乡", "code" => "220182200"},
      %{"name" => "红星乡", "code" => "220182201"},
      %{"name" => "太安乡", "code" => "220182202"},
      %{"name" => "先峰乡", "code" => "220182203"},
      %{"name" => "青山乡", "code" => "220182204"},
      %{"name" => "延和朝鲜族乡", "code" => "220182205"},
      %{"name" => "恩育乡", "code" => "220182206"},
      %{"name" => "城发乡", "code" => "220182207"},
      %{"name" => "环城乡", "code" => "220182208"}
    ]

  def next(input) when input == "德惠市" or input == "220183",
    do: [
      %{"name" => "胜利街道", "code" => "220183001"},
      %{"name" => "建设街道", "code" => "220183002"},
      %{"name" => "惠发街道", "code" => "220183003"},
      %{"name" => "夏家店街道", "code" => "220183004"},
      %{"name" => "大青嘴镇", "code" => "220183100"},
      %{"name" => "郭家镇", "code" => "220183101"},
      %{"name" => "松花江镇", "code" => "220183102"},
      %{"name" => "达家沟镇", "code" => "220183103"},
      %{"name" => "大房身镇", "code" => "220183104"},
      %{"name" => "岔路口镇", "code" => "220183105"},
      %{"name" => "朱城子镇", "code" => "220183106"},
      %{"name" => "布海镇", "code" => "220183107"},
      %{"name" => "天台镇", "code" => "220183108"},
      %{"name" => "菜园子镇", "code" => "220183109"},
      %{"name" => "同太乡", "code" => "220183200"},
      %{"name" => "边岗乡", "code" => "220183201"},
      %{"name" => "五台乡", "code" => "220183202"},
      %{"name" => "朝阳乡", "code" => "220183203"}
    ]

  def next(input) when input == "公主岭市" or input == "220184",
    do: [
      %{"name" => "河南街道", "code" => "220184001"},
      %{"name" => "河北街道", "code" => "220184002"},
      %{"name" => "东三街道", "code" => "220184003"},
      %{"name" => "岭东街道", "code" => "220184004"},
      %{"name" => "铁北街道", "code" => "220184005"},
      %{"name" => "岭西街道", "code" => "220184006"},
      %{"name" => "刘房子街道", "code" => "220184007"},
      %{"name" => "南崴子街道", "code" => "220184008"},
      %{"name" => "环岭街道", "code" => "220184009"},
      %{"name" => "苇子沟街道", "code" => "220184010"},
      %{"name" => "二十家子镇", "code" => "220184100"},
      %{"name" => "黑林子镇", "code" => "220184101"},
      %{"name" => "陶家屯镇", "code" => "220184102"},
      %{"name" => "范家屯镇", "code" => "220184103"},
      %{"name" => "响水镇", "code" => "220184104"},
      %{"name" => "大岭镇", "code" => "220184105"},
      %{"name" => "怀德镇", "code" => "220184106"},
      %{"name" => "双城堡镇", "code" => "220184107"},
      %{"name" => "双龙镇", "code" => "220184108"},
      %{"name" => "杨大城子镇", "code" => "220184109"},
      %{"name" => "毛城子镇", "code" => "220184110"},
      %{"name" => "玻璃城子镇", "code" => "220184111"},
      %{"name" => "朝阳坡镇", "code" => "220184112"},
      %{"name" => "大榆树镇", "code" => "220184113"},
      %{"name" => "秦家屯镇", "code" => "220184114"},
      %{"name" => "八屋镇", "code" => "220184115"},
      %{"name" => "十屋镇", "code" => "220184116"},
      %{"name" => "桑树台镇", "code" => "220184117"},
      %{"name" => "龙山乡", "code" => "220184200"},
      %{"name" => "永发乡", "code" => "220184201"},
      %{"name" => "省原种繁殖场", "code" => "220184400"},
      %{"name" => "四平农科院", "code" => "220184401"},
      %{"name" => "公主岭市种猪场", "code" => "220184402"},
      %{"name" => "十屋种牛场", "code" => "220184404"},
      %{"name" => "创业农场", "code" => "220184405"},
      %{"name" => "范家屯经济开发区", "code" => "220184407"}
    ]

  def next(_), do: nil
end