defmodule ChinaAdminDivisions.Gen.Lv3x.M22 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "安图县" or input == "222426",
    do: [
      %{"name" => "长兴街道", "code" => "222426001000"},
      %{"name" => "瓮声街道", "code" => "222426002000"},
      %{"name" => "九龙街道", "code" => "222426003000"},
      %{"name" => "明月镇", "code" => "222426100000"},
      %{"name" => "松江镇", "code" => "222426101000"},
      %{"name" => "二道白河镇", "code" => "222426102000"},
      %{"name" => "两江镇", "code" => "222426103000"},
      %{"name" => "石门镇", "code" => "222426104000"},
      %{"name" => "万宝镇", "code" => "222426105000"},
      %{"name" => "亮兵镇", "code" => "222426106000"},
      %{"name" => "长白山保护开发区池北区特殊乡镇", "code" => "222426120000"},
      %{"name" => "新合乡", "code" => "222426200000"},
      %{"name" => "永庆乡", "code" => "222426201000"},
      %{"name" => "白河林业局", "code" => "222426400000"},
      %{"name" => "安图林业有限公司", "code" => "222426401000"},
      %{"name" => "安图县林业局", "code" => "222426402000"}
    ]

  def next(input) when input == "汪清县" or input == "222424",
    do: [
      %{"name" => "大川街道", "code" => "222424011000"},
      %{"name" => "新民街道", "code" => "222424012000"},
      %{"name" => "长荣街道", "code" => "222424013000"},
      %{"name" => "汪清镇", "code" => "222424100000"},
      %{"name" => "大兴沟镇", "code" => "222424101000"},
      %{"name" => "天桥岭镇", "code" => "222424102000"},
      %{"name" => "罗子沟镇", "code" => "222424103000"},
      %{"name" => "百草沟镇", "code" => "222424104000"},
      %{"name" => "春阳镇", "code" => "222424105000"},
      %{"name" => "复兴镇", "code" => "222424106000"},
      %{"name" => "东光镇", "code" => "222424107000"},
      %{"name" => "鸡冠乡", "code" => "222424200000"},
      %{"name" => "汪清林业局", "code" => "222424400000"},
      %{"name" => "天桥岭林业局", "code" => "222424401000"},
      %{"name" => "大兴沟林业局", "code" => "222424402000"}
    ]

  def next(input) when input == "和龙市" or input == "222406",
    do: [
      %{"name" => "民慧街道", "code" => "222406001000"},
      %{"name" => "光明街道", "code" => "222406002000"},
      %{"name" => "文化街道", "code" => "222406003000"},
      %{"name" => "八家子镇", "code" => "222406100000"},
      %{"name" => "福洞镇", "code" => "222406101000"},
      %{"name" => "头道镇", "code" => "222406102000"},
      %{"name" => "西城镇", "code" => "222406103000"},
      %{"name" => "南坪镇", "code" => "222406104000"},
      %{"name" => "东城镇", "code" => "222406105000"},
      %{"name" => "崇善镇", "code" => "222406106000"},
      %{"name" => "龙城镇", "code" => "222406107000"},
      %{"name" => "和龙林业局", "code" => "222406400000"},
      %{"name" => "八家子林业局", "code" => "222406401000"},
      %{"name" => "和龙市林业局", "code" => "222406402000"}
    ]

  def next(input) when input == "龙井市" or input == "222405",
    do: [
      %{"name" => "安民街道", "code" => "222405001000"},
      %{"name" => "龙门街道", "code" => "222405002000"},
      %{"name" => "梨园街道", "code" => "222405005000"},
      %{"name" => "开山屯镇", "code" => "222405100000"},
      %{"name" => "老头沟镇", "code" => "222405102000"},
      %{"name" => "三合镇", "code" => "222405103000"},
      %{"name" => "东盛涌镇", "code" => "222405104000"},
      %{"name" => "智新镇", "code" => "222405105000"},
      %{"name" => "德新乡", "code" => "222405200000"},
      %{"name" => "白金乡", "code" => "222405201000"},
      %{"name" => "龙井市林业局", "code" => "222405400000"},
      %{"name" => "龙井大苏果树农场", "code" => "222405401000"}
    ]

  def next(input) when input == "珲春市" or input == "222404",
    do: [
      %{"name" => "靖和街道", "code" => "222404001000"},
      %{"name" => "新安街道", "code" => "222404002000"},
      %{"name" => "河南街道", "code" => "222404003000"},
      %{"name" => "海东街道", "code" => "222404006000"},
      %{"name" => "近海街道", "code" => "222404060000"},
      %{"name" => "春化镇", "code" => "222404100000"},
      %{"name" => "敬信镇", "code" => "222404101000"},
      %{"name" => "板石镇", "code" => "222404102000"},
      %{"name" => "英安镇", "code" => "222404103000"},
      %{"name" => "马川子乡", "code" => "222404200000"},
      %{"name" => "杨泡满族乡", "code" => "222404201000"},
      %{"name" => "三家子满族乡", "code" => "222404202000"},
      %{"name" => "密江乡", "code" => "222404203000"},
      %{"name" => "哈达门乡", "code" => "222404204000"},
      %{"name" => "珲春林业局", "code" => "222404400000"}
    ]

  def next(input) when input == "敦化市" or input == "222403",
    do: [
      %{"name" => "渤海街道", "code" => "222403001000"},
      %{"name" => "胜利街道", "code" => "222403002000"},
      %{"name" => "民主街道", "code" => "222403003000"},
      %{"name" => "丹江街道", "code" => "222403004000"},
      %{"name" => "大石头镇", "code" => "222403100000"},
      %{"name" => "黄泥河镇", "code" => "222403101000"},
      %{"name" => "官地镇", "code" => "222403102000"},
      %{"name" => "沙河沿镇", "code" => "222403103000"},
      %{"name" => "秋梨沟镇", "code" => "222403104000"},
      %{"name" => "额穆镇", "code" => "222403105000"},
      %{"name" => "贤儒镇", "code" => "222403106000"},
      %{"name" => "大蒲柴河镇", "code" => "222403107000"},
      %{"name" => "雁鸣湖镇", "code" => "222403108000"},
      %{"name" => "江源镇", "code" => "222403109000"},
      %{"name" => "江南镇", "code" => "222403110000"},
      %{"name" => "大桥乡", "code" => "222403200000"},
      %{"name" => "黑石乡", "code" => "222403201000"},
      %{"name" => "青沟子乡", "code" => "222403202000"},
      %{"name" => "翰章乡", "code" => "222403203000"},
      %{"name" => "红石乡", "code" => "222403204000"},
      %{"name" => "长白山森工集团敦化林业有限公司", "code" => "222403400000"},
      %{"name" => "长白山森工集团黄泥河林业有限公司", "code" => "222403401000"},
      %{"name" => "长白山森工集团大石头林业有限公司", "code" => "222403402000"},
      %{"name" => "敦化市林业局", "code" => "222403403000"},
      %{"name" => "敖东鹿场", "code" => "222403404000"}
    ]

  def next(input) when input == "图们市" or input == "222402",
    do: [
      %{"name" => "向上街道", "code" => "222402001000"},
      %{"name" => "新华街道", "code" => "222402002000"},
      %{"name" => "月宫街道", "code" => "222402003000"},
      %{"name" => "月晴镇", "code" => "222402100000"},
      %{"name" => "石岘镇", "code" => "222402101000"},
      %{"name" => "长安镇", "code" => "222402102000"},
      %{"name" => "凉水镇", "code" => "222402103000"}
    ]

  def next(input) when input == "延吉市" or input == "222401",
    do: [
      %{"name" => "进学街道", "code" => "222401001000"},
      %{"name" => "北山街道", "code" => "222401002000"},
      %{"name" => "新兴街道", "code" => "222401003000"},
      %{"name" => "公园街道", "code" => "222401004000"},
      %{"name" => "河南街道", "code" => "222401005000"},
      %{"name" => "建工街道", "code" => "222401006000"},
      %{"name" => "小营镇", "code" => "222401100000"},
      %{"name" => "依兰镇", "code" => "222401101000"},
      %{"name" => "三道湾镇", "code" => "222401102000"},
      %{"name" => "朝阳川镇", "code" => "222401105000"},
      %{"name" => "延吉市林业局", "code" => "222401400000"},
      %{"name" => "东山农场", "code" => "222401401000"},
      %{"name" => "延边原种场", "code" => "222401402000"},
      %{"name" => "延边新兴工业集中区", "code" => "222401404000"}
    ]

  def next(input) when input == "大安市" or input == "220882",
    do: [
      %{"name" => "慧阳街道", "code" => "220882001000"},
      %{"name" => "临江街道", "code" => "220882002000"},
      %{"name" => "长虹街道", "code" => "220882003000"},
      %{"name" => "锦华街道", "code" => "220882004000"},
      %{"name" => "安北街道", "code" => "220882005000"},
      %{"name" => "月亮泡镇", "code" => "220882100000"},
      %{"name" => "安广镇", "code" => "220882101000"},
      %{"name" => "丰收镇", "code" => "220882102000"},
      %{"name" => "新平安镇", "code" => "220882103000"},
      %{"name" => "两家子镇", "code" => "220882104000"},
      %{"name" => "舍力镇", "code" => "220882105000"},
      %{"name" => "大岗子镇", "code" => "220882106000"},
      %{"name" => "叉干镇", "code" => "220882107000"},
      %{"name" => "龙沼镇", "code" => "220882108000"},
      %{"name" => "太山镇", "code" => "220882109000"},
      %{"name" => "四棵树乡", "code" => "220882200000"},
      %{"name" => "联合乡", "code" => "220882201000"},
      %{"name" => "大赉乡", "code" => "220882202000"},
      %{"name" => "红岗子乡", "code" => "220882203000"},
      %{"name" => "海坨乡", "code" => "220882204000"},
      %{"name" => "新艾里蒙古族乡", "code" => "220882205000"},
      %{"name" => "烧锅镇乡", "code" => "220882206000"},
      %{"name" => "乐胜乡", "code" => "220882207000"},
      %{"name" => "大安经济开发区（省级）", "code" => "220882400000"},
      %{"name" => "新荒渔场", "code" => "220882401000"},
      %{"name" => "东方红农场", "code" => "220882402000"},
      %{"name" => "五间房水库", "code" => "220882404000"},
      %{"name" => "风水山牧场", "code" => "220882406000"},
      %{"name" => "东风马场", "code" => "220882407000"},
      %{"name" => "良种繁育场", "code" => "220882408000"},
      %{"name" => "大安马场", "code" => "220882409000"},
      %{"name" => "安广猪场", "code" => "220882410000"},
      %{"name" => "红旗饲养场", "code" => "220882411000"}
    ]

  def next(input) when input == "洮南市" or input == "220881",
    do: [
      %{"name" => "团结街道", "code" => "220881001000"},
      %{"name" => "富文街道", "code" => "220881002000"},
      %{"name" => "光明街道", "code" => "220881003000"},
      %{"name" => "兴隆街道", "code" => "220881004000"},
      %{"name" => "永康街道", "code" => "220881005000"},
      %{"name" => "通达街道", "code" => "220881006000"},
      %{"name" => "洮府街道", "code" => "220881007000"},
      %{"name" => "向阳街道", "code" => "220881008000"},
      %{"name" => "瓦房镇", "code" => "220881100000"},
      %{"name" => "万宝镇", "code" => "220881101000"},
      %{"name" => "黑水镇", "code" => "220881102000"},
      %{"name" => "那金镇", "code" => "220881103000"},
      %{"name" => "安定镇", "code" => "220881104000"},
      %{"name" => "福顺镇", "code" => "220881105000"},
      %{"name" => "胡力吐蒙古族乡", "code" => "220881200000"},
      %{"name" => "万宝乡", "code" => "220881201000"},
      %{"name" => "聚宝乡", "code" => "220881202000"},
      %{"name" => "东升乡", "code" => "220881203000"},
      %{"name" => "野马乡", "code" => "220881204000"},
      %{"name" => "永茂乡", "code" => "220881205000"},
      %{"name" => "蛟流河乡", "code" => "220881206000"},
      %{"name" => "大通乡", "code" => "220881207000"},
      %{"name" => "二龙乡", "code" => "220881209000"},
      %{"name" => "呼和车力蒙古族乡", "code" => "220881210000"},
      %{"name" => "市原种场", "code" => "220881402000"}
    ]

  def next(input) when input == "吉林白城经济开发区" or input == "220871",
    do: [
      %{"name" => "幸福街道", "code" => "220871001000"},
      %{"name" => "保平街道", "code" => "220871002000"},
      %{"name" => "西郊街道", "code" => "220871003000"}
    ]

  def next(input) when input == "通榆县" or input == "220822",
    do: [
      %{"name" => "树满街道", "code" => "220822001000"},
      %{"name" => "八区街道", "code" => "220822002000"},
      %{"name" => "迎新街道", "code" => "220822003000"},
      %{"name" => "开通镇", "code" => "220822100000"},
      %{"name" => "瞻榆镇", "code" => "220822101000"},
      %{"name" => "双岗镇", "code" => "220822102000"},
      %{"name" => "兴隆山镇", "code" => "220822103000"},
      %{"name" => "边昭镇", "code" => "220822104000"},
      %{"name" => "鸿兴镇", "code" => "220822105000"},
      %{"name" => "新华镇", "code" => "220822106000"},
      %{"name" => "乌兰花镇", "code" => "220822107000"},
      %{"name" => "新发乡", "code" => "220822200000"},
      %{"name" => "新兴乡", "code" => "220822201000"},
      %{"name" => "向海蒙古族乡", "code" => "220822202000"},
      %{"name" => "包拉温都蒙古族乡", "code" => "220822203000"},
      %{"name" => "团结乡", "code" => "220822204000"},
      %{"name" => "十花道乡", "code" => "220822205000"},
      %{"name" => "八面乡", "code" => "220822206000"},
      %{"name" => "苏公坨乡", "code" => "220822207000"},
      %{"name" => "通榆经济开发区", "code" => "220822400000"},
      %{"name" => "三家子种牛场", "code" => "220822401000"},
      %{"name" => "新华牛场", "code" => "220822405000"}
    ]

  def next(input) when input == "镇赉县" or input == "220821",
    do: [
      %{"name" => "鹤城街道", "code" => "220821001000"},
      %{"name" => "镇东街道", "code" => "220821002000"},
      %{"name" => "赉北街道", "code" => "220821003000"},
      %{"name" => "镇赉镇", "code" => "220821100000"},
      %{"name" => "坦途镇", "code" => "220821101000"},
      %{"name" => "东屏镇", "code" => "220821102000"},
      %{"name" => "大屯镇", "code" => "220821103000"},
      %{"name" => "沿江镇", "code" => "220821104000"},
      %{"name" => "五棵树镇", "code" => "220821105000"},
      %{"name" => "黑鱼泡镇", "code" => "220821106000"},
      %{"name" => "哈吐气蒙古族乡", "code" => "220821200000"},
      %{"name" => "莫莫格蒙古族乡", "code" => "220821201000"},
      %{"name" => "建平乡", "code" => "220821202000"},
      %{"name" => "嘎什根乡", "code" => "220821203000"},
      %{"name" => "四方坨子农场", "code" => "220821400000"},
      %{"name" => "良种繁育场", "code" => "220821402000"},
      %{"name" => "九龙山马场", "code" => "220821403000"},
      %{"name" => "国营渔场", "code" => "220821406000"}
    ]

  def next(input) when input == "洮北区" or input == "220802",
    do: [
      %{"name" => "海明街道", "code" => "220802001000"},
      %{"name" => "长庆街道", "code" => "220802002000"},
      %{"name" => "瑞光街道", "code" => "220802003000"},
      %{"name" => "明仁街道", "code" => "220802004000"},
      %{"name" => "铁东街道", "code" => "220802005000"},
      %{"name" => "（工业园区）城南街道", "code" => "220802006000"},
      %{"name" => "新立街道", "code" => "220802007000"},
      %{"name" => "新华街道", "code" => "220802009000"},
      %{"name" => "（白城市生态新区）官银号街道", "code" => "220802012000"},
      %{"name" => "平安镇", "code" => "220802100000"},
      %{"name" => "青山镇", "code" => "220802101000"},
      %{"name" => "林海镇", "code" => "220802102000"},
      %{"name" => "洮河镇", "code" => "220802103000"},
      %{"name" => "平台镇", "code" => "220802104000"},
      %{"name" => "到保镇", "code" => "220802105000"},
      %{"name" => "岭下镇", "code" => "220802170000"},
      %{"name" => "东风乡", "code" => "220802200000"},
      %{"name" => "三合乡", "code" => "220802201000"},
      %{"name" => "东胜乡", "code" => "220802202000"},
      %{"name" => "金祥乡", "code" => "220802203000"},
      %{"name" => "德顺蒙古族乡", "code" => "220802204000"},
      %{"name" => "镇南种羊场", "code" => "220802402000"},
      %{"name" => "白城牧场", "code" => "220802403000"},
      %{"name" => "洮儿河农场", "code" => "220802404000"},
      %{"name" => "保民农场", "code" => "220802405000"}
    ]

  def next(input) when input == "扶余市" or input == "220781",
    do: [
      %{"name" => "和兴街道", "code" => "220781001000"},
      %{"name" => "育才街道", "code" => "220781002000"},
      %{"name" => "联盟街道", "code" => "220781003000"},
      %{"name" => "士英街道", "code" => "220781004000"},
      %{"name" => "铁西街道", "code" => "220781005000"},
      %{"name" => "三岔河镇", "code" => "220781100000"},
      %{"name" => "长春岭镇", "code" => "220781101000"},
      %{"name" => "五家站镇", "code" => "220781102000"},
      %{"name" => "陶赖昭镇", "code" => "220781103000"},
      %{"name" => "蔡家沟镇", "code" => "220781104000"},
      %{"name" => "弓棚子镇", "code" => "220781105000"},
      %{"name" => "三井子镇", "code" => "220781106000"},
      %{"name" => "增盛镇", "code" => "220781107000"},
      %{"name" => "新万发镇", "code" => "220781108000"},
      %{"name" => "大林子镇", "code" => "220781109000"},
      %{"name" => "新源镇", "code" => "220781110000"},
      %{"name" => "得胜镇", "code" => "220781111000"},
      %{"name" => "三骏满族蒙古族锡伯族乡", "code" => "220781200000"},
      %{"name" => "永平乡", "code" => "220781201000"},
      %{"name" => "新站乡", "code" => "220781203000"},
      %{"name" => "更新乡", "code" => "220781204000"},
      %{"name" => "肖家乡", "code" => "220781206000"},
      %{"name" => "拉林灌区管理局", "code" => "220781401000"},
      %{"name" => "下岱吉灌区管理局", "code" => "220781402000"}
    ]

  def next(input) when input == "吉林松原经济开发区" or input == "220771",
    do: [
      %{"name" => "兴原乡", "code" => "220771200000"},
      %{"name" => "松原经济技术开发区特殊乡镇", "code" => "220771599000"}
    ]

  def next(input) when input == "乾安县" or input == "220723",
    do: [
      %{"name" => "荣业街道", "code" => "220723001000"},
      %{"name" => "驰誉街道", "code" => "220723002000"},
      %{"name" => "如松街道", "code" => "220723003000"},
      %{"name" => "乾安镇", "code" => "220723100000"},
      %{"name" => "大布苏镇", "code" => "220723101000"},
      %{"name" => "水字镇", "code" => "220723102000"},
      %{"name" => "让字镇", "code" => "220723103000"},
      %{"name" => "所字镇", "code" => "220723104000"},
      %{"name" => "安字镇", "code" => "220723105000"},
      %{"name" => "余字乡", "code" => "220723200000"},
      %{"name" => "道字乡", "code" => "220723201000"},
      %{"name" => "严字乡", "code" => "220723202000"},
      %{"name" => "赞字乡", "code" => "220723203000"},
      %{"name" => "国营林场", "code" => "220723400000"},
      %{"name" => "腾字种畜场", "code" => "220723401000"},
      %{"name" => "大遐畜牧场", "code" => "220723402000"},
      %{"name" => "乾安鹿场", "code" => "220723403000"},
      %{"name" => "来字良种繁育基地", "code" => "220723404000"},
      %{"name" => "地字种畜场", "code" => "220723405000"}
    ]

  def next(input) when input == "长岭县" or input == "220722",
    do: [
      %{"name" => "长盛街道", "code" => "220722001000"},
      %{"name" => "长治街道", "code" => "220722002000"},
      %{"name" => "长久街道", "code" => "220722003000"},
      %{"name" => "长岭镇", "code" => "220722100000"},
      %{"name" => "太平川镇", "code" => "220722101000"},
      %{"name" => "巨宝山镇", "code" => "220722102000"},
      %{"name" => "太平山镇", "code" => "220722103000"},
      %{"name" => "前七号镇", "code" => "220722104000"},
      %{"name" => "新安镇", "code" => "220722105000"},
      %{"name" => "三青山镇", "code" => "220722106000"},
      %{"name" => "大兴镇", "code" => "220722107000"},
      %{"name" => "北正镇", "code" => "220722108000"},
      %{"name" => "流水镇", "code" => "220722109000"},
      %{"name" => "永久镇", "code" => "220722110000"},
      %{"name" => "利发盛镇", "code" => "220722111000"},
      %{"name" => "集体乡", "code" => "220722200000"},
      %{"name" => "光明乡", "code" => "220722201000"},
      %{"name" => "三县堡乡", "code" => "220722202000"},
      %{"name" => "海青乡", "code" => "220722203000"},
      %{"name" => "前进乡", "code" => "220722204000"},
      %{"name" => "东岭乡", "code" => "220722205000"},
      %{"name" => "腰坨子乡", "code" => "220722206000"},
      %{"name" => "八十八乡", "code" => "220722207000"},
      %{"name" => "三团乡", "code" => "220722208000"},
      %{"name" => "三十号乡", "code" => "220722209000"},
      %{"name" => "长岭种马场", "code" => "220722400000"},
      %{"name" => "长岭环城工业集中区", "code" => "220722401000"},
      %{"name" => "太平川机械林场", "code" => "220722405000"},
      %{"name" => "三团机械林场", "code" => "220722406000"},
      %{"name" => "东岭机械林场", "code" => "220722407000"},
      %{"name" => "十四号种畜场", "code" => "220722408000"},
      %{"name" => "良种繁育场", "code" => "220722409000"},
      %{"name" => "前七号机械林场", "code" => "220722410000"}
    ]

  def next(input) when input == "前郭尔罗斯蒙古族自治县" or input == "220721",
    do: [
      %{"name" => "阿穆尔街道", "code" => "220721001000"},
      %{"name" => "萨日朗街道", "code" => "220721002000"},
      %{"name" => "哈达街道", "code" => "220721003000"},
      %{"name" => "前郭尔罗斯镇", "code" => "220721100000"},
      %{"name" => "长山镇", "code" => "220721101000"},
      %{"name" => "海渤日戈镇", "code" => "220721102000"},
      %{"name" => "乌兰图嘎镇", "code" => "220721103000"},
      %{"name" => "查干花镇", "code" => "220721104000"},
      %{"name" => "王府站镇", "code" => "220721105000"},
      %{"name" => "八郎镇", "code" => "220721106000"},
      %{"name" => "哈拉毛都镇", "code" => "220721107000"},
      %{"name" => "查干湖镇", "code" => "220721108000"},
      %{"name" => "宝甸乡", "code" => "220721200000"},
      %{"name" => "平凤乡", "code" => "220721201000"},
      %{"name" => "达里巴乡", "code" => "220721203000"},
      %{"name" => "吉拉吐乡", "code" => "220721204000"},
      %{"name" => "白依拉嘎乡", "code" => "220721205000"},
      %{"name" => "洪泉乡", "code" => "220721206000"},
      %{"name" => "额如乡", "code" => "220721207000"},
      %{"name" => "套浩太乡", "code" => "220721208000"},
      %{"name" => "长龙乡", "code" => "220721209000"},
      %{"name" => "乌兰塔拉乡", "code" => "220721210000"},
      %{"name" => "东三家子乡", "code" => "220721211000"},
      %{"name" => "浩特芒哈乡", "code" => "220721212000"},
      %{"name" => "乌兰敖都乡", "code" => "220721213000"},
      %{"name" => "红旗农场", "code" => "220721400000"},
      %{"name" => "红光农场", "code" => "220721401000"},
      %{"name" => "红星牧场", "code" => "220721402000"},
      %{"name" => "查干花种畜场", "code" => "220721403000"},
      %{"name" => "莲花泡农场", "code" => "220721404000"},
      %{"name" => "深井子牧场", "code" => "220721405000"},
      %{"name" => "前郭尔罗斯蒙古族自治县国有林总场", "code" => "220721406000"},
      %{"name" => "查干湖旅游经济开发区", "code" => "220721407000"},
      %{"name" => "八郎农场", "code" => "220721408000"},
      %{"name" => "查干湖渔场", "code" => "220721409000"},
      %{"name" => "长山余热鱼苗繁殖场", "code" => "220721411000"},
      %{"name" => "库里渔场", "code" => "220721412000"},
      %{"name" => "哈拉毛都良种场", "code" => "220721413000"},
      %{"name" => "新庙泡渔场", "code" => "220721415000"},
      %{"name" => "吉林前郭经济技术开发区", "code" => "220721417000"}
    ]

  def next(input) when input == "宁江区" or input == "220702",
    do: [
      %{"name" => "团结街道", "code" => "220702001000"},
      %{"name" => "文化街道", "code" => "220702002000"},
      %{"name" => "民主街道", "code" => "220702003000"},
      %{"name" => "临江街道", "code" => "220702004000"},
      %{"name" => "新区街道", "code" => "220702005000"},
      %{"name" => "前进街道", "code" => "220702006000"},
      %{"name" => "和平街道", "code" => "220702007000"},
      %{"name" => "工农街道", "code" => "220702008000"},
      %{"name" => "沿江街道", "code" => "220702009000"},
      %{"name" => "铁西街道", "code" => "220702010000"},
      %{"name" => "繁荣街道", "code" => "220702011000"},
      %{"name" => "建设街道", "code" => "220702012000"},
      %{"name" => "石化街道", "code" => "220702013000"},
      %{"name" => "伯都讷街道", "code" => "220702014000"},
      %{"name" => "长宁街道", "code" => "220702015000"},
      %{"name" => "滨江街道", "code" => "220702016000"},
      %{"name" => "镜湖街道", "code" => "220702017000"},
      %{"name" => "大洼镇", "code" => "220702100000"},
      %{"name" => "善友镇", "code" => "220702101000"},
      %{"name" => "毛都站镇", "code" => "220702102000"},
      %{"name" => "哈达山镇", "code" => "220702103000"},
      %{"name" => "新城乡", "code" => "220702200000"},
      %{"name" => "伯都乡", "code" => "220702202000"},
      %{"name" => "大洼商业渔场", "code" => "220702401000"},
      %{"name" => "松原市善友国有林保护中心", "code" => "220702402000"},
      %{"name" => "松原市宁江区八家子国有林保护中心", "code" => "220702403000"},
      %{"name" => "良种繁育场", "code" => "220702404000"},
      %{"name" => "松原市哈达山国有林保护中心", "code" => "220702405000"},
      %{"name" => "吉林宁江经济开发区", "code" => "220702406000"}
    ]

  def next(input) when input == "临江市" or input == "220681",
    do: [
      %{"name" => "建国街道", "code" => "220681001000"},
      %{"name" => "新市街道", "code" => "220681002000"},
      %{"name" => "兴隆街道", "code" => "220681003000"},
      %{"name" => "大湖街道", "code" => "220681004000"},
      %{"name" => "森工街道", "code" => "220681005000"},
      %{"name" => "大栗子街道", "code" => "220681006000"},
      %{"name" => "桦树镇", "code" => "220681100000"},
      %{"name" => "六道沟镇", "code" => "220681101000"},
      %{"name" => "苇沙河镇", "code" => "220681102000"},
      %{"name" => "花山镇", "code" => "220681103000"},
      %{"name" => "闹枝镇", "code" => "220681104000"},
      %{"name" => "四道沟镇", "code" => "220681105000"},
      %{"name" => "蚂蚁河乡", "code" => "220681200000"}
    ]

  def next(input) when input == "长白朝鲜族自治县" or input == "220623",
    do: [
      %{"name" => "长白镇", "code" => "220623100000"},
      %{"name" => "八道沟镇", "code" => "220623101000"},
      %{"name" => "十四道沟镇", "code" => "220623102000"},
      %{"name" => "马鹿沟镇", "code" => "220623103000"},
      %{"name" => "宝泉山镇", "code" => "220623104000"},
      %{"name" => "新房子镇", "code" => "220623105000"},
      %{"name" => "十二道沟镇", "code" => "220623106000"},
      %{"name" => "金华乡", "code" => "220623200000"}
    ]

  def next(input) when input == "靖宇县" or input == "220622",
    do: [
      %{"name" => "靖宇镇", "code" => "220622100000"},
      %{"name" => "三道湖镇", "code" => "220622101000"},
      %{"name" => "龙泉镇", "code" => "220622102000"},
      %{"name" => "那尔轰镇", "code" => "220622103000"},
      %{"name" => "花园口镇", "code" => "220622104000"},
      %{"name" => "景山镇", "code" => "220622105000"},
      %{"name" => "赤松镇", "code" => "220622106000"},
      %{"name" => "濛江乡", "code" => "220622201000"}
    ]

  def next(input) when input == "抚松县" or input == "220621",
    do: [
      %{"name" => "抚松镇", "code" => "220621100000"},
      %{"name" => "松江河镇", "code" => "220621101000"},
      %{"name" => "泉阳镇", "code" => "220621102000"},
      %{"name" => "露水河镇", "code" => "220621103000"},
      %{"name" => "仙人桥镇", "code" => "220621104000"},
      %{"name" => "万良镇", "code" => "220621105000"},
      %{"name" => "新屯子镇", "code" => "220621106000"},
      %{"name" => "东岗镇", "code" => "220621107000"},
      %{"name" => "漫江镇", "code" => "220621108000"},
      %{"name" => "北岗镇", "code" => "220621109000"},
      %{"name" => "兴参镇", "code" => "220621110000"},
      %{"name" => "长白山保护开发区池西区特殊乡镇", "code" => "220621120000"},
      %{"name" => "长白山保护开发区池南区特殊乡镇", "code" => "220621121000"},
      %{"name" => "兴隆乡", "code" => "220621200000"},
      %{"name" => "抽水乡", "code" => "220621201000"},
      %{"name" => "沿江乡", "code" => "220621202000"}
    ]

  def next(input) when input == "江源区" or input == "220605",
    do: [
      %{"name" => "孙家堡子街道", "code" => "220605001000"},
      %{"name" => "江源街道", "code" => "220605002000"},
      %{"name" => "正岔街道", "code" => "220605003000"},
      %{"name" => "城墙街道", "code" => "220605004000"},
      %{"name" => "湾沟镇", "code" => "220605102000"},
      %{"name" => "松树镇", "code" => "220605103000"},
      %{"name" => "砟子镇", "code" => "220605104000"},
      %{"name" => "石人镇", "code" => "220605105000"},
      %{"name" => "大阳岔镇", "code" => "220605106000"},
      %{"name" => "大石人镇", "code" => "220605107000"}
    ]

  def next(input) when input == "浑江区" or input == "220602",
    do: [
      %{"name" => "新建街道", "code" => "220602001000"},
      %{"name" => "通沟街道", "code" => "220602002000"},
      %{"name" => "东兴街道", "code" => "220602003000"},
      %{"name" => "红旗街道", "code" => "220602004000"},
      %{"name" => "城南街道", "code" => "220602005000"},
      %{"name" => "江北街道", "code" => "220602006000"},
      %{"name" => "河口街道", "code" => "220602007000"},
      %{"name" => "板石街道", "code" => "220602008000"},
      %{"name" => "七道江镇", "code" => "220602100000"},
      %{"name" => "六道江镇", "code" => "220602101000"},
      %{"name" => "红土崖镇", "code" => "220602102000"},
      %{"name" => "三道沟镇", "code" => "220602103000"}
    ]

  def next(input) when input == "集安市" or input == "220582",
    do: [
      %{"name" => "团结街道", "code" => "220582001000"},
      %{"name" => "黎明街道", "code" => "220582002000"},
      %{"name" => "通胜街道", "code" => "220582003000"},
      %{"name" => "城东街道", "code" => "220582004000"},
      %{"name" => "青石镇", "code" => "220582100000"},
      %{"name" => "榆林镇", "code" => "220582101000"},
      %{"name" => "花甸镇", "code" => "220582102000"},
      %{"name" => "头道镇", "code" => "220582103000"},
      %{"name" => "清河镇", "code" => "220582104000"},
      %{"name" => "台上镇", "code" => "220582105000"},
      %{"name" => "财源镇", "code" => "220582106000"},
      %{"name" => "大路镇", "code" => "220582107000"},
      %{"name" => "太王镇", "code" => "220582108000"},
      %{"name" => "麻线乡", "code" => "220582200000"},
      %{"name" => "凉水朝鲜族乡", "code" => "220582201000"}
    ]

  def next(input) when input == "梅河口市" or input == "220581",
    do: [
      %{"name" => "新华街道", "code" => "220581001000"},
      %{"name" => "光明街道", "code" => "220581002000"},
      %{"name" => "和平街道", "code" => "220581070000"},
      %{"name" => "解放街道", "code" => "220581071000"},
      %{"name" => "福民街道", "code" => "220581072000"},
      %{"name" => "山城镇", "code" => "220581100000"},
      %{"name" => "红梅镇", "code" => "220581101000"},
      %{"name" => "海龙镇", "code" => "220581102000"},
      %{"name" => "新合镇", "code" => "220581103000"},
      %{"name" => "曙光镇", "code" => "220581104000"},
      %{"name" => "中和镇", "code" => "220581105000"},
      %{"name" => "黑山头镇", "code" => "220581106000"},
      %{"name" => "水道镇", "code" => "220581107000"},
      %{"name" => "进化镇", "code" => "220581108000"},
      %{"name" => "一座营镇", "code" => "220581109000"},
      %{"name" => "康大营镇", "code" => "220581110000"},
      %{"name" => "牛心顶镇", "code" => "220581111000"},
      %{"name" => "杏岭镇", "code" => "220581112000"},
      %{"name" => "湾龙镇", "code" => "220581113000"},
      %{"name" => "兴华镇", "code" => "220581114000"},
      %{"name" => "双兴镇", "code" => "220581115000"},
      %{"name" => "李炉乡", "code" => "220581201000"},
      %{"name" => "小杨满族朝鲜族乡", "code" => "220581205000"},
      %{"name" => "吉乐乡", "code" => "220581206000"}
    ]

  def next(input) when input == "柳河县" or input == "220524",
    do: [
      %{"name" => "采胜街道", "code" => "220524001000"},
      %{"name" => "中岗街道", "code" => "220524002000"},
      %{"name" => "导航街道", "code" => "220524003000"},
      %{"name" => "柳河镇", "code" => "220524100000"},
      %{"name" => "三源浦朝鲜族镇", "code" => "220524101000"},
      %{"name" => "五道沟镇", "code" => "220524102000"},
      %{"name" => "驼腰岭镇", "code" => "220524103000"},
      %{"name" => "孤山子镇", "code" => "220524104000"},
      %{"name" => "圣水镇", "code" => "220524105000"},
      %{"name" => "罗通山镇", "code" => "220524106000"},
      %{"name" => "安口镇", "code" => "220524107000"},
      %{"name" => "向阳镇", "code" => "220524108000"},
      %{"name" => "红石镇", "code" => "220524109000"},
      %{"name" => "凉水河子镇", "code" => "220524110000"},
      %{"name" => "亨通镇", "code" => "220524111000"},
      %{"name" => "柳南乡", "code" => "220524200000"},
      %{"name" => "时家店乡", "code" => "220524201000"},
      %{"name" => "姜家店朝鲜族乡", "code" => "220524202000"}
    ]

  def next(input) when input == "辉南县" or input == "220523",
    do: [
      %{"name" => "东凤街道", "code" => "220523001000"},
      %{"name" => "朝辉街道", "code" => "220523002000"},
      %{"name" => "西凤街道", "code" => "220523003000"},
      %{"name" => "朝阳镇", "code" => "220523100000"},
      %{"name" => "辉南镇", "code" => "220523101000"},
      %{"name" => "样子哨镇", "code" => "220523102000"},
      %{"name" => "杉松岗镇", "code" => "220523103000"},
      %{"name" => "石道河镇", "code" => "220523104000"},
      %{"name" => "辉发城镇", "code" => "220523105000"},
      %{"name" => "抚民镇", "code" => "220523106000"},
      %{"name" => "金川镇", "code" => "220523107000"},
      %{"name" => "团林镇", "code" => "220523108000"},
      %{"name" => "庆阳镇", "code" => "220523109000"},
      %{"name" => "楼街朝鲜族乡", "code" => "220523200000"}
    ]

  def next(input) when input == "通化县" or input == "220521",
    do: [
      %{"name" => "茂山街道", "code" => "220521001000"},
      %{"name" => "东安街道", "code" => "220521002000"},
      %{"name" => "快大茂镇", "code" => "220521100000"},
      %{"name" => "二密镇", "code" => "220521101000"},
      %{"name" => "果松镇", "code" => "220521102000"},
      %{"name" => "石湖镇", "code" => "220521103000"},
      %{"name" => "大安镇", "code" => "220521104000"},
      %{"name" => "光华镇", "code" => "220521105000"},
      %{"name" => "兴林镇", "code" => "220521106000"},
      %{"name" => "英额布镇", "code" => "220521107000"},
      %{"name" => "三棵榆树镇", "code" => "220521108000"},
      %{"name" => "西江镇", "code" => "220521109000"},
      %{"name" => "通化聚鑫经济开发区特殊乡镇", "code" => "220521120000"},
      %{"name" => "富江乡", "code" => "220521200000"},
      %{"name" => "四棚乡", "code" => "220521201000"},
      %{"name" => "东来乡", "code" => "220521202000"},
      %{"name" => "大泉源满族朝鲜族乡", "code" => "220521203000"},
      %{"name" => "金斗朝鲜族满族乡", "code" => "220521204000"},
      %{"name" => "东宝新村", "code" => "220521401000"}
    ]

  def next(input) when input == "二道江区" or input == "220503",
    do: [
      %{"name" => "桃园街道", "code" => "220503001000"},
      %{"name" => "东通化街道", "code" => "220503002000"},
      %{"name" => "鸭园镇", "code" => "220503100000"},
      %{"name" => "铁厂镇", "code" => "220503101000"},
      %{"name" => "五道江镇", "code" => "220503102000"},
      %{"name" => "二道江乡", "code" => "220503200000"}
    ]

  def next(input) when input == "东昌区" or input == "220502",
    do: [
      %{"name" => "东昌街道", "code" => "220502001000"},
      %{"name" => "民主街道", "code" => "220502002000"},
      %{"name" => "老站街道", "code" => "220502003000"},
      %{"name" => "团结街道", "code" => "220502004000"},
      %{"name" => "新站街道", "code" => "220502005000"},
      %{"name" => "光明街道", "code" => "220502006000"},
      %{"name" => "龙泉街道", "code" => "220502007000"},
      %{"name" => "陆港街道", "code" => "220502008000"},
      %{"name" => "滨江街道", "code" => "220502009000"},
      %{"name" => "金厂镇", "code" => "220502100000"},
      %{"name" => "通化经济开发区特殊乡镇", "code" => "220502120000"},
      %{"name" => "环通乡", "code" => "220502200000"},
      %{"name" => "江东乡", "code" => "220502201000"}
    ]

  def next(input) when input == "东辽县" or input == "220422",
    do: [
      %{"name" => "白泉镇", "code" => "220422100000"},
      %{"name" => "渭津镇", "code" => "220422101000"},
      %{"name" => "安石镇", "code" => "220422102000"},
      %{"name" => "辽河源镇", "code" => "220422103000"},
      %{"name" => "泉太镇", "code" => "220422104000"},
      %{"name" => "建安镇", "code" => "220422105000"},
      %{"name" => "安恕镇", "code" => "220422106000"},
      %{"name" => "平岗镇", "code" => "220422107000"},
      %{"name" => "云顶镇", "code" => "220422108000"},
      %{"name" => "凌云乡", "code" => "220422200000"},
      %{"name" => "甲山乡", "code" => "220422201000"},
      %{"name" => "足民乡", "code" => "220422202000"},
      %{"name" => "金州乡", "code" => "220422203000"}
    ]

  def next(input) when input == "东丰县" or input == "220421",
    do: [
      %{"name" => "吉鹿街道", "code" => "220421001000"},
      %{"name" => "祥鹿街道", "code" => "220421002000"},
      %{"name" => "福鹿街道", "code" => "220421003000"},
      %{"name" => "东丰镇", "code" => "220421100000"},
      %{"name" => "大阳镇", "code" => "220421101000"},
      %{"name" => "横道河镇", "code" => "220421102000"},
      %{"name" => "那丹伯镇", "code" => "220421103000"},
      %{"name" => "猴石镇", "code" => "220421104000"},
      %{"name" => "杨木林镇", "code" => "220421105000"},
      %{"name" => "小四平镇", "code" => "220421106000"},
      %{"name" => "黄河镇", "code" => "220421107000"},
      %{"name" => "拉拉河镇", "code" => "220421108000"},
      %{"name" => "沙河镇", "code" => "220421109000"},
      %{"name" => "南屯基镇", "code" => "220421110000"},
      %{"name" => "大兴镇", "code" => "220421111000"},
      %{"name" => "三合满族朝鲜族乡", "code" => "220421200000"},
      %{"name" => "二龙山乡", "code" => "220421201000"}
    ]

  def next(input) when input == "西安区" or input == "220403",
    do: [
      %{"name" => "太安街道", "code" => "220403001000"},
      %{"name" => "仙城街道", "code" => "220403002000"},
      %{"name" => "东山街道", "code" => "220403003000"},
      %{"name" => "先锋街道", "code" => "220403004000"},
      %{"name" => "富国街道", "code" => "220403005000"},
      %{"name" => "安家街道", "code" => "220403006000"},
      %{"name" => "灯塔镇", "code" => "220403100000"}
    ]

  def next(input) when input == "龙山区" or input == "220402",
    do: [
      %{"name" => "东吉街道", "code" => "220402001000"},
      %{"name" => "南康街道", "code" => "220402002000"},
      %{"name" => "北寿街道", "code" => "220402003000"},
      %{"name" => "西宁街道", "code" => "220402004000"},
      %{"name" => "站前街道", "code" => "220402005000"},
      %{"name" => "向阳街道", "code" => "220402006000"},
      %{"name" => "新兴街道", "code" => "220402007000"},
      %{"name" => "福镇街道", "code" => "220402008000"},
      %{"name" => "辽源高新技术产业开发区特殊街道", "code" => "220402070000"},
      %{"name" => "寿山镇", "code" => "220402100000"},
      %{"name" => "工农乡", "code" => "220402200000"}
    ]

  def next(input) when input == "双辽市" or input == "220382",
    do: [
      %{"name" => "郑家屯街道", "code" => "220382001000"},
      %{"name" => "辽西街道", "code" => "220382002000"},
      %{"name" => "辽南街道", "code" => "220382003000"},
      %{"name" => "辽北街道", "code" => "220382004000"},
      %{"name" => "辽东街道", "code" => "220382005000"},
      %{"name" => "红旗街道", "code" => "220382006000"},
      %{"name" => "茂林镇", "code" => "220382100000"},
      %{"name" => "双山镇", "code" => "220382101000"},
      %{"name" => "卧虎镇", "code" => "220382102000"},
      %{"name" => "服先镇", "code" => "220382103000"},
      %{"name" => "王奔镇", "code" => "220382104000"},
      %{"name" => "玻璃山镇", "code" => "220382105000"},
      %{"name" => "兴隆镇", "code" => "220382106000"},
      %{"name" => "东明镇", "code" => "220382107000"},
      %{"name" => "那木乡", "code" => "220382200000"},
      %{"name" => "柳条乡", "code" => "220382201000"},
      %{"name" => "新立乡", "code" => "220382202000"},
      %{"name" => "永加乡", "code" => "220382203000"},
      %{"name" => "吉林双辽经济开发区", "code" => "220382402000"}
    ]

  def next(input) when input == "伊通满族自治县" or input == "220323",
    do: [
      %{"name" => "永盛街道", "code" => "220323001000"},
      %{"name" => "永宁街道", "code" => "220323002000"},
      %{"name" => "伊通镇", "code" => "220323100000"},
      %{"name" => "二道镇", "code" => "220323101000"},
      %{"name" => "伊丹镇", "code" => "220323102000"},
      %{"name" => "马鞍山镇", "code" => "220323103000"},
      %{"name" => "景台镇", "code" => "220323104000"},
      %{"name" => "靠山镇", "code" => "220323105000"},
      %{"name" => "大孤山镇", "code" => "220323106000"},
      %{"name" => "小孤山镇", "code" => "220323107000"},
      %{"name" => "营城子镇", "code" => "220323108000"},
      %{"name" => "西苇镇", "code" => "220323109000"},
      %{"name" => "河源镇", "code" => "220323110000"},
      %{"name" => "黄岭子镇", "code" => "220323111000"},
      %{"name" => "新兴乡", "code" => "220323200000"},
      %{"name" => "莫里青乡", "code" => "220323201000"},
      %{"name" => "三道乡", "code" => "220323202000"}
    ]

  def next(input) when input == "梨树县" or input == "220322",
    do: [
      %{"name" => "富强街道", "code" => "220322001000"},
      %{"name" => "康平街道", "code" => "220322002000"},
      %{"name" => "霍家店街道", "code" => "220322003000"},
      %{"name" => "梨树镇", "code" => "220322100000"},
      %{"name" => "郭家店镇", "code" => "220322101000"},
      %{"name" => "榆树台镇", "code" => "220322102000"},
      %{"name" => "孤家子镇", "code" => "220322103000"},
      %{"name" => "小城子镇", "code" => "220322104000"},
      %{"name" => "喇嘛甸镇", "code" => "220322105000"},
      %{"name" => "蔡家镇", "code" => "220322106000"},
      %{"name" => "刘家馆子镇", "code" => "220322107000"},
      %{"name" => "十家堡镇", "code" => "220322108000"},
      %{"name" => "孟家岭镇", "code" => "220322109000"},
      %{"name" => "万发镇", "code" => "220322110000"},
      %{"name" => "东河镇", "code" => "220322111000"},
      %{"name" => "沈洋镇", "code" => "220322112000"},
      %{"name" => "林海镇", "code" => "220322113000"},
      %{"name" => "小宽镇", "code" => "220322114000"},
      %{"name" => "白山乡", "code" => "220322200000"},
      %{"name" => "泉眼岭乡", "code" => "220322201000"},
      %{"name" => "胜利乡", "code" => "220322202000"},
      %{"name" => "四棵树乡", "code" => "220322203000"},
      %{"name" => "双河乡", "code" => "220322204000"},
      %{"name" => "金山乡", "code" => "220322205000"}
    ]

  def next(input) when input == "铁东区" or input == "220303",
    do: [
      %{"name" => "四平市铁东区平东街道", "code" => "220303001000"},
      %{"name" => "四平市铁东区北市场街道", "code" => "220303002000"},
      %{"name" => "四平市铁东区七马路街道", "code" => "220303003000"},
      %{"name" => "四平市铁东区四马路街道", "code" => "220303004000"},
      %{"name" => "四平市铁东区解放街道", "code" => "220303005000"},
      %{"name" => "四平市铁东区北门街道", "code" => "220303006000"},
      %{"name" => "四平市铁东区黄土坑街道", "code" => "220303007000"},
      %{"name" => "四平市铁东区平南街道", "code" => "220303008000"},
      %{"name" => "四平市铁东区山门镇", "code" => "220303100000"},
      %{"name" => "四平市铁东区石岭镇", "code" => "220303101000"},
      %{"name" => "四平市铁东区叶赫满族镇", "code" => "220303102000"},
      %{"name" => "四平市铁东区城东乡", "code" => "220303200000"}
    ]

  def next(input) when input == "铁西区" or input == "220302",
    do: [
      %{"name" => "仁兴街道", "code" => "220302001000"},
      %{"name" => "英雄街道", "code" => "220302002000"},
      %{"name" => "站前街道", "code" => "220302003000"},
      %{"name" => "北沟街道", "code" => "220302004000"},
      %{"name" => "地直街道", "code" => "220302005000"},
      %{"name" => "平西乡", "code" => "220302200000"},
      %{"name" => "红嘴高新技术开发区", "code" => "220302400000"}
    ]

  def next(input) when input == "磐石市" or input == "220284",
    do: [
      %{"name" => "福安街道", "code" => "220284001000"},
      %{"name" => "东宁街道", "code" => "220284002000"},
      %{"name" => "河南街道", "code" => "220284003000"},
      %{"name" => "磐石经济开发区特殊街道", "code" => "220284070000"},
      %{"name" => "烟筒山镇", "code" => "220284100000"},
      %{"name" => "红旗岭镇", "code" => "220284101000"},
      %{"name" => "明城镇", "code" => "220284102000"},
      %{"name" => "石嘴镇", "code" => "220284103000"},
      %{"name" => "驿马镇", "code" => "220284104000"},
      %{"name" => "牛心镇", "code" => "220284105000"},
      %{"name" => "呼兰镇", "code" => "220284106000"},
      %{"name" => "吉昌镇", "code" => "220284107000"},
      %{"name" => "松山镇", "code" => "220284108000"},
      %{"name" => "黑石镇", "code" => "220284109000"},
      %{"name" => "朝阳山镇", "code" => "220284110000"},
      %{"name" => "富太镇", "code" => "220284111000"},
      %{"name" => "取柴河镇", "code" => "220284112000"},
      %{"name" => "宝山乡", "code" => "220284200000"}
    ]

  def next(input) when input == "舒兰市" or input == "220283",
    do: [
      %{"name" => "北城街道", "code" => "220283001000"},
      %{"name" => "南城街道", "code" => "220283002000"},
      %{"name" => "环城街道", "code" => "220283003000"},
      %{"name" => "吉舒街道", "code" => "220283004000"},
      %{"name" => "滨河街道", "code" => "220283005000"},
      %{"name" => "法特镇", "code" => "220283100000"},
      %{"name" => "白旗镇", "code" => "220283101000"},
      %{"name" => "溪河镇", "code" => "220283102000"},
      %{"name" => "朝阳镇", "code" => "220283103000"},
      %{"name" => "小城镇", "code" => "220283104000"},
      %{"name" => "上营镇", "code" => "220283105000"},
      %{"name" => "水曲柳镇", "code" => "220283106000"},
      %{"name" => "平安镇", "code" => "220283107000"},
      %{"name" => "金马镇", "code" => "220283108000"},
      %{"name" => "开原镇", "code" => "220283109000"},
      %{"name" => "莲花乡", "code" => "220283200000"},
      %{"name" => "亮甲山乡", "code" => "220283201000"},
      %{"name" => "新安乡", "code" => "220283202000"},
      %{"name" => "七里乡", "code" => "220283203000"},
      %{"name" => "天德乡", "code" => "220283204000"}
    ]

  def next(input) when input == "桦甸市" or input == "220282",
    do: [
      %{"name" => "明桦街道", "code" => "220282001000"},
      %{"name" => "永吉街道", "code" => "220282002000"},
      %{"name" => "胜利街道", "code" => "220282003000"},
      %{"name" => "新华街道", "code" => "220282004000"},
      %{"name" => "启新街道", "code" => "220282005000"},
      %{"name" => "夹皮沟镇", "code" => "220282100000"},
      %{"name" => "二道甸子镇", "code" => "220282101000"},
      %{"name" => "红石砬子镇", "code" => "220282102000"},
      %{"name" => "八道河子镇", "code" => "220282103000"},
      %{"name" => "常山镇", "code" => "220282104000"},
      %{"name" => "金沙镇", "code" => "220282105000"},
      %{"name" => "桦郊乡", "code" => "220282200000"},
      %{"name" => "横道河子乡", "code" => "220282201000"},
      %{"name" => "公吉乡", "code" => "220282204000"}
    ]

  def next(input) when input == "蛟河市" or input == "220281",
    do: [
      %{"name" => "民主街道", "code" => "220281001000"},
      %{"name" => "长安街道", "code" => "220281002000"},
      %{"name" => "河南街道", "code" => "220281003000"},
      %{"name" => "奶子山街道", "code" => "220281004000"},
      %{"name" => "拉法街道", "code" => "220281005000"},
      %{"name" => "河北街道", "code" => "220281006000"},
      %{"name" => "新农街道", "code" => "220281007000"},
      %{"name" => "新站镇", "code" => "220281100000"},
      %{"name" => "天岗镇", "code" => "220281101000"},
      %{"name" => "白石山镇", "code" => "220281102000"},
      %{"name" => "漂河镇", "code" => "220281103000"},
      %{"name" => "黄松甸镇", "code" => "220281104000"},
      %{"name" => "天北镇", "code" => "220281105000"},
      %{"name" => "松江镇", "code" => "220281106000"},
      %{"name" => "庆岭镇", "code" => "220281107000"},
      %{"name" => "乌林朝鲜族乡", "code" => "220281200000"},
      %{"name" => "前进乡", "code" => "220281201000"}
    ]

  def next(input) when input == "吉林中国新加坡食品区" or input == "220273",
    do: [%{"name" => "岔路河镇", "code" => "220273100000"}]

  def next(input) when input == "吉林高新技术产业开发区" or input == "220272",
    do: [
      %{"name" => "高新街道", "code" => "220272001000"},
      %{"name" => "新北街道", "code" => "220272002000"}
    ]

  def next(input) when input == "吉林经济开发区" or input == "220271",
    do: [
      %{"name" => "九站街道", "code" => "220271001000"},
      %{"name" => "双吉街道", "code" => "220271013000"}
    ]

  def next(input) when input == "永吉县" or input == "220221",
    do: [
      %{"name" => "口前镇", "code" => "220221100000"},
      %{"name" => "双河镇", "code" => "220221101000"},
      %{"name" => "西阳镇", "code" => "220221102000"},
      %{"name" => "北大湖镇", "code" => "220221103000"},
      %{"name" => "一拉溪镇", "code" => "220221104000"},
      %{"name" => "万昌镇", "code" => "220221171000"},
      %{"name" => "永吉经济开发区特殊乡镇", "code" => "220221172000"},
      %{"name" => "金家乡", "code" => "220221200000"},
      %{"name" => "黄榆乡", "code" => "220221201000"}
    ]

  def next(input) when input == "丰满区" or input == "220211",
    do: [
      %{"name" => "泰山街道", "code" => "220211001000"},
      %{"name" => "江南街道", "code" => "220211002000"},
      %{"name" => "石井街道", "code" => "220211003000"},
      %{"name" => "沿丰街道", "code" => "220211004000"},
      %{"name" => "丰满街道", "code" => "220211005000"},
      %{"name" => "建华街道", "code" => "220211008000"},
      %{"name" => "红旗街道", "code" => "220211071000"},
      %{"name" => "旺起镇", "code" => "220211100000"},
      %{"name" => "江南乡", "code" => "220211200000"},
      %{"name" => "前二道乡", "code" => "220211201000"},
      %{"name" => "小白山乡", "code" => "220211270000"}
    ]

  def next(input) when input == "船营区" or input == "220204",
    do: [
      %{"name" => "德胜街道", "code" => "220204001000"},
      %{"name" => "南京街道", "code" => "220204002000"},
      %{"name" => "大东街道", "code" => "220204003000"},
      %{"name" => "青岛街道", "code" => "220204004000"},
      %{"name" => "向阳街道", "code" => "220204005000"},
      %{"name" => "北极街道", "code" => "220204006000"},
      %{"name" => "致和街道", "code" => "220204007000"},
      %{"name" => "长春路街道", "code" => "220204008000"},
      %{"name" => "临江街道", "code" => "220204009000"},
      %{"name" => "北山街道", "code" => "220204010000"},
      %{"name" => "黄旗街道", "code" => "220204011000"},
      %{"name" => "大绥河镇", "code" => "220204100000"},
      %{"name" => "搜登站镇", "code" => "220204101000"},
      %{"name" => "越北镇", "code" => "220204102000"},
      %{"name" => "欢喜乡", "code" => "220204200000"},
      %{"name" => "吉林船营经济开发区", "code" => "220204400000"}
    ]

  def next(input) when input == "龙潭区" or input == "220203",
    do: [
      %{"name" => "龙华街道", "code" => "220203001000"},
      %{"name" => "湘潭街道", "code" => "220203002000"},
      %{"name" => "铁东街道", "code" => "220203003000"},
      %{"name" => "泡子沿街道", "code" => "220203004000"},
      %{"name" => "龙潭街道", "code" => "220203005000"},
      %{"name" => "新吉林街道", "code" => "220203006000"},
      %{"name" => "山前街道", "code" => "220203007000"},
      %{"name" => "新安街道", "code" => "220203008000"},
      %{"name" => "遵义街道", "code" => "220203009000"},
      %{"name" => "榆树街道", "code" => "220203010000"},
      %{"name" => "东城街道", "code" => "220203012000"},
      %{"name" => "承德街道", "code" => "220203013000"},
      %{"name" => "靠山街道", "code" => "220203014000"},
      %{"name" => "乌拉街镇", "code" => "220203100000"},
      %{"name" => "缸窑镇", "code" => "220203101000"},
      %{"name" => "江密峰镇", "code" => "220203102000"},
      %{"name" => "大口钦镇", "code" => "220203103000"},
      %{"name" => "金珠镇", "code" => "220203104000"},
      %{"name" => "江北乡", "code" => "220203200000"},
      %{"name" => "龙潭经济开发区", "code" => "220203400000"},
      %{"name" => "金珠工业区", "code" => "220203401000"}
    ]

  def next(input) when input == "昌邑区" or input == "220202",
    do: [
      %{"name" => "兴华街道", "code" => "220202001000"},
      %{"name" => "文庙街道", "code" => "220202002000"},
      %{"name" => "东局子街道", "code" => "220202003000"},
      %{"name" => "新地号街道", "code" => "220202004000"},
      %{"name" => "延安街道", "code" => "220202005000"},
      %{"name" => "站前街道", "code" => "220202006000"},
      %{"name" => "民主街道", "code" => "220202007000"},
      %{"name" => "莲花街道", "code" => "220202008000"},
      %{"name" => "通江街道", "code" => "220202009000"},
      %{"name" => "哈达湾街道", "code" => "220202010000"},
      %{"name" => "新建街道", "code" => "220202011000"},
      %{"name" => "延江街道", "code" => "220202012000"},
      %{"name" => "孤店子镇", "code" => "220202100000"},
      %{"name" => "桦皮厂镇", "code" => "220202101000"},
      %{"name" => "左家镇", "code" => "220202102000"},
      %{"name" => "两家子满族乡", "code" => "220202200000"},
      %{"name" => "土城子满族朝鲜族乡", "code" => "220202201000"},
      %{"name" => "幸福开发区", "code" => "220202401000"},
      %{"name" => "哈达湾经济开发区", "code" => "220202402000"}
    ]

  def next(input) when input == "公主岭市" or input == "220184",
    do: [
      %{"name" => "河南街道", "code" => "220184001000"},
      %{"name" => "河北街道", "code" => "220184002000"},
      %{"name" => "东三街道", "code" => "220184003000"},
      %{"name" => "岭东街道", "code" => "220184004000"},
      %{"name" => "铁北街道", "code" => "220184005000"},
      %{"name" => "岭西街道", "code" => "220184006000"},
      %{"name" => "刘房子街道", "code" => "220184007000"},
      %{"name" => "南崴子街道", "code" => "220184008000"},
      %{"name" => "环岭街道", "code" => "220184009000"},
      %{"name" => "苇子沟街道", "code" => "220184010000"},
      %{"name" => "二十家子镇", "code" => "220184100000"},
      %{"name" => "黑林子镇", "code" => "220184101000"},
      %{"name" => "陶家屯镇", "code" => "220184102000"},
      %{"name" => "范家屯镇", "code" => "220184103000"},
      %{"name" => "响水镇", "code" => "220184104000"},
      %{"name" => "大岭镇", "code" => "220184105000"},
      %{"name" => "怀德镇", "code" => "220184106000"},
      %{"name" => "双城堡镇", "code" => "220184107000"},
      %{"name" => "双龙镇", "code" => "220184108000"},
      %{"name" => "杨大城子镇", "code" => "220184109000"},
      %{"name" => "毛城子镇", "code" => "220184110000"},
      %{"name" => "玻璃城子镇", "code" => "220184111000"},
      %{"name" => "朝阳坡镇", "code" => "220184112000"},
      %{"name" => "大榆树镇", "code" => "220184113000"},
      %{"name" => "秦家屯镇", "code" => "220184114000"},
      %{"name" => "八屋镇", "code" => "220184115000"},
      %{"name" => "十屋镇", "code" => "220184116000"},
      %{"name" => "桑树台镇", "code" => "220184117000"},
      %{"name" => "龙山乡", "code" => "220184200000"},
      %{"name" => "永发乡", "code" => "220184201000"},
      %{"name" => "省原种繁殖场", "code" => "220184400000"},
      %{"name" => "四平农科院", "code" => "220184401000"},
      %{"name" => "公主岭市种猪场", "code" => "220184402000"},
      %{"name" => "十屋种牛场", "code" => "220184404000"},
      %{"name" => "创业农场", "code" => "220184405000"},
      %{"name" => "范家屯经济开发区", "code" => "220184407000"}
    ]

  def next(input) when input == "德惠市" or input == "220183",
    do: [
      %{"name" => "胜利街道", "code" => "220183001000"},
      %{"name" => "建设街道", "code" => "220183002000"},
      %{"name" => "惠发街道", "code" => "220183003000"},
      %{"name" => "夏家店街道", "code" => "220183004000"},
      %{"name" => "大青嘴镇", "code" => "220183100000"},
      %{"name" => "郭家镇", "code" => "220183101000"},
      %{"name" => "松花江镇", "code" => "220183102000"},
      %{"name" => "达家沟镇", "code" => "220183103000"},
      %{"name" => "大房身镇", "code" => "220183104000"},
      %{"name" => "岔路口镇", "code" => "220183105000"},
      %{"name" => "朱城子镇", "code" => "220183106000"},
      %{"name" => "布海镇", "code" => "220183107000"},
      %{"name" => "天台镇", "code" => "220183108000"},
      %{"name" => "菜园子镇", "code" => "220183109000"},
      %{"name" => "同太乡", "code" => "220183200000"},
      %{"name" => "边岗乡", "code" => "220183201000"},
      %{"name" => "五台乡", "code" => "220183202000"},
      %{"name" => "朝阳乡", "code" => "220183203000"}
    ]

  def next(input) when input == "榆树市" or input == "220182",
    do: [
      %{"name" => "华昌街道", "code" => "220182001000"},
      %{"name" => "正阳街道", "code" => "220182002000"},
      %{"name" => "培英街道", "code" => "220182003000"},
      %{"name" => "城郊街道", "code" => "220182004000"},
      %{"name" => "五棵树镇", "code" => "220182100000"},
      %{"name" => "弓棚镇", "code" => "220182101000"},
      %{"name" => "闵家镇", "code" => "220182102000"},
      %{"name" => "大坡镇", "code" => "220182103000"},
      %{"name" => "黑林镇", "code" => "220182104000"},
      %{"name" => "土桥镇", "code" => "220182105000"},
      %{"name" => "新立镇", "code" => "220182106000"},
      %{"name" => "大岭镇", "code" => "220182107000"},
      %{"name" => "于家镇", "code" => "220182108000"},
      %{"name" => "泗河镇", "code" => "220182109000"},
      %{"name" => "八号镇", "code" => "220182110000"},
      %{"name" => "刘家镇", "code" => "220182111000"},
      %{"name" => "秀水镇", "code" => "220182112000"},
      %{"name" => "保寿镇", "code" => "220182113000"},
      %{"name" => "新庄镇", "code" => "220182114000"},
      %{"name" => "育民乡", "code" => "220182200000"},
      %{"name" => "红星乡", "code" => "220182201000"},
      %{"name" => "太安乡", "code" => "220182202000"},
      %{"name" => "先峰乡", "code" => "220182203000"},
      %{"name" => "青山乡", "code" => "220182204000"},
      %{"name" => "延和朝鲜族乡", "code" => "220182205000"},
      %{"name" => "恩育乡", "code" => "220182206000"},
      %{"name" => "城发乡", "code" => "220182207000"},
      %{"name" => "环城乡", "code" => "220182208000"}
    ]

  def next(input) when input == "长春汽车经济技术开发区" or input == "220174",
    do: [
      %{"name" => "锦程街道", "code" => "220174001000"},
      %{"name" => "东风街道", "code" => "220174002000"},
      %{"name" => "富民街道", "code" => "220174003000"},
      %{"name" => "前程街道", "code" => "220174004000"},
      %{"name" => "广兴街道", "code" => "220174005000"},
      %{"name" => "锦绣街道", "code" => "220174006000"}
    ]

  def next(input) when input == "长春高新技术产业开发区" or input == "220173",
    do: [
      %{"name" => "硅谷街道", "code" => "220173001000"},
      %{"name" => "北湖街道", "code" => "220173002000"},
      %{"name" => "超越街道", "code" => "220173003000"},
      %{"name" => "飞跃街道", "code" => "220173004000"},
      %{"name" => "双德街道", "code" => "220173005000"},
      %{"name" => "奋进乡", "code" => "220173200000"}
    ]

  def next(input) when input == "长春净月高新技术产业开发区" or input == "220172",
    do: [
      %{"name" => "永兴街道", "code" => "220172001000"},
      %{"name" => "净月街道", "code" => "220172002000"},
      %{"name" => "福祉街道", "code" => "220172003000"},
      %{"name" => "德正街道", "code" => "220172004000"},
      %{"name" => "彩织街道", "code" => "220172005000"},
      %{"name" => "德容街道", "code" => "220172006000"},
      %{"name" => "博硕街道", "code" => "220172007000"},
      %{"name" => "德馨街道", "code" => "220172008000"},
      %{"name" => "永顺街道", "code" => "220172009000"},
      %{"name" => "新立城镇", "code" => "220172100000"},
      %{"name" => "新湖镇", "code" => "220172101000"},
      %{"name" => "玉潭镇", "code" => "220172102000"}
    ]

  def next(input) when input == "长春经济技术开发区" or input == "220171",
    do: [
      %{"name" => "临河街道", "code" => "220171001000"},
      %{"name" => "东方广场街道", "code" => "220171002000"},
      %{"name" => "会展街道", "code" => "220171003000"},
      %{"name" => "世纪街道", "code" => "220171004000"},
      %{"name" => "兴隆山镇", "code" => "220171100000"}
    ]

  def next(input) when input == "农安县" or input == "220122",
    do: [
      %{"name" => "兴农街道", "code" => "220122001000"},
      %{"name" => "宝塔街道", "code" => "220122002000"},
      %{"name" => "和谐街道", "code" => "220122003000"},
      %{"name" => "黄龙街道", "code" => "220122004000"},
      %{"name" => "农安镇", "code" => "220122100000"},
      %{"name" => "伏龙泉镇", "code" => "220122101000"},
      %{"name" => "哈拉海镇", "code" => "220122102000"},
      %{"name" => "靠山镇", "code" => "220122103000"},
      %{"name" => "开安镇", "code" => "220122104000"},
      %{"name" => "烧锅镇", "code" => "220122105000"},
      %{"name" => "高家店镇", "code" => "220122106000"},
      %{"name" => "华家镇", "code" => "220122107000"},
      %{"name" => "三盛玉镇", "code" => "220122108000"},
      %{"name" => "巴吉垒镇", "code" => "220122109000"},
      %{"name" => "三岗镇", "code" => "220122110000"},
      %{"name" => "前岗乡", "code" => "220122200000"},
      %{"name" => "龙王乡", "code" => "220122201000"},
      %{"name" => "万顺乡", "code" => "220122203000"},
      %{"name" => "杨树林乡", "code" => "220122204000"},
      %{"name" => "永安乡", "code" => "220122205000"},
      %{"name" => "青山口乡", "code" => "220122206000"},
      %{"name" => "黄鱼圈乡", "code" => "220122207000"},
      %{"name" => "新农乡", "code" => "220122208000"},
      %{"name" => "万金塔乡", "code" => "220122209000"},
      %{"name" => "小城子乡", "code" => "220122210000"},
      %{"name" => "洼中高农场", "code" => "220122400000"}
    ]

  def next(input) when input == "九台区" or input == "220113",
    do: [
      %{"name" => "九台街道", "code" => "220113001000"},
      %{"name" => "营城街道", "code" => "220113002000"},
      %{"name" => "九郊街道", "code" => "220113003000"},
      %{"name" => "西营城街道", "code" => "220113004000"},
      %{"name" => "土们岭街道", "code" => "220113005000"},
      %{"name" => "苇子沟街道", "code" => "220113006000"},
      %{"name" => "兴隆街道", "code" => "220113007000"},
      %{"name" => "纪家街道", "code" => "220113008000"},
      %{"name" => "波泥河街道", "code" => "220113009000"},
      %{"name" => "卡伦湖街道", "code" => "220113010000"},
      %{"name" => "东湖街道", "code" => "220113011000"},
      %{"name" => "龙嘉街道", "code" => "220113012000"},
      %{"name" => "兴港街道", "code" => "220113013000"},
      %{"name" => "沐石河街道", "code" => "220113014000"},
      %{"name" => "城子街街道", "code" => "220113015000"},
      %{"name" => "南山街道", "code" => "220113016000"},
      %{"name" => "其塔木镇", "code" => "220113102000"},
      %{"name" => "上河湾镇", "code" => "220113103000"},
      %{"name" => "胡家回族乡", "code" => "220113200000"},
      %{"name" => "莽卡满族乡", "code" => "220113201000"}
    ]

  def next(input) when input == "双阳区" or input == "220112",
    do: [
      %{"name" => "云山街道", "code" => "220112001000"},
      %{"name" => "平湖街道", "code" => "220112002000"},
      %{"name" => "奢岭街道", "code" => "220112003000"},
      %{"name" => "山河街道", "code" => "220112004000"},
      %{"name" => "鹿乡镇", "code" => "220112102000"},
      %{"name" => "齐家镇", "code" => "220112104000"},
      %{"name" => "太平镇", "code" => "220112105000"},
      %{"name" => "双营子回族乡", "code" => "220112203000"}
    ]

  def next(input) when input == "绿园区" or input == "220106",
    do: [
      %{"name" => "正阳街道", "code" => "220106001000"},
      %{"name" => "春城街道", "code" => "220106003000"},
      %{"name" => "青年路街道", "code" => "220106005000"},
      %{"name" => "普阳街道", "code" => "220106006000"},
      %{"name" => "铁西街道", "code" => "220106007000"},
      %{"name" => "林园街道", "code" => "220106010000"},
      %{"name" => "同心街道", "code" => "220106011000"},
      %{"name" => "迎宾街道", "code" => "220106012000"},
      %{"name" => "自立街道", "code" => "220106013000"},
      %{"name" => "合心镇", "code" => "220106100000"},
      %{"name" => "西新镇", "code" => "220106101000"},
      %{"name" => "城西镇", "code" => "220106102000"},
      %{"name" => "绿园经济开发区", "code" => "220106400000"},
      %{"name" => "皓月产业园区", "code" => "220106401000"}
    ]

  def next(input) when input == "二道区" or input == "220105",
    do: [
      %{"name" => "东盛街道", "code" => "220105001000"},
      %{"name" => "吉林街道", "code" => "220105002000"},
      %{"name" => "荣光街道", "code" => "220105003000"},
      %{"name" => "东站街道", "code" => "220105004000"},
      %{"name" => "远达街道", "code" => "220105005000"},
      %{"name" => "八里堡街道", "code" => "220105006000"},
      %{"name" => "长青街道", "code" => "220105007000"},
      %{"name" => "东惠街道", "code" => "220105010000"},
      %{"name" => "英俊镇", "code" => "220105100000"},
      %{"name" => "劝农山镇", "code" => "220105173000"},
      %{"name" => "泉眼镇", "code" => "220105174000"},
      %{"name" => "四家乡", "code" => "220105270000"}
    ]

  def next(input) when input == "朝阳区" or input == "220104",
    do: [
      %{"name" => "前进街道", "code" => "220104001000"},
      %{"name" => "桂林街道", "code" => "220104002000"},
      %{"name" => "南湖街道", "code" => "220104003000"},
      %{"name" => "永昌街道", "code" => "220104004000"},
      %{"name" => "重庆街道", "code" => "220104005000"},
      %{"name" => "清和街道", "code" => "220104006000"},
      %{"name" => "红旗街道", "code" => "220104007000"},
      %{"name" => "湖西街道", "code" => "220104008000"},
      %{"name" => "富锋街道", "code" => "220104009000"},
      %{"name" => "乐山镇", "code" => "220104100000"},
      %{"name" => "永春镇", "code" => "220104101000"}
    ]

  def next(input) when input == "宽城区" or input == "220103",
    do: [
      %{"name" => "站前街道", "code" => "220103002000"},
      %{"name" => "群英街道", "code" => "220103005000"},
      %{"name" => "兴业街道", "code" => "220103006000"},
      %{"name" => "凯旋街道", "code" => "220103007000"},
      %{"name" => "团山街道", "code" => "220103008000"},
      %{"name" => "柳影街道", "code" => "220103009000"},
      %{"name" => "欣园街道", "code" => "220103010000"},
      %{"name" => "长德街道", "code" => "220103011000"},
      %{"name" => "新广街道", "code" => "220103013000"},
      %{"name" => "新隆街道", "code" => "220103014000"},
      %{"name" => "长新街道", "code" => "220103015000"},
      %{"name" => "兰家镇", "code" => "220103100000"},
      %{"name" => "米沙子镇", "code" => "220103101000"},
      %{"name" => "万宝镇", "code" => "220103102000"},
      %{"name" => "合隆镇", "code" => "220103171000"}
    ]

  def next(input) when input == "南关区" or input == "220102",
    do: [
      %{"name" => "南岭街道", "code" => "220102001000"},
      %{"name" => "自强街道", "code" => "220102002000"},
      %{"name" => "民康街道", "code" => "220102003000"},
      %{"name" => "新春街道", "code" => "220102004000"},
      %{"name" => "长通街道", "code" => "220102005000"},
      %{"name" => "全安街道", "code" => "220102006000"},
      %{"name" => "曙光街道", "code" => "220102007000"},
      %{"name" => "永吉街道", "code" => "220102008000"},
      %{"name" => "桃源街道", "code" => "220102009000"},
      %{"name" => "鸿城街道", "code" => "220102010000"},
      %{"name" => "明珠街道", "code" => "220102011000"},
      %{"name" => "富裕街道", "code" => "220102012000"},
      %{"name" => "盛世街道", "code" => "220102013000"},
      %{"name" => "幸福乡", "code" => "220102200000"}
    ]

  def next(_), do: nil
end