defmodule ChinaAdminDivisions.Gen.Lv3x.M23 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "漠河市" or input == "232701",
    do: [
      %{"name" => "西林吉镇", "code" => "232701100000"},
      %{"name" => "图强镇", "code" => "232701101000"},
      %{"name" => "阿木尔镇", "code" => "232701102000"},
      %{"name" => "兴安镇", "code" => "232701103000"},
      %{"name" => "北极镇", "code" => "232701104000"},
      %{"name" => "古莲镇", "code" => "232701105000"}
    ]

  def next(input) when input == "呼玛县" or input == "232721",
    do: [
      %{"name" => "呼玛镇", "code" => "232721100000"},
      %{"name" => "韩家园镇", "code" => "232721101000"},
      %{"name" => "三卡乡", "code" => "232721200000"},
      %{"name" => "金山乡", "code" => "232721201000"},
      %{"name" => "兴华乡", "code" => "232721202000"},
      %{"name" => "鸥浦乡", "code" => "232721203000"},
      %{"name" => "白银纳鄂伦春族民族乡", "code" => "232721204000"},
      %{"name" => "北疆乡", "code" => "232721205000"}
    ]

  def next(input) when input == "塔河县" or input == "232722",
    do: [
      %{"name" => "塔河镇", "code" => "232722100000"},
      %{"name" => "瓦拉干镇", "code" => "232722101000"},
      %{"name" => "盘古镇", "code" => "232722102000"},
      %{"name" => "古驿镇", "code" => "232722103000"},
      %{"name" => "开库康镇", "code" => "232722104000"},
      %{"name" => "十八站鄂伦春族乡", "code" => "232722200000"},
      %{"name" => "依西肯乡", "code" => "232722201000"}
    ]

  def next(input) when input == "加格达奇区" or input == "232761",
    do: [
      %{"name" => "卫东街道", "code" => "232761002000"},
      %{"name" => "红旗街道", "code" => "232761003000"},
      %{"name" => "曙光街道", "code" => "232761005000"},
      %{"name" => "光明街道", "code" => "232761006000"},
      %{"name" => "东山镇", "code" => "232761100000"},
      %{"name" => "长虹镇", "code" => "232761101000"},
      %{"name" => "加北乡", "code" => "232761200000"},
      %{"name" => "白桦乡", "code" => "232761201000"}
    ]

  def next(input) when input == "松岭区" or input == "232762",
    do: [
      %{"name" => "小扬气镇", "code" => "232762100000"},
      %{"name" => "劲松镇", "code" => "232762101000"},
      %{"name" => "古源镇", "code" => "232762102000"}
    ]

  def next(input) when input == "新林区" or input == "232763",
    do: [
      %{"name" => "新林镇", "code" => "232763100000"},
      %{"name" => "翠岗镇", "code" => "232763101000"},
      %{"name" => "塔源镇", "code" => "232763102000"},
      %{"name" => "大乌苏镇", "code" => "232763103000"},
      %{"name" => "塔尔根镇", "code" => "232763104000"},
      %{"name" => "碧洲镇", "code" => "232763105000"},
      %{"name" => "宏图镇", "code" => "232763106000"}
    ]

  def next(input) when input == "呼中区" or input == "232764",
    do: [
      %{"name" => "呼中镇", "code" => "232764100000"},
      %{"name" => "碧水镇", "code" => "232764101000"},
      %{"name" => "呼源镇", "code" => "232764102000"},
      %{"name" => "宏伟镇", "code" => "232764103000"}
    ]

  def next(input) when input == "北林区" or input == "231202",
    do: [
      %{"name" => "紫来街道", "code" => "231202001000"},
      %{"name" => "爱路街道", "code" => "231202002000"},
      %{"name" => "大有街道", "code" => "231202003000"},
      %{"name" => "吉泰街道", "code" => "231202004000"},
      %{"name" => "东兴街道", "code" => "231202005000"},
      %{"name" => "北林街道", "code" => "231202006000"},
      %{"name" => "朝旭街道", "code" => "231202007000"},
      %{"name" => "春雷街道", "code" => "231202008000"},
      %{"name" => "北辰街道", "code" => "231202009000"},
      %{"name" => "康庄街道", "code" => "231202010000"},
      %{"name" => "先锋街道", "code" => "231202011000"},
      %{"name" => "东城街道", "code" => "231202012000"},
      %{"name" => "宝山镇", "code" => "231202101000"},
      %{"name" => "绥胜满族镇", "code" => "231202102000"},
      %{"name" => "西长发镇", "code" => "231202103000"},
      %{"name" => "永安满族镇", "code" => "231202104000"},
      %{"name" => "太平川镇", "code" => "231202105000"},
      %{"name" => "秦家镇", "code" => "231202106000"},
      %{"name" => "双河镇", "code" => "231202107000"},
      %{"name" => "三河镇", "code" => "231202108000"},
      %{"name" => "四方台镇", "code" => "231202109000"},
      %{"name" => "津河镇", "code" => "231202110000"},
      %{"name" => "张维镇", "code" => "231202111000"},
      %{"name" => "东津镇", "code" => "231202113000"},
      %{"name" => "东富镇", "code" => "231202114000"},
      %{"name" => "兴福镇", "code" => "231202115000"},
      %{"name" => "三井镇", "code" => "231202116000"},
      %{"name" => "红旗满族乡", "code" => "231202201000"},
      %{"name" => "连岗乡", "code" => "231202202000"},
      %{"name" => "新华乡", "code" => "231202203000"},
      %{"name" => "五营乡", "code" => "231202212000"},
      %{"name" => "兴和朝鲜族乡", "code" => "231202213000"},
      %{"name" => "绥化局直", "code" => "231202579000"}
    ]

  def next(input) when input == "望奎县" or input == "231221",
    do: [
      %{"name" => "东风街道", "code" => "231221001000"},
      %{"name" => "前进街道", "code" => "231221002000"},
      %{"name" => "东胜街道", "code" => "231221003000"},
      %{"name" => "兴安街道", "code" => "231221004000"},
      %{"name" => "望奎镇", "code" => "231221100000"},
      %{"name" => "通江镇", "code" => "231221101000"},
      %{"name" => "卫星镇", "code" => "231221102000"},
      %{"name" => "海丰镇", "code" => "231221103000"},
      %{"name" => "莲花镇", "code" => "231221104000"},
      %{"name" => "惠七满族镇", "code" => "231221105000"},
      %{"name" => "先锋镇", "code" => "231221106000"},
      %{"name" => "火箭镇", "code" => "231221107000"},
      %{"name" => "东郊镇", "code" => "231221108000"},
      %{"name" => "灯塔镇", "code" => "231221109000"},
      %{"name" => "灵山满族乡", "code" => "231221202000"},
      %{"name" => "后三乡", "code" => "231221203000"},
      %{"name" => "东升乡", "code" => "231221209000"},
      %{"name" => "恭六乡", "code" => "231221210000"},
      %{"name" => "厢白满族乡", "code" => "231221211000"},
      %{"name" => "白四林场", "code" => "231221400000"},
      %{"name" => "种畜场", "code" => "231221580000"},
      %{"name" => "第一良种场", "code" => "231221581000"},
      %{"name" => "第二良种场", "code" => "231221582000"}
    ]

  def next(input) when input == "兰西县" or input == "231222",
    do: [
      %{"name" => "颜河街道", "code" => "231222001000"},
      %{"name" => "顺达街道", "code" => "231222002000"},
      %{"name" => "兰亚街道", "code" => "231222003000"},
      %{"name" => "正阳街道", "code" => "231222004000"},
      %{"name" => "兰西镇", "code" => "231222101000"},
      %{"name" => "榆林镇", "code" => "231222102000"},
      %{"name" => "临江镇", "code" => "231222103000"},
      %{"name" => "平山镇", "code" => "231222104000"},
      %{"name" => "红光镇", "code" => "231222105000"},
      %{"name" => "远大镇", "code" => "231222106000"},
      %{"name" => "康荣镇", "code" => "231222107000"},
      %{"name" => "燎原镇", "code" => "231222108000"},
      %{"name" => "奋斗镇", "code" => "231222109000"},
      %{"name" => "北安乡", "code" => "231222202000"},
      %{"name" => "长江乡", "code" => "231222203000"},
      %{"name" => "兰河乡", "code" => "231222204000"},
      %{"name" => "红星乡", "code" => "231222205000"},
      %{"name" => "长岗乡", "code" => "231222207000"},
      %{"name" => "星火乡", "code" => "231222210000"},
      %{"name" => "原种示范服务中心", "code" => "231222580000"},
      %{"name" => "畜牧技术推广服务中心", "code" => "231222582000"}
    ]

  def next(input) when input == "青冈县" or input == "231223",
    do: [
      %{"name" => "北城街道", "code" => "231223001000"},
      %{"name" => "西城街道", "code" => "231223002000"},
      %{"name" => "靖城街道", "code" => "231223003000"},
      %{"name" => "东城街道", "code" => "231223004000"},
      %{"name" => "青冈镇", "code" => "231223100000"},
      %{"name" => "中和镇", "code" => "231223101000"},
      %{"name" => "祯祥镇", "code" => "231223102000"},
      %{"name" => "兴华镇", "code" => "231223103000"},
      %{"name" => "永丰镇", "code" => "231223104000"},
      %{"name" => "芦河镇", "code" => "231223105000"},
      %{"name" => "民政镇", "code" => "231223106000"},
      %{"name" => "柞岗镇", "code" => "231223107000"},
      %{"name" => "劳动镇", "code" => "231223108000"},
      %{"name" => "迎春镇", "code" => "231223109000"},
      %{"name" => "德胜镇", "code" => "231223110000"},
      %{"name" => "昌盛镇", "code" => "231223111000"},
      %{"name" => "建设乡", "code" => "231223202000"},
      %{"name" => "新村乡", "code" => "231223203000"},
      %{"name" => "连丰乡", "code" => "231223212000"},
      %{"name" => "青冈县林场", "code" => "231223400000"},
      %{"name" => "青冈县互利营林站", "code" => "231223401000"},
      %{"name" => "青冈县果树场", "code" => "231223402000"},
      %{"name" => "青冈县种马场", "code" => "231223580000"},
      %{"name" => "青冈县种羊场", "code" => "231223581000"},
      %{"name" => "青冈县原种场", "code" => "231223582000"}
    ]

  def next(input) when input == "庆安县" or input == "231224",
    do: [
      %{"name" => "吉康街道", "code" => "231224001000"},
      %{"name" => "庆瑞街道", "code" => "231224002000"},
      %{"name" => "平顺街道", "code" => "231224003000"},
      %{"name" => "安泰街道", "code" => "231224004000"},
      %{"name" => "庆安镇", "code" => "231224101000"},
      %{"name" => "民乐镇", "code" => "231224102000"},
      %{"name" => "大罗镇", "code" => "231224103000"},
      %{"name" => "平安镇", "code" => "231224104000"},
      %{"name" => "勤劳镇", "code" => "231224105000"},
      %{"name" => "久胜镇", "code" => "231224106000"},
      %{"name" => "同乐镇", "code" => "231224107000"},
      %{"name" => "柳河镇", "code" => "231224108000"},
      %{"name" => "建民乡", "code" => "231224201000"},
      %{"name" => "巨宝山乡", "code" => "231224202000"},
      %{"name" => "丰收乡", "code" => "231224206000"},
      %{"name" => "发展乡", "code" => "231224208000"},
      %{"name" => "致富乡", "code" => "231224210000"},
      %{"name" => "欢胜乡", "code" => "231224211000"},
      %{"name" => "国有林场管理局", "code" => "231224400000"},
      %{"name" => "庆柳社区管理委员会", "code" => "231224500000"}
    ]

  def next(input) when input == "明水县" or input == "231225",
    do: [
      %{"name" => "明阳街道", "code" => "231225001000"},
      %{"name" => "明源街道", "code" => "231225002000"},
      %{"name" => "明新街道", "code" => "231225003000"},
      %{"name" => "明泉街道", "code" => "231225004000"},
      %{"name" => "明水镇", "code" => "231225100000"},
      %{"name" => "兴仁镇", "code" => "231225101000"},
      %{"name" => "永兴镇", "code" => "231225102000"},
      %{"name" => "崇德镇", "code" => "231225103000"},
      %{"name" => "通达镇", "code" => "231225104000"},
      %{"name" => "双兴镇", "code" => "231225106000"},
      %{"name" => "永久乡", "code" => "231225203000"},
      %{"name" => "树人乡", "code" => "231225204000"},
      %{"name" => "光荣乡", "code" => "231225205000"},
      %{"name" => "繁荣乡", "code" => "231225206000"},
      %{"name" => "通泉乡", "code" => "231225207000"},
      %{"name" => "育林乡", "code" => "231225208000"},
      %{"name" => "国营林场", "code" => "231225400000"},
      %{"name" => "县联社马场", "code" => "231225580000"},
      %{"name" => "明水种畜场", "code" => "231225581000"},
      %{"name" => "育林畜牧场", "code" => "231225582000"},
      %{"name" => "国营第一良种", "code" => "231225583000"},
      %{"name" => "国营第二良种", "code" => "231225584000"},
      %{"name" => "国营第三良种", "code" => "231225585000"}
    ]

  def next(input) when input == "绥棱县" or input == "231226",
    do: [
      %{"name" => "车站街道", "code" => "231226001000"},
      %{"name" => "建设街道", "code" => "231226002000"},
      %{"name" => "西北街道", "code" => "231226003000"},
      %{"name" => "东南街道", "code" => "231226004000"},
      %{"name" => "绥棱镇", "code" => "231226100000"},
      %{"name" => "上集镇", "code" => "231226101000"},
      %{"name" => "四海店镇", "code" => "231226102000"},
      %{"name" => "双岔河镇", "code" => "231226103000"},
      %{"name" => "阁山镇", "code" => "231226104000"},
      %{"name" => "长山镇", "code" => "231226105000"},
      %{"name" => "靠山乡", "code" => "231226200000"},
      %{"name" => "后头乡", "code" => "231226201000"},
      %{"name" => "克音河乡", "code" => "231226205000"},
      %{"name" => "绥中乡", "code" => "231226206000"},
      %{"name" => "泥尔河乡", "code" => "231226207000"},
      %{"name" => "绥棱县国有林场阁山林场", "code" => "231226400000"},
      %{"name" => "绥棱县国有林场四海店林场", "code" => "231226401000"},
      %{"name" => "绥棱县国有林场三吉台林场", "code" => "231226402000"},
      %{"name" => "绥棱县国有林场半截河林场", "code" => "231226403000"},
      %{"name" => "黑龙江省绥棱林业局有限公司", "code" => "231226404000"},
      %{"name" => "黑龙江北大荒农垦集团绥棱农场有限公司", "code" => "231226500000"},
      %{"name" => "种马场", "code" => "231226580000"},
      %{"name" => "良种场", "code" => "231226581000"},
      %{"name" => "绥棱县猪场", "code" => "231226582000"}
    ]

  def next(input) when input == "安达市" or input == "231281",
    do: [
      %{"name" => "铁西街道", "code" => "231281001000"},
      %{"name" => "新兴街道", "code" => "231281002000"},
      %{"name" => "安虹街道", "code" => "231281003000"},
      %{"name" => "东城街道", "code" => "231281004000"},
      %{"name" => "安达镇", "code" => "231281100000"},
      %{"name" => "任民镇", "code" => "231281101000"},
      %{"name" => "万宝山镇", "code" => "231281103000"},
      %{"name" => "昌德镇", "code" => "231281104000"},
      %{"name" => "升平镇", "code" => "231281105000"},
      %{"name" => "羊草镇", "code" => "231281106000"},
      %{"name" => "老虎岗镇", "code" => "231281107000"},
      %{"name" => "中本镇", "code" => "231281108000"},
      %{"name" => "太平庄镇", "code" => "231281109000"},
      %{"name" => "吉兴岗镇", "code" => "231281110000"},
      %{"name" => "卧里屯镇", "code" => "231281111000"},
      %{"name" => "火石山镇", "code" => "231281112000"},
      %{"name" => "古大湖镇", "code" => "231281113000"},
      %{"name" => "先源乡", "code" => "231281209000"},
      %{"name" => "安达畜牧场", "code" => "231281500000"},
      %{"name" => "原种场", "code" => "231281581000"},
      %{"name" => "红旗泡水库管理所", "code" => "231281583000"},
      %{"name" => "东湖水库管理站", "code" => "231281584000"}
    ]

  def next(input) when input == "肇东市" or input == "231282",
    do: [
      %{"name" => "朝阳区街道", "code" => "231282001000"},
      %{"name" => "东升区街道", "code" => "231282002000"},
      %{"name" => "西园区街道", "code" => "231282003000"},
      %{"name" => "正阳区街道", "code" => "231282004000"},
      %{"name" => "肇东镇", "code" => "231282100000"},
      %{"name" => "昌五镇", "code" => "231282101000"},
      %{"name" => "宋站镇", "code" => "231282102000"},
      %{"name" => "五站镇", "code" => "231282103000"},
      %{"name" => "尚家镇", "code" => "231282104000"},
      %{"name" => "姜家镇", "code" => "231282105000"},
      %{"name" => "里木店镇", "code" => "231282106000"},
      %{"name" => "四站镇", "code" => "231282107000"},
      %{"name" => "涝洲镇", "code" => "231282108000"},
      %{"name" => "五里明镇", "code" => "231282109000"},
      %{"name" => "黎明镇", "code" => "231282110000"},
      %{"name" => "西八里镇", "code" => "231282111000"},
      %{"name" => "海城镇", "code" => "231282112000"},
      %{"name" => "太平乡", "code" => "231282201000"},
      %{"name" => "向阳乡", "code" => "231282204000"},
      %{"name" => "洪河乡", "code" => "231282205000"},
      %{"name" => "跃进乡", "code" => "231282206000"},
      %{"name" => "德昌乡", "code" => "231282212000"},
      %{"name" => "宣化乡", "code" => "231282213000"},
      %{"name" => "安民乡", "code" => "231282214000"},
      %{"name" => "明久乡", "code" => "231282215000"},
      %{"name" => "四方山农场", "code" => "231282500000"},
      %{"name" => "涝洲鱼种场", "code" => "231282501000"}
    ]

  def next(input) when input == "海伦市" or input == "231283",
    do: [
      %{"name" => "海伦镇", "code" => "231283100000"},
      %{"name" => "海北镇", "code" => "231283101000"},
      %{"name" => "伦河镇", "code" => "231283102000"},
      %{"name" => "共合镇", "code" => "231283103000"},
      %{"name" => "海兴镇", "code" => "231283104000"},
      %{"name" => "祥富镇", "code" => "231283105000"},
      %{"name" => "东风镇", "code" => "231283106000"},
      %{"name" => "百祥镇", "code" => "231283107000"},
      %{"name" => "向荣镇", "code" => "231283108000"},
      %{"name" => "永富镇", "code" => "231283109000"},
      %{"name" => "长发镇", "code" => "231283110000"},
      %{"name" => "联发镇", "code" => "231283111000"},
      %{"name" => "前进镇", "code" => "231283112000"},
      %{"name" => "共荣镇", "code" => "231283113000"},
      %{"name" => "东林镇", "code" => "231283114000"},
      %{"name" => "永和镇", "code" => "231283115000"},
      %{"name" => "海南乡", "code" => "231283208000"},
      %{"name" => "乐业乡", "code" => "231283210000"},
      %{"name" => "福民乡", "code" => "231283211000"},
      %{"name" => "丰山乡", "code" => "231283212000"},
      %{"name" => "爱民乡", "code" => "231283218000"},
      %{"name" => "扎音河乡", "code" => "231283220000"},
      %{"name" => "双录乡", "code" => "231283221000"},
      %{"name" => "海伦市森林资源保护中心", "code" => "231283400000"},
      %{"name" => "东方红水库地区", "code" => "231283401000"},
      %{"name" => "海伦农场", "code" => "231283500000"},
      %{"name" => "红光农场", "code" => "231283501000"},
      %{"name" => "海伦市董家农作物种植场", "code" => "231283581000"},
      %{"name" => "海伦市东方农牧场", "code" => "231283582000"}
    ]

  def next(input) when input == "爱辉区" or input == "231102",
    do: [
      %{"name" => "花园街道", "code" => "231102001000"},
      %{"name" => "兴安街道", "code" => "231102002000"},
      %{"name" => "海兰街道", "code" => "231102003000"},
      %{"name" => "西兴街道", "code" => "231102004000"},
      %{"name" => "西岗子镇", "code" => "231102101000"},
      %{"name" => "瑷珲镇", "code" => "231102102000"},
      %{"name" => "罕达汽镇", "code" => "231102103000"},
      %{"name" => "上马厂镇", "code" => "231102104000"},
      %{"name" => "幸福乡", "code" => "231102200000"},
      %{"name" => "四嘉子乡", "code" => "231102201000"},
      %{"name" => "坤河乡", "code" => "231102202000"},
      %{"name" => "张地营子乡", "code" => "231102204000"},
      %{"name" => "西峰山乡", "code" => "231102205000"},
      %{"name" => "新生乡", "code" => "231102206000"},
      %{"name" => "二站乡", "code" => "231102207000"},
      %{"name" => "大平林场", "code" => "231102407000"},
      %{"name" => "七二七林场", "code" => "231102408000"},
      %{"name" => "望峰林场", "code" => "231102409000"},
      %{"name" => "卡伦山林场", "code" => "231102410000"},
      %{"name" => "胜山林场", "code" => "231102411000"},
      %{"name" => "二站林场", "code" => "231102412000"},
      %{"name" => "三站林场", "code" => "231102413000"},
      %{"name" => "大岭林场", "code" => "231102414000"},
      %{"name" => "桦皮窑林场", "code" => "231102415000"},
      %{"name" => "滨南林场", "code" => "231102416000"},
      %{"name" => "江防林场", "code" => "231102417000"},
      %{"name" => "河南屯林场", "code" => "231102418000"},
      %{"name" => "西岗子试验林场", "code" => "231102421000"},
      %{"name" => "大新屯储木场", "code" => "231102425000"},
      %{"name" => "宋集屯煤矿", "code" => "231102480000"},
      %{"name" => "西岗子煤矿", "code" => "231102481000"},
      %{"name" => "东方红煤矿", "code" => "231102482000"},
      %{"name" => "锦河农场", "code" => "231102500000"},
      %{"name" => "红色边疆农场", "code" => "231102501000"},
      %{"name" => "奶牛场", "code" => "231102580000"},
      %{"name" => "种畜场", "code" => "231102581000"},
      %{"name" => "第二良种场", "code" => "231102582000"},
      %{"name" => "第一良种场", "code" => "231102583000"}
    ]

  def next(input) when input == "逊克县" or input == "231123",
    do: [
      %{"name" => "奇克镇", "code" => "231123100000"},
      %{"name" => "逊河镇", "code" => "231123101000"},
      %{"name" => "克林镇", "code" => "231123103000"},
      %{"name" => "干岔子乡", "code" => "231123201000"},
      %{"name" => "松树沟乡", "code" => "231123202000"},
      %{"name" => "车陆乡", "code" => "231123203000"},
      %{"name" => "新鄂乡", "code" => "231123204000"},
      %{"name" => "新兴乡", "code" => "231123205000"},
      %{"name" => "宝山乡", "code" => "231123207000"},
      %{"name" => "道干林场", "code" => "231123402000"},
      %{"name" => "干岔子林场", "code" => "231123403000"},
      %{"name" => "新立林场", "code" => "231123404000"},
      %{"name" => "三间房林场", "code" => "231123405000"},
      %{"name" => "良种场", "code" => "231123406000"},
      %{"name" => "种畜场", "code" => "231123407000"},
      %{"name" => "逊克农场", "code" => "231123500000"}
    ]

  def next(input) when input == "孙吴县" or input == "231124",
    do: [
      %{"name" => "孙吴镇", "code" => "231124100000"},
      %{"name" => "辰清镇", "code" => "231124101000"},
      %{"name" => "西兴乡", "code" => "231124201000"},
      %{"name" => "沿江满族达斡尔族乡", "code" => "231124202000"},
      %{"name" => "腰屯乡", "code" => "231124203000"},
      %{"name" => "卧牛河乡", "code" => "231124204000"},
      %{"name" => "群山乡", "code" => "231124205000"},
      %{"name" => "奋斗乡", "code" => "231124206000"},
      %{"name" => "红旗乡", "code" => "231124207000"},
      %{"name" => "正阳山乡", "code" => "231124208000"},
      %{"name" => "清溪乡", "code" => "231124210000"},
      %{"name" => "前进林场", "code" => "231124402000"},
      %{"name" => "大河口林场", "code" => "231124403000"},
      %{"name" => "正阳林场", "code" => "231124404000"},
      %{"name" => "平山林场", "code" => "231124405000"},
      %{"name" => "沿江林场", "code" => "231124406000"},
      %{"name" => "辰清林场", "code" => "231124407000"},
      %{"name" => "红旗林场", "code" => "231124408000"},
      %{"name" => "向阳林场", "code" => "231124409000"},
      %{"name" => "良种场", "code" => "231124410000"},
      %{"name" => "种畜场", "code" => "231124411000"}
    ]

  def next(input) when input == "北安市" or input == "231181",
    do: [
      %{"name" => "兆麟街道地区", "code" => "231181001000"},
      %{"name" => "和平街道地区", "code" => "231181002000"},
      %{"name" => "北岗街道地区", "code" => "231181003000"},
      %{"name" => "庆华街道地区", "code" => "231181004000"},
      %{"name" => "铁西街道地区", "code" => "231181005000"},
      %{"name" => "铁南街道地区", "code" => "231181006000"},
      %{"name" => "通北镇", "code" => "231181101000"},
      %{"name" => "赵光镇", "code" => "231181102000"},
      %{"name" => "海星镇", "code" => "231181103000"},
      %{"name" => "石泉镇", "code" => "231181104000"},
      %{"name" => "二井镇", "code" => "231181105000"},
      %{"name" => "城郊乡", "code" => "231181200000"},
      %{"name" => "东胜乡", "code" => "231181201000"},
      %{"name" => "杨家乡", "code" => "231181203000"},
      %{"name" => "主星乡", "code" => "231181207000"},
      %{"name" => "通北林业局", "code" => "231181400000"},
      %{"name" => "北安管理局局直", "code" => "231181500000"},
      %{"name" => "长水河农场", "code" => "231181501000"},
      %{"name" => "赵光农场", "code" => "231181502000"},
      %{"name" => "红星农场", "code" => "231181503000"},
      %{"name" => "建设农场", "code" => "231181504000"}
    ]

  def next(input) when input == "五大连池市" or input == "231182",
    do: [
      %{"name" => "青山街道", "code" => "231182001000"},
      %{"name" => "龙镇", "code" => "231182101000"},
      %{"name" => "和平镇", "code" => "231182102000"},
      %{"name" => "五大连池镇", "code" => "231182103000"},
      %{"name" => "双泉镇", "code" => "231182104000"},
      %{"name" => "新发镇", "code" => "231182105000"},
      %{"name" => "团结镇", "code" => "231182106000"},
      %{"name" => "兴隆镇", "code" => "231182107000"},
      %{"name" => "朝阳山镇", "code" => "231182108000"},
      %{"name" => "建设乡", "code" => "231182203000"},
      %{"name" => "太平乡", "code" => "231182205000"},
      %{"name" => "兴安乡", "code" => "231182208000"},
      %{"name" => "元青山林场", "code" => "231182406000"},
      %{"name" => "三九六林场", "code" => "231182407000"},
      %{"name" => "小兴安林场", "code" => "231182408000"},
      %{"name" => "二龙山林场", "code" => "231182409000"},
      %{"name" => "朝阳林场", "code" => "231182410000"},
      %{"name" => "引龙河林场", "code" => "231182411000"},
      %{"name" => "焦得布林场", "code" => "231182412000"},
      %{"name" => "小孤山林场", "code" => "231182414000"},
      %{"name" => "药泉林场", "code" => "231182415000"},
      %{"name" => "沾河林业局", "code" => "231182417000"},
      %{"name" => "莲花管理委员会", "code" => "231182418000"},
      %{"name" => "二龙山蚕种场", "code" => "231182427000"},
      %{"name" => "畜牧场", "code" => "231182429000"},
      %{"name" => "第二良种场", "code" => "231182430000"},
      %{"name" => "花园劳教所", "code" => "231182480000"},
      %{"name" => "永丰监狱", "code" => "231182481000"},
      %{"name" => "华山监狱", "code" => "231182482000"},
      %{"name" => "凤凰山监狱", "code" => "231182483000"},
      %{"name" => "龙门农场", "code" => "231182501000"},
      %{"name" => "襄河农场", "code" => "231182502000"},
      %{"name" => "龙镇农场", "code" => "231182503000"},
      %{"name" => "二龙山农场", "code" => "231182504000"},
      %{"name" => "引龙河农场", "code" => "231182505000"},
      %{"name" => "尾山农场", "code" => "231182506000"},
      %{"name" => "格球山农场", "code" => "231182507000"},
      %{"name" => "五大连池农场", "code" => "231182508000"}
    ]

  def next(input) when input == "嫩江市" or input == "231183",
    do: [
      %{"name" => "嫩江镇", "code" => "231183100000"},
      %{"name" => "伊拉哈镇", "code" => "231183101000"},
      %{"name" => "双山镇", "code" => "231183102000"},
      %{"name" => "多宝山镇", "code" => "231183103000"},
      %{"name" => "海江镇", "code" => "231183104000"},
      %{"name" => "前进镇", "code" => "231183105000"},
      %{"name" => "长福镇", "code" => "231183106000"},
      %{"name" => "科洛镇", "code" => "231183107000"},
      %{"name" => "霍龙门镇", "code" => "231183108000"},
      %{"name" => "临江乡", "code" => "231183202000"},
      %{"name" => "联兴乡", "code" => "231183206000"},
      %{"name" => "白云乡", "code" => "231183207000"},
      %{"name" => "塔溪乡", "code" => "231183208000"},
      %{"name" => "长江乡", "code" => "231183211000"},
      %{"name" => "多宝山铜矿", "code" => "231183400000"},
      %{"name" => "九三管理局局直", "code" => "231183500000"},
      %{"name" => "鹤山农场", "code" => "231183501000"},
      %{"name" => "大西江农场", "code" => "231183502000"},
      %{"name" => "尖山农场", "code" => "231183503000"},
      %{"name" => "荣军农场", "code" => "231183504000"},
      %{"name" => "七星泡农场", "code" => "231183506000"},
      %{"name" => "嫩江农场", "code" => "231183507000"},
      %{"name" => "山河农场", "code" => "231183508000"},
      %{"name" => "嫩北农场", "code" => "231183509000"},
      %{"name" => "建边农场", "code" => "231183510000"},
      %{"name" => "马铃薯原种繁殖场", "code" => "231183581000"}
    ]

  def next(input) when input == "东安区" or input == "231002",
    do: [
      %{"name" => "新安街道", "code" => "231002001000"},
      %{"name" => "长安街道", "code" => "231002002000"},
      %{"name" => "七星街道", "code" => "231002003000"},
      %{"name" => "五星街道", "code" => "231002004000"},
      %{"name" => "东兴街道", "code" => "231002008000"},
      %{"name" => "振兴街道", "code" => "231002009000"},
      %{"name" => "兴隆镇", "code" => "231002101000"}
    ]

  def next(input) when input == "阳明区" or input == "231003",
    do: [
      %{"name" => "阳明街道", "code" => "231003001000"},
      %{"name" => "前进街道", "code" => "231003002000"},
      %{"name" => "新兴街道", "code" => "231003003000"},
      %{"name" => "桦林橡胶厂街道", "code" => "231003004000"},
      %{"name" => "铁岭镇", "code" => "231003100000"},
      %{"name" => "桦林镇", "code" => "231003101000"},
      %{"name" => "磨刀石镇", "code" => "231003102000"},
      %{"name" => "五林镇", "code" => "231003103000"}
    ]

  def next(input) when input == "爱民区" or input == "231004",
    do: [
      %{"name" => "向阳街道", "code" => "231004001000"},
      %{"name" => "黄花街道", "code" => "231004002000"},
      %{"name" => "铁北街道", "code" => "231004003000"},
      %{"name" => "新华街道", "code" => "231004004000"},
      %{"name" => "大庆街道", "code" => "231004005000"},
      %{"name" => "兴平街道", "code" => "231004006000"},
      %{"name" => "北山街道", "code" => "231004007000"},
      %{"name" => "三道关镇", "code" => "231004100000"}
    ]

  def next(input) when input == "西安区" or input == "231005",
    do: [
      %{"name" => "先锋街道", "code" => "231005001000"},
      %{"name" => "火炬街道", "code" => "231005002000"},
      %{"name" => "立新街道", "code" => "231005003000"},
      %{"name" => "牡丹街道", "code" => "231005004000"},
      %{"name" => "江滨街道", "code" => "231005005000"},
      %{"name" => "沿江街道", "code" => "231005006000"},
      %{"name" => "温春镇", "code" => "231005100000"},
      %{"name" => "海南朝鲜族乡", "code" => "231005201000"}
    ]

  def next(input) when input == "林口县" or input == "231025",
    do: [
      %{"name" => "林口镇", "code" => "231025100000"},
      %{"name" => "古城镇", "code" => "231025101000"},
      %{"name" => "刁翎镇", "code" => "231025102000"},
      %{"name" => "朱家镇", "code" => "231025104000"},
      %{"name" => "柳树镇", "code" => "231025105000"},
      %{"name" => "三道通镇", "code" => "231025106000"},
      %{"name" => "龙爪镇", "code" => "231025107000"},
      %{"name" => "莲花镇", "code" => "231025108000"},
      %{"name" => "青山镇", "code" => "231025110000"},
      %{"name" => "建堂镇", "code" => "231025111000"},
      %{"name" => "奎山镇", "code" => "231025112000"},
      %{"name" => "林口林业局", "code" => "231025400000"}
    ]

  def next(input) when input == "绥芬河市" or input == "231081",
    do: [
      %{"name" => "绥芬河镇", "code" => "231081100000"},
      %{"name" => "阜宁镇", "code" => "231081101000"}
    ]

  def next(input) when input == "海林市" or input == "231083",
    do: [
      %{"name" => "海林镇", "code" => "231083100000"},
      %{"name" => "长汀镇", "code" => "231083101000"},
      %{"name" => "横道镇", "code" => "231083102000"},
      %{"name" => "山市镇", "code" => "231083103000"},
      %{"name" => "柴河镇", "code" => "231083104000"},
      %{"name" => "二道镇", "code" => "231083105000"},
      %{"name" => "新安朝鲜族镇", "code" => "231083106000"},
      %{"name" => "三道镇", "code" => "231083107000"},
      %{"name" => "牡林工程公司街道", "code" => "231083400000"},
      %{"name" => "柴河林机厂街道", "code" => "231083401000"},
      %{"name" => "大海林林业局", "code" => "231083402000"},
      %{"name" => "海林林业局", "code" => "231083403000"},
      %{"name" => "柴河林业局", "code" => "231083404000"},
      %{"name" => "海林农场", "code" => "231083500000"},
      %{"name" => "山市种奶牛场", "code" => "231083501000"}
    ]

  def next(input) when input == "宁安市" or input == "231084",
    do: [
      %{"name" => "城区街道", "code" => "231084001000"},
      %{"name" => "宁安镇", "code" => "231084100000"},
      %{"name" => "东京城镇", "code" => "231084101000"},
      %{"name" => "渤海镇", "code" => "231084102000"},
      %{"name" => "石岩镇", "code" => "231084103000"},
      %{"name" => "沙兰镇", "code" => "231084104000"},
      %{"name" => "海浪镇", "code" => "231084105000"},
      %{"name" => "兰岗镇", "code" => "231084106000"},
      %{"name" => "镜泊镇", "code" => "231084107000"},
      %{"name" => "江南朝鲜族满族乡", "code" => "231084202000"},
      %{"name" => "卧龙朝鲜族乡", "code" => "231084206000"},
      %{"name" => "马河乡", "code" => "231084208000"},
      %{"name" => "三陵乡", "code" => "231084211000"},
      %{"name" => "东京城林业局", "code" => "231084400000"},
      %{"name" => "宁安农场", "code" => "231084500000"}
    ]

  def next(input) when input == "穆棱市" or input == "231085",
    do: [
      %{"name" => "八面通镇", "code" => "231085100000"},
      %{"name" => "穆棱镇", "code" => "231085101000"},
      %{"name" => "下城子镇", "code" => "231085102000"},
      %{"name" => "马桥河镇", "code" => "231085103000"},
      %{"name" => "兴源镇", "code" => "231085104000"},
      %{"name" => "河西镇", "code" => "231085105000"},
      %{"name" => "福录乡", "code" => "231085200000"},
      %{"name" => "共和乡", "code" => "231085202000"},
      %{"name" => "八面通林业局", "code" => "231085400000"},
      %{"name" => "穆棱林业局", "code" => "231085401000"}
    ]

  def next(input) when input == "东宁市" or input == "231086",
    do: [
      %{"name" => "东宁镇", "code" => "231086100000"},
      %{"name" => "三岔口镇", "code" => "231086101000"},
      %{"name" => "大肚川镇", "code" => "231086102000"},
      %{"name" => "老黑山镇", "code" => "231086103000"},
      %{"name" => "道河镇", "code" => "231086104000"},
      %{"name" => "绥阳镇", "code" => "231086105000"},
      %{"name" => "绥阳林业局", "code" => "231086400000"}
    ]

  def next(input) when input == "新兴区" or input == "230902",
    do: [
      %{"name" => "兴安街道", "code" => "230902031000"},
      %{"name" => "兴富街道", "code" => "230902032000"},
      %{"name" => "兴和街道", "code" => "230902033000"},
      %{"name" => "兴盛街道", "code" => "230902034000"},
      %{"name" => "欣源街道", "code" => "230902035000"},
      %{"name" => "北山街道", "code" => "230902036000"},
      %{"name" => "兴华街道", "code" => "230902037000"},
      %{"name" => "金沙街道", "code" => "230902038000"},
      %{"name" => "红旗镇", "code" => "230902100000"},
      %{"name" => "长兴乡", "code" => "230902200000"},
      %{"name" => "七台河经济开发区管理委员会", "code" => "230902400000"}
    ]

  def next(input) when input == "桃山区" or input == "230903",
    do: [
      %{"name" => "桃东街道", "code" => "230903011000"},
      %{"name" => "桃南街道", "code" => "230903012000"},
      %{"name" => "桃西街道", "code" => "230903013000"},
      %{"name" => "桃北街道", "code" => "230903014000"},
      %{"name" => "桃源街道", "code" => "230903015000"},
      %{"name" => "桃山街道", "code" => "230903016000"},
      %{"name" => "万宝河镇", "code" => "230903100000"}
    ]

  def next(input) when input == "茄子河区" or input == "230904",
    do: [
      %{"name" => "东风街道", "code" => "230904001000"},
      %{"name" => "富强街道", "code" => "230904003000"},
      %{"name" => "龙湖街道", "code" => "230904005000"},
      %{"name" => "东胜街道", "code" => "230904006000"},
      %{"name" => "湖东街道", "code" => "230904007000"},
      %{"name" => "通达街道", "code" => "230904008000"},
      %{"name" => "茄子河镇", "code" => "230904100000"},
      %{"name" => "宏伟镇", "code" => "230904101000"},
      %{"name" => "兴北镇", "code" => "230904102000"},
      %{"name" => "铁山乡", "code" => "230904200000"},
      %{"name" => "中心河乡", "code" => "230904201000"}
    ]

  def next(input) when input == "勃利县" or input == "230921",
    do: [
      %{"name" => "新起街道", "code" => "230921001000"},
      %{"name" => "新华街道", "code" => "230921002000"},
      %{"name" => "元明街道", "code" => "230921003000"},
      %{"name" => "铁西街道", "code" => "230921004000"},
      %{"name" => "城西街道", "code" => "230921005000"},
      %{"name" => "勃利镇", "code" => "230921100000"},
      %{"name" => "小五站镇", "code" => "230921101000"},
      %{"name" => "大四站镇", "code" => "230921102000"},
      %{"name" => "双河镇", "code" => "230921103000"},
      %{"name" => "倭肯镇", "code" => "230921104000"},
      %{"name" => "青山乡", "code" => "230921200000"},
      %{"name" => "永恒乡", "code" => "230921202000"},
      %{"name" => "抢垦乡", "code" => "230921203000"},
      %{"name" => "杏树朝鲜族乡", "code" => "230921204000"},
      %{"name" => "吉兴朝鲜族满族乡", "code" => "230921205000"}
    ]

  def next(input) when input == "向阳区" or input == "230803",
    do: [
      %{"name" => "西林街道", "code" => "230803007000"},
      %{"name" => "建设街道", "code" => "230803008000"},
      %{"name" => "长安街道", "code" => "230803009000"},
      %{"name" => "学府街道", "code" => "230803010000"},
      %{"name" => "桥南街道", "code" => "230803011000"},
      %{"name" => "向阳区直辖村级区划", "code" => "230803198000"}
    ]

  def next(input) when input == "前进区" or input == "230804",
    do: [
      %{"name" => "永安街道", "code" => "230804007000"},
      %{"name" => "港湾街道", "code" => "230804008000"},
      %{"name" => "和平街道", "code" => "230804009000"},
      %{"name" => "山水街道", "code" => "230804010000"},
      %{"name" => "前进区农垦", "code" => "230804579000"}
    ]

  def next(input) when input == "东风区" or input == "230805",
    do: [
      %{"name" => "晓云街道", "code" => "230805007000"},
      %{"name" => "佳东街道", "code" => "230805008000"},
      %{"name" => "建国街道", "code" => "230805009000"},
      %{"name" => "佳南街道", "code" => "230805010000"},
      %{"name" => "建国镇", "code" => "230805100000"},
      %{"name" => "松江乡", "code" => "230805200000"}
    ]

  def next(input) when input == "郊区" or input == "230811",
    do: [
      %{"name" => "云环街道", "code" => "230811008000"},
      %{"name" => "英俊街道", "code" => "230811009000"},
      %{"name" => "红旗街道", "code" => "230811010000"},
      %{"name" => "友谊街道", "code" => "230811011000"},
      %{"name" => "大来镇", "code" => "230811101000"},
      %{"name" => "敖其镇", "code" => "230811102000"},
      %{"name" => "望江镇", "code" => "230811103000"},
      %{"name" => "长发镇", "code" => "230811104000"},
      %{"name" => "莲江口镇", "code" => "230811105000"},
      %{"name" => "西格木镇", "code" => "230811106000"},
      %{"name" => "沿江镇", "code" => "230811107000"},
      %{"name" => "四丰镇", "code" => "230811108000"},
      %{"name" => "长青乡", "code" => "230811200000"},
      %{"name" => "平安乡", "code" => "230811208000"},
      %{"name" => "群胜乡", "code" => "230811211000"},
      %{"name" => "莲江口监狱", "code" => "230811480000"},
      %{"name" => "郊区农垦", "code" => "230811579000"}
    ]

  def next(input) when input == "桦南县" or input == "230822",
    do: [
      %{"name" => "驼腰子镇", "code" => "230822103000"},
      %{"name" => "石头河子镇", "code" => "230822104000"},
      %{"name" => "桦南镇", "code" => "230822106000"},
      %{"name" => "土龙山镇", "code" => "230822107000"},
      %{"name" => "孟家岗镇", "code" => "230822108000"},
      %{"name" => "闫家镇", "code" => "230822109000"},
      %{"name" => "柳毛河镇", "code" => "230822110000"},
      %{"name" => "金沙乡", "code" => "230822205000"},
      %{"name" => "梨树乡", "code" => "230822213000"},
      %{"name" => "明义乡", "code" => "230822214000"},
      %{"name" => "大八浪乡", "code" => "230822215000"},
      %{"name" => "五道岗乡", "code" => "230822216000"},
      %{"name" => "桦南林业局", "code" => "230822400000"},
      %{"name" => "黑龙江桦南经济开发区", "code" => "230822480000"},
      %{"name" => "曙光农场", "code" => "230822500000"},
      %{"name" => "桦南种畜场", "code" => "230822580000"}
    ]

  def next(input) when input == "桦川县" or input == "230826",
    do: [
      %{"name" => "横头山镇", "code" => "230826101000"},
      %{"name" => "苏家店镇", "code" => "230826103000"},
      %{"name" => "悦来镇", "code" => "230826104000"},
      %{"name" => "新城镇", "code" => "230826105000"},
      %{"name" => "四马架镇", "code" => "230826106000"},
      %{"name" => "东河乡", "code" => "230826201000"},
      %{"name" => "梨丰乡", "code" => "230826202000"},
      %{"name" => "创业乡", "code" => "230826205000"},
      %{"name" => "星火乡", "code" => "230826207000"},
      %{"name" => "江川农场", "code" => "230826500000"},
      %{"name" => "宝山农场", "code" => "230826501000"}
    ]

  def next(input) when input == "汤原县" or input == "230828",
    do: [
      %{"name" => "香兰镇", "code" => "230828101000"},
      %{"name" => "鹤立镇", "code" => "230828102000"},
      %{"name" => "竹帘镇", "code" => "230828103000"},
      %{"name" => "汤原镇", "code" => "230828104000"},
      %{"name" => "汤旺乡", "code" => "230828201000"},
      %{"name" => "胜利乡", "code" => "230828203000"},
      %{"name" => "吉祥乡", "code" => "230828208000"},
      %{"name" => "振兴乡", "code" => "230828209000"},
      %{"name" => "太平川乡", "code" => "230828210000"},
      %{"name" => "永发乡", "code" => "230828211000"},
      %{"name" => "鹤立林业局", "code" => "230828400000"},
      %{"name" => "香兰监狱", "code" => "230828480000"},
      %{"name" => "汤原农场", "code" => "230828500000"},
      %{"name" => "梧桐河农场", "code" => "230828501000"}
    ]

  def next(input) when input == "同江市" or input == "230881",
    do: [
      %{"name" => "繁荣街道", "code" => "230881001000"},
      %{"name" => "兴华街道", "code" => "230881002000"},
      %{"name" => "同江镇", "code" => "230881100000"},
      %{"name" => "乐业镇", "code" => "230881101000"},
      %{"name" => "三村镇", "code" => "230881102000"},
      %{"name" => "临江镇", "code" => "230881103000"},
      %{"name" => "向阳镇", "code" => "230881104000"},
      %{"name" => "青河镇", "code" => "230881105000"},
      %{"name" => "街津口乡", "code" => "230881204000"},
      %{"name" => "八岔乡", "code" => "230881205000"},
      %{"name" => "金川乡", "code" => "230881206000"},
      %{"name" => "银川乡", "code" => "230881207000"},
      %{"name" => "街津口林场", "code" => "230881400000"},
      %{"name" => "鸭北林场", "code" => "230881401000"},
      %{"name" => "勤得利农场", "code" => "230881500000"},
      %{"name" => "青龙山农场", "code" => "230881501000"},
      %{"name" => "前进农场", "code" => "230881502000"},
      %{"name" => "洪河农场", "code" => "230881503000"},
      %{"name" => "鸭绿河农场", "code" => "230881504000"},
      %{"name" => "浓江农场", "code" => "230881505000"},
      %{"name" => "良种场", "code" => "230881580000"},
      %{"name" => "畜牧场", "code" => "230881581000"},
      %{"name" => "知青农场", "code" => "230881582000"}
    ]

  def next(input) when input == "富锦市" or input == "230882",
    do: [
      %{"name" => "城东街道", "code" => "230882001000"},
      %{"name" => "城西街道", "code" => "230882003000"},
      %{"name" => "富锦镇", "code" => "230882102000"},
      %{"name" => "长安镇", "code" => "230882103000"},
      %{"name" => "砚山镇", "code" => "230882106000"},
      %{"name" => "头林镇", "code" => "230882107000"},
      %{"name" => "兴隆岗镇", "code" => "230882108000"},
      %{"name" => "宏胜镇", "code" => "230882109000"},
      %{"name" => "向阳川镇", "code" => "230882110000"},
      %{"name" => "二龙山镇", "code" => "230882111000"},
      %{"name" => "上街基镇", "code" => "230882112000"},
      %{"name" => "锦山镇", "code" => "230882113000"},
      %{"name" => "大榆树镇", "code" => "230882114000"},
      %{"name" => "石砬山林场", "code" => "230882400000"},
      %{"name" => "东风岗林场", "code" => "230882401000"},
      %{"name" => "太东林场", "code" => "230882402000"},
      %{"name" => "工农林场", "code" => "230882403000"},
      %{"name" => "富锦市国营原种场", "code" => "230882404000"},
      %{"name" => "富锦市国营果树示范场", "code" => "230882405000"},
      %{"name" => "富锦市科研所", "code" => "230882406000"},
      %{"name" => "工业园区", "code" => "230882407000"},
      %{"name" => "建三江管理局局直", "code" => "230882500000"},
      %{"name" => "七星农场", "code" => "230882501000"},
      %{"name" => "大兴农场", "code" => "230882502000"},
      %{"name" => "创业农场", "code" => "230882503000"},
      %{"name" => "种猪场", "code" => "230882580000"},
      %{"name" => "种畜场", "code" => "230882581000"}
    ]

  def next(input) when input == "抚远市" or input == "230883",
    do: [
      %{"name" => "抚远镇", "code" => "230883100000"},
      %{"name" => "寒葱沟镇", "code" => "230883101000"},
      %{"name" => "浓桥镇", "code" => "230883102000"},
      %{"name" => "乌苏镇", "code" => "230883103000"},
      %{"name" => "黑瞎子岛镇", "code" => "230883104000"},
      %{"name" => "通江镇", "code" => "230883105000"},
      %{"name" => "海青镇", "code" => "230883106000"},
      %{"name" => "浓江乡", "code" => "230883201000"},
      %{"name" => "别拉洪乡", "code" => "230883203000"},
      %{"name" => "鸭南乡", "code" => "230883204000"},
      %{"name" => "前哨农场", "code" => "230883500000"},
      %{"name" => "前锋农场", "code" => "230883501000"},
      %{"name" => "二道河农场", "code" => "230883502000"}
    ]

  def next(input) when input == "伊美区" or input == "230717",
    do: [
      %{"name" => "朝阳街道", "code" => "230717001000"},
      %{"name" => "前进街道", "code" => "230717002000"},
      %{"name" => "红升街道", "code" => "230717003000"},
      %{"name" => "旭日街道", "code" => "230717004000"},
      %{"name" => "新欣街道", "code" => "230717005000"},
      %{"name" => "南郡街道", "code" => "230717006000"},
      %{"name" => "东升镇", "code" => "230717100000"},
      %{"name" => "美溪镇", "code" => "230717101000"}
    ]

  def next(input) when input == "乌翠区" or input == "230718",
    do: [
      %{"name" => "翠峦镇", "code" => "230718100000"},
      %{"name" => "乌马河镇", "code" => "230718101000"}
    ]

  def next(input) when input == "友好区" or input == "230719",
    do: [
      %{"name" => "友好街道", "code" => "230719003000"},
      %{"name" => "上甘岭镇", "code" => "230719100000"},
      %{"name" => "双子河镇", "code" => "230719101000"},
      %{"name" => "铁林镇", "code" => "230719102000"}
    ]

  def next(input) when input == "嘉荫县" or input == "230722",
    do: [
      %{"name" => "朝阳镇", "code" => "230722100000"},
      %{"name" => "乌云镇", "code" => "230722101000"},
      %{"name" => "乌拉嘎镇", "code" => "230722102000"},
      %{"name" => "保兴镇", "code" => "230722103000"},
      %{"name" => "常胜乡", "code" => "230722200000"},
      %{"name" => "向阳乡", "code" => "230722201000"},
      %{"name" => "沪嘉乡", "code" => "230722202000"},
      %{"name" => "红光乡", "code" => "230722203000"},
      %{"name" => "青山乡", "code" => "230722205000"},
      %{"name" => "太平林场", "code" => "230722400000"},
      %{"name" => "清河林场", "code" => "230722402000"},
      %{"name" => "马连林场", "code" => "230722404000"}
    ]

  def next(input) when input == "汤旺县" or input == "230723",
    do: [
      %{"name" => "乌伊岭镇", "code" => "230723100000"},
      %{"name" => "汤旺河镇", "code" => "230723101000"}
    ]

  def next(input) when input == "丰林县" or input == "230724",
    do: [
      %{"name" => "新青镇", "code" => "230724100000"},
      %{"name" => "红星镇", "code" => "230724101000"},
      %{"name" => "五营镇", "code" => "230724102000"}
    ]

  def next(input) when input == "大箐山县" or input == "230725",
    do: [
      %{"name" => "带岭镇", "code" => "230725100000"},
      %{"name" => "朗乡镇", "code" => "230725101000"}
    ]

  def next(input) when input == "南岔县" or input == "230726",
    do: [
      %{"name" => "南岔镇", "code" => "230726100000"},
      %{"name" => "晨明镇", "code" => "230726101000"},
      %{"name" => "浩良河镇", "code" => "230726102000"},
      %{"name" => "梧桐镇", "code" => "230726103000"}
    ]

  def next(input) when input == "金林区" or input == "230751",
    do: [
      %{"name" => "西林镇", "code" => "230751100000"},
      %{"name" => "金山屯镇", "code" => "230751101000"}
    ]

  def next(input) when input == "铁力市" or input == "230781",
    do: [
      %{"name" => "铁力镇", "code" => "230781100000"},
      %{"name" => "双丰镇", "code" => "230781101000"},
      %{"name" => "桃山镇", "code" => "230781102000"},
      %{"name" => "神树镇", "code" => "230781105000"},
      %{"name" => "日月峡镇", "code" => "230781106000"},
      %{"name" => "年丰朝鲜族乡", "code" => "230781200000"},
      %{"name" => "工农乡", "code" => "230781201000"},
      %{"name" => "王杨乡", "code" => "230781202000"},
      %{"name" => "铁力林业局", "code" => "230781400000"},
      %{"name" => "双丰林业局", "code" => "230781401000"},
      %{"name" => "桃山林业局", "code" => "230781402000"}
    ]

  def next(input) when input == "萨尔图区" or input == "230602",
    do: [
      %{"name" => "萨尔图街道", "code" => "230602013000"},
      %{"name" => "会战街道", "code" => "230602014000"},
      %{"name" => "友谊街道", "code" => "230602015000"},
      %{"name" => "东安街道", "code" => "230602016000"},
      %{"name" => "东风街道", "code" => "230602017000"},
      %{"name" => "铁人街道", "code" => "230602018000"},
      %{"name" => "火炬街道", "code" => "230602019000"},
      %{"name" => "拥军街道", "code" => "230602020000"},
      %{"name" => "万宝街道", "code" => "230602021000"},
      %{"name" => "格林街道", "code" => "230602022000"},
      %{"name" => "绿园街道", "code" => "230602023000"}
    ]

  def next(input) when input == "龙凤区" or input == "230603",
    do: [
      %{"name" => "兴化街道", "code" => "230603011000"},
      %{"name" => "卧里屯街道", "code" => "230603012000"},
      %{"name" => "东光街道", "code" => "230603013000"},
      %{"name" => "龙凤街道", "code" => "230603014000"},
      %{"name" => "三永街道", "code" => "230603015000"},
      %{"name" => "龙政街道", "code" => "230603016000"},
      %{"name" => "湿地街道", "code" => "230603017000"},
      %{"name" => "龙凤镇", "code" => "230603100000"}
    ]

  def next(input) when input == "让胡路区" or input == "230604",
    do: [
      %{"name" => "庆新街道", "code" => "230604010000"},
      %{"name" => "北湖街道", "code" => "230604011000"},
      %{"name" => "奋斗街道", "code" => "230604012000"},
      %{"name" => "龙岗街道", "code" => "230604013000"},
      %{"name" => "旭园街道", "code" => "230604014000"},
      %{"name" => "西宾街道", "code" => "230604015000"},
      %{"name" => "怡园街道", "code" => "230604016000"},
      %{"name" => "东湖街道", "code" => "230604017000"},
      %{"name" => "乘风街道", "code" => "230604018000"},
      %{"name" => "创业城街道", "code" => "230604019000"},
      %{"name" => "银浪街道", "code" => "230604020000"},
      %{"name" => "喇嘛甸镇", "code" => "230604101000"},
      %{"name" => "经济开发区", "code" => "230604401000"}
    ]

  def next(input) when input == "红岗区" or input == "230605",
    do: [
      %{"name" => "杏南街道", "code" => "230605008000"},
      %{"name" => "创业街道", "code" => "230605009000"},
      %{"name" => "红岗街道", "code" => "230605010000"},
      %{"name" => "八百垧街道", "code" => "230605011000"},
      %{"name" => "银河街道", "code" => "230605012000"},
      %{"name" => "解放街道", "code" => "230605013000"},
      %{"name" => "杏树岗镇", "code" => "230605100000"},
      %{"name" => "黑龙江红岗经济开发区", "code" => "230605480000"}
    ]

  def next(input) when input == "大同区" or input == "230606",
    do: [
      %{"name" => "和平街道", "code" => "230606007000"},
      %{"name" => "庆葡街道", "code" => "230606008000"},
      %{"name" => "新华街道", "code" => "230606009000"},
      %{"name" => "高平街道", "code" => "230606010000"},
      %{"name" => "林源街道", "code" => "230606011000"},
      %{"name" => "和苑街道", "code" => "230606012000"},
      %{"name" => "同福街道", "code" => "230606013000"},
      %{"name" => "大同镇", "code" => "230606100000"},
      %{"name" => "高台子镇", "code" => "230606101000"},
      %{"name" => "太阳升镇", "code" => "230606102000"},
      %{"name" => "林源镇", "code" => "230606103000"},
      %{"name" => "祝三乡", "code" => "230606200000"},
      %{"name" => "老山头乡", "code" => "230606203000"},
      %{"name" => "八井子乡", "code" => "230606205000"},
      %{"name" => "双榆树乡", "code" => "230606206000"}
    ]

  def next(input) when input == "肇州县" or input == "230621",
    do: [
      %{"name" => "肇州镇", "code" => "230621100000"},
      %{"name" => "永乐镇", "code" => "230621101000"},
      %{"name" => "丰乐镇", "code" => "230621102000"},
      %{"name" => "朝阳沟镇", "code" => "230621103000"},
      %{"name" => "兴城镇", "code" => "230621104000"},
      %{"name" => "二井镇", "code" => "230621105000"},
      %{"name" => "双发乡", "code" => "230621202000"},
      %{"name" => "托古乡", "code" => "230621203000"},
      %{"name" => "朝阳乡", "code" => "230621205000"},
      %{"name" => "永胜乡", "code" => "230621206000"},
      %{"name" => "榆树乡", "code" => "230621208000"},
      %{"name" => "新福乡", "code" => "230621211000"},
      %{"name" => "乐园良种场", "code" => "230621580000"},
      %{"name" => "卫星种畜场", "code" => "230621581000"}
    ]

  def next(input) when input == "肇源县" or input == "230622",
    do: [
      %{"name" => "肇源镇", "code" => "230622100000"},
      %{"name" => "三站镇", "code" => "230622101000"},
      %{"name" => "二站镇", "code" => "230622102000"},
      %{"name" => "茂兴镇", "code" => "230622103000"},
      %{"name" => "古龙镇", "code" => "230622104000"},
      %{"name" => "新站镇", "code" => "230622105000"},
      %{"name" => "头台镇", "code" => "230622106000"},
      %{"name" => "古恰镇", "code" => "230622107000"},
      %{"name" => "福兴乡", "code" => "230622200000"},
      %{"name" => "薄荷台乡", "code" => "230622201000"},
      %{"name" => "和平乡", "code" => "230622203000"},
      %{"name" => "超等乡", "code" => "230622207000"},
      %{"name" => "民意乡", "code" => "230622208000"},
      %{"name" => "义顺乡", "code" => "230622210000"},
      %{"name" => "浩德乡", "code" => "230622211000"},
      %{"name" => "大兴乡", "code" => "230622212000"},
      %{"name" => "种畜场", "code" => "230622581000"},
      %{"name" => "新立良种繁育场", "code" => "230622583000"},
      %{"name" => "立陡山良种场", "code" => "230622584000"},
      %{"name" => "果树示范场", "code" => "230622586000"},
      %{"name" => "经济作物示范场", "code" => "230622587000"},
      %{"name" => "茂兴湖水产养殖场", "code" => "230622588000"}
    ]

  def next(input) when input == "林甸县" or input == "230623",
    do: [
      %{"name" => "林甸镇", "code" => "230623100000"},
      %{"name" => "红旗镇", "code" => "230623101000"},
      %{"name" => "花园镇", "code" => "230623102000"},
      %{"name" => "四季青镇", "code" => "230623103000"},
      %{"name" => "鹤鸣湖镇", "code" => "230623104000"},
      %{"name" => "东兴乡", "code" => "230623200000"},
      %{"name" => "宏伟乡", "code" => "230623201000"},
      %{"name" => "四合乡", "code" => "230623204000"},
      %{"name" => "林甸县长青林场", "code" => "230623400000"},
      %{"name" => "巨浪牧场", "code" => "230623500000"},
      %{"name" => "国营苇场", "code" => "230623580000"},
      %{"name" => "新兴畜牧场", "code" => "230623581000"}
    ]

  def next(input) when input == "杜尔伯特蒙古族自治县" or input == "230624",
    do: [
      %{"name" => "杜尔伯特镇", "code" => "230624100000"},
      %{"name" => "胡吉吐莫镇", "code" => "230624101000"},
      %{"name" => "烟筒屯镇", "code" => "230624102000"},
      %{"name" => "他拉哈镇", "code" => "230624103000"},
      %{"name" => "连环湖镇", "code" => "230624104000"},
      %{"name" => "一心乡", "code" => "230624200000"},
      %{"name" => "克尔台乡", "code" => "230624201000"},
      %{"name" => "敖林西伯乡", "code" => "230624203000"},
      %{"name" => "巴彦查干乡", "code" => "230624204000"},
      %{"name" => "腰新乡", "code" => "230624205000"},
      %{"name" => "江湾乡", "code" => "230624206000"},
      %{"name" => "绿色草原牧场", "code" => "230624500000"},
      %{"name" => "大山种羊场", "code" => "230624501000"}
    ]

  def next(input) when input == "大庆高新技术产业开发区" or input == "230671",
    do: [
      %{"name" => "开发区黎明街道", "code" => "230671010000"},
      %{"name" => "高新区农场", "code" => "230671580000"}
    ]

  def next(input) when input == "尖山区" or input == "230502",
    do: [
      %{"name" => "二马路街道", "code" => "230502001000"},
      %{"name" => "八马路街道", "code" => "230502002000"},
      %{"name" => "中心站街道", "code" => "230502003000"},
      %{"name" => "富安街道", "code" => "230502004000"},
      %{"name" => "长安街道", "code" => "230502006000"},
      %{"name" => "铁西街道", "code" => "230502007000"},
      %{"name" => "学府街道", "code" => "230502008000"},
      %{"name" => "安邦乡", "code" => "230502200000"}
    ]

  def next(input) when input == "岭东区" or input == "230503",
    do: [
      %{"name" => "中山街道", "code" => "230503001000"},
      %{"name" => "北山街道", "code" => "230503002000"},
      %{"name" => "南山街道", "code" => "230503003000"},
      %{"name" => "东山街道", "code" => "230503004000"},
      %{"name" => "中心街道", "code" => "230503005000"},
      %{"name" => "西山街道", "code" => "230503006000"},
      %{"name" => "长胜乡", "code" => "230503200000"}
    ]

  def next(input) when input == "四方台区" or input == "230505",
    do: [
      %{"name" => "振兴中路街道", "code" => "230505001000"},
      %{"name" => "振兴东路街道", "code" => "230505002000"},
      %{"name" => "集贤街道", "code" => "230505004000"},
      %{"name" => "东荣街道", "code" => "230505005000"},
      %{"name" => "太保镇", "code" => "230505101000"}
    ]

  def next(input) when input == "宝山区" or input == "230506",
    do: [
      %{"name" => "红旗街道", "code" => "230506001000"},
      %{"name" => "跃进街道", "code" => "230506002000"},
      %{"name" => "东保卫街道", "code" => "230506003000"},
      %{"name" => "七星街道", "code" => "230506004000"},
      %{"name" => "双阳街道", "code" => "230506005000"},
      %{"name" => "新安街道", "code" => "230506006000"},
      %{"name" => "电厂街道", "code" => "230506007000"},
      %{"name" => "农场街道", "code" => "230506008000"},
      %{"name" => "七星镇", "code" => "230506101000"}
    ]

  def next(input) when input == "集贤县" or input == "230521",
    do: [
      %{"name" => "福利镇", "code" => "230521100000"},
      %{"name" => "集贤镇", "code" => "230521101000"},
      %{"name" => "升昌镇", "code" => "230521102000"},
      %{"name" => "丰乐镇", "code" => "230521103000"},
      %{"name" => "太平镇", "code" => "230521104000"},
      %{"name" => "腰屯乡", "code" => "230521201000"},
      %{"name" => "兴安乡", "code" => "230521202000"},
      %{"name" => "永安乡", "code" => "230521204000"},
      %{"name" => "太平林场", "code" => "230521401000"},
      %{"name" => "丰乐林场", "code" => "230521402000"},
      %{"name" => "七星林场", "code" => "230521403000"},
      %{"name" => "峻山林场", "code" => "230521404000"},
      %{"name" => "爱林林场", "code" => "230521405000"},
      %{"name" => "腰屯林场", "code" => "230521406000"},
      %{"name" => "升平煤矿", "code" => "230521407000"},
      %{"name" => "黑龙江省双鸭山监狱", "code" => "230521480000"},
      %{"name" => "二九一农场", "code" => "230521500000"},
      %{"name" => "良种场", "code" => "230521581000"},
      %{"name" => "种畜场", "code" => "230521582000"},
      %{"name" => "果树示范场", "code" => "230521583000"}
    ]

  def next(input) when input == "友谊县" or input == "230522",
    do: [
      %{"name" => "友谊镇", "code" => "230522100000"},
      %{"name" => "兴隆镇", "code" => "230522101000"},
      %{"name" => "龙山镇", "code" => "230522102000"},
      %{"name" => "凤岗镇", "code" => "230522103000"},
      %{"name" => "兴盛乡", "code" => "230522200000"},
      %{"name" => "东建乡", "code" => "230522201000"},
      %{"name" => "庆丰乡", "code" => "230522202000"},
      %{"name" => "建设乡", "code" => "230522203000"},
      %{"name" => "友邻乡", "code" => "230522204000"},
      %{"name" => "新镇乡", "code" => "230522205000"},
      %{"name" => "成富朝鲜族满族乡", "code" => "230522206000"},
      %{"name" => "红兴隆管理局局直", "code" => "230522501000"},
      %{"name" => "友谊农场", "code" => "230522502000"}
    ]

  def next(input) when input == "宝清县" or input == "230523",
    do: [
      %{"name" => "宝清镇", "code" => "230523100000"},
      %{"name" => "七星泡镇", "code" => "230523101000"},
      %{"name" => "青原镇", "code" => "230523102000"},
      %{"name" => "夹信子镇", "code" => "230523103000"},
      %{"name" => "龙头镇", "code" => "230523104000"},
      %{"name" => "小城子镇", "code" => "230523105000"},
      %{"name" => "朝阳镇", "code" => "230523106000"},
      %{"name" => "万金山乡", "code" => "230523203000"},
      %{"name" => "尖山子乡", "code" => "230523204000"},
      %{"name" => "七星河乡", "code" => "230523209000"},
      %{"name" => "双鸭山林业局上游经营所", "code" => "230523400000"},
      %{"name" => "双鸭山林业局南瓮泉经营所", "code" => "230523401000"},
      %{"name" => "双鸭山林业局七一林场", "code" => "230523402000"},
      %{"name" => "双鸭山林业局七星河林场", "code" => "230523403000"},
      %{"name" => "双鸭山林业局红旗林场", "code" => "230523404000"},
      %{"name" => "双鸭山林业局三岔河林场", "code" => "230523405000"},
      %{"name" => "双鸭山林业局青龙林场", "code" => "230523406000"},
      %{"name" => "双鸭山林业局宝石经营所", "code" => "230523407000"},
      %{"name" => "双鸭山林业局七星河金矿", "code" => "230523408000"},
      %{"name" => "桦南林业局岚峰林场", "code" => "230523409000"},
      %{"name" => "五九七农场", "code" => "230523500000"},
      %{"name" => "八五二农场", "code" => "230523501000"},
      %{"name" => "八五三农场", "code" => "230523502000"}
    ]

  def next(input) when input == "饶河县" or input == "230524",
    do: [
      %{"name" => "饶河镇", "code" => "230524100000"},
      %{"name" => "小佳河镇", "code" => "230524101000"},
      %{"name" => "西丰镇", "code" => "230524102000"},
      %{"name" => "五林洞镇", "code" => "230524103000"},
      %{"name" => "西林子乡", "code" => "230524200000"},
      %{"name" => "四排乡", "code" => "230524201000"},
      %{"name" => "大佳河乡", "code" => "230524203000"},
      %{"name" => "山里乡", "code" => "230524204000"},
      %{"name" => "大通河乡", "code" => "230524207000"},
      %{"name" => "小佳河林场", "code" => "230524400000"},
      %{"name" => "威山林场", "code" => "230524401000"},
      %{"name" => "西丰林场", "code" => "230524402000"},
      %{"name" => "大牙克林场", "code" => "230524403000"},
      %{"name" => "石场林场", "code" => "230524404000"},
      %{"name" => "宝马山林场", "code" => "230524405000"},
      %{"name" => "大岱林场", "code" => "230524406000"},
      %{"name" => "永幸林场", "code" => "230524407000"},
      %{"name" => "奇源林场", "code" => "230524408000"},
      %{"name" => "芦源林场", "code" => "230524409000"},
      %{"name" => "五林洞林场", "code" => "230524410000"},
      %{"name" => "饶河农场", "code" => "230524500000"},
      %{"name" => "红旗岭农场", "code" => "230524501000"},
      %{"name" => "八五九农场", "code" => "230524502000"},
      %{"name" => "胜利农场", "code" => "230524503000"},
      %{"name" => "红卫农场", "code" => "230524504000"}
    ]

  def next(input) when input == "向阳区" or input == "230402",
    do: [
      %{"name" => "北山街道", "code" => "230402001000"},
      %{"name" => "红军街道", "code" => "230402002000"},
      %{"name" => "光明街道", "code" => "230402003000"},
      %{"name" => "胜利街道", "code" => "230402004000"},
      %{"name" => "南翼街道", "code" => "230402005000"}
    ]

  def next(input) when input == "工农区" or input == "230403",
    do: [
      %{"name" => "育才街道", "code" => "230403001000"},
      %{"name" => "红旗街道", "code" => "230403002000"},
      %{"name" => "新南街道", "code" => "230403003000"},
      %{"name" => "团结街道", "code" => "230403006000"}
    ]

  def next(input) when input == "南山区" or input == "230404",
    do: [
      %{"name" => "铁西街道", "code" => "230404001000"},
      %{"name" => "铁东街道", "code" => "230404002000"},
      %{"name" => "六号街道", "code" => "230404003000"},
      %{"name" => "大陆街道", "code" => "230404004000"},
      %{"name" => "富力街道", "code" => "230404005000"},
      %{"name" => "麓林山街道", "code" => "230404006000"}
    ]

  def next(input) when input == "兴安区" or input == "230405",
    do: [
      %{"name" => "兴安路街道", "code" => "230405001000"},
      %{"name" => "兴建路街道", "code" => "230405002000"},
      %{"name" => "兴长路街道", "code" => "230405003000"},
      %{"name" => "峻德路街道", "code" => "230405004000"},
      %{"name" => "河东路街道", "code" => "230405005000"},
      %{"name" => "光宇街道", "code" => "230405006000"},
      %{"name" => "红旗镇", "code" => "230405100000"}
    ]

  def next(input) when input == "东山区" or input == "230406",
    do: [
      %{"name" => "工人村办街道", "code" => "230406001000"},
      %{"name" => "新一办街道", "code" => "230406002000"},
      %{"name" => "东山办街道", "code" => "230406004000"},
      %{"name" => "鹤兴办街道", "code" => "230406005000"},
      %{"name" => "新华镇", "code" => "230406100000"},
      %{"name" => "蔬园乡", "code" => "230406201000"},
      %{"name" => "东方红乡", "code" => "230406202000"},
      %{"name" => "鹤岗市林业局生活区", "code" => "230406400000"},
      %{"name" => "新华农场", "code" => "230406501000"}
    ]

  def next(input) when input == "兴山区" or input == "230407",
    do: [
      %{"name" => "岭北街道", "code" => "230407001000"},
      %{"name" => "岭南街道", "code" => "230407002000"},
      %{"name" => "沟北街道", "code" => "230407003000"},
      %{"name" => "沟南街道", "code" => "230407004000"}
    ]

  def next(input) when input == "萝北县" or input == "230421",
    do: [
      %{"name" => "凤翔镇", "code" => "230421100000"},
      %{"name" => "鹤北镇", "code" => "230421101000"},
      %{"name" => "名山镇", "code" => "230421102000"},
      %{"name" => "团结镇", "code" => "230421103000"},
      %{"name" => "肇兴镇", "code" => "230421104000"},
      %{"name" => "云山镇", "code" => "230421105000"},
      %{"name" => "东明朝鲜族乡", "code" => "230421200000"},
      %{"name" => "太平沟乡", "code" => "230421203000"},
      %{"name" => "萝北县林业局", "code" => "230421400000"},
      %{"name" => "鹤北林业局", "code" => "230421401000"},
      %{"name" => "宝泉岭管理局局直", "code" => "230421500000"},
      %{"name" => "江滨农场", "code" => "230421501000"},
      %{"name" => "军川农场", "code" => "230421502000"},
      %{"name" => "名山农场", "code" => "230421503000"},
      %{"name" => "延军农场", "code" => "230421504000"},
      %{"name" => "共青农场", "code" => "230421505000"},
      %{"name" => "宝泉岭农场", "code" => "230421506000"},
      %{"name" => "萝北县农业局", "code" => "230421580000"}
    ]

  def next(input) when input == "绥滨县" or input == "230422",
    do: [
      %{"name" => "绥滨镇", "code" => "230422100000"},
      %{"name" => "绥东镇", "code" => "230422101000"},
      %{"name" => "忠仁镇", "code" => "230422102000"},
      %{"name" => "连生乡", "code" => "230422200000"},
      %{"name" => "北岗乡", "code" => "230422201000"},
      %{"name" => "富强乡", "code" => "230422202000"},
      %{"name" => "北山乡", "code" => "230422203000"},
      %{"name" => "福兴乡", "code" => "230422204000"},
      %{"name" => "新富乡", "code" => "230422205000"},
      %{"name" => "绥滨西林场", "code" => "230422400000"},
      %{"name" => "国营中兴边防林场", "code" => "230422401000"},
      %{"name" => "忠仁镇良种场", "code" => "230422480000"},
      %{"name" => "绥东镇种畜场", "code" => "230422481000"},
      %{"name" => "二九〇农场", "code" => "230422500000"},
      %{"name" => "绥滨农场", "code" => "230422501000"},
      %{"name" => "普阳农场", "code" => "230422503000"}
    ]

  def next(input) when input == "鸡冠区" or input == "230302",
    do: [
      %{"name" => "向阳街道", "code" => "230302001000"},
      %{"name" => "南山街道", "code" => "230302002000"},
      %{"name" => "立新街道", "code" => "230302003000"},
      %{"name" => "东风街道", "code" => "230302004000"},
      %{"name" => "红军路街道", "code" => "230302005000"},
      %{"name" => "西鸡西街道", "code" => "230302006000"},
      %{"name" => "西山街道", "code" => "230302007000"},
      %{"name" => "红星乡", "code" => "230302200000"},
      %{"name" => "西郊乡", "code" => "230302201000"}
    ]

  def next(input) when input == "恒山区" or input == "230303",
    do: [
      %{"name" => "大恒山街道", "code" => "230303002000"},
      %{"name" => "小恒山街道", "code" => "230303003000"},
      %{"name" => "二道河子街道", "code" => "230303004000"},
      %{"name" => "张新街道", "code" => "230303005000"},
      %{"name" => "奋斗街道", "code" => "230303006000"},
      %{"name" => "柳毛街道", "code" => "230303007000"},
      %{"name" => "红旗乡", "code" => "230303200000"},
      %{"name" => "柳毛乡", "code" => "230303201000"}
    ]

  def next(input) when input == "滴道区" or input == "230304",
    do: [
      %{"name" => "东兴街道", "code" => "230304001000"},
      %{"name" => "矿里街道", "code" => "230304002000"},
      %{"name" => "洗煤街道", "code" => "230304003000"},
      %{"name" => "大通沟街道", "code" => "230304004000"},
      %{"name" => "滴道河乡", "code" => "230304200000"},
      %{"name" => "兰岭乡", "code" => "230304201000"}
    ]

  def next(input) when input == "梨树区" or input == "230305",
    do: [
      %{"name" => "街里街道", "code" => "230305001000"},
      %{"name" => "穆棱街道", "code" => "230305002000"},
      %{"name" => "平岗街道", "code" => "230305003000"},
      %{"name" => "梨树镇", "code" => "230305101000"}
    ]

  def next(input) when input == "城子河区" or input == "230306",
    do: [
      %{"name" => "城子河街道", "code" => "230306001000"},
      %{"name" => "正阳街道", "code" => "230306002000"},
      %{"name" => "东海街道", "code" => "230306003000"},
      %{"name" => "城西街道", "code" => "230306004000"},
      %{"name" => "杏花街道", "code" => "230306005000"},
      %{"name" => "长青乡", "code" => "230306200000"},
      %{"name" => "永丰乡", "code" => "230306201000"}
    ]

  def next(input) when input == "麻山区" or input == "230307",
    do: [
      %{"name" => "麻山街道", "code" => "230307001000"},
      %{"name" => "麻山镇", "code" => "230307101000"}
    ]

  def next(input) when input == "鸡东县" or input == "230321",
    do: [
      %{"name" => "鸡东镇", "code" => "230321100000"},
      %{"name" => "平阳镇", "code" => "230321101000"},
      %{"name" => "向阳镇", "code" => "230321102000"},
      %{"name" => "哈达镇", "code" => "230321103000"},
      %{"name" => "永安镇", "code" => "230321104000"},
      %{"name" => "永和镇", "code" => "230321105000"},
      %{"name" => "东海镇", "code" => "230321106000"},
      %{"name" => "兴农镇", "code" => "230321107000"},
      %{"name" => "鸡林乡", "code" => "230321200000"},
      %{"name" => "明德乡", "code" => "230321205000"},
      %{"name" => "下亮子乡", "code" => "230321206000"},
      %{"name" => "林业局", "code" => "230321400000"},
      %{"name" => "八五一零农场", "code" => "230321500000"}
    ]

  def next(input) when input == "虎林市" or input == "230381",
    do: [
      %{"name" => "虎林镇", "code" => "230381100000"},
      %{"name" => "东方红镇", "code" => "230381101000"},
      %{"name" => "迎春镇", "code" => "230381102000"},
      %{"name" => "虎头镇", "code" => "230381103000"},
      %{"name" => "杨岗镇", "code" => "230381104000"},
      %{"name" => "东诚镇", "code" => "230381105000"},
      %{"name" => "宝东镇", "code" => "230381106000"},
      %{"name" => "新乐乡", "code" => "230381203000"},
      %{"name" => "伟光乡", "code" => "230381204000"},
      %{"name" => "珍宝岛乡", "code" => "230381206000"},
      %{"name" => "阿北乡", "code" => "230381207000"},
      %{"name" => "东方红林业局", "code" => "230381400000"},
      %{"name" => "迎春林业局", "code" => "230381401000"},
      %{"name" => "八五〇农场", "code" => "230381500000"},
      %{"name" => "八五四农场", "code" => "230381501000"},
      %{"name" => "八五六农场", "code" => "230381502000"},
      %{"name" => "八五八农场", "code" => "230381503000"},
      %{"name" => "庆丰农场", "code" => "230381504000"},
      %{"name" => "云山农场", "code" => "230381505000"}
    ]

  def next(input) when input == "密山市" or input == "230382",
    do: [
      %{"name" => "中心街道", "code" => "230382001000"},
      %{"name" => "密山镇", "code" => "230382100000"},
      %{"name" => "连珠山镇", "code" => "230382101000"},
      %{"name" => "当壁镇", "code" => "230382102000"},
      %{"name" => "知一镇", "code" => "230382103000"},
      %{"name" => "黑台镇", "code" => "230382104000"},
      %{"name" => "兴凯镇", "code" => "230382105000"},
      %{"name" => "裴德镇", "code" => "230382106000"},
      %{"name" => "白鱼湾镇", "code" => "230382107000"},
      %{"name" => "柳毛乡", "code" => "230382200000"},
      %{"name" => "杨木乡", "code" => "230382201000"},
      %{"name" => "兴凯湖乡", "code" => "230382202000"},
      %{"name" => "承紫河乡", "code" => "230382203000"},
      %{"name" => "二人班乡", "code" => "230382206000"},
      %{"name" => "太平乡", "code" => "230382208000"},
      %{"name" => "和平乡", "code" => "230382210000"},
      %{"name" => "富源乡", "code" => "230382212000"},
      %{"name" => "林草局", "code" => "230382400000"},
      %{"name" => "青年水库", "code" => "230382480000"},
      %{"name" => "煤管局", "code" => "230382481000"},
      %{"name" => "经济开发区管理委员会", "code" => "230382482000"},
      %{"name" => "水产养殖有限公司", "code" => "230382580000"},
      %{"name" => "种畜场", "code" => "230382581000"},
      %{"name" => "水田良种场", "code" => "230382582000"},
      %{"name" => "市良种场", "code" => "230382583000"},
      %{"name" => "校办企业公司", "code" => "230382584000"},
      %{"name" => "蜂蜜山粮库有限公司", "code" => "230382585000"}
    ]

  def next(input) when input == "龙沙区" or input == "230202",
    do: [
      %{"name" => "五龙街道", "code" => "230202001000"},
      %{"name" => "湖滨街道", "code" => "230202002000"},
      %{"name" => "江安街道", "code" => "230202003000"},
      %{"name" => "正阳街道", "code" => "230202004000"},
      %{"name" => "彩虹街道", "code" => "230202005000"},
      %{"name" => "南航街道", "code" => "230202006000"},
      %{"name" => "大民街道", "code" => "230202007000"},
      %{"name" => "齐齐哈尔局直", "code" => "230202579000"}
    ]

  def next(input) when input == "建华区" or input == "230203",
    do: [
      %{"name" => "中华街道", "code" => "230203002000"},
      %{"name" => "西大桥街道", "code" => "230203004000"},
      %{"name" => "卜奎街道", "code" => "230203005000"},
      %{"name" => "建设街道", "code" => "230203006000"},
      %{"name" => "文化街道", "code" => "230203007000"},
      %{"name" => "溪畔街道", "code" => "230203008000"},
      %{"name" => "北华街道", "code" => "230203009000"}
    ]

  def next(input) when input == "铁锋区" or input == "230204",
    do: [
      %{"name" => "站前街道", "code" => "230204001000"},
      %{"name" => "南浦街道", "code" => "230204002000"},
      %{"name" => "通东街道", "code" => "230204003000"},
      %{"name" => "光荣街道", "code" => "230204004000"},
      %{"name" => "龙华街道", "code" => "230204005000"},
      %{"name" => "北局宅街道", "code" => "230204006000"},
      %{"name" => "东湖街道", "code" => "230204008000"},
      %{"name" => "种畜场街道", "code" => "230204009000"},
      %{"name" => "扎龙镇", "code" => "230204100000"}
    ]

  def next(input) when input == "昂昂溪区" or input == "230205",
    do: [
      %{"name" => "新兴街道", "code" => "230205001000"},
      %{"name" => "新建街道", "code" => "230205002000"},
      %{"name" => "林机街道", "code" => "230205005000"},
      %{"name" => "道北街道", "code" => "230205006000"},
      %{"name" => "水师营满族镇", "code" => "230205100000"},
      %{"name" => "榆树屯镇", "code" => "230205101000"}
    ]

  def next(input) when input == "富拉尔基区" or input == "230206",
    do: [
      %{"name" => "红岸街道", "code" => "230206001000"},
      %{"name" => "沿江街道", "code" => "230206003000"},
      %{"name" => "电力街道", "code" => "230206004000"},
      %{"name" => "幸福街道", "code" => "230206005000"},
      %{"name" => "红宝石街道", "code" => "230206006000"},
      %{"name" => "北兴街道", "code" => "230206007000"},
      %{"name" => "铁北街道", "code" => "230206008000"},
      %{"name" => "和平街道", "code" => "230206009000"},
      %{"name" => "长青乡", "code" => "230206200000"},
      %{"name" => "杜尔门沁达斡尔族乡", "code" => "230206202000"}
    ]

  def next(input) when input == "碾子山区" or input == "230207",
    do: [
      %{"name" => "东安街道", "code" => "230207001000"},
      %{"name" => "富强街道", "code" => "230207002000"},
      %{"name" => "跃进街道", "code" => "230207003000"},
      %{"name" => "繁荣街道", "code" => "230207004000"}
    ]

  def next(input) when input == "梅里斯达斡尔族区" or input == "230208",
    do: [
      %{"name" => "梅里斯街道", "code" => "230208001000"},
      %{"name" => "雅尔塞镇", "code" => "230208101000"},
      %{"name" => "卧牛吐达斡尔族镇", "code" => "230208102000"},
      %{"name" => "达呼店镇", "code" => "230208103000"},
      %{"name" => "共和镇", "code" => "230208104000"},
      %{"name" => "梅里斯镇", "code" => "230208105000"},
      %{"name" => "莽格吐达斡尔族乡", "code" => "230208200000"}
    ]

  def next(input) when input == "龙江县" or input == "230221",
    do: [
      %{"name" => "龙江镇", "code" => "230221100000"},
      %{"name" => "景星镇", "code" => "230221101000"},
      %{"name" => "龙兴镇", "code" => "230221102000"},
      %{"name" => "山泉镇", "code" => "230221103000"},
      %{"name" => "七棵树镇", "code" => "230221104000"},
      %{"name" => "杏山镇", "code" => "230221105000"},
      %{"name" => "白山镇", "code" => "230221106000"},
      %{"name" => "头站镇", "code" => "230221107000"},
      %{"name" => "黑岗乡", "code" => "230221201000"},
      %{"name" => "广厚乡", "code" => "230221202000"},
      %{"name" => "华民乡", "code" => "230221203000"},
      %{"name" => "哈拉海乡", "code" => "230221204000"},
      %{"name" => "鲁河乡", "code" => "230221215000"},
      %{"name" => "济沁河乡", "code" => "230221217000"}
    ]

  def next(input) when input == "依安县" or input == "230223",
    do: [
      %{"name" => "依安镇", "code" => "230223100000"},
      %{"name" => "依龙镇", "code" => "230223101000"},
      %{"name" => "双阳镇", "code" => "230223102000"},
      %{"name" => "三兴镇", "code" => "230223103000"},
      %{"name" => "中心镇", "code" => "230223104000"},
      %{"name" => "新兴镇", "code" => "230223105000"},
      %{"name" => "富饶乡", "code" => "230223200000"},
      %{"name" => "解放乡", "code" => "230223201000"},
      %{"name" => "阳春乡", "code" => "230223202000"},
      %{"name" => "新发乡", "code" => "230223203000"},
      %{"name" => "太东乡", "code" => "230223204000"},
      %{"name" => "上游乡", "code" => "230223205000"},
      %{"name" => "红星乡", "code" => "230223206000"},
      %{"name" => "先锋乡", "code" => "230223207000"},
      %{"name" => "新屯乡", "code" => "230223208000"}
    ]

  def next(input) when input == "泰来县" or input == "230224",
    do: [
      %{"name" => "泰来镇", "code" => "230224100000"},
      %{"name" => "平洋镇", "code" => "230224101000"},
      %{"name" => "汤池镇", "code" => "230224102000"},
      %{"name" => "江桥蒙古族镇", "code" => "230224103000"},
      %{"name" => "塔子城镇", "code" => "230224104000"},
      %{"name" => "大兴镇", "code" => "230224105000"},
      %{"name" => "和平镇", "code" => "230224106000"},
      %{"name" => "克利镇", "code" => "230224107000"},
      %{"name" => "胜利蒙古族乡", "code" => "230224200000"},
      %{"name" => "宁姜蒙古族乡", "code" => "230224209000"},
      %{"name" => "葡萄场", "code" => "230224400000"},
      %{"name" => "果树场", "code" => "230224401000"},
      %{"name" => "泰来县一苗圃", "code" => "230224402000"},
      %{"name" => "泰来县二苗圃", "code" => "230224403000"},
      %{"name" => "东方红机械林场", "code" => "230224404000"},
      %{"name" => "六三监狱", "code" => "230224480000"},
      %{"name" => "第一良种场", "code" => "230224580000"},
      %{"name" => "第二良种场", "code" => "230224581000"},
      %{"name" => "宏胜种畜场", "code" => "230224582000"},
      %{"name" => "二龙涛农场", "code" => "230224583000"}
    ]

  def next(input) when input == "甘南县" or input == "230225",
    do: [
      %{"name" => "甘南镇", "code" => "230225100000"},
      %{"name" => "兴十四镇", "code" => "230225101000"},
      %{"name" => "平阳镇", "code" => "230225102000"},
      %{"name" => "东阳镇", "code" => "230225103000"},
      %{"name" => "巨宝镇", "code" => "230225104000"},
      %{"name" => "长山乡", "code" => "230225201000"},
      %{"name" => "中兴乡", "code" => "230225202000"},
      %{"name" => "兴隆乡", "code" => "230225203000"},
      %{"name" => "宝山乡", "code" => "230225204000"},
      %{"name" => "查哈阳乡", "code" => "230225206000"},
      %{"name" => "查哈阳农场", "code" => "230225500000"},
      %{"name" => "北京市双河农场", "code" => "230225580000"}
    ]

  def next(input) when input == "富裕县" or input == "230227",
    do: [
      %{"name" => "富裕镇", "code" => "230227100000"},
      %{"name" => "富路镇", "code" => "230227101000"},
      %{"name" => "富海镇", "code" => "230227102000"},
      %{"name" => "二道湾镇", "code" => "230227103000"},
      %{"name" => "龙安桥镇", "code" => "230227104000"},
      %{"name" => "塔哈镇", "code" => "230227105000"},
      %{"name" => "繁荣乡", "code" => "230227200000"},
      %{"name" => "绍文乡", "code" => "230227201000"},
      %{"name" => "忠厚乡", "code" => "230227202000"},
      %{"name" => "友谊达斡尔族满族柯尔克孜族乡", "code" => "230227203000"}
    ]

  def next(input) when input == "克山县" or input == "230229",
    do: [
      %{"name" => "克山镇", "code" => "230229100000"},
      %{"name" => "北兴镇", "code" => "230229101000"},
      %{"name" => "西城镇", "code" => "230229102000"},
      %{"name" => "古城镇", "code" => "230229103000"},
      %{"name" => "北联镇", "code" => "230229104000"},
      %{"name" => "西河镇", "code" => "230229105000"},
      %{"name" => "双河镇", "code" => "230229106000"},
      %{"name" => "河南乡", "code" => "230229200000"},
      %{"name" => "河北乡", "code" => "230229203000"},
      %{"name" => "古北乡", "code" => "230229204000"},
      %{"name" => "西联乡", "code" => "230229205000"},
      %{"name" => "发展乡", "code" => "230229206000"},
      %{"name" => "西建乡", "code" => "230229207000"},
      %{"name" => "向华乡", "code" => "230229208000"},
      %{"name" => "曙光乡", "code" => "230229210000"},
      %{"name" => "克山县河北林场", "code" => "230229400000"},
      %{"name" => "克山县涌泉林场", "code" => "230229401000"},
      %{"name" => "克山县北联林场", "code" => "230229402000"},
      %{"name" => "克山县第一良种场", "code" => "230229580000"},
      %{"name" => "克山县第二良种场", "code" => "230229581000"},
      %{"name" => "克山县种猪场", "code" => "230229583000"},
      %{"name" => "克山县种畜场", "code" => "230229584000"}
    ]

  def next(input) when input == "克东县" or input == "230230",
    do: [
      %{"name" => "克东镇", "code" => "230230100000"},
      %{"name" => "宝泉镇", "code" => "230230101000"},
      %{"name" => "乾丰镇", "code" => "230230102000"},
      %{"name" => "玉岗镇", "code" => "230230103000"},
      %{"name" => "蒲峪路镇", "code" => "230230104000"},
      %{"name" => "润津乡", "code" => "230230202000"},
      %{"name" => "昌盛乡", "code" => "230230204000"},
      %{"name" => "爱华林场", "code" => "230230402000"},
      %{"name" => "发展林场", "code" => "230230403000"},
      %{"name" => "东兴林场", "code" => "230230404000"},
      %{"name" => "红旗奶山羊场", "code" => "230230580000"},
      %{"name" => "第一良种场", "code" => "230230581000"},
      %{"name" => "第二良种繁殖场", "code" => "230230582000"},
      %{"name" => "果树繁殖场", "code" => "230230583000"},
      %{"name" => "种猪场", "code" => "230230584000"},
      %{"name" => "黑龙江省社会救助安置中心", "code" => "230230585000"}
    ]

  def next(input) when input == "拜泉县" or input == "230231",
    do: [
      %{"name" => "拜泉镇", "code" => "230231100000"},
      %{"name" => "三道镇", "code" => "230231101000"},
      %{"name" => "兴农镇", "code" => "230231102000"},
      %{"name" => "长春镇", "code" => "230231103000"},
      %{"name" => "龙泉镇", "code" => "230231104000"},
      %{"name" => "国富镇", "code" => "230231105000"},
      %{"name" => "富强镇", "code" => "230231106000"},
      %{"name" => "新生乡", "code" => "230231200000"},
      %{"name" => "兴国乡", "code" => "230231201000"},
      %{"name" => "上升乡", "code" => "230231203000"},
      %{"name" => "兴华乡", "code" => "230231204000"},
      %{"name" => "大众乡", "code" => "230231206000"},
      %{"name" => "丰产乡", "code" => "230231209000"},
      %{"name" => "永勤乡", "code" => "230231210000"},
      %{"name" => "爱农乡", "code" => "230231212000"},
      %{"name" => "时中乡", "code" => "230231214000"}
    ]

  def next(input) when input == "讷河市" or input == "230281",
    do: [
      %{"name" => "雨亭街道", "code" => "230281001000"},
      %{"name" => "通江街道", "code" => "230281002000"},
      %{"name" => "拉哈镇", "code" => "230281101000"},
      %{"name" => "二克浅镇", "code" => "230281102000"},
      %{"name" => "学田镇", "code" => "230281103000"},
      %{"name" => "龙河镇", "code" => "230281104000"},
      %{"name" => "讷南镇", "code" => "230281105000"},
      %{"name" => "六合镇", "code" => "230281106000"},
      %{"name" => "长发镇", "code" => "230281107000"},
      %{"name" => "通南镇", "code" => "230281108000"},
      %{"name" => "同义镇", "code" => "230281109000"},
      %{"name" => "九井镇", "code" => "230281110000"},
      %{"name" => "老莱镇", "code" => "230281111000"},
      %{"name" => "孔国乡", "code" => "230281201000"},
      %{"name" => "和盛乡", "code" => "230281207000"},
      %{"name" => "同心乡", "code" => "230281208000"},
      %{"name" => "兴旺鄂温克族乡", "code" => "230281210000"},
      %{"name" => "龙河镇保安林场", "code" => "230281400000"},
      %{"name" => "龙河镇茂山林场", "code" => "230281401000"},
      %{"name" => "龙河镇国庆林场", "code" => "230281402000"},
      %{"name" => "学田镇富源林场", "code" => "230281403000"},
      %{"name" => "老莱镇宽余林场", "code" => "230281404000"},
      %{"name" => "新江林场", "code" => "230281405000"},
      %{"name" => "一良苗圃", "code" => "230281406000"},
      %{"name" => "黑龙江省老莱农场", "code" => "230281480000"},
      %{"name" => "六合镇黎明奶牛场", "code" => "230281581000"},
      %{"name" => "孔国乡进化种猪场", "code" => "230281582000"},
      %{"name" => "二克浅镇二里种畜场", "code" => "230281583000"},
      %{"name" => "龙河镇青色草原种畜场", "code" => "230281584000"},
      %{"name" => "第一良种场", "code" => "230281585000"},
      %{"name" => "第二良种场", "code" => "230281586000"},
      %{"name" => "第三良种场", "code" => "230281587000"},
      %{"name" => "第四良种场", "code" => "230281588000"}
    ]

  def next(input) when input == "道里区" or input == "230102",
    do: [
      %{"name" => "兆麟街道", "code" => "230102001000"},
      %{"name" => "新阳路街道", "code" => "230102002000"},
      %{"name" => "抚顺街道", "code" => "230102003000"},
      %{"name" => "共乐街道", "code" => "230102004000"},
      %{"name" => "新华街道", "code" => "230102005000"},
      %{"name" => "城乡路街道", "code" => "230102006000"},
      %{"name" => "工农街道", "code" => "230102007000"},
      %{"name" => "尚志街道", "code" => "230102008000"},
      %{"name" => "斯大林街道", "code" => "230102009000"},
      %{"name" => "通江街道", "code" => "230102010000"},
      %{"name" => "经纬街道", "code" => "230102011000"},
      %{"name" => "工程街道", "code" => "230102012000"},
      %{"name" => "安静街道", "code" => "230102013000"},
      %{"name" => "安和街道", "code" => "230102014000"},
      %{"name" => "正阳河街道", "code" => "230102015000"},
      %{"name" => "建国街道", "code" => "230102016000"},
      %{"name" => "康安街道", "code" => "230102017000"},
      %{"name" => "爱建街道", "code" => "230102018000"},
      %{"name" => "群力街道", "code" => "230102019000"},
      %{"name" => "太平镇", "code" => "230102101000"},
      %{"name" => "新发镇", "code" => "230102102000"},
      %{"name" => "新农镇", "code" => "230102103000"},
      %{"name" => "榆树镇", "code" => "230102104000"}
    ]

  def next(input) when input == "南岗区" or input == "230103",
    do: [
      %{"name" => "花园街道", "code" => "230103001000"},
      %{"name" => "奋斗路街道", "code" => "230103002000"},
      %{"name" => "革新街道", "code" => "230103003000"},
      %{"name" => "文化街道", "code" => "230103004000"},
      %{"name" => "大成街道", "code" => "230103005000"},
      %{"name" => "芦家街道", "code" => "230103006000"},
      %{"name" => "荣市街道", "code" => "230103007000"},
      %{"name" => "燎原街道", "code" => "230103009000"},
      %{"name" => "松花江街道", "code" => "230103010000"},
      %{"name" => "曲线街道", "code" => "230103011000"},
      %{"name" => "通达街道", "code" => "230103012000"},
      %{"name" => "七政街道", "code" => "230103013000"},
      %{"name" => "和兴路街道", "code" => "230103015000"},
      %{"name" => "哈西街道", "code" => "230103016000"},
      %{"name" => "保健路街道", "code" => "230103017000"},
      %{"name" => "先锋路街道", "code" => "230103018000"},
      %{"name" => "新春街道", "code" => "230103019000"},
      %{"name" => "跃进街道", "code" => "230103020000"},
      %{"name" => "王岗镇", "code" => "230103101000"},
      %{"name" => "红旗满族乡", "code" => "230103201000"},
      %{"name" => "红旗农场", "code" => "230103500000"},
      %{"name" => "南岗区农垦", "code" => "230103579000"}
    ]

  def next(input) when input == "道外区" or input == "230104",
    do: [
      %{"name" => "靖宇街道", "code" => "230104001000"},
      %{"name" => "太古街道", "code" => "230104002000"},
      %{"name" => "东莱街道", "code" => "230104003000"},
      %{"name" => "滨江街道", "code" => "230104004000"},
      %{"name" => "仁里街道", "code" => "230104005000"},
      %{"name" => "南市街道", "code" => "230104006000"},
      %{"name" => "崇俭街道", "code" => "230104007000"},
      %{"name" => "振江街道", "code" => "230104008000"},
      %{"name" => "东原街道", "code" => "230104009000"},
      %{"name" => "大兴街道", "code" => "230104010000"},
      %{"name" => "胜利街道", "code" => "230104011000"},
      %{"name" => "南马街道", "code" => "230104012000"},
      %{"name" => "民强街道", "code" => "230104021000"},
      %{"name" => "大有坊街道", "code" => "230104022000"},
      %{"name" => "南直路街道", "code" => "230104023000"},
      %{"name" => "化工街道", "code" => "230104024000"},
      %{"name" => "火车头街道", "code" => "230104025000"},
      %{"name" => "新一街道", "code" => "230104026000"},
      %{"name" => "三棵树大街街道", "code" => "230104027000"},
      %{"name" => "水泥路街道", "code" => "230104028000"},
      %{"name" => "太平大街街道", "code" => "230104029000"},
      %{"name" => "黎华街道", "code" => "230104030000"},
      %{"name" => "新乐街道", "code" => "230104031000"},
      %{"name" => "永源镇", "code" => "230104102000"},
      %{"name" => "巨源镇", "code" => "230104109000"},
      %{"name" => "团结镇", "code" => "230104111000"},
      %{"name" => "民主镇", "code" => "230104112000"},
      %{"name" => "青年农场", "code" => "230104500000"},
      %{"name" => "道外农垦", "code" => "230104579000"}
    ]

  def next(input) when input == "平房区" or input == "230108",
    do: [
      %{"name" => "兴建街道", "code" => "230108001000"},
      %{"name" => "保国街道", "code" => "230108002000"},
      %{"name" => "联盟街道", "code" => "230108003000"},
      %{"name" => "友协街道", "code" => "230108004000"},
      %{"name" => "新疆街道", "code" => "230108005000"},
      %{"name" => "新伟街道", "code" => "230108006000"},
      %{"name" => "平新街道", "code" => "230108007000"},
      %{"name" => "建安街道", "code" => "230108008000"},
      %{"name" => "平盛街道", "code" => "230108009000"},
      %{"name" => "平房镇", "code" => "230108101000"},
      %{"name" => "平房农垦", "code" => "230108579000"}
    ]

  def next(input) when input == "松北区" or input == "230109",
    do: [
      %{"name" => "太阳岛街道", "code" => "230109002000"},
      %{"name" => "松浦街道", "code" => "230109003000"},
      %{"name" => "万宝街道", "code" => "230109004000"},
      %{"name" => "松北街道", "code" => "230109005000"},
      %{"name" => "松安街道", "code" => "230109006000"},
      %{"name" => "松祥街道", "code" => "230109007000"},
      %{"name" => "船口街道", "code" => "230109008000"},
      %{"name" => "对青山镇", "code" => "230109101000"},
      %{"name" => "乐业镇", "code" => "230109102000"}
    ]

  def next(input) when input == "香坊区" or input == "230110",
    do: [
      %{"name" => "香坊大街街道", "code" => "230110001000"},
      %{"name" => "安埠街道", "code" => "230110002000"},
      %{"name" => "通天街道", "code" => "230110003000"},
      %{"name" => "新香坊街道", "code" => "230110004000"},
      %{"name" => "铁东街道", "code" => "230110005000"},
      %{"name" => "新成街道", "code" => "230110006000"},
      %{"name" => "红旗街道", "code" => "230110007000"},
      %{"name" => "六顺街道", "code" => "230110008000"},
      %{"name" => "建筑街道", "code" => "230110009000"},
      %{"name" => "哈平路街道", "code" => "230110010000"},
      %{"name" => "安乐街道", "code" => "230110011000"},
      %{"name" => "健康路街道", "code" => "230110012000"},
      %{"name" => "大庆路街道", "code" => "230110013000"},
      %{"name" => "进乡街道", "code" => "230110014000"},
      %{"name" => "通乡街道", "code" => "230110015000"},
      %{"name" => "和平路街道", "code" => "230110016000"},
      %{"name" => "民生路街道", "code" => "230110017000"},
      %{"name" => "文政街道", "code" => "230110018000"},
      %{"name" => "王兆街道", "code" => "230110019000"},
      %{"name" => "黎明街道", "code" => "230110020000"},
      %{"name" => "成高子镇", "code" => "230110101000"},
      %{"name" => "幸福镇", "code" => "230110102000"},
      %{"name" => "朝阳镇", "code" => "230110103000"},
      %{"name" => "向阳镇", "code" => "230110104000"},
      %{"name" => "哈尔滨综合保税区地区", "code" => "230110400000"}
    ]

  def next(input) when input == "呼兰区" or input == "230111",
    do: [
      %{"name" => "呼兰街道", "code" => "230111001000"},
      %{"name" => "兰河街道", "code" => "230111002000"},
      %{"name" => "腰堡街道", "code" => "230111003000"},
      %{"name" => "利民街道", "code" => "230111004000"},
      %{"name" => "康金街道", "code" => "230111005000"},
      %{"name" => "双井街道", "code" => "230111006000"},
      %{"name" => "建设路街道", "code" => "230111007000"},
      %{"name" => "学院路街道", "code" => "230111008000"},
      %{"name" => "长岭街道", "code" => "230111009000"},
      %{"name" => "沈家街道", "code" => "230111010000"},
      %{"name" => "南京路街道", "code" => "230111011000"},
      %{"name" => "裕民街道", "code" => "230111012000"},
      %{"name" => "裕田街道", "code" => "230111013000"},
      %{"name" => "裕强街道", "code" => "230111014000"},
      %{"name" => "萧乡街道", "code" => "230111015000"},
      %{"name" => "公园路街道", "code" => "230111016000"},
      %{"name" => "二八镇", "code" => "230111105000"},
      %{"name" => "石人镇", "code" => "230111106000"},
      %{"name" => "白奎镇", "code" => "230111107000"},
      %{"name" => "方台镇", "code" => "230111109000"},
      %{"name" => "莲花镇", "code" => "230111110000"},
      %{"name" => "大用镇", "code" => "230111111000"},
      %{"name" => "利业镇", "code" => "230111114000"},
      %{"name" => "杨林乡", "code" => "230111201000"},
      %{"name" => "许堡乡", "code" => "230111203000"},
      %{"name" => "孟家乡", "code" => "230111205000"},
      %{"name" => "呼兰农垦", "code" => "230111579000"}
    ]

  def next(input) when input == "阿城区" or input == "230112",
    do: [
      %{"name" => "金城街道", "code" => "230112001000"},
      %{"name" => "金都街道", "code" => "230112002000"},
      %{"name" => "通城街道", "code" => "230112003000"},
      %{"name" => "河东街道", "code" => "230112004000"},
      %{"name" => "阿什河街道", "code" => "230112005000"},
      %{"name" => "玉泉街道", "code" => "230112006000"},
      %{"name" => "新利街道", "code" => "230112007000"},
      %{"name" => "双丰街道", "code" => "230112008000"},
      %{"name" => "舍利街道", "code" => "230112009000"},
      %{"name" => "小岭街道", "code" => "230112010000"},
      %{"name" => "亚沟街道", "code" => "230112011000"},
      %{"name" => "交界街道", "code" => "230112012000"},
      %{"name" => "料甸街道", "code" => "230112013000"},
      %{"name" => "蜚克图街道", "code" => "230112014000"},
      %{"name" => "杨树街道", "code" => "230112015000"},
      %{"name" => "平山镇", "code" => "230112107000"},
      %{"name" => "松峰山镇", "code" => "230112108000"},
      %{"name" => "红星镇", "code" => "230112109000"},
      %{"name" => "金龙山镇", "code" => "230112112000"},
      %{"name" => "阿城原种场", "code" => "230112503000"}
    ]

  def next(input) when input == "双城区" or input == "230113",
    do: [
      %{"name" => "五家街道", "code" => "230113002000"},
      %{"name" => "新兴街道", "code" => "230113003000"},
      %{"name" => "兰棱街道", "code" => "230113004000"},
      %{"name" => "周家街道", "code" => "230113005000"},
      %{"name" => "公正街道", "code" => "230113006000"},
      %{"name" => "承旭街道", "code" => "230113007000"},
      %{"name" => "承恩街道", "code" => "230113008000"},
      %{"name" => "永治街道", "code" => "230113009000"},
      %{"name" => "永和街道", "code" => "230113010000"},
      %{"name" => "幸福街道", "code" => "230113011000"},
      %{"name" => "韩甸镇", "code" => "230113104000"},
      %{"name" => "单城镇", "code" => "230113105000"},
      %{"name" => "东官镇", "code" => "230113106000"},
      %{"name" => "农丰满族锡伯族镇", "code" => "230113107000"},
      %{"name" => "杏山镇", "code" => "230113108000"},
      %{"name" => "西官镇", "code" => "230113109000"},
      %{"name" => "联兴镇", "code" => "230113110000"},
      %{"name" => "永胜镇", "code" => "230113111000"},
      %{"name" => "胜丰镇", "code" => "230113112000"},
      %{"name" => "金城乡", "code" => "230113201000"},
      %{"name" => "青岭满族乡", "code" => "230113203000"},
      %{"name" => "临江乡", "code" => "230113209000"},
      %{"name" => "水泉乡", "code" => "230113210000"},
      %{"name" => "乐群满族乡", "code" => "230113211000"},
      %{"name" => "万隆乡", "code" => "230113214000"},
      %{"name" => "希勤满族乡", "code" => "230113216000"},
      %{"name" => "同心满族乡", "code" => "230113217000"}
    ]

  def next(input) when input == "依兰县" or input == "230123",
    do: [
      %{"name" => "依兰镇", "code" => "230123100000"},
      %{"name" => "达连河镇", "code" => "230123101000"},
      %{"name" => "江湾镇", "code" => "230123102000"},
      %{"name" => "三道岗镇", "code" => "230123103000"},
      %{"name" => "道台桥镇", "code" => "230123104000"},
      %{"name" => "宏克利镇", "code" => "230123105000"},
      %{"name" => "团山子乡", "code" => "230123200000"},
      %{"name" => "愚公乡", "code" => "230123201000"},
      %{"name" => "迎兰朝鲜族乡", "code" => "230123202000"},
      %{"name" => "依兰县林业局", "code" => "230123400000"},
      %{"name" => "依兰农场", "code" => "230123500000"},
      %{"name" => "松花江农场", "code" => "230123501000"}
    ]

  def next(input) when input == "方正县" or input == "230124",
    do: [
      %{"name" => "方正镇", "code" => "230124100000"},
      %{"name" => "会发镇", "code" => "230124101000"},
      %{"name" => "大罗密镇", "code" => "230124102000"},
      %{"name" => "得莫利镇", "code" => "230124103000"},
      %{"name" => "天门乡", "code" => "230124200000"},
      %{"name" => "松南乡", "code" => "230124201000"},
      %{"name" => "德善乡", "code" => "230124202000"},
      %{"name" => "宝兴乡", "code" => "230124204000"},
      %{"name" => "方正林业局", "code" => "230124400000"},
      %{"name" => "沙河农场", "code" => "230124500000"}
    ]

  def next(input) when input == "宾县" or input == "230125",
    do: [
      %{"name" => "宾州镇", "code" => "230125100000"},
      %{"name" => "居仁镇", "code" => "230125101000"},
      %{"name" => "宾西镇", "code" => "230125102000"},
      %{"name" => "糖坊镇", "code" => "230125103000"},
      %{"name" => "宾安镇", "code" => "230125104000"},
      %{"name" => "新甸镇", "code" => "230125105000"},
      %{"name" => "胜利镇", "code" => "230125106000"},
      %{"name" => "宁远镇", "code" => "230125107000"},
      %{"name" => "摆渡镇", "code" => "230125109000"},
      %{"name" => "平坊镇", "code" => "230125110000"},
      %{"name" => "满井镇", "code" => "230125111000"},
      %{"name" => "常安镇", "code" => "230125112000"},
      %{"name" => "永和乡", "code" => "230125201000"},
      %{"name" => "鸟河乡", "code" => "230125203000"},
      %{"name" => "民和乡", "code" => "230125204000"},
      %{"name" => "经建乡", "code" => "230125205000"},
      %{"name" => "三宝乡", "code" => "230125210000"}
    ]

  def next(input) when input == "巴彦县" or input == "230126",
    do: [
      %{"name" => "巴彦镇", "code" => "230126100000"},
      %{"name" => "兴隆镇", "code" => "230126101000"},
      %{"name" => "西集镇", "code" => "230126102000"},
      %{"name" => "洼兴镇", "code" => "230126103000"},
      %{"name" => "龙泉镇", "code" => "230126104000"},
      %{"name" => "巴彦港镇", "code" => "230126105000"},
      %{"name" => "龙庙镇", "code" => "230126106000"},
      %{"name" => "万发镇", "code" => "230126107000"},
      %{"name" => "天增镇", "code" => "230126108000"},
      %{"name" => "黑山镇", "code" => "230126110000"},
      %{"name" => "松花江乡", "code" => "230126200000"},
      %{"name" => "富江乡", "code" => "230126202000"},
      %{"name" => "华山乡", "code" => "230126204000"},
      %{"name" => "丰乐乡", "code" => "230126205000"},
      %{"name" => "德祥乡", "code" => "230126209000"},
      %{"name" => "红光乡", "code" => "230126210000"},
      %{"name" => "山后乡", "code" => "230126212000"},
      %{"name" => "镇东乡", "code" => "230126214000"},
      %{"name" => "兴隆林业局", "code" => "230126400000"},
      %{"name" => "工业园区", "code" => "230126401000"}
    ]

  def next(input) when input == "木兰县" or input == "230127",
    do: [
      %{"name" => "木兰镇", "code" => "230127100000"},
      %{"name" => "东兴镇", "code" => "230127101000"},
      %{"name" => "大贵镇", "code" => "230127102000"},
      %{"name" => "利东镇", "code" => "230127103000"},
      %{"name" => "柳河镇", "code" => "230127104000"},
      %{"name" => "新民镇", "code" => "230127105000"},
      %{"name" => "建国乡", "code" => "230127200000"},
      %{"name" => "吉兴乡", "code" => "230127203000"},
      %{"name" => "兴隆林业局", "code" => "230127400000"}
    ]

  def next(input) when input == "通河县" or input == "230128",
    do: [
      %{"name" => "通河镇", "code" => "230128100000"},
      %{"name" => "乌鸦泡镇", "code" => "230128101000"},
      %{"name" => "清河镇", "code" => "230128102000"},
      %{"name" => "浓河镇", "code" => "230128103000"},
      %{"name" => "凤山镇", "code" => "230128104000"},
      %{"name" => "祥顺镇", "code" => "230128105000"},
      %{"name" => "富林镇", "code" => "230128106000"},
      %{"name" => "三站镇", "code" => "230128107000"},
      %{"name" => "清河林业局", "code" => "230128400000"},
      %{"name" => "兴隆林业局", "code" => "230128401000"},
      %{"name" => "岔林河农场", "code" => "230128500000"}
    ]

  def next(input) when input == "延寿县" or input == "230129",
    do: [
      %{"name" => "延寿镇", "code" => "230129100000"},
      %{"name" => "六团镇", "code" => "230129101000"},
      %{"name" => "中和镇", "code" => "230129102000"},
      %{"name" => "加信镇", "code" => "230129103000"},
      %{"name" => "延河镇", "code" => "230129104000"},
      %{"name" => "玉河镇", "code" => "230129105000"},
      %{"name" => "安山乡", "code" => "230129204000"},
      %{"name" => "寿山乡", "code" => "230129205000"},
      %{"name" => "青川乡", "code" => "230129209000"},
      %{"name" => "太平川", "code" => "230129400000"},
      %{"name" => "庆阳农场", "code" => "230129500000"}
    ]

  def next(input) when input == "尚志市" or input == "230183",
    do: [
      %{"name" => "尚志镇", "code" => "230183100000"},
      %{"name" => "一面坡镇", "code" => "230183101000"},
      %{"name" => "苇河镇", "code" => "230183102000"},
      %{"name" => "亚布力镇", "code" => "230183103000"},
      %{"name" => "帽儿山镇", "code" => "230183104000"},
      %{"name" => "亮河镇", "code" => "230183105000"},
      %{"name" => "庆阳镇", "code" => "230183106000"},
      %{"name" => "石头河子镇", "code" => "230183107000"},
      %{"name" => "元宝镇", "code" => "230183108000"},
      %{"name" => "黑龙宫镇", "code" => "230183109000"},
      %{"name" => "长寿乡", "code" => "230183202000"},
      %{"name" => "乌吉密乡", "code" => "230183204000"},
      %{"name" => "鱼池乡", "code" => "230183206000"},
      %{"name" => "珍珠山乡", "code" => "230183207000"},
      %{"name" => "老街基乡", "code" => "230183208000"},
      %{"name" => "马延乡", "code" => "230183209000"},
      %{"name" => "河东乡", "code" => "230183211000"},
      %{"name" => "苇河林业局", "code" => "230183400000"},
      %{"name" => "亚布力林业局", "code" => "230183401000"},
      %{"name" => "哈尔滨市政府亚布力滑雪旅游度假区管理委员会", "code" => "230183402000"}
    ]

  def next(input) when input == "五常市" or input == "230184",
    do: [
      %{"name" => "五常镇", "code" => "230184100000"},
      %{"name" => "拉林满族镇", "code" => "230184101000"},
      %{"name" => "山河镇", "code" => "230184102000"},
      %{"name" => "小山子镇", "code" => "230184103000"},
      %{"name" => "安家镇", "code" => "230184104000"},
      %{"name" => "牛家满族镇", "code" => "230184105000"},
      %{"name" => "杜家镇", "code" => "230184106000"},
      %{"name" => "背荫河镇", "code" => "230184107000"},
      %{"name" => "冲河镇", "code" => "230184108000"},
      %{"name" => "沙河子镇", "code" => "230184109000"},
      %{"name" => "向阳镇", "code" => "230184110000"},
      %{"name" => "龙凤山镇", "code" => "230184111000"},
      %{"name" => "兴盛乡", "code" => "230184200000"},
      %{"name" => "志广乡", "code" => "230184201000"},
      %{"name" => "卫国乡", "code" => "230184202000"},
      %{"name" => "常堡乡", "code" => "230184203000"},
      %{"name" => "民意乡", "code" => "230184206000"},
      %{"name" => "红旗满族乡", "code" => "230184209000"},
      %{"name" => "八家子乡", "code" => "230184210000"},
      %{"name" => "民乐朝鲜族乡", "code" => "230184211000"},
      %{"name" => "营城子满族乡", "code" => "230184212000"},
      %{"name" => "长山乡", "code" => "230184214000"},
      %{"name" => "兴隆乡", "code" => "230184215000"},
      %{"name" => "二河乡", "code" => "230184216000"},
      %{"name" => "山河屯林业局", "code" => "230184400000"}
    ]

  def next(_), do: nil
end