defmodule ChinaAdminDivisions.Gen.Lv3x.M31 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "黄浦区" or input == "310101",
    do: [
      %{"name" => "南京东路街道", "code" => "310101002"},
      %{"name" => "外滩街道", "code" => "310101013"},
      %{"name" => "半淞园路街道", "code" => "310101015"},
      %{"name" => "小东门街道", "code" => "310101017"},
      %{"name" => "豫园街道", "code" => "310101018"},
      %{"name" => "老西门街道", "code" => "310101019"},
      %{"name" => "五里桥街道", "code" => "310101020"},
      %{"name" => "打浦桥街道", "code" => "310101021"},
      %{"name" => "淮海中路街道", "code" => "310101022"},
      %{"name" => "瑞金二路街道", "code" => "310101023"}
    ]

  def next(input) when input == "徐汇区" or input == "310104",
    do: [
      %{"name" => "天平路街道", "code" => "310104003"},
      %{"name" => "湖南路街道", "code" => "310104004"},
      %{"name" => "斜土路街道", "code" => "310104007"},
      %{"name" => "枫林路街道", "code" => "310104008"},
      %{"name" => "长桥街道", "code" => "310104010"},
      %{"name" => "田林街道", "code" => "310104011"},
      %{"name" => "虹梅路街道", "code" => "310104012"},
      %{"name" => "康健新村街道", "code" => "310104013"},
      %{"name" => "徐家汇街道", "code" => "310104014"},
      %{"name" => "凌云路街道", "code" => "310104015"},
      %{"name" => "龙华街道", "code" => "310104016"},
      %{"name" => "漕河泾街道", "code" => "310104017"},
      %{"name" => "华泾镇", "code" => "310104103"},
      %{"name" => "漕河泾新兴技术开发区", "code" => "310104501"}
    ]

  def next(input) when input == "长宁区" or input == "310105",
    do: [
      %{"name" => "华阳路街道", "code" => "310105001"},
      %{"name" => "江苏路街道", "code" => "310105002"},
      %{"name" => "新华路街道", "code" => "310105004"},
      %{"name" => "周家桥街道", "code" => "310105005"},
      %{"name" => "天山路街道", "code" => "310105006"},
      %{"name" => "仙霞新村街道", "code" => "310105008"},
      %{"name" => "虹桥街道", "code" => "310105009"},
      %{"name" => "程家桥街道", "code" => "310105010"},
      %{"name" => "北新泾街道", "code" => "310105011"},
      %{"name" => "新泾镇", "code" => "310105102"}
    ]

  def next(input) when input == "静安区" or input == "310106",
    do: [
      %{"name" => "江宁路街道", "code" => "310106006"},
      %{"name" => "石门二路街道", "code" => "310106011"},
      %{"name" => "南京西路街道", "code" => "310106012"},
      %{"name" => "静安寺街道", "code" => "310106013"},
      %{"name" => "曹家渡街道", "code" => "310106014"},
      %{"name" => "天目西路街道", "code" => "310106015"},
      %{"name" => "北站街道", "code" => "310106016"},
      %{"name" => "宝山路街道", "code" => "310106017"},
      %{"name" => "共和新路街道", "code" => "310106018"},
      %{"name" => "大宁路街道", "code" => "310106019"},
      %{"name" => "彭浦新村街道", "code" => "310106020"},
      %{"name" => "临汾路街道", "code" => "310106021"},
      %{"name" => "芷江西路街道", "code" => "310106022"},
      %{"name" => "彭浦镇", "code" => "310106101"}
    ]

  def next(input) when input == "普陀区" or input == "310107",
    do: [
      %{"name" => "曹杨新村街道", "code" => "310107005"},
      %{"name" => "长风新村街道", "code" => "310107014"},
      %{"name" => "长寿路街道", "code" => "310107015"},
      %{"name" => "甘泉路街道", "code" => "310107016"},
      %{"name" => "石泉路街道", "code" => "310107017"},
      %{"name" => "宜川路街道", "code" => "310107020"},
      %{"name" => "万里街道", "code" => "310107021"},
      %{"name" => "真如镇街道", "code" => "310107022"},
      %{"name" => "长征镇", "code" => "310107102"},
      %{"name" => "桃浦镇", "code" => "310107103"}
    ]

  def next(input) when input == "虹口区" or input == "310109",
    do: [
      %{"name" => "欧阳路街道", "code" => "310109009"},
      %{"name" => "曲阳路街道", "code" => "310109010"},
      %{"name" => "广中路街道", "code" => "310109011"},
      %{"name" => "嘉兴路街道", "code" => "310109014"},
      %{"name" => "凉城新村街道", "code" => "310109016"},
      %{"name" => "四川北路街道", "code" => "310109017"},
      %{"name" => "北外滩街道", "code" => "310109018"},
      %{"name" => "江湾镇街道", "code" => "310109019"}
    ]

  def next(input) when input == "杨浦区" or input == "310110",
    do: [
      %{"name" => "定海路街道", "code" => "310110001"},
      %{"name" => "平凉路街道", "code" => "310110006"},
      %{"name" => "江浦路街道", "code" => "310110008"},
      %{"name" => "四平路街道", "code" => "310110009"},
      %{"name" => "控江路街道", "code" => "310110012"},
      %{"name" => "长白新村街道", "code" => "310110013"},
      %{"name" => "延吉新村街道", "code" => "310110015"},
      %{"name" => "殷行街道", "code" => "310110016"},
      %{"name" => "大桥街道", "code" => "310110018"},
      %{"name" => "五角场街道", "code" => "310110019"},
      %{"name" => "新江湾城街道", "code" => "310110020"},
      %{"name" => "长海路街道", "code" => "310110021"}
    ]

  def next(input) when input == "闵行区" or input == "310112",
    do: [
      %{"name" => "江川路街道", "code" => "310112001"},
      %{"name" => "古美街道", "code" => "310112006"},
      %{"name" => "新虹街道", "code" => "310112008"},
      %{"name" => "浦锦街道", "code" => "310112009"},
      %{"name" => "莘庄镇", "code" => "310112101"},
      %{"name" => "七宝镇", "code" => "310112102"},
      %{"name" => "颛桥镇", "code" => "310112103"},
      %{"name" => "华漕镇", "code" => "310112106"},
      %{"name" => "虹桥镇", "code" => "310112107"},
      %{"name" => "梅陇镇", "code" => "310112108"},
      %{"name" => "吴泾镇", "code" => "310112110"},
      %{"name" => "马桥镇", "code" => "310112112"},
      %{"name" => "浦江镇", "code" => "310112114"},
      %{"name" => "莘庄工业区", "code" => "310112501"}
    ]

  def next(input) when input == "宝山区" or input == "310113",
    do: [
      %{"name" => "友谊路街道", "code" => "310113003"},
      %{"name" => "吴淞街道", "code" => "310113007"},
      %{"name" => "张庙街道", "code" => "310113008"},
      %{"name" => "罗店镇", "code" => "310113101"},
      %{"name" => "大场镇", "code" => "310113102"},
      %{"name" => "杨行镇", "code" => "310113103"},
      %{"name" => "月浦镇", "code" => "310113104"},
      %{"name" => "罗泾镇", "code" => "310113106"},
      %{"name" => "顾村镇", "code" => "310113109"},
      %{"name" => "高境镇", "code" => "310113111"},
      %{"name" => "庙行镇", "code" => "310113112"},
      %{"name" => "淞南镇", "code" => "310113113"},
      %{"name" => "宝山工业园区", "code" => "310113501"}
    ]

  def next(input) when input == "嘉定区" or input == "310114",
    do: [
      %{"name" => "新成路街道", "code" => "310114001"},
      %{"name" => "真新街道", "code" => "310114002"},
      %{"name" => "嘉定镇街道", "code" => "310114004"},
      %{"name" => "南翔镇", "code" => "310114102"},
      %{"name" => "安亭镇", "code" => "310114103"},
      %{"name" => "马陆镇", "code" => "310114106"},
      %{"name" => "徐行镇", "code" => "310114109"},
      %{"name" => "华亭镇", "code" => "310114111"},
      %{"name" => "外冈镇", "code" => "310114114"},
      %{"name" => "江桥镇", "code" => "310114118"},
      %{"name" => "菊园新区", "code" => "310114401"},
      %{"name" => "嘉定工业区", "code" => "310114501"}
    ]

  def next(input) when input == "浦东新区" or input == "310115",
    do: [
      %{"name" => "潍坊新村街道", "code" => "310115004"},
      %{"name" => "陆家嘴街道", "code" => "310115005"},
      %{"name" => "周家渡街道", "code" => "310115007"},
      %{"name" => "塘桥街道", "code" => "310115008"},
      %{"name" => "上钢新村街道", "code" => "310115009"},
      %{"name" => "南码头路街道", "code" => "310115010"},
      %{"name" => "沪东新村街道", "code" => "310115011"},
      %{"name" => "金杨新村街道", "code" => "310115012"},
      %{"name" => "洋泾街道", "code" => "310115013"},
      %{"name" => "浦兴路街道", "code" => "310115014"},
      %{"name" => "东明路街道", "code" => "310115015"},
      %{"name" => "花木街道", "code" => "310115016"},
      %{"name" => "川沙新镇", "code" => "310115103"},
      %{"name" => "高桥镇", "code" => "310115104"},
      %{"name" => "北蔡镇", "code" => "310115105"},
      %{"name" => "合庆镇", "code" => "310115110"},
      %{"name" => "唐镇", "code" => "310115114"},
      %{"name" => "曹路镇", "code" => "310115117"},
      %{"name" => "金桥镇", "code" => "310115120"},
      %{"name" => "高行镇", "code" => "310115121"},
      %{"name" => "高东镇", "code" => "310115123"},
      %{"name" => "张江镇", "code" => "310115125"},
      %{"name" => "三林镇", "code" => "310115130"},
      %{"name" => "惠南镇", "code" => "310115131"},
      %{"name" => "周浦镇", "code" => "310115132"},
      %{"name" => "新场镇", "code" => "310115133"},
      %{"name" => "大团镇", "code" => "310115134"},
      %{"name" => "康桥镇", "code" => "310115136"},
      %{"name" => "航头镇", "code" => "310115137"},
      %{"name" => "祝桥镇", "code" => "310115139"},
      %{"name" => "泥城镇", "code" => "310115140"},
      %{"name" => "宣桥镇", "code" => "310115141"},
      %{"name" => "书院镇", "code" => "310115142"},
      %{"name" => "万祥镇", "code" => "310115143"},
      %{"name" => "老港镇", "code" => "310115144"},
      %{"name" => "南汇新城镇", "code" => "310115145"},
      %{"name" => "芦潮港农场", "code" => "310115401"},
      %{"name" => "东海农场", "code" => "310115402"},
      %{"name" => "朝阳农场", "code" => "310115403"},
      %{"name" => "中国（上海）自由贸易试验区（保税片区）", "code" => "310115501"},
      %{"name" => "金桥经济技术开发区", "code" => "310115502"},
      %{"name" => "张江高科技园区", "code" => "310115503"}
    ]

  def next(input) when input == "金山区" or input == "310116",
    do: [
      %{"name" => "石化街道", "code" => "310116001"},
      %{"name" => "朱泾镇", "code" => "310116101"},
      %{"name" => "枫泾镇", "code" => "310116102"},
      %{"name" => "张堰镇", "code" => "310116103"},
      %{"name" => "亭林镇", "code" => "310116104"},
      %{"name" => "吕巷镇", "code" => "310116105"},
      %{"name" => "廊下镇", "code" => "310116107"},
      %{"name" => "金山卫镇", "code" => "310116109"},
      %{"name" => "漕泾镇", "code" => "310116112"},
      %{"name" => "山阳镇", "code" => "310116113"},
      %{"name" => "上海湾区高新技术产业开发区", "code" => "310116503"}
    ]

  def next(input) when input == "松江区" or input == "310117",
    do: [
      %{"name" => "岳阳街道", "code" => "310117001"},
      %{"name" => "永丰街道", "code" => "310117002"},
      %{"name" => "方松街道", "code" => "310117003"},
      %{"name" => "中山街道", "code" => "310117004"},
      %{"name" => "广富林街道", "code" => "310117005"},
      %{"name" => "九里亭街道", "code" => "310117006"},
      %{"name" => "泗泾镇", "code" => "310117102"},
      %{"name" => "佘山镇", "code" => "310117103"},
      %{"name" => "车墩镇", "code" => "310117104"},
      %{"name" => "新桥镇", "code" => "310117105"},
      %{"name" => "洞泾镇", "code" => "310117106"},
      %{"name" => "九亭镇", "code" => "310117107"},
      %{"name" => "泖港镇", "code" => "310117109"},
      %{"name" => "石湖荡镇", "code" => "310117116"},
      %{"name" => "新浜镇", "code" => "310117117"},
      %{"name" => "叶榭镇", "code" => "310117120"},
      %{"name" => "小昆山镇", "code" => "310117121"},
      %{"name" => "松江工业区", "code" => "310117501"},
      %{"name" => "佘山度假区", "code" => "310117504"},
      %{"name" => "上海松江出口加工区", "code" => "310117507"}
    ]

  def next(input) when input == "青浦区" or input == "310118",
    do: [
      %{"name" => "夏阳街道", "code" => "310118001"},
      %{"name" => "盈浦街道", "code" => "310118002"},
      %{"name" => "香花桥街道", "code" => "310118003"},
      %{"name" => "朱家角镇", "code" => "310118102"},
      %{"name" => "练塘镇", "code" => "310118103"},
      %{"name" => "金泽镇", "code" => "310118104"},
      %{"name" => "赵巷镇", "code" => "310118105"},
      %{"name" => "徐泾镇", "code" => "310118106"},
      %{"name" => "华新镇", "code" => "310118107"},
      %{"name" => "重固镇", "code" => "310118109"},
      %{"name" => "白鹤镇", "code" => "310118110"}
    ]

  def next(input) when input == "奉贤区" or input == "310120",
    do: [
      %{"name" => "西渡街道", "code" => "310120001"},
      %{"name" => "奉浦街道", "code" => "310120002"},
      %{"name" => "金海街道", "code" => "310120003"},
      %{"name" => "南桥镇", "code" => "310120101"},
      %{"name" => "奉城镇", "code" => "310120102"},
      %{"name" => "庄行镇", "code" => "310120104"},
      %{"name" => "金汇镇", "code" => "310120106"},
      %{"name" => "四团镇", "code" => "310120109"},
      %{"name" => "青村镇", "code" => "310120111"},
      %{"name" => "柘林镇", "code" => "310120118"},
      %{"name" => "海湾镇", "code" => "310120123"},
      %{"name" => "海湾旅游区", "code" => "310120503"}
    ]

  def next(input) when input == "崇明区" or input == "310151",
    do: [
      %{"name" => "城桥镇", "code" => "310151101"},
      %{"name" => "堡镇", "code" => "310151102"},
      %{"name" => "新河镇", "code" => "310151103"},
      %{"name" => "庙镇", "code" => "310151104"},
      %{"name" => "竖新镇", "code" => "310151105"},
      %{"name" => "向化镇", "code" => "310151106"},
      %{"name" => "三星镇", "code" => "310151107"},
      %{"name" => "港沿镇", "code" => "310151108"},
      %{"name" => "中兴镇", "code" => "310151109"},
      %{"name" => "陈家镇", "code" => "310151110"},
      %{"name" => "绿华镇", "code" => "310151111"},
      %{"name" => "港西镇", "code" => "310151112"},
      %{"name" => "建设镇", "code" => "310151113"},
      %{"name" => "新海镇", "code" => "310151114"},
      %{"name" => "东平镇", "code" => "310151115"},
      %{"name" => "长兴镇", "code" => "310151116"},
      %{"name" => "新村乡", "code" => "310151201"},
      %{"name" => "横沙乡", "code" => "310151202"},
      %{"name" => "前卫农场", "code" => "310151401"},
      %{"name" => "东平林场", "code" => "310151402"},
      %{"name" => "上实现代农业园区", "code" => "310151501"}
    ]

  def next(_), do: nil
end