defmodule ChinaAdminDivisions.Gen.Lv3x.M31 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "黄浦区" or input == "310101",
    do: [
      %{"name" => "南京东路街道", "code" => "310101002000"},
      %{"name" => "外滩街道", "code" => "310101013000"},
      %{"name" => "半淞园路街道", "code" => "310101015000"},
      %{"name" => "小东门街道", "code" => "310101017000"},
      %{"name" => "豫园街道", "code" => "310101018000"},
      %{"name" => "老西门街道", "code" => "310101019000"},
      %{"name" => "五里桥街道", "code" => "310101020000"},
      %{"name" => "打浦桥街道", "code" => "310101021000"},
      %{"name" => "淮海中路街道", "code" => "310101022000"},
      %{"name" => "瑞金二路街道", "code" => "310101023000"}
    ]

  def next(input) when input == "徐汇区" or input == "310104",
    do: [
      %{"name" => "天平路街道", "code" => "310104003000"},
      %{"name" => "湖南路街道", "code" => "310104004000"},
      %{"name" => "斜土路街道", "code" => "310104007000"},
      %{"name" => "枫林路街道", "code" => "310104008000"},
      %{"name" => "长桥街道", "code" => "310104010000"},
      %{"name" => "田林街道", "code" => "310104011000"},
      %{"name" => "虹梅路街道", "code" => "310104012000"},
      %{"name" => "康健新村街道", "code" => "310104013000"},
      %{"name" => "徐家汇街道", "code" => "310104014000"},
      %{"name" => "凌云路街道", "code" => "310104015000"},
      %{"name" => "龙华街道", "code" => "310104016000"},
      %{"name" => "漕河泾街道", "code" => "310104017000"},
      %{"name" => "华泾镇", "code" => "310104103000"},
      %{"name" => "漕河泾新兴技术开发区", "code" => "310104501000"}
    ]

  def next(input) when input == "长宁区" or input == "310105",
    do: [
      %{"name" => "华阳路街道", "code" => "310105001000"},
      %{"name" => "江苏路街道", "code" => "310105002000"},
      %{"name" => "新华路街道", "code" => "310105004000"},
      %{"name" => "周家桥街道", "code" => "310105005000"},
      %{"name" => "天山路街道", "code" => "310105006000"},
      %{"name" => "仙霞新村街道", "code" => "310105008000"},
      %{"name" => "虹桥街道", "code" => "310105009000"},
      %{"name" => "程家桥街道", "code" => "310105010000"},
      %{"name" => "北新泾街道", "code" => "310105011000"},
      %{"name" => "新泾镇", "code" => "310105102000"}
    ]

  def next(input) when input == "静安区" or input == "310106",
    do: [
      %{"name" => "江宁路街道", "code" => "310106006000"},
      %{"name" => "石门二路街道", "code" => "310106011000"},
      %{"name" => "南京西路街道", "code" => "310106012000"},
      %{"name" => "静安寺街道", "code" => "310106013000"},
      %{"name" => "曹家渡街道", "code" => "310106014000"},
      %{"name" => "天目西路街道", "code" => "310106015000"},
      %{"name" => "北站街道", "code" => "310106016000"},
      %{"name" => "宝山路街道", "code" => "310106017000"},
      %{"name" => "共和新路街道", "code" => "310106018000"},
      %{"name" => "大宁路街道", "code" => "310106019000"},
      %{"name" => "彭浦新村街道", "code" => "310106020000"},
      %{"name" => "临汾路街道", "code" => "310106021000"},
      %{"name" => "芷江西路街道", "code" => "310106022000"},
      %{"name" => "彭浦镇", "code" => "310106101000"}
    ]

  def next(input) when input == "普陀区" or input == "310107",
    do: [
      %{"name" => "曹杨新村街道", "code" => "310107005000"},
      %{"name" => "长风新村街道", "code" => "310107014000"},
      %{"name" => "长寿路街道", "code" => "310107015000"},
      %{"name" => "甘泉路街道", "code" => "310107016000"},
      %{"name" => "石泉路街道", "code" => "310107017000"},
      %{"name" => "宜川路街道", "code" => "310107020000"},
      %{"name" => "万里街道", "code" => "310107021000"},
      %{"name" => "真如镇街道", "code" => "310107022000"},
      %{"name" => "长征镇", "code" => "310107102000"},
      %{"name" => "桃浦镇", "code" => "310107103000"}
    ]

  def next(input) when input == "虹口区" or input == "310109",
    do: [
      %{"name" => "欧阳路街道", "code" => "310109009000"},
      %{"name" => "曲阳路街道", "code" => "310109010000"},
      %{"name" => "广中路街道", "code" => "310109011000"},
      %{"name" => "嘉兴路街道", "code" => "310109014000"},
      %{"name" => "凉城新村街道", "code" => "310109016000"},
      %{"name" => "四川北路街道", "code" => "310109017000"},
      %{"name" => "北外滩街道", "code" => "310109018000"},
      %{"name" => "江湾镇街道", "code" => "310109019000"}
    ]

  def next(input) when input == "杨浦区" or input == "310110",
    do: [
      %{"name" => "定海路街道", "code" => "310110001000"},
      %{"name" => "平凉路街道", "code" => "310110006000"},
      %{"name" => "江浦路街道", "code" => "310110008000"},
      %{"name" => "四平路街道", "code" => "310110009000"},
      %{"name" => "控江路街道", "code" => "310110012000"},
      %{"name" => "长白新村街道", "code" => "310110013000"},
      %{"name" => "延吉新村街道", "code" => "310110015000"},
      %{"name" => "殷行街道", "code" => "310110016000"},
      %{"name" => "大桥街道", "code" => "310110018000"},
      %{"name" => "五角场街道", "code" => "310110019000"},
      %{"name" => "新江湾城街道", "code" => "310110020000"},
      %{"name" => "长海路街道", "code" => "310110021000"}
    ]

  def next(input) when input == "闵行区" or input == "310112",
    do: [
      %{"name" => "江川路街道", "code" => "310112001000"},
      %{"name" => "古美街道", "code" => "310112006000"},
      %{"name" => "新虹街道", "code" => "310112008000"},
      %{"name" => "浦锦街道", "code" => "310112009000"},
      %{"name" => "莘庄镇", "code" => "310112101000"},
      %{"name" => "七宝镇", "code" => "310112102000"},
      %{"name" => "颛桥镇", "code" => "310112103000"},
      %{"name" => "华漕镇", "code" => "310112106000"},
      %{"name" => "虹桥镇", "code" => "310112107000"},
      %{"name" => "梅陇镇", "code" => "310112108000"},
      %{"name" => "吴泾镇", "code" => "310112110000"},
      %{"name" => "马桥镇", "code" => "310112112000"},
      %{"name" => "浦江镇", "code" => "310112114000"},
      %{"name" => "莘庄工业区", "code" => "310112501000"}
    ]

  def next(input) when input == "宝山区" or input == "310113",
    do: [
      %{"name" => "友谊路街道", "code" => "310113003000"},
      %{"name" => "吴淞街道", "code" => "310113007000"},
      %{"name" => "张庙街道", "code" => "310113008000"},
      %{"name" => "罗店镇", "code" => "310113101000"},
      %{"name" => "大场镇", "code" => "310113102000"},
      %{"name" => "杨行镇", "code" => "310113103000"},
      %{"name" => "月浦镇", "code" => "310113104000"},
      %{"name" => "罗泾镇", "code" => "310113106000"},
      %{"name" => "顾村镇", "code" => "310113109000"},
      %{"name" => "高境镇", "code" => "310113111000"},
      %{"name" => "庙行镇", "code" => "310113112000"},
      %{"name" => "淞南镇", "code" => "310113113000"},
      %{"name" => "宝山工业园区", "code" => "310113501000"}
    ]

  def next(input) when input == "嘉定区" or input == "310114",
    do: [
      %{"name" => "新成路街道", "code" => "310114001000"},
      %{"name" => "真新街道", "code" => "310114002000"},
      %{"name" => "嘉定镇街道", "code" => "310114004000"},
      %{"name" => "南翔镇", "code" => "310114102000"},
      %{"name" => "安亭镇", "code" => "310114103000"},
      %{"name" => "马陆镇", "code" => "310114106000"},
      %{"name" => "徐行镇", "code" => "310114109000"},
      %{"name" => "华亭镇", "code" => "310114111000"},
      %{"name" => "外冈镇", "code" => "310114114000"},
      %{"name" => "江桥镇", "code" => "310114118000"},
      %{"name" => "菊园新区", "code" => "310114401000"},
      %{"name" => "嘉定工业区", "code" => "310114501000"}
    ]

  def next(input) when input == "浦东新区" or input == "310115",
    do: [
      %{"name" => "潍坊新村街道", "code" => "310115004000"},
      %{"name" => "陆家嘴街道", "code" => "310115005000"},
      %{"name" => "周家渡街道", "code" => "310115007000"},
      %{"name" => "塘桥街道", "code" => "310115008000"},
      %{"name" => "上钢新村街道", "code" => "310115009000"},
      %{"name" => "南码头路街道", "code" => "310115010000"},
      %{"name" => "沪东新村街道", "code" => "310115011000"},
      %{"name" => "金杨新村街道", "code" => "310115012000"},
      %{"name" => "洋泾街道", "code" => "310115013000"},
      %{"name" => "浦兴路街道", "code" => "310115014000"},
      %{"name" => "东明路街道", "code" => "310115015000"},
      %{"name" => "花木街道", "code" => "310115016000"},
      %{"name" => "川沙新镇", "code" => "310115103000"},
      %{"name" => "高桥镇", "code" => "310115104000"},
      %{"name" => "北蔡镇", "code" => "310115105000"},
      %{"name" => "合庆镇", "code" => "310115110000"},
      %{"name" => "唐镇", "code" => "310115114000"},
      %{"name" => "曹路镇", "code" => "310115117000"},
      %{"name" => "金桥镇", "code" => "310115120000"},
      %{"name" => "高行镇", "code" => "310115121000"},
      %{"name" => "高东镇", "code" => "310115123000"},
      %{"name" => "张江镇", "code" => "310115125000"},
      %{"name" => "三林镇", "code" => "310115130000"},
      %{"name" => "惠南镇", "code" => "310115131000"},
      %{"name" => "周浦镇", "code" => "310115132000"},
      %{"name" => "新场镇", "code" => "310115133000"},
      %{"name" => "大团镇", "code" => "310115134000"},
      %{"name" => "康桥镇", "code" => "310115136000"},
      %{"name" => "航头镇", "code" => "310115137000"},
      %{"name" => "祝桥镇", "code" => "310115139000"},
      %{"name" => "泥城镇", "code" => "310115140000"},
      %{"name" => "宣桥镇", "code" => "310115141000"},
      %{"name" => "书院镇", "code" => "310115142000"},
      %{"name" => "万祥镇", "code" => "310115143000"},
      %{"name" => "老港镇", "code" => "310115144000"},
      %{"name" => "南汇新城镇", "code" => "310115145000"},
      %{"name" => "芦潮港农场", "code" => "310115401000"},
      %{"name" => "东海农场", "code" => "310115402000"},
      %{"name" => "朝阳农场", "code" => "310115403000"},
      %{"name" => "中国（上海）自由贸易试验区（保税片区）", "code" => "310115501000"},
      %{"name" => "金桥经济技术开发区", "code" => "310115502000"},
      %{"name" => "张江高科技园区", "code" => "310115503000"}
    ]

  def next(input) when input == "金山区" or input == "310116",
    do: [
      %{"name" => "石化街道", "code" => "310116001000"},
      %{"name" => "朱泾镇", "code" => "310116101000"},
      %{"name" => "枫泾镇", "code" => "310116102000"},
      %{"name" => "张堰镇", "code" => "310116103000"},
      %{"name" => "亭林镇", "code" => "310116104000"},
      %{"name" => "吕巷镇", "code" => "310116105000"},
      %{"name" => "廊下镇", "code" => "310116107000"},
      %{"name" => "金山卫镇", "code" => "310116109000"},
      %{"name" => "漕泾镇", "code" => "310116112000"},
      %{"name" => "山阳镇", "code" => "310116113000"},
      %{"name" => "上海湾区高新技术产业开发区", "code" => "310116503000"}
    ]

  def next(input) when input == "松江区" or input == "310117",
    do: [
      %{"name" => "岳阳街道", "code" => "310117001000"},
      %{"name" => "永丰街道", "code" => "310117002000"},
      %{"name" => "方松街道", "code" => "310117003000"},
      %{"name" => "中山街道", "code" => "310117004000"},
      %{"name" => "广富林街道", "code" => "310117005000"},
      %{"name" => "九里亭街道", "code" => "310117006000"},
      %{"name" => "泗泾镇", "code" => "310117102000"},
      %{"name" => "佘山镇", "code" => "310117103000"},
      %{"name" => "车墩镇", "code" => "310117104000"},
      %{"name" => "新桥镇", "code" => "310117105000"},
      %{"name" => "洞泾镇", "code" => "310117106000"},
      %{"name" => "九亭镇", "code" => "310117107000"},
      %{"name" => "泖港镇", "code" => "310117109000"},
      %{"name" => "石湖荡镇", "code" => "310117116000"},
      %{"name" => "新浜镇", "code" => "310117117000"},
      %{"name" => "叶榭镇", "code" => "310117120000"},
      %{"name" => "小昆山镇", "code" => "310117121000"},
      %{"name" => "松江工业区", "code" => "310117501000"},
      %{"name" => "佘山度假区", "code" => "310117504000"},
      %{"name" => "上海松江出口加工区", "code" => "310117507000"}
    ]

  def next(input) when input == "青浦区" or input == "310118",
    do: [
      %{"name" => "夏阳街道", "code" => "310118001000"},
      %{"name" => "盈浦街道", "code" => "310118002000"},
      %{"name" => "香花桥街道", "code" => "310118003000"},
      %{"name" => "朱家角镇", "code" => "310118102000"},
      %{"name" => "练塘镇", "code" => "310118103000"},
      %{"name" => "金泽镇", "code" => "310118104000"},
      %{"name" => "赵巷镇", "code" => "310118105000"},
      %{"name" => "徐泾镇", "code" => "310118106000"},
      %{"name" => "华新镇", "code" => "310118107000"},
      %{"name" => "重固镇", "code" => "310118109000"},
      %{"name" => "白鹤镇", "code" => "310118110000"}
    ]

  def next(input) when input == "奉贤区" or input == "310120",
    do: [
      %{"name" => "西渡街道", "code" => "310120001000"},
      %{"name" => "奉浦街道", "code" => "310120002000"},
      %{"name" => "金海街道", "code" => "310120003000"},
      %{"name" => "南桥镇", "code" => "310120101000"},
      %{"name" => "奉城镇", "code" => "310120102000"},
      %{"name" => "庄行镇", "code" => "310120104000"},
      %{"name" => "金汇镇", "code" => "310120106000"},
      %{"name" => "四团镇", "code" => "310120109000"},
      %{"name" => "青村镇", "code" => "310120111000"},
      %{"name" => "柘林镇", "code" => "310120118000"},
      %{"name" => "海湾镇", "code" => "310120123000"},
      %{"name" => "海湾旅游区", "code" => "310120503000"}
    ]

  def next(input) when input == "崇明区" or input == "310151",
    do: [
      %{"name" => "城桥镇", "code" => "310151101000"},
      %{"name" => "堡镇", "code" => "310151102000"},
      %{"name" => "新河镇", "code" => "310151103000"},
      %{"name" => "庙镇", "code" => "310151104000"},
      %{"name" => "竖新镇", "code" => "310151105000"},
      %{"name" => "向化镇", "code" => "310151106000"},
      %{"name" => "三星镇", "code" => "310151107000"},
      %{"name" => "港沿镇", "code" => "310151108000"},
      %{"name" => "中兴镇", "code" => "310151109000"},
      %{"name" => "陈家镇", "code" => "310151110000"},
      %{"name" => "绿华镇", "code" => "310151111000"},
      %{"name" => "港西镇", "code" => "310151112000"},
      %{"name" => "建设镇", "code" => "310151113000"},
      %{"name" => "新海镇", "code" => "310151114000"},
      %{"name" => "东平镇", "code" => "310151115000"},
      %{"name" => "长兴镇", "code" => "310151116000"},
      %{"name" => "新村乡", "code" => "310151201000"},
      %{"name" => "横沙乡", "code" => "310151202000"},
      %{"name" => "前卫农场", "code" => "310151401000"},
      %{"name" => "东平林场", "code" => "310151402000"},
      %{"name" => "上实现代农业园区", "code" => "310151501000"}
    ]

  def next(_), do: nil
end