defmodule ChinaAdminDivisions.Gen.Lv3x.M32 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "宿迁经济技术开发区" or input == "321371",
    do: [
      %{"name" => "黄河街道", "code" => "321371050000"},
      %{"name" => "三棵树街道", "code" => "321371052000"},
      %{"name" => "南蔡乡", "code" => "321371351000"},
      %{"name" => "古楚街道", "code" => "321371400000"}
    ]

  def next(input) when input == "泗洪县" or input == "321324",
    do: [
      %{"name" => "青阳街道", "code" => "321324001000"},
      %{"name" => "大楼街道", "code" => "321324002000"},
      %{"name" => "重岗街道", "code" => "321324003000"},
      %{"name" => "双沟镇", "code" => "321324101000"},
      %{"name" => "上塘镇", "code" => "321324102000"},
      %{"name" => "魏营镇", "code" => "321324103000"},
      %{"name" => "临淮镇", "code" => "321324104000"},
      %{"name" => "半城镇", "code" => "321324105000"},
      %{"name" => "孙园镇", "code" => "321324106000"},
      %{"name" => "梅花镇", "code" => "321324107000"},
      %{"name" => "归仁镇", "code" => "321324108000"},
      %{"name" => "金锁镇", "code" => "321324109000"},
      %{"name" => "朱湖镇", "code" => "321324110000"},
      %{"name" => "界集镇", "code" => "321324111000"},
      %{"name" => "龙集镇", "code" => "321324113000"},
      %{"name" => "天岗湖乡", "code" => "321324202000"},
      %{"name" => "车门乡", "code" => "321324203000"},
      %{"name" => "瑶沟乡", "code" => "321324204000"},
      %{"name" => "石集乡", "code" => "321324205000"},
      %{"name" => "五里江农场", "code" => "321324400000"},
      %{"name" => "洪泽湖农场", "code" => "321324401000"}
    ]

  def next(input) when input == "泗阳县" or input == "321323",
    do: [
      %{"name" => "众兴街道", "code" => "321323001000"},
      %{"name" => "城厢街道", "code" => "321323002000"},
      %{"name" => "来安街道", "code" => "321323003000"},
      %{"name" => "爱园镇", "code" => "321323101000"},
      %{"name" => "王集镇", "code" => "321323102000"},
      %{"name" => "裴圩镇", "code" => "321323103000"},
      %{"name" => "新袁镇", "code" => "321323104000"},
      %{"name" => "李口镇", "code" => "321323105000"},
      %{"name" => "临河镇", "code" => "321323106000"},
      %{"name" => "穿城镇", "code" => "321323107000"},
      %{"name" => "卢集镇", "code" => "321323110000"},
      %{"name" => "三庄镇", "code" => "321323111000"},
      %{"name" => "庄圩乡", "code" => "321323200000"},
      %{"name" => "棉花原种场", "code" => "321323400000"},
      %{"name" => "泗阳农场", "code" => "321323401000"},
      %{"name" => "江苏泗阳开发区", "code" => "321323402000"}
    ]

  def next(input) when input == "沭阳县" or input == "321322",
    do: [
      %{"name" => "沭城街道", "code" => "321322001000"},
      %{"name" => "南湖街道", "code" => "321322002000"},
      %{"name" => "梦溪街道", "code" => "321322003000"},
      %{"name" => "十字街道", "code" => "321322004000"},
      %{"name" => "章集街道", "code" => "321322005000"},
      %{"name" => "七雄街道", "code" => "321322006000"},
      %{"name" => "陇集镇", "code" => "321322101000"},
      %{"name" => "胡集镇", "code" => "321322102000"},
      %{"name" => "钱集镇", "code" => "321322103000"},
      %{"name" => "塘沟镇", "code" => "321322104000"},
      %{"name" => "马厂镇", "code" => "321322105000"},
      %{"name" => "沂涛镇", "code" => "321322106000"},
      %{"name" => "庙头镇", "code" => "321322107000"},
      %{"name" => "韩山镇", "code" => "321322108000"},
      %{"name" => "华冲镇", "code" => "321322109000"},
      %{"name" => "桑墟镇", "code" => "321322110000"},
      %{"name" => "悦来镇", "code" => "321322111000"},
      %{"name" => "刘集镇", "code" => "321322112000"},
      %{"name" => "李恒镇", "code" => "321322114000"},
      %{"name" => "扎下镇", "code" => "321322115000"},
      %{"name" => "颜集镇", "code" => "321322116000"},
      %{"name" => "潼阳镇", "code" => "321322117000"},
      %{"name" => "龙庙镇", "code" => "321322118000"},
      %{"name" => "高墟镇", "code" => "321322119000"},
      %{"name" => "耿圩镇", "code" => "321322120000"},
      %{"name" => "新河镇", "code" => "321322124000"},
      %{"name" => "贤官镇", "code" => "321322125000"},
      %{"name" => "吴集镇", "code" => "321322126000"},
      %{"name" => "青伊湖镇", "code" => "321322128000"},
      %{"name" => "西圩乡", "code" => "321322205000"},
      %{"name" => "沭阳经济开发区", "code" => "321322401000"},
      %{"name" => "昆山（沭阳）工业园区", "code" => "321322402000"}
    ]

  def next(input) when input == "宿豫区" or input == "321311",
    do: [
      %{"name" => "顺河街道", "code" => "321311001000"},
      %{"name" => "豫新街道", "code" => "321311002000"},
      %{"name" => "下相街道", "code" => "321311003000"},
      %{"name" => "晓店街道", "code" => "321311004000"},
      %{"name" => "井头街道", "code" => "321311005000"},
      %{"name" => "陆集街道", "code" => "321311006000"},
      %{"name" => "仰化镇", "code" => "321311105000"},
      %{"name" => "大兴镇", "code" => "321311106000"},
      %{"name" => "来龙镇", "code" => "321311108000"},
      %{"name" => "关庙镇", "code" => "321311111000"},
      %{"name" => "新庄镇", "code" => "321311113000"},
      %{"name" => "皂河镇", "code" => "321311151000"},
      %{"name" => "曹集乡", "code" => "321311201000"},
      %{"name" => "宿豫经济开发区", "code" => "321311401000"},
      %{"name" => "宿迁生态化工科技产业园", "code" => "321311402000"},
      %{"name" => "张家港宿豫工业园", "code" => "321311403000"},
      %{"name" => "嶂山林场", "code" => "321311450000"},
      %{"name" => "宿迁市软件与服务外包产业园", "code" => "321311451000"}
    ]

  def next(input) when input == "宿城区" or input == "321302",
    do: [
      %{"name" => "幸福街道", "code" => "321302001000"},
      %{"name" => "项里街道", "code" => "321302002000"},
      %{"name" => "河滨街道", "code" => "321302003000"},
      %{"name" => "古城街道", "code" => "321302004000"},
      %{"name" => "双庄街道", "code" => "321302005000"},
      %{"name" => "支口街道", "code" => "321302006000"},
      %{"name" => "洋北街道", "code" => "321302007000"},
      %{"name" => "耿车镇", "code" => "321302101000"},
      %{"name" => "埠子镇", "code" => "321302102000"},
      %{"name" => "龙河镇", "code" => "321302103000"},
      %{"name" => "中扬镇", "code" => "321302107000"},
      %{"name" => "陈集镇", "code" => "321302109000"},
      %{"name" => "蔡集镇", "code" => "321302110000"},
      %{"name" => "王官集镇", "code" => "321302111000"},
      %{"name" => "屠园镇", "code" => "321302112000"},
      %{"name" => "洋河镇", "code" => "321302150000"},
      %{"name" => "宿城开发区", "code" => "321302400000"},
      %{"name" => "苏州宿迁工业园", "code" => "321302450000"}
    ]

  def next(input) when input == "泰兴市" or input == "321283",
    do: [
      %{"name" => "济川街道", "code" => "321283001000"},
      %{"name" => "延令街道", "code" => "321283002000"},
      %{"name" => "姚王街道", "code" => "321283003000"},
      %{"name" => "黄桥镇", "code" => "321283100000"},
      %{"name" => "分界镇", "code" => "321283101000"},
      %{"name" => "古溪镇", "code" => "321283102000"},
      %{"name" => "元竹镇", "code" => "321283104000"},
      %{"name" => "珊瑚镇", "code" => "321283105000"},
      %{"name" => "广陵镇", "code" => "321283106000"},
      %{"name" => "曲霞镇", "code" => "321283108000"},
      %{"name" => "张桥镇", "code" => "321283109000"},
      %{"name" => "河失镇", "code" => "321283112000"},
      %{"name" => "新街镇", "code" => "321283113000"},
      %{"name" => "宣堡镇", "code" => "321283115000"},
      %{"name" => "滨江镇", "code" => "321283123000"},
      %{"name" => "虹桥镇", "code" => "321283124000"},
      %{"name" => "根思乡", "code" => "321283200000"},
      %{"name" => "市农科所", "code" => "321283401000"},
      %{"name" => "城东高新技术产业园", "code" => "321283402000"},
      %{"name" => "农产品加工园", "code" => "321283403000"}
    ]

  def next(input) when input == "靖江市" or input == "321282",
    do: [
      %{"name" => "靖城街道", "code" => "321282001000"},
      %{"name" => "新桥镇", "code" => "321282101000"},
      %{"name" => "东兴镇", "code" => "321282102000"},
      %{"name" => "斜桥镇", "code" => "321282103000"},
      %{"name" => "西来镇", "code" => "321282104000"},
      %{"name" => "季市镇", "code" => "321282105000"},
      %{"name" => "孤山镇", "code" => "321282106000"},
      %{"name" => "生祠镇", "code" => "321282108000"},
      %{"name" => "马桥镇", "code" => "321282109000"},
      %{"name" => "城南", "code" => "321282401000"},
      %{"name" => "新港城", "code" => "321282402000"},
      %{"name" => "城北园区", "code" => "321282403000"},
      %{"name" => "江阴园区", "code" => "321282404000"},
      %{"name" => "滨江新城", "code" => "321282406000"}
    ]

  def next(input) when input == "兴化市" or input == "321281",
    do: [
      %{"name" => "昭阳街道", "code" => "321281001000"},
      %{"name" => "临城街道", "code" => "321281002000"},
      %{"name" => "垛田街道", "code" => "321281003000"},
      %{"name" => "戴窑镇", "code" => "321281100000"},
      %{"name" => "合陈镇", "code" => "321281101000"},
      %{"name" => "永丰镇", "code" => "321281102000"},
      %{"name" => "新垛镇", "code" => "321281103000"},
      %{"name" => "安丰镇", "code" => "321281104000"},
      %{"name" => "海南镇", "code" => "321281105000"},
      %{"name" => "钓鱼镇", "code" => "321281106000"},
      %{"name" => "大邹镇", "code" => "321281107000"},
      %{"name" => "沙沟镇", "code" => "321281108000"},
      %{"name" => "中堡镇", "code" => "321281109000"},
      %{"name" => "竹泓镇", "code" => "321281114000"},
      %{"name" => "沈伦镇", "code" => "321281115000"},
      %{"name" => "大垛镇", "code" => "321281116000"},
      %{"name" => "荻垛镇", "code" => "321281117000"},
      %{"name" => "陶庄镇", "code" => "321281118000"},
      %{"name" => "昌荣镇", "code" => "321281119000"},
      %{"name" => "周庄镇", "code" => "321281121000"},
      %{"name" => "陈堡镇", "code" => "321281122000"},
      %{"name" => "戴南镇", "code" => "321281123000"},
      %{"name" => "大营镇", "code" => "321281126000"},
      %{"name" => "兴东镇", "code" => "321281129000"},
      %{"name" => "千垛镇", "code" => "321281130000"},
      %{"name" => "林湖乡", "code" => "321281204000"},
      %{"name" => "开发区", "code" => "321281400000"},
      %{"name" => "良种场", "code" => "321281401000"}
    ]

  def next(input) when input == "姜堰区" or input == "321204",
    do: [
      %{"name" => "罗塘街道", "code" => "321204001000"},
      %{"name" => "三水街道", "code" => "321204002000"},
      %{"name" => "天目山街道", "code" => "321204003000"},
      %{"name" => "梁徐街道", "code" => "321204004000"},
      %{"name" => "溱潼镇", "code" => "321204101000"},
      %{"name" => "蒋垛镇", "code" => "321204102000"},
      %{"name" => "顾高镇", "code" => "321204103000"},
      %{"name" => "大伦镇", "code" => "321204104000"},
      %{"name" => "张甸镇", "code" => "321204105000"},
      %{"name" => "淤溪镇", "code" => "321204110000"},
      %{"name" => "白米镇", "code" => "321204111000"},
      %{"name" => "娄庄镇", "code" => "321204112000"},
      %{"name" => "俞垛镇", "code" => "321204115000"},
      %{"name" => "溱湖风景区", "code" => "321204401000"},
      %{"name" => "林场", "code" => "321204403000"},
      %{"name" => "种猪场", "code" => "321204404000"},
      %{"name" => "林业站", "code" => "321204405000"},
      %{"name" => "渔业社", "code" => "321204406000"}
    ]

  def next(input) when input == "高港区" or input == "321203",
    do: [
      %{"name" => "口岸街道", "code" => "321203001000"},
      %{"name" => "刁铺街道", "code" => "321203002000"},
      %{"name" => "许庄街道", "code" => "321203003000"},
      %{"name" => "凤凰街道", "code" => "321203004000"},
      %{"name" => "寺巷街道", "code" => "321203005000"},
      %{"name" => "明珠街道", "code" => "321203006000"},
      %{"name" => "化学新材料产业园-沿江街道", "code" => "321203007000"},
      %{"name" => "港口物流产业园-永安洲镇", "code" => "321203100000"},
      %{"name" => "白马镇", "code" => "321203101000"},
      %{"name" => "胡庄镇", "code" => "321203103000"},
      %{"name" => "大泗镇", "code" => "321203104000"},
      %{"name" => "野徐镇", "code" => "321203105000"},
      %{"name" => "高端装备制造产业园", "code" => "321203400000"},
      %{"name" => "生物医药产业园", "code" => "321203401000"},
      %{"name" => "电子信息产业园", "code" => "321203402000"}
    ]

  def next(input) when input == "海陵区" or input == "321202",
    do: [
      %{"name" => "城东街道", "code" => "321202001000"},
      %{"name" => "城西街道", "code" => "321202002000"},
      %{"name" => "城南街道", "code" => "321202003000"},
      %{"name" => "城中街道", "code" => "321202004000"},
      %{"name" => "城北街道", "code" => "321202005000"},
      %{"name" => "京泰路街道", "code" => "321202007000"},
      %{"name" => "红旗街道", "code" => "321202050000"},
      %{"name" => "九龙镇", "code" => "321202100000"},
      %{"name" => "罡杨镇", "code" => "321202101000"},
      %{"name" => "苏陈镇", "code" => "321202102000"},
      %{"name" => "华港镇", "code" => "321202103000"},
      %{"name" => "海陵工业园区", "code" => "321202406000"},
      %{"name" => "农业示范园区", "code" => "321202407000"},
      %{"name" => "火车站街区", "code" => "321202408000"}
    ]

  def next(input) when input == "句容市" or input == "321183",
    do: [
      %{"name" => "华阳街道", "code" => "321183002000"},
      %{"name" => "黄梅街道", "code" => "321183003000"},
      %{"name" => "下蜀镇", "code" => "321183102000"},
      %{"name" => "白兔镇", "code" => "321183103000"},
      %{"name" => "边城镇", "code" => "321183104000"},
      %{"name" => "茅山镇", "code" => "321183105000"},
      %{"name" => "后白镇", "code" => "321183106000"},
      %{"name" => "郭庄镇", "code" => "321183107000"},
      %{"name" => "天王镇", "code" => "321183108000"},
      %{"name" => "宝华镇", "code" => "321183109000"},
      %{"name" => "茅山风景区", "code" => "321183429000"}
    ]

  def next(input) when input == "扬中市" or input == "321182",
    do: [
      %{"name" => "三茅街道", "code" => "321182001000"},
      %{"name" => "新坝镇", "code" => "321182101000"},
      %{"name" => "油坊镇", "code" => "321182102000"},
      %{"name" => "八桥镇", "code" => "321182103000"},
      %{"name" => "西来桥镇", "code" => "321182104000"},
      %{"name" => "经济开发区", "code" => "321182400000"}
    ]

  def next(input) when input == "丹阳市" or input == "321181",
    do: [
      %{"name" => "云阳街道", "code" => "321181001000"},
      %{"name" => "曲阿街道", "code" => "321181002000"},
      %{"name" => "司徒镇", "code" => "321181100000"},
      %{"name" => "延陵镇", "code" => "321181101000"},
      %{"name" => "珥陵镇", "code" => "321181102000"},
      %{"name" => "导墅镇", "code" => "321181103000"},
      %{"name" => "皇塘镇", "code" => "321181104000"},
      %{"name" => "吕城镇", "code" => "321181105000"},
      %{"name" => "陵口镇", "code" => "321181106000"},
      %{"name" => "访仙镇", "code" => "321181107000"},
      %{"name" => "界牌镇", "code" => "321181108000"},
      %{"name" => "丹北镇", "code" => "321181113000"}
    ]

  def next(input) when input == "镇江新区" or input == "321171",
    do: [
      %{"name" => "丁卯街道", "code" => "321171001000"},
      %{"name" => "大港街道", "code" => "321171002000"},
      %{"name" => "姚桥镇", "code" => "321171100000"},
      %{"name" => "大路镇", "code" => "321171101000"},
      %{"name" => "丁岗镇", "code" => "321171102000"}
    ]

  def next(input) when input == "丹徒区" or input == "321112",
    do: [
      %{"name" => "高资街道", "code" => "321112001000"},
      %{"name" => "宜城街道", "code" => "321112002000"},
      %{"name" => "高桥镇", "code" => "321112100000"},
      %{"name" => "辛丰镇", "code" => "321112101000"},
      %{"name" => "谷阳镇", "code" => "321112102000"},
      %{"name" => "上党镇", "code" => "321112103000"},
      %{"name" => "宝堰镇", "code" => "321112104000"},
      %{"name" => "世业镇", "code" => "321112105000"},
      %{"name" => "江心洲生态农业园区", "code" => "321112401000"},
      %{"name" => "荣炳盐资源区", "code" => "321112402000"}
    ]

  def next(input) when input == "润州区" or input == "321111",
    do: [
      %{"name" => "宝塔路街道", "code" => "321111001000"},
      %{"name" => "和平路街道", "code" => "321111002000"},
      %{"name" => "金山街道", "code" => "321111003000"},
      %{"name" => "七里甸街道", "code" => "321111004000"},
      %{"name" => "蒋乔街道", "code" => "321111005000"},
      %{"name" => "官塘桥街道", "code" => "321111006000"},
      %{"name" => "韦岗街道", "code" => "321111007000"},
      %{"name" => "南山街道", "code" => "321111008000"}
    ]

  def next(input) when input == "京口区" or input == "321102",
    do: [
      %{"name" => "正东路街道", "code" => "321102001000"},
      %{"name" => "健康路街道", "code" => "321102002000"},
      %{"name" => "大市口街道", "code" => "321102003000"},
      %{"name" => "四牌楼街道", "code" => "321102004000"},
      %{"name" => "象山街道", "code" => "321102005000"},
      %{"name" => "谏壁街道", "code" => "321102006000"},
      %{"name" => "京口经济开发区", "code" => "321102400000"},
      %{"name" => "新民洲临港产业园", "code" => "321102401000"}
    ]

  def next(input) when input == "高邮市" or input == "321084",
    do: [
      %{"name" => "高邮街道", "code" => "321084001000"},
      %{"name" => "龙虬镇", "code" => "321084101000"},
      %{"name" => "汤庄镇", "code" => "321084106000"},
      %{"name" => "卸甲镇", "code" => "321084107000"},
      %{"name" => "三垛镇", "code" => "321084108000"},
      %{"name" => "甘垛镇", "code" => "321084109000"},
      %{"name" => "界首镇", "code" => "321084112000"},
      %{"name" => "周山镇", "code" => "321084113000"},
      %{"name" => "临泽镇", "code" => "321084115000"},
      %{"name" => "送桥镇", "code" => "321084116000"},
      %{"name" => "菱塘回族乡", "code" => "321084200000"},
      %{"name" => "城南经济新区（车逻镇）", "code" => "321084401000"},
      %{"name" => "经济开发区（马棚街道）", "code" => "321084406000"}
    ]

  def next(input) when input == "仪征市" or input == "321081",
    do: [
      %{"name" => "真州镇", "code" => "321081100000"},
      %{"name" => "新集镇", "code" => "321081103000"},
      %{"name" => "新城镇", "code" => "321081104000"},
      %{"name" => "马集镇", "code" => "321081105000"},
      %{"name" => "刘集镇", "code" => "321081106000"},
      %{"name" => "陈集镇", "code" => "321081107000"},
      %{"name" => "大仪镇", "code" => "321081108000"},
      %{"name" => "月塘镇", "code" => "321081109000"},
      %{"name" => "青山镇", "code" => "321081150000"},
      %{"name" => "原种场", "code" => "321081401000"},
      %{"name" => "蚕种场", "code" => "321081402000"},
      %{"name" => "园艺试验场", "code" => "321081403000"},
      %{"name" => "水产试验场", "code" => "321081404000"},
      %{"name" => "捺山茶场", "code" => "321081405000"},
      %{"name" => "汽车工业园", "code" => "321081407000"},
      %{"name" => "开发区", "code" => "321081410000"},
      %{"name" => "枣林湾旅游度假区", "code" => "321081412000"},
      %{"name" => "化学工业园区", "code" => "321081454000"}
    ]

  def next(input) when input == "扬州经济技术开发区" or input == "321071",
    do: [
      %{"name" => "扬子津街道", "code" => "321071050000"},
      %{"name" => "文汇街道", "code" => "321071051000"},
      %{"name" => "施桥镇", "code" => "321071150000"},
      %{"name" => "八里镇", "code" => "321071151000"},
      %{"name" => "朴席镇", "code" => "321071152000"}
    ]

  def next(input) when input == "宝应县" or input == "321023",
    do: [
      %{"name" => "安宜镇", "code" => "321023100000"},
      %{"name" => "氾水镇", "code" => "321023101000"},
      %{"name" => "夏集镇", "code" => "321023102000"},
      %{"name" => "柳堡镇", "code" => "321023103000"},
      %{"name" => "射阳湖镇", "code" => "321023104000"},
      %{"name" => "广洋湖镇", "code" => "321023105000"},
      %{"name" => "鲁垛镇", "code" => "321023106000"},
      %{"name" => "小官庄镇", "code" => "321023107000"},
      %{"name" => "望直港镇", "code" => "321023108000"},
      %{"name" => "曹甸镇", "code" => "321023109000"},
      %{"name" => "西安丰镇", "code" => "321023110000"},
      %{"name" => "山阳镇", "code" => "321023111000"},
      %{"name" => "黄塍镇", "code" => "321023112000"},
      %{"name" => "泾河镇", "code" => "321023113000"},
      %{"name" => "宝应县经济开发区", "code" => "321023400000"}
    ]

  def next(input) when input == "江都区" or input == "321012",
    do: [
      %{"name" => "仙女镇", "code" => "321012100000"},
      %{"name" => "小纪镇", "code" => "321012101000"},
      %{"name" => "武坚镇", "code" => "321012103000"},
      %{"name" => "樊川镇", "code" => "321012106000"},
      %{"name" => "真武镇", "code" => "321012108000"},
      %{"name" => "宜陵镇", "code" => "321012109000"},
      %{"name" => "丁沟镇", "code" => "321012110000"},
      %{"name" => "郭村镇", "code" => "321012112000"},
      %{"name" => "邵伯镇", "code" => "321012114000"},
      %{"name" => "丁伙镇", "code" => "321012116000"},
      %{"name" => "大桥镇", "code" => "321012118000"},
      %{"name" => "吴桥镇", "code" => "321012119000"},
      %{"name" => "浦头镇", "code" => "321012120000"},
      %{"name" => "立新农场", "code" => "321012400000"}
    ]

  def next(input) when input == "邗江区" or input == "321003",
    do: [
      %{"name" => "邗上街道", "code" => "321003001000"},
      %{"name" => "蒋王街道", "code" => "321003002000"},
      %{"name" => "汊河街道", "code" => "321003003000"},
      %{"name" => "双桥街道", "code" => "321003005000"},
      %{"name" => "梅岭街道", "code" => "321003006000"},
      %{"name" => "甘泉街道", "code" => "321003007000"},
      %{"name" => "新盛街道", "code" => "321003009000"},
      %{"name" => "竹西街道", "code" => "321003010000"},
      %{"name" => "西湖街道", "code" => "321003011000"},
      %{"name" => "瘦西湖街道", "code" => "321003052000"},
      %{"name" => "城北街道", "code" => "321003053000"},
      %{"name" => "公道镇", "code" => "321003100000"},
      %{"name" => "方巷镇", "code" => "321003101000"},
      %{"name" => "槐泗镇", "code" => "321003102000"},
      %{"name" => "瓜洲镇", "code" => "321003103000"},
      %{"name" => "杨寿镇", "code" => "321003108000"},
      %{"name" => "杨庙镇", "code" => "321003110000"},
      %{"name" => "平山乡", "code" => "321003350000"},
      %{"name" => "江苏省扬州高新技术产业开发区", "code" => "321003401000"},
      %{"name" => "维扬经济开发区", "code" => "321003402000"},
      %{"name" => "物流园区", "code" => "321003403000"}
    ]

  def next(input) when input == "广陵区" or input == "321002",
    do: [
      %{"name" => "东关街道", "code" => "321002001000"},
      %{"name" => "汶河街道", "code" => "321002002000"},
      %{"name" => "文峰街道", "code" => "321002003000"},
      %{"name" => "曲江街道", "code" => "321002004000"},
      %{"name" => "汤汪街道", "code" => "321002005000"},
      %{"name" => "李典镇", "code" => "321002102000"},
      %{"name" => "沙头镇", "code" => "321002103000"},
      %{"name" => "头桥镇", "code" => "321002104000"},
      %{"name" => "湾头镇", "code" => "321002106000"},
      %{"name" => "广陵经济开发区", "code" => "321002400000"},
      %{"name" => "扬州市生态科技新城杭集镇", "code" => "321002401000"},
      %{"name" => "扬州市生态科技新城泰安镇", "code" => "321002402000"}
    ]

  def next(input) when input == "东台市" or input == "320981",
    do: [
      %{"name" => "溱东镇", "code" => "320981100000"},
      %{"name" => "时堰镇", "code" => "320981101000"},
      %{"name" => "五烈镇", "code" => "320981106000"},
      %{"name" => "梁垛镇", "code" => "320981107000"},
      %{"name" => "安丰镇", "code" => "320981108000"},
      %{"name" => "南沈灶镇", "code" => "320981109000"},
      %{"name" => "富安镇", "code" => "320981110000"},
      %{"name" => "唐洋镇", "code" => "320981112000"},
      %{"name" => "新街镇", "code" => "320981113000"},
      %{"name" => "许河镇", "code" => "320981114000"},
      %{"name" => "三仓镇", "code" => "320981115000"},
      %{"name" => "头灶镇", "code" => "320981118000"},
      %{"name" => "弶港镇", "code" => "320981121000"},
      %{"name" => "东台镇", "code" => "320981122000"},
      %{"name" => "江苏省新曹农场", "code" => "320981400000"},
      %{"name" => "江苏省弶港农场", "code" => "320981401000"},
      %{"name" => "开发区", "code" => "320981409000"},
      %{"name" => "沿海经济区", "code" => "320981410000"},
      %{"name" => "高新区", "code" => "320981411000"},
      %{"name" => "西溪景区", "code" => "320981412000"},
      %{"name" => "黄海森林公园", "code" => "320981413000"}
    ]

  def next(input) when input == "盐城经济技术开发区" or input == "320971",
    do: [
      %{"name" => "新城街道", "code" => "320971001000"},
      %{"name" => "步凤镇", "code" => "320971100000"}
    ]

  def next(input) when input == "建湖县" or input == "320925",
    do: [
      %{"name" => "近湖街道", "code" => "320925001000"},
      %{"name" => "钟庄街道", "code" => "320925050000"},
      %{"name" => "塘河街道", "code" => "320925051000"},
      %{"name" => "建阳镇", "code" => "320925101000"},
      %{"name" => "九龙口镇", "code" => "320925102000"},
      %{"name" => "恒济镇", "code" => "320925103000"},
      %{"name" => "颜单镇", "code" => "320925104000"},
      %{"name" => "沿河镇", "code" => "320925105000"},
      %{"name" => "芦沟镇", "code" => "320925106000"},
      %{"name" => "庆丰镇", "code" => "320925107000"},
      %{"name" => "上冈镇", "code" => "320925108000"},
      %{"name" => "冈西镇", "code" => "320925111000"},
      %{"name" => "宝塔镇", "code" => "320925113000"},
      %{"name" => "高作镇", "code" => "320925114000"}
    ]

  def next(input) when input == "射阳县" or input == "320924",
    do: [
      %{"name" => "合德镇", "code" => "320924100000"},
      %{"name" => "临海镇", "code" => "320924101000"},
      %{"name" => "千秋镇", "code" => "320924102000"},
      %{"name" => "四明镇", "code" => "320924104000"},
      %{"name" => "海河镇", "code" => "320924106000"},
      %{"name" => "海通镇", "code" => "320924108000"},
      %{"name" => "兴桥镇", "code" => "320924109000"},
      %{"name" => "新坍镇", "code" => "320924110000"},
      %{"name" => "长荡镇", "code" => "320924111000"},
      %{"name" => "盘湾镇", "code" => "320924112000"},
      %{"name" => "特庸镇", "code" => "320924113000"},
      %{"name" => "洋马镇", "code" => "320924114000"},
      %{"name" => "黄沙港镇", "code" => "320924117000"},
      %{"name" => "县经济开发区", "code" => "320924400000"},
      %{"name" => "淮海农场", "code" => "320924401000"},
      %{"name" => "临海农场", "code" => "320924402000"},
      %{"name" => "新洋农场", "code" => "320924403000"},
      %{"name" => "盐场", "code" => "320924404000"},
      %{"name" => "射阳港经济区", "code" => "320924406000"}
    ]

  def next(input) when input == "阜宁县" or input == "320923",
    do: [
      %{"name" => "阜城街道", "code" => "320923001000"},
      %{"name" => "吴滩街道", "code" => "320923002000"},
      %{"name" => "花园街道", "code" => "320923003000"},
      %{"name" => "金沙湖街道", "code" => "320923004000"},
      %{"name" => "沟墩镇", "code" => "320923100000"},
      %{"name" => "陈良镇", "code" => "320923101000"},
      %{"name" => "三灶镇", "code" => "320923102000"},
      %{"name" => "郭墅镇", "code" => "320923103000"},
      %{"name" => "新沟镇", "code" => "320923104000"},
      %{"name" => "陈集镇", "code" => "320923105000"},
      %{"name" => "羊寨镇", "code" => "320923106000"},
      %{"name" => "芦蒲镇", "code" => "320923107000"},
      %{"name" => "板湖镇", "code" => "320923108000"},
      %{"name" => "东沟镇", "code" => "320923109000"},
      %{"name" => "益林镇", "code" => "320923110000"},
      %{"name" => "古河镇", "code" => "320923111000"},
      %{"name" => "罗桥镇", "code" => "320923112000"}
    ]

  def next(input) when input == "滨海县" or input == "320922",
    do: [
      %{"name" => "东坎街道", "code" => "320922001000"},
      %{"name" => "坎南街道", "code" => "320922002000"},
      %{"name" => "坎北街道", "code" => "320922003000"},
      %{"name" => "五汛镇", "code" => "320922101000"},
      %{"name" => "蔡桥镇", "code" => "320922102000"},
      %{"name" => "正红镇", "code" => "320922103000"},
      %{"name" => "通榆镇", "code" => "320922104000"},
      %{"name" => "界牌镇", "code" => "320922105000"},
      %{"name" => "八巨镇", "code" => "320922106000"},
      %{"name" => "八滩镇", "code" => "320922107000"},
      %{"name" => "滨淮镇", "code" => "320922109000"},
      %{"name" => "天场镇", "code" => "320922110000"},
      %{"name" => "陈涛镇", "code" => "320922111000"},
      %{"name" => "滨海港镇", "code" => "320922112000"},
      %{"name" => "滨淮农场", "code" => "320922400000"},
      %{"name" => "新滩盐场", "code" => "320922401000"},
      %{"name" => "开发区沿海工业园", "code" => "320922403000"},
      %{"name" => "滨海港经济区", "code" => "320922404000"},
      %{"name" => "滨海县现代农业产业园区", "code" => "320922405000"}
    ]

  def next(input) when input == "响水县" or input == "320921",
    do: [
      %{"name" => "响水镇", "code" => "320921100000"},
      %{"name" => "陈家港镇", "code" => "320921101000"},
      %{"name" => "小尖镇", "code" => "320921102000"},
      %{"name" => "黄圩镇", "code" => "320921103000"},
      %{"name" => "大有镇", "code" => "320921104000"},
      %{"name" => "双港镇", "code" => "320921105000"},
      %{"name" => "南河镇", "code" => "320921106000"},
      %{"name" => "运河镇", "code" => "320921107000"},
      %{"name" => "县开发区", "code" => "320921400000"},
      %{"name" => "省属黄海农场", "code" => "320921401000"},
      %{"name" => "省属灌东盐场", "code" => "320921402000"}
    ]

  def next(input) when input == "大丰区" or input == "320904",
    do: [
      %{"name" => "丰华街道", "code" => "320904001000"},
      %{"name" => "大中街道", "code" => "320904002000"},
      %{"name" => "草堰镇", "code" => "320904101000"},
      %{"name" => "白驹镇", "code" => "320904102000"},
      %{"name" => "刘庄镇", "code" => "320904103000"},
      %{"name" => "西团镇", "code" => "320904104000"},
      %{"name" => "小海镇", "code" => "320904105000"},
      %{"name" => "大桥镇", "code" => "320904106000"},
      %{"name" => "草庙镇", "code" => "320904107000"},
      %{"name" => "万盈镇", "code" => "320904108000"},
      %{"name" => "南阳镇", "code" => "320904109000"},
      %{"name" => "新丰镇", "code" => "320904110000"},
      %{"name" => "三龙镇", "code" => "320904111000"},
      %{"name" => "大中农场", "code" => "320904400000"},
      %{"name" => "方强农场", "code" => "320904401000"},
      %{"name" => "东坝头农场", "code" => "320904402000"},
      %{"name" => "大丰经济开发区", "code" => "320904403000"},
      %{"name" => "大丰港经济开发区", "code" => "320904404000"},
      %{"name" => "大丰常州高新区", "code" => "320904405000"}
    ]

  def next(input) when input == "盐都区" or input == "320903",
    do: [
      %{"name" => "张庄街道", "code" => "320903002000"},
      %{"name" => "盐龙街道", "code" => "320903003000"},
      %{"name" => "潘黄街道", "code" => "320903004000"},
      %{"name" => "盐渎街道", "code" => "320903012000"},
      %{"name" => "新都街道", "code" => "320903050000"},
      %{"name" => "科城街道", "code" => "320903051000"},
      %{"name" => "大纵湖镇", "code" => "320903100000"},
      %{"name" => "楼王镇", "code" => "320903102000"},
      %{"name" => "学富镇", "code" => "320903103000"},
      %{"name" => "尚庄镇", "code" => "320903105000"},
      %{"name" => "秦南镇", "code" => "320903108000"},
      %{"name" => "龙冈镇", "code" => "320903109000"},
      %{"name" => "郭猛镇", "code" => "320903111000"},
      %{"name" => "大冈镇", "code" => "320903112000"},
      %{"name" => "大纵湖旅游度假区", "code" => "320903403000"},
      %{"name" => "台湾农民创业园", "code" => "320903404000"}
    ]

  def next(input) when input == "亭湖区" or input == "320902",
    do: [
      %{"name" => "五星街道", "code" => "320902001000"},
      %{"name" => "文峰街道", "code" => "320902002000"},
      %{"name" => "先锋街道", "code" => "320902003000"},
      %{"name" => "毓龙街道", "code" => "320902004000"},
      %{"name" => "新洋街道", "code" => "320902007000"},
      %{"name" => "大洋街道", "code" => "320902008000"},
      %{"name" => "伍佑街道", "code" => "320902050000"},
      %{"name" => "黄海街道", "code" => "320902051000"},
      %{"name" => "新河街道", "code" => "320902052000"},
      %{"name" => "南洋镇", "code" => "320902100000"},
      %{"name" => "新兴镇", "code" => "320902102000"},
      %{"name" => "便仓镇", "code" => "320902104000"},
      %{"name" => "盐东镇", "code" => "320902107000"},
      %{"name" => "黄尖镇", "code" => "320902108000"},
      %{"name" => "亭湖新区", "code" => "320902400000"},
      %{"name" => "环保产业园", "code" => "320902402000"}
    ]

  def next(input) when input == "淮安经济技术开发区" or input == "320871",
    do: [
      %{"name" => "钵池街道", "code" => "320871001000"},
      %{"name" => "徐杨街道", "code" => "320871002000"},
      %{"name" => "南马厂街道", "code" => "320871003000"},
      %{"name" => "枚乘街道", "code" => "320871004000"},
      %{"name" => "新港办", "code" => "320871401000"},
      %{"name" => "金港路办", "code" => "320871405000"},
      %{"name" => "富城路办", "code" => "320871410000"},
      %{"name" => "福地路办", "code" => "320871411000"},
      %{"name" => "高铁商务区办", "code" => "320871412000"},
      %{"name" => "张码办", "code" => "320871420000"}
    ]

  def next(input) when input == "金湖县" or input == "320831",
    do: [
      %{"name" => "黎城街道", "code" => "320831001000"},
      %{"name" => "戴楼街道", "code" => "320831002000"},
      %{"name" => "金北街道", "code" => "320831003000"},
      %{"name" => "金南镇", "code" => "320831101000"},
      %{"name" => "塔集镇", "code" => "320831103000"},
      %{"name" => "前锋镇", "code" => "320831106000"},
      %{"name" => "吕良镇", "code" => "320831107000"},
      %{"name" => "银涂镇", "code" => "320831111000"},
      %{"name" => "宝应湖农场", "code" => "320831400000"},
      %{"name" => "复兴圩农场", "code" => "320831401000"},
      %{"name" => "粮棉原种场", "code" => "320831402000"},
      %{"name" => "金湖经济开发区", "code" => "320831403000"}
    ]

  def next(input) when input == "盱眙县" or input == "320830",
    do: [
      %{"name" => "盱城街道", "code" => "320830001000"},
      %{"name" => "太和街道", "code" => "320830002000"},
      %{"name" => "古桑街道", "code" => "320830003000"},
      %{"name" => "马坝镇", "code" => "320830101000"},
      %{"name" => "官滩镇", "code" => "320830102000"},
      %{"name" => "桂五镇", "code" => "320830104000"},
      %{"name" => "河桥镇", "code" => "320830106000"},
      %{"name" => "鲍集镇", "code" => "320830107000"},
      %{"name" => "黄花塘镇", "code" => "320830108000"},
      %{"name" => "淮河镇", "code" => "320830111000"},
      %{"name" => "天泉湖镇", "code" => "320830114000"},
      %{"name" => "管仲镇", "code" => "320830115000"},
      %{"name" => "穆店镇", "code" => "320830116000"},
      %{"name" => "三河农场", "code" => "320830400000"},
      %{"name" => "淮化集团", "code" => "320830401000"}
    ]

  def next(input) when input == "涟水县" or input == "320826",
    do: [
      %{"name" => "涟城街道", "code" => "320826001000"},
      %{"name" => "朱码街道", "code" => "320826002000"},
      %{"name" => "陈师街道", "code" => "320826003000"},
      %{"name" => "保滩街道", "code" => "320826004000"},
      %{"name" => "高沟镇", "code" => "320826101000"},
      %{"name" => "唐集镇", "code" => "320826102000"},
      %{"name" => "大东镇", "code" => "320826104000"},
      %{"name" => "五港镇", "code" => "320826105000"},
      %{"name" => "梁岔镇", "code" => "320826106000"},
      %{"name" => "石湖镇", "code" => "320826107000"},
      %{"name" => "岔庙镇", "code" => "320826109000"},
      %{"name" => "东胡集镇", "code" => "320826110000"},
      %{"name" => "南集镇", "code" => "320826111000"},
      %{"name" => "成集镇", "code" => "320826113000"},
      %{"name" => "红窑镇", "code" => "320826114000"},
      %{"name" => "黄营镇", "code" => "320826117000"}
    ]

  def next(input) when input == "洪泽区" or input == "320813",
    do: [
      %{"name" => "高良涧街道", "code" => "320813001000"},
      %{"name" => "朱坝街道", "code" => "320813002000"},
      %{"name" => "黄集街道", "code" => "320813003000"},
      %{"name" => "蒋坝镇", "code" => "320813101000"},
      %{"name" => "岔河镇", "code" => "320813103000"},
      %{"name" => "西顺河镇", "code" => "320813104000"},
      %{"name" => "老子山镇", "code" => "320813105000"},
      %{"name" => "三河镇", "code" => "320813106000"},
      %{"name" => "东双沟镇", "code" => "320813110000"},
      %{"name" => "洪泽经济开发区", "code" => "320813400000"}
    ]

  def next(input) when input == "清江浦区" or input == "320812",
    do: [
      %{"name" => "城南街道", "code" => "320812001000"},
      %{"name" => "清江街道", "code" => "320812002000"},
      %{"name" => "浦楼街道", "code" => "320812003000"},
      %{"name" => "闸口街道", "code" => "320812004000"},
      %{"name" => "清浦街道", "code" => "320812005000"},
      %{"name" => "府前街道", "code" => "320812006000"},
      %{"name" => "长西街道", "code" => "320812007000"},
      %{"name" => "淮海街道", "code" => "320812008000"},
      %{"name" => "长东街道", "code" => "320812009000"},
      %{"name" => "柳树湾街道", "code" => "320812010000"},
      %{"name" => "水渡口街道", "code" => "320812011000"},
      %{"name" => "清河街道", "code" => "320812012000"},
      %{"name" => "武墩街道", "code" => "320812013000"},
      %{"name" => "盐河街道", "code" => "320812014000"},
      %{"name" => "和平镇", "code" => "320812100000"},
      %{"name" => "黄码镇", "code" => "320812103000"},
      %{"name" => "宁连路办", "code" => "320812450000"}
    ]

  def next(input) when input == "淮阴区" or input == "320804",
    do: [
      %{"name" => "长江路街道", "code" => "320804001000"},
      %{"name" => "王家营街道", "code" => "320804002000"},
      %{"name" => "新渡口街道", "code" => "320804003000"},
      %{"name" => "古清口街道", "code" => "320804004000"},
      %{"name" => "南陈集镇", "code" => "320804103000"},
      %{"name" => "丁集镇", "code" => "320804107000"},
      %{"name" => "徐溜镇", "code" => "320804109000"},
      %{"name" => "渔沟镇", "code" => "320804110000"},
      %{"name" => "三树镇", "code" => "320804113000"},
      %{"name" => "高家堰镇", "code" => "320804114000"},
      %{"name" => "马头镇", "code" => "320804115000"},
      %{"name" => "刘老庄镇", "code" => "320804116000"},
      %{"name" => "淮高镇", "code" => "320804117000"},
      %{"name" => "淮安高新技术产业开发区", "code" => "320804400000"}
    ]

  def next(input) when input == "淮安区" or input == "320803",
    do: [
      %{"name" => "淮城街道", "code" => "320803001000"},
      %{"name" => "河下街道", "code" => "320803002000"},
      %{"name" => "山阳街道", "code" => "320803004000"},
      %{"name" => "平桥镇", "code" => "320803101000"},
      %{"name" => "朱桥镇", "code" => "320803104000"},
      %{"name" => "施河镇", "code" => "320803106000"},
      %{"name" => "车桥镇", "code" => "320803107000"},
      %{"name" => "流均镇", "code" => "320803109000"},
      %{"name" => "博里镇", "code" => "320803110000"},
      %{"name" => "复兴镇", "code" => "320803112000"},
      %{"name" => "苏嘴镇", "code" => "320803113000"},
      %{"name" => "钦工镇", "code" => "320803114000"},
      %{"name" => "顺河镇", "code" => "320803115000"},
      %{"name" => "漕运镇", "code" => "320803121000"},
      %{"name" => "石塘镇", "code" => "320803122000"},
      %{"name" => "范集镇", "code" => "320803123000"},
      %{"name" => "白马湖农场", "code" => "320803400000"},
      %{"name" => "经济开发区", "code" => "320803401000"},
      %{"name" => "淮安新材料产业园", "code" => "320803402000"}
    ]

  def next(input) when input == "连云港经济技术开发区" or input == "320771",
    do: [
      %{"name" => "中云街道", "code" => "320771001000"},
      %{"name" => "猴嘴街道", "code" => "320771002000"},
      %{"name" => "朝阳街道", "code" => "320771003000"},
      %{"name" => "青口盐场", "code" => "320771450000"}
    ]

  def next(input) when input == "灌南县" or input == "320724",
    do: [
      %{"name" => "新安镇", "code" => "320724100000"},
      %{"name" => "堆沟港镇", "code" => "320724101000"},
      %{"name" => "田楼镇", "code" => "320724102000"},
      %{"name" => "北陈集镇", "code" => "320724103000"},
      %{"name" => "张店镇", "code" => "320724104000"},
      %{"name" => "三口镇", "code" => "320724105000"},
      %{"name" => "孟兴庄镇", "code" => "320724106000"},
      %{"name" => "汤沟镇", "code" => "320724107000"},
      %{"name" => "百禄镇", "code" => "320724108000"},
      %{"name" => "新集镇", "code" => "320724109000"},
      %{"name" => "李集镇", "code" => "320724110000"}
    ]

  def next(input) when input == "灌云县" or input == "320723",
    do: [
      %{"name" => "侍庄街道", "code" => "320723001000"},
      %{"name" => "伊山镇", "code" => "320723100000"},
      %{"name" => "杨集镇", "code" => "320723102000"},
      %{"name" => "燕尾港镇", "code" => "320723103000"},
      %{"name" => "同兴镇", "code" => "320723104000"},
      %{"name" => "四队镇", "code" => "320723105000"},
      %{"name" => "圩丰镇", "code" => "320723106000"},
      %{"name" => "龙苴镇", "code" => "320723107000"},
      %{"name" => "下车镇", "code" => "320723108000"},
      %{"name" => "图河镇", "code" => "320723109000"},
      %{"name" => "东王集镇", "code" => "320723110000"},
      %{"name" => "小伊镇", "code" => "320723111000"},
      %{"name" => "南岗镇", "code" => "320723112000"},
      %{"name" => "五图河农场", "code" => "320723401000"},
      %{"name" => "灌西盐场", "code" => "320723402000"},
      %{"name" => "灌云经济开发区", "code" => "320723403000"},
      %{"name" => "灌云临港产业区", "code" => "320723404000"}
    ]

  def next(input) when input == "东海县" or input == "320722",
    do: [
      %{"name" => "牛山街道", "code" => "320722001000"},
      %{"name" => "石榴街道", "code" => "320722002000"},
      %{"name" => "白塔埠镇", "code" => "320722101000"},
      %{"name" => "黄川镇", "code" => "320722103000"},
      %{"name" => "石梁河镇", "code" => "320722104000"},
      %{"name" => "青湖镇", "code" => "320722105000"},
      %{"name" => "温泉镇", "code" => "320722107000"},
      %{"name" => "双店镇", "code" => "320722108000"},
      %{"name" => "桃林镇", "code" => "320722109000"},
      %{"name" => "洪庄镇", "code" => "320722110000"},
      %{"name" => "安峰镇", "code" => "320722111000"},
      %{"name" => "房山镇", "code" => "320722112000"},
      %{"name" => "平明镇", "code" => "320722113000"},
      %{"name" => "曲阳镇", "code" => "320722114000"},
      %{"name" => "山左口镇", "code" => "320722115000"},
      %{"name" => "驼峰乡", "code" => "320722200000"},
      %{"name" => "李埝乡", "code" => "320722203000"},
      %{"name" => "石湖乡", "code" => "320722205000"},
      %{"name" => "张湾乡", "code" => "320722207000"},
      %{"name" => "江苏东海经济开发区", "code" => "320722401000"},
      %{"name" => "江苏东海高新技术开发区", "code" => "320722402000"}
    ]

  def next(input) when input == "赣榆区" or input == "320707",
    do: [
      %{"name" => "青口镇", "code" => "320707100000"},
      %{"name" => "柘汪镇", "code" => "320707101000"},
      %{"name" => "石桥镇", "code" => "320707102000"},
      %{"name" => "金山镇", "code" => "320707103000"},
      %{"name" => "黑林镇", "code" => "320707104000"},
      %{"name" => "厉庄镇", "code" => "320707105000"},
      %{"name" => "海头镇", "code" => "320707106000"},
      %{"name" => "塔山镇", "code" => "320707107000"},
      %{"name" => "赣马镇", "code" => "320707108000"},
      %{"name" => "班庄镇", "code" => "320707109000"},
      %{"name" => "城头镇", "code" => "320707110000"},
      %{"name" => "城西镇", "code" => "320707112000"},
      %{"name" => "宋庄镇", "code" => "320707114000"},
      %{"name" => "沙河镇", "code" => "320707115000"},
      %{"name" => "墩尚镇", "code" => "320707116000"},
      %{"name" => "农业技术服务中心", "code" => "320707400000"},
      %{"name" => "赣榆海洋经济开发区", "code" => "320707402000"},
      %{"name" => "赣榆经济开发区", "code" => "320707403000"}
    ]

  def next(input) when input == "海州区" or input == "320706",
    do: [
      %{"name" => "朐阳街道", "code" => "320706001000"},
      %{"name" => "新海街道", "code" => "320706006000"},
      %{"name" => "云台街道", "code" => "320706009000"},
      %{"name" => "新浦街道", "code" => "320706010000"},
      %{"name" => "海州街道", "code" => "320706011000"},
      %{"name" => "幸福路街道", "code" => "320706012000"},
      %{"name" => "洪门街道", "code" => "320706013000"},
      %{"name" => "宁海街道", "code" => "320706014000"},
      %{"name" => "浦西街道", "code" => "320706016000"},
      %{"name" => "新东街道", "code" => "320706017000"},
      %{"name" => "新南街道", "code" => "320706018000"},
      %{"name" => "路南街道", "code" => "320706019000"},
      %{"name" => "花果山街道", "code" => "320706020000"},
      %{"name" => "南城街道", "code" => "320706021000"},
      %{"name" => "郁州街道", "code" => "320706022000"},
      %{"name" => "锦屏镇", "code" => "320706100000"},
      %{"name" => "新坝镇", "code" => "320706102000"},
      %{"name" => "板浦镇", "code" => "320706103000"},
      %{"name" => "浦南镇", "code" => "320706104000"},
      %{"name" => "岗埠农场", "code" => "320706402000"},
      %{"name" => "新浦经济开发区", "code" => "320706403000"},
      %{"name" => "海州经济开发区", "code" => "320706404000"},
      %{"name" => "高新技术开发区", "code" => "320706405000"},
      %{"name" => "云台农场", "code" => "320706406000"},
      %{"name" => "南云台林场", "code" => "320706407000"}
    ]

  def next(input) when input == "连云区" or input == "320703",
    do: [
      %{"name" => "墟沟街道", "code" => "320703001000"},
      %{"name" => "连云街道", "code" => "320703003000"},
      %{"name" => "云山街道", "code" => "320703004000"},
      %{"name" => "板桥街道", "code" => "320703005000"},
      %{"name" => "连岛街道", "code" => "320703006000"},
      %{"name" => "徐圩街道", "code" => "320703007000"},
      %{"name" => "海州湾街道", "code" => "320703008000"},
      %{"name" => "宿城街道", "code" => "320703009000"},
      %{"name" => "高公岛街道", "code" => "320703010000"},
      %{"name" => "前三岛乡", "code" => "320703203000"},
      %{"name" => "连云港碱厂", "code" => "320703400000"},
      %{"name" => "东辛农场", "code" => "320703401000"},
      %{"name" => "连云经济技术开发区", "code" => "320703402000"}
    ]

  def next(input) when input == "海安市" or input == "320685",
    do: [
      %{"name" => "海安镇", "code" => "320685100000"},
      %{"name" => "城东镇", "code" => "320685101000"},
      %{"name" => "曲塘镇", "code" => "320685102000"},
      %{"name" => "李堡镇", "code" => "320685103000"},
      %{"name" => "角斜镇", "code" => "320685105000"},
      %{"name" => "大公镇", "code" => "320685107000"},
      %{"name" => "雅周镇", "code" => "320685109000"},
      %{"name" => "白甸镇", "code" => "320685111000"},
      %{"name" => "南莫镇", "code" => "320685112000"},
      %{"name" => "墩头镇", "code" => "320685113000"},
      %{"name" => "海安县农场", "code" => "320685400000"}
    ]

  def next(input) when input == "如皋市" or input == "320682",
    do: [
      %{"name" => "如城街道", "code" => "320682001000"},
      %{"name" => "东陈镇", "code" => "320682103000"},
      %{"name" => "丁堰镇", "code" => "320682104000"},
      %{"name" => "白蒲镇", "code" => "320682105000"},
      %{"name" => "下原镇", "code" => "320682107000"},
      %{"name" => "九华镇", "code" => "320682108000"},
      %{"name" => "石庄镇", "code" => "320682110000"},
      %{"name" => "长江镇", "code" => "320682111000"},
      %{"name" => "吴窑镇", "code" => "320682112000"},
      %{"name" => "江安镇", "code" => "320682113000"},
      %{"name" => "搬经镇", "code" => "320682116000"},
      %{"name" => "磨头镇", "code" => "320682117000"},
      %{"name" => "如皋市经济开发区", "code" => "320682400000"},
      %{"name" => "如皋高新技术产业开发区", "code" => "320682401000"},
      %{"name" => "南通市粮棉原种场", "code" => "320682402000"},
      %{"name" => "如皋市蚕种场", "code" => "320682403000"},
      %{"name" => "如皋市良种场", "code" => "320682404000"},
      %{"name" => "如皋市种猪场", "code" => "320682406000"},
      %{"name" => "如皋市农科所", "code" => "320682407000"},
      %{"name" => "如皋市江滨医院", "code" => "320682408000"},
      %{"name" => "如皋市中心沙水产养殖场", "code" => "320682409000"}
    ]

  def next(input) when input == "启东市" or input == "320681",
    do: [
      %{"name" => "汇龙镇", "code" => "320681100000"},
      %{"name" => "北新镇", "code" => "320681101000"},
      %{"name" => "惠萍镇", "code" => "320681102000"},
      %{"name" => "东海镇", "code" => "320681104000"},
      %{"name" => "南阳镇", "code" => "320681106000"},
      %{"name" => "海复镇", "code" => "320681107000"},
      %{"name" => "合作镇", "code" => "320681108000"},
      %{"name" => "王鲍镇", "code" => "320681109000"},
      %{"name" => "吕四港镇", "code" => "320681110000"},
      %{"name" => "启东经济开发区", "code" => "320681400000"},
      %{"name" => "启东滨海工业园", "code" => "320681401000"},
      %{"name" => "启东生命健康产业园", "code" => "320681402000"},
      %{"name" => "江苏吕四海洋经济开发区", "code" => "320681403000"},
      %{"name" => "启隆生态科技产业园", "code" => "320681404000"},
      %{"name" => "启东海工船舶工业园", "code" => "320681405000"},
      %{"name" => "启东江海产业园", "code" => "320681406000"},
      %{"name" => "圆陀角旅游度假区", "code" => "320681407000"},
      %{"name" => "启东生命健康科技园", "code" => "320681408000"}
    ]

  def next(input) when input == "南通经济技术开发区" or input == "320671",
    do: [
      %{"name" => "中兴街道", "code" => "320671001000"},
      %{"name" => "新开街道", "code" => "320671002000"},
      %{"name" => "竹行街道", "code" => "320671003000"},
      %{"name" => "小海街道", "code" => "320671004000"},
      %{"name" => "江海镇区", "code" => "320671400000"},
      %{"name" => "南通市经济技术开发区老洪港", "code" => "320671401000"},
      %{"name" => "南通苏通科技产业园", "code" => "320671403000"}
    ]

  def next(input) when input == "如东县" or input == "320623",
    do: [
      %{"name" => "掘港街道", "code" => "320623001000"},
      %{"name" => "城中街道", "code" => "320623002000"},
      %{"name" => "苴镇街道", "code" => "320623003000"},
      %{"name" => "栟茶镇", "code" => "320623100000"},
      %{"name" => "洋口镇", "code" => "320623101000"},
      %{"name" => "长沙镇", "code" => "320623103000"},
      %{"name" => "大豫镇", "code" => "320623104000"},
      %{"name" => "马塘镇", "code" => "320623107000"},
      %{"name" => "丰利镇", "code" => "320623108000"},
      %{"name" => "曹埠镇", "code" => "320623109000"},
      %{"name" => "岔河镇", "code" => "320623110000"},
      %{"name" => "双甸镇", "code" => "320623111000"},
      %{"name" => "新店镇", "code" => "320623112000"},
      %{"name" => "河口镇", "code" => "320623113000"},
      %{"name" => "袁庄镇", "code" => "320623114000"},
      %{"name" => "如东县经济开发区", "code" => "320623400000"},
      %{"name" => "如东沿海经济开发区", "code" => "320623401000"},
      %{"name" => "如东洋口港经济开发区", "code" => "320623402000"},
      %{"name" => "如东东安科技园区", "code" => "320623403000"},
      %{"name" => "如东沿海旅游经济开发区", "code" => "320623404000"},
      %{"name" => "南通外向型农业开发区", "code" => "320623405000"}
    ]

  def next(input) when input == "海门区" or input == "320614",
    do: [
      %{"name" => "海永镇", "code" => "320614102000"},
      %{"name" => "常乐镇", "code" => "320614103000"},
      %{"name" => "悦来镇", "code" => "320614104000"},
      %{"name" => "四甲镇", "code" => "320614105000"},
      %{"name" => "余东镇", "code" => "320614106000"},
      %{"name" => "正余镇", "code" => "320614107000"},
      %{"name" => "南通市海门区经济技术开发区", "code" => "320614400000"},
      %{"name" => "南通市海门区永隆沙农场", "code" => "320614401000"},
      %{"name" => "南通市海门区大东农场", "code" => "320614403000"},
      %{"name" => "南通市海门区畜禽良种场", "code" => "320614404000"},
      %{"name" => "南通市海门区种羊场", "code" => "320614405000"},
      %{"name" => "南通市海门区包场渔场", "code" => "320614406000"},
      %{"name" => "南通市海门区长江芦荡养殖场", "code" => "320614407000"},
      %{"name" => "南通市海门市沿江渔场", "code" => "320614408000"},
      %{"name" => "南通市海门区三厂苗圃", "code" => "320614409000"},
      %{"name" => "南通市海门区农科所", "code" => "320614410000"},
      %{"name" => "南通市海门区财政局芦荡管理所", "code" => "320614412000"},
      %{"name" => "江苏省国营江心沙农场", "code" => "320614413000"},
      %{"name" => "南通市海门区临江新区", "code" => "320614414000"},
      %{"name" => "海门港新区", "code" => "320614415000"},
      %{"name" => "三星镇（叠石桥家纺产业园区）", "code" => "320614416000"},
      %{"name" => "三厂工业园区", "code" => "320614418000"}
    ]

  def next(input) when input == "崇川区" or input == "320613",
    do: [
      %{"name" => "城东街道", "code" => "320613001000"},
      %{"name" => "和平桥街道", "code" => "320613002000"},
      %{"name" => "任港街道", "code" => "320613003000"},
      %{"name" => "新城桥街道", "code" => "320613004000"},
      %{"name" => "虹桥街道", "code" => "320613005000"},
      %{"name" => "学田街道", "code" => "320613006000"},
      %{"name" => "钟秀街道", "code" => "320613007000"},
      %{"name" => "文峰街道", "code" => "320613008000"},
      %{"name" => "观音山街道", "code" => "320613009000"},
      %{"name" => "狼山镇街道", "code" => "320613010000"},
      %{"name" => "永兴街道", "code" => "320613016000"},
      %{"name" => "唐闸镇街道", "code" => "320613017000"},
      %{"name" => "天生港镇街道", "code" => "320613018000"},
      %{"name" => "秦灶街道", "code" => "320613019000"},
      %{"name" => "陈桥街道", "code" => "320613020000"},
      %{"name" => "幸福街道", "code" => "320613021000"},
      %{"name" => "南通崇川经济开发区", "code" => "320613401000"},
      %{"name" => "港闸开发区", "code" => "320613402000"},
      %{"name" => "市北高新区", "code" => "320613403000"}
    ]

  def next(input) when input == "通州区" or input == "320612",
    do: [
      %{"name" => "金沙街道", "code" => "320612001000"},
      %{"name" => "兴东街道", "code" => "320612002000"},
      %{"name" => "先锋街道", "code" => "320612003000"},
      %{"name" => "金新街道", "code" => "320612004000"},
      %{"name" => "西亭镇", "code" => "320612101000"},
      %{"name" => "二甲镇", "code" => "320612102000"},
      %{"name" => "东社镇", "code" => "320612103000"},
      %{"name" => "三余镇", "code" => "320612104000"},
      %{"name" => "十总镇", "code" => "320612107000"},
      %{"name" => "石港镇", "code" => "320612110000"},
      %{"name" => "刘桥镇", "code" => "320612112000"},
      %{"name" => "平潮镇", "code" => "320612114000"},
      %{"name" => "五接镇", "code" => "320612116000"},
      %{"name" => "兴仁镇", "code" => "320612117000"},
      %{"name" => "张芝山镇", "code" => "320612119000"},
      %{"name" => "川姜镇", "code" => "320612120000"},
      %{"name" => "环本农场", "code" => "320612401000"}
    ]

  def next(input) when input == "太仓市" or input == "320585",
    do: [
      %{"name" => "城厢镇", "code" => "320585100000"},
      %{"name" => "沙溪镇", "code" => "320585101000"},
      %{"name" => "浏河镇", "code" => "320585102000"},
      %{"name" => "浮桥镇", "code" => "320585103000"},
      %{"name" => "璜泾镇", "code" => "320585104000"},
      %{"name" => "双凤镇", "code" => "320585105000"},
      %{"name" => "经济开发区", "code" => "320585400000"},
      %{"name" => "科教新城", "code" => "320585403000"}
    ]

  def next(input) when input == "昆山市" or input == "320583",
    do: [
      %{"name" => "玉山镇", "code" => "320583100000"},
      %{"name" => "巴城镇", "code" => "320583101000"},
      %{"name" => "周市镇", "code" => "320583102000"},
      %{"name" => "陆家镇", "code" => "320583103000"},
      %{"name" => "花桥镇", "code" => "320583104000"},
      %{"name" => "张浦镇", "code" => "320583106000"},
      %{"name" => "千灯镇", "code" => "320583108000"},
      %{"name" => "昆山开发区", "code" => "320583400000"},
      %{"name" => "昆山旅游度假区", "code" => "320583401000"}
    ]

  def next(input) when input == "张家港市" or input == "320582",
    do: [
      %{"name" => "金港街道", "code" => "320582001000"},
      %{"name" => "后塍街道", "code" => "320582002000"},
      %{"name" => "德积街道", "code" => "320582003000"},
      %{"name" => "杨舍镇", "code" => "320582100000"},
      %{"name" => "塘桥镇", "code" => "320582101000"},
      %{"name" => "锦丰镇", "code" => "320582103000"},
      %{"name" => "乐余镇", "code" => "320582104000"},
      %{"name" => "凤凰镇", "code" => "320582105000"},
      %{"name" => "南丰镇", "code" => "320582106000"},
      %{"name" => "大新镇", "code" => "320582107000"},
      %{"name" => "张家港市现代农业示范园区", "code" => "320582400000"},
      %{"name" => "张家港经济技术开发区", "code" => "320582401000"},
      %{"name" => "张家港保税区", "code" => "320582403000"},
      %{"name" => "张家港市冶金工业园", "code" => "320582406000"},
      %{"name" => "双山岛旅游度假区", "code" => "320582407000"}
    ]

  def next(input) when input == "常熟市" or input == "320581",
    do: [
      %{"name" => "虞山街道", "code" => "320581001000"},
      %{"name" => "常福街道", "code" => "320581002000"},
      %{"name" => "琴川街道", "code" => "320581003000"},
      %{"name" => "莫城街道", "code" => "320581004000"},
      %{"name" => "碧溪街道", "code" => "320581005000"},
      %{"name" => "东南街道", "code" => "320581006000"},
      %{"name" => "梅李镇", "code" => "320581101000"},
      %{"name" => "海虞镇", "code" => "320581102000"},
      %{"name" => "古里镇", "code" => "320581104000"},
      %{"name" => "沙家浜镇", "code" => "320581105000"},
      %{"name" => "支塘镇", "code" => "320581106000"},
      %{"name" => "董浜镇", "code" => "320581107000"},
      %{"name" => "辛庄镇", "code" => "320581110000"},
      %{"name" => "尚湖镇", "code" => "320581111000"},
      %{"name" => "常熟经济技术开发区", "code" => "320581401000"},
      %{"name" => "常熟高新技术产业开发区", "code" => "320581402000"},
      %{"name" => "常熟国家大学科技园", "code" => "320581407000"}
    ]

  def next(input) when input == "苏州工业园区" or input == "320576",
    do: [
      %{"name" => "娄葑街道", "code" => "320576050000"},
      %{"name" => "斜塘街道", "code" => "320576051000"},
      %{"name" => "唯亭街道", "code" => "320576052000"},
      %{"name" => "胜浦街道", "code" => "320576053000"},
      %{"name" => "金鸡湖街道", "code" => "320576054000"}
    ]

  def next(input) when input == "吴江区" or input == "320509",
    do: [
      %{"name" => "松陵街道", "code" => "320509001000"},
      %{"name" => "横扇街道", "code" => "320509002000"},
      %{"name" => "八坼街道", "code" => "320509003000"},
      %{"name" => "江陵街道", "code" => "320509004000"},
      %{"name" => "平望镇", "code" => "320509104000"},
      %{"name" => "盛泽镇", "code" => "320509105000"},
      %{"name" => "七都镇", "code" => "320509107000"},
      %{"name" => "震泽镇", "code" => "320509108000"},
      %{"name" => "桃源镇", "code" => "320509109000"},
      %{"name" => "黎里镇", "code" => "320509110000"},
      %{"name" => "同里镇", "code" => "320509111000"},
      %{"name" => "吴江经济技术开发区", "code" => "320509400000"},
      %{"name" => "东方丝绸市场", "code" => "320509401000"},
      %{"name" => "东太湖生态旅游度假区", "code" => "320509402000"}
    ]

  def next(input) when input == "姑苏区" or input == "320508",
    do: [
      %{"name" => "白洋湾街道", "code" => "320508017000"},
      %{"name" => "平江街道", "code" => "320508018000"},
      %{"name" => "金阊街道", "code" => "320508019000"},
      %{"name" => "沧浪街道", "code" => "320508020000"},
      %{"name" => "双塔街道", "code" => "320508021000"},
      %{"name" => "虎丘街道", "code" => "320508022000"},
      %{"name" => "苏锦街道", "code" => "320508023000"},
      %{"name" => "吴门桥街道", "code" => "320508024000"}
    ]

  def next(input) when input == "相城区" or input == "320507",
    do: [
      %{"name" => "元和街道", "code" => "320507001000"},
      %{"name" => "太平街道", "code" => "320507002000"},
      %{"name" => "黄桥街道", "code" => "320507003000"},
      %{"name" => "北桥街道", "code" => "320507004000"},
      %{"name" => "北河泾街道", "code" => "320507005000"},
      %{"name" => "漕湖街道", "code" => "320507006000"},
      %{"name" => "澄阳街道", "code" => "320507007000"},
      %{"name" => "望亭镇", "code" => "320507100000"},
      %{"name" => "黄埭镇", "code" => "320507102000"},
      %{"name" => "渭塘镇", "code" => "320507105000"},
      %{"name" => "阳澄湖镇", "code" => "320507109000"},
      %{"name" => "阳澄湖生态休闲旅游度假区", "code" => "320507401000"},
      %{"name" => "苏州高铁新城", "code" => "320507402000"}
    ]

  def next(input) when input == "吴中区" or input == "320506",
    do: [
      %{"name" => "长桥街道", "code" => "320506001000"},
      %{"name" => "越溪街道", "code" => "320506003000"},
      %{"name" => "郭巷街道", "code" => "320506004000"},
      %{"name" => "横泾街道", "code" => "320506005000"},
      %{"name" => "香山街道", "code" => "320506006000"},
      %{"name" => "城南街道", "code" => "320506009000"},
      %{"name" => "太湖街道", "code" => "320506010000"},
      %{"name" => "甪直镇", "code" => "320506100000"},
      %{"name" => "木渎镇", "code" => "320506103000"},
      %{"name" => "胥口镇", "code" => "320506104000"},
      %{"name" => "东山镇", "code" => "320506107000"},
      %{"name" => "光福镇", "code" => "320506108000"},
      %{"name" => "金庭镇", "code" => "320506109000"},
      %{"name" => "临湖镇", "code" => "320506110000"},
      %{"name" => "江苏省太湖采石公司", "code" => "320506400000"},
      %{"name" => "吴中区林场", "code" => "320506401000"},
      %{"name" => "西山农业园区", "code" => "320506402000"},
      %{"name" => "穹窿山风景区", "code" => "320506403000"},
      %{"name" => "开发区", "code" => "320506404000"},
      %{"name" => "国家苏州太湖旅游度假区", "code" => "320506405000"}
    ]

  def next(input) when input == "虎丘区" or input == "320505",
    do: [
      %{"name" => "横塘街道", "code" => "320505001000"},
      %{"name" => "狮山街道", "code" => "320505002000"},
      %{"name" => "枫桥街道", "code" => "320505003000"},
      %{"name" => "镇湖街道", "code" => "320505004000"},
      %{"name" => "通安镇", "code" => "320505101000"},
      %{"name" => "浒墅关经开区（镇）", "code" => "320505400000"},
      %{"name" => "苏州高新技术创业服务中心", "code" => "320505405000"},
      %{"name" => "科技城（东渚街道）", "code" => "320505407000"},
      %{"name" => "苏州高新区综合保税区", "code" => "320505408000"}
    ]

  def next(input) when input == "溧阳市" or input == "320481",
    do: [
      %{"name" => "昆仑街道", "code" => "320481001000"},
      %{"name" => "溧城街道", "code" => "320481002000"},
      %{"name" => "古县街道", "code" => "320481003000"},
      %{"name" => "埭头镇", "code" => "320481101000"},
      %{"name" => "上黄镇", "code" => "320481102000"},
      %{"name" => "戴埠镇", "code" => "320481103000"},
      %{"name" => "天目湖镇", "code" => "320481106000"},
      %{"name" => "别桥镇", "code" => "320481107000"},
      %{"name" => "上兴镇", "code" => "320481109000"},
      %{"name" => "竹箦镇", "code" => "320481111000"},
      %{"name" => "南渡镇", "code" => "320481114000"},
      %{"name" => "社渚镇", "code" => "320481116000"},
      %{"name" => "常州监狱", "code" => "320481400000"},
      %{"name" => "溧阳监狱", "code" => "320481401000"}
    ]

  def next(input) when input == "金坛区" or input == "320413",
    do: [
      %{"name" => "西城街道", "code" => "320413001000"},
      %{"name" => "金城镇", "code" => "320413100000"},
      %{"name" => "儒林镇", "code" => "320413104000"},
      %{"name" => "直溪镇", "code" => "320413106000"},
      %{"name" => "朱林镇", "code" => "320413108000"},
      %{"name" => "薛埠镇", "code" => "320413109000"},
      %{"name" => "指前镇", "code" => "320413112000"},
      %{"name" => "经济开发区", "code" => "320413400000"},
      %{"name" => "茅山旅游度假区", "code" => "320413401000"},
      %{"name" => "华罗庚高新区", "code" => "320413402000"}
    ]

  def next(input) when input == "武进区" or input == "320412",
    do: [
      %{"name" => "戚墅堰街道", "code" => "320412001000"},
      %{"name" => "丁堰街道", "code" => "320412002000"},
      %{"name" => "潞城街道", "code" => "320412003000"},
      %{"name" => "湖塘镇", "code" => "320412100000"},
      %{"name" => "牛塘镇", "code" => "320412102000"},
      %{"name" => "洛阳镇", "code" => "320412103000"},
      %{"name" => "遥观镇", "code" => "320412104000"},
      %{"name" => "横林镇", "code" => "320412105000"},
      %{"name" => "横山桥镇", "code" => "320412106000"},
      %{"name" => "雪堰镇", "code" => "320412110000"},
      %{"name" => "前黄镇", "code" => "320412113000"},
      %{"name" => "礼嘉镇", "code" => "320412114000"},
      %{"name" => "嘉泽镇", "code" => "320412119000"},
      %{"name" => "湟里镇", "code" => "320412120000"},
      %{"name" => "武进经济开发区", "code" => "320412400000"},
      %{"name" => "高新区", "code" => "320412411000"},
      %{"name" => "西太湖生态休闲区", "code" => "320412412000"},
      %{"name" => "太湖旅游度假区", "code" => "320412413000"}
    ]

  def next(input) when input == "新北区" or input == "320411",
    do: [
      %{"name" => "三井街道", "code" => "320411002000"},
      %{"name" => "龙虎塘街道", "code" => "320411003000"},
      %{"name" => "春江街道", "code" => "320411004000"},
      %{"name" => "魏村街道", "code" => "320411005000"},
      %{"name" => "新桥街道", "code" => "320411006000"},
      %{"name" => "孟河镇", "code" => "320411101000"},
      %{"name" => "薛家镇", "code" => "320411103000"},
      %{"name" => "罗溪镇", "code" => "320411104000"},
      %{"name" => "西夏墅镇", "code" => "320411105000"},
      %{"name" => "奔牛镇", "code" => "320411122000"}
    ]

  def next(input) when input == "钟楼区" or input == "320404",
    do: [
      %{"name" => "五星街道", "code" => "320404001000"},
      %{"name" => "永红街道", "code" => "320404002000"},
      %{"name" => "北港街道", "code" => "320404003000"},
      %{"name" => "西林街道", "code" => "320404004000"},
      %{"name" => "南大街街道", "code" => "320404005000"},
      %{"name" => "荷花池街道", "code" => "320404006000"},
      %{"name" => "新闸街道", "code" => "320404007000"},
      %{"name" => "邹区镇", "code" => "320404116000"}
    ]

  def next(input) when input == "天宁区" or input == "320402",
    do: [
      %{"name" => "雕庄街道", "code" => "320402001000"},
      %{"name" => "青龙街道", "code" => "320402002000"},
      %{"name" => "茶山街道", "code" => "320402003000"},
      %{"name" => "红梅街道", "code" => "320402004000"},
      %{"name" => "天宁街道", "code" => "320402005000"},
      %{"name" => "兰陵街道", "code" => "320402006000"},
      %{"name" => "郑陆镇", "code" => "320402109000"}
    ]

  def next(input) when input == "邳州市" or input == "320382",
    do: [
      %{"name" => "东湖街道", "code" => "320382001000"},
      %{"name" => "运河街道", "code" => "320382002000"},
      %{"name" => "戴圩街道", "code" => "320382003000"},
      %{"name" => "炮车街道", "code" => "320382004000"},
      %{"name" => "邳城镇", "code" => "320382102000"},
      %{"name" => "官湖镇", "code" => "320382103000"},
      %{"name" => "四户镇", "code" => "320382104000"},
      %{"name" => "宿羊山镇", "code" => "320382105000"},
      %{"name" => "八义集镇", "code" => "320382106000"},
      %{"name" => "土山镇", "code" => "320382107000"},
      %{"name" => "碾庄镇", "code" => "320382108000"},
      %{"name" => "港上镇", "code" => "320382109000"},
      %{"name" => "邹庄镇", "code" => "320382110000"},
      %{"name" => "占城镇", "code" => "320382111000"},
      %{"name" => "新河镇", "code" => "320382112000"},
      %{"name" => "八路镇", "code" => "320382113000"},
      %{"name" => "铁富镇", "code" => "320382115000"},
      %{"name" => "岔河镇", "code" => "320382116000"},
      %{"name" => "陈楼镇", "code" => "320382118000"},
      %{"name" => "邢楼镇", "code" => "320382119000"},
      %{"name" => "戴庄镇", "code" => "320382120000"},
      %{"name" => "车辐山镇", "code" => "320382121000"},
      %{"name" => "燕子埠镇", "code" => "320382122000"},
      %{"name" => "赵墩镇", "code" => "320382123000"},
      %{"name" => "议堂镇", "code" => "320382124000"},
      %{"name" => "邳城农场", "code" => "320382401000"},
      %{"name" => "张楼农场", "code" => "320382402000"},
      %{"name" => "江苏邳州经济开发区", "code" => "320382403000"}
    ]

  def next(input) when input == "新沂市" or input == "320381",
    do: [
      %{"name" => "新安街道", "code" => "320381001000"},
      %{"name" => "北沟街道", "code" => "320381002000"},
      %{"name" => "墨河街道", "code" => "320381003000"},
      %{"name" => "唐店街道", "code" => "320381004000"},
      %{"name" => "钟吾街道", "code" => "320381005000"},
      %{"name" => "瓦窑镇", "code" => "320381102000"},
      %{"name" => "港头镇", "code" => "320381103000"},
      %{"name" => "合沟镇", "code" => "320381105000"},
      %{"name" => "草桥镇", "code" => "320381106000"},
      %{"name" => "窑湾镇", "code" => "320381107000"},
      %{"name" => "棋盘镇", "code" => "320381108000"},
      %{"name" => "马陵山镇", "code" => "320381109000"},
      %{"name" => "新店镇", "code" => "320381110000"},
      %{"name" => "邵店镇", "code" => "320381111000"},
      %{"name" => "时集镇", "code" => "320381113000"},
      %{"name" => "高流镇", "code" => "320381114000"},
      %{"name" => "阿湖镇", "code" => "320381115000"},
      %{"name" => "双塘镇", "code" => "320381116000"},
      %{"name" => "经济开发区", "code" => "320381401000"},
      %{"name" => "锡沂高新技术产业开发区", "code" => "320381402000"},
      %{"name" => "马陵山风景名胜区", "code" => "320381403000"}
    ]

  def next(input) when input == "徐州经济技术开发区" or input == "320371",
    do: [
      %{"name" => "金山桥街道", "code" => "320371001000"},
      %{"name" => "东环街道", "code" => "320371002000"},
      %{"name" => "大黄山街道", "code" => "320371003000"},
      %{"name" => "大庙街道", "code" => "320371004000"},
      %{"name" => "金龙湖街道", "code" => "320371005000"},
      %{"name" => "徐庄镇", "code" => "320371101000"}
    ]

  def next(input) when input == "睢宁县" or input == "320324",
    do: [
      %{"name" => "睢城街道", "code" => "320324001000"},
      %{"name" => "金城街道", "code" => "320324002000"},
      %{"name" => "睢河街道", "code" => "320324003000"},
      %{"name" => "王集镇", "code" => "320324102000"},
      %{"name" => "双沟镇", "code" => "320324103000"},
      %{"name" => "岚山镇", "code" => "320324104000"},
      %{"name" => "李集镇", "code" => "320324105000"},
      %{"name" => "桃园镇", "code" => "320324106000"},
      %{"name" => "官山镇", "code" => "320324107000"},
      %{"name" => "高作镇", "code" => "320324108000"},
      %{"name" => "沙集镇", "code" => "320324109000"},
      %{"name" => "凌城镇", "code" => "320324110000"},
      %{"name" => "邱集镇", "code" => "320324111000"},
      %{"name" => "古邳镇", "code" => "320324112000"},
      %{"name" => "姚集镇", "code" => "320324113000"},
      %{"name" => "魏集镇", "code" => "320324114000"},
      %{"name" => "梁集镇", "code" => "320324115000"},
      %{"name" => "庆安镇", "code" => "320324116000"},
      %{"name" => "经济开发区", "code" => "320324401000"},
      %{"name" => "空港经济开发区", "code" => "320324405000"}
    ]

  def next(input) when input == "沛县" or input == "320322",
    do: [
      %{"name" => "沛城街道", "code" => "320322001000"},
      %{"name" => "大屯街道", "code" => "320322002000"},
      %{"name" => "汉源街道", "code" => "320322003000"},
      %{"name" => "汉兴街道", "code" => "320322004000"},
      %{"name" => "龙固镇", "code" => "320322101000"},
      %{"name" => "杨屯镇", "code" => "320322102000"},
      %{"name" => "胡寨镇", "code" => "320322105000"},
      %{"name" => "魏庙镇", "code" => "320322106000"},
      %{"name" => "五段镇", "code" => "320322107000"},
      %{"name" => "张庄镇", "code" => "320322108000"},
      %{"name" => "张寨镇", "code" => "320322109000"},
      %{"name" => "敬安镇", "code" => "320322110000"},
      %{"name" => "河口镇", "code" => "320322111000"},
      %{"name" => "栖山镇", "code" => "320322112000"},
      %{"name" => "鹿楼镇", "code" => "320322113000"},
      %{"name" => "朱寨镇", "code" => "320322114000"},
      %{"name" => "安国镇", "code" => "320322115000"},
      %{"name" => "沛县湖西农场", "code" => "320322403000"}
    ]

  def next(input) when input == "丰县" or input == "320321",
    do: [
      %{"name" => "中阳里街道", "code" => "320321001000"},
      %{"name" => "凤城街道", "code" => "320321002000"},
      %{"name" => "孙楼街道", "code" => "320321003000"},
      %{"name" => "首羡镇", "code" => "320321102000"},
      %{"name" => "顺河镇", "code" => "320321103000"},
      %{"name" => "常店镇", "code" => "320321104000"},
      %{"name" => "欢口镇", "code" => "320321105000"},
      %{"name" => "师寨镇", "code" => "320321106000"},
      %{"name" => "华山镇", "code" => "320321107000"},
      %{"name" => "梁寨镇", "code" => "320321108000"},
      %{"name" => "范楼镇", "code" => "320321109000"},
      %{"name" => "宋楼镇", "code" => "320321111000"},
      %{"name" => "大沙河镇", "code" => "320321112000"},
      %{"name" => "王沟镇", "code" => "320321113000"},
      %{"name" => "赵庄镇", "code" => "320321114000"},
      %{"name" => "大沙河林场", "code" => "320321401000"}
    ]

  def next(input) when input == "铜山区" or input == "320312",
    do: [
      %{"name" => "三河尖街道", "code" => "320312001000"},
      %{"name" => "张双楼街道", "code" => "320312002000"},
      %{"name" => "垞城街道", "code" => "320312003000"},
      %{"name" => "张集街道", "code" => "320312004000"},
      %{"name" => "利国街道", "code" => "320312006000"},
      %{"name" => "电厂街道", "code" => "320312007000"},
      %{"name" => "铜山街道", "code" => "320312009000"},
      %{"name" => "沿湖街道", "code" => "320312010000"},
      %{"name" => "新区街道", "code" => "320312051000"},
      %{"name" => "三堡街道", "code" => "320312052000"},
      %{"name" => "何桥镇", "code" => "320312102000"},
      %{"name" => "黄集镇", "code" => "320312103000"},
      %{"name" => "马坡镇", "code" => "320312104000"},
      %{"name" => "郑集镇", "code" => "320312105000"},
      %{"name" => "柳新镇", "code" => "320312106000"},
      %{"name" => "刘集镇", "code" => "320312107000"},
      %{"name" => "大彭镇", "code" => "320312108000"},
      %{"name" => "汉王镇", "code" => "320312109000"},
      %{"name" => "棠张镇", "code" => "320312111000"},
      %{"name" => "张集镇", "code" => "320312112000"},
      %{"name" => "房村镇", "code" => "320312113000"},
      %{"name" => "伊庄镇", "code" => "320312114000"},
      %{"name" => "单集镇", "code" => "320312115000"},
      %{"name" => "利国镇", "code" => "320312116000"},
      %{"name" => "大许镇", "code" => "320312118000"},
      %{"name" => "茅村镇", "code" => "320312119000"},
      %{"name" => "柳泉镇", "code" => "320312120000"},
      %{"name" => "徐州高新技术产业开发区", "code" => "320312402000"},
      %{"name" => "江苏铜山经济开发区", "code" => "320312403000"}
    ]

  def next(input) when input == "泉山区" or input == "320311",
    do: [
      %{"name" => "王陵街道", "code" => "320311001000"},
      %{"name" => "七里沟街道", "code" => "320311002000"},
      %{"name" => "永安街道", "code" => "320311003000"},
      %{"name" => "湖滨街道", "code" => "320311004000"},
      %{"name" => "段庄街道", "code" => "320311005000"},
      %{"name" => "翟山街道", "code" => "320311006000"},
      %{"name" => "奎山街道", "code" => "320311007000"},
      %{"name" => "和平街道", "code" => "320311008000"},
      %{"name" => "金山街道", "code" => "320311009000"},
      %{"name" => "泰山街道", "code" => "320311010000"},
      %{"name" => "庞庄街道", "code" => "320311011000"},
      %{"name" => "火花街道", "code" => "320311012000"},
      %{"name" => "桃园街道", "code" => "320311013000"},
      %{"name" => "苏山街道", "code" => "320311014000"},
      %{"name" => "徐州泉山经济开发区", "code" => "320311401000"},
      %{"name" => "江苏淮海科技城", "code" => "320311402000"}
    ]

  def next(input) when input == "贾汪区" or input == "320305",
    do: [
      %{"name" => "老矿街道", "code" => "320305001000"},
      %{"name" => "大泉街道", "code" => "320305003000"},
      %{"name" => "大吴街道", "code" => "320305004000"},
      %{"name" => "潘安湖街道", "code" => "320305005000"},
      %{"name" => "茱萸山街道", "code" => "320305006000"},
      %{"name" => "青山泉镇", "code" => "320305102000"},
      %{"name" => "紫庄镇", "code" => "320305104000"},
      %{"name" => "塔山镇", "code" => "320305105000"},
      %{"name" => "汴塘镇", "code" => "320305106000"},
      %{"name" => "江庄镇", "code" => "320305107000"},
      %{"name" => "鹿庄粮棉原种场", "code" => "320305401000"},
      %{"name" => "工业园区管委会", "code" => "320305402000"},
      %{"name" => "现代农业产业园区", "code" => "320305403000"}
    ]

  def next(input) when input == "云龙区" or input == "320303",
    do: [
      %{"name" => "彭城街道", "code" => "320303001000"},
      %{"name" => "子房街道", "code" => "320303002000"},
      %{"name" => "黄山街道", "code" => "320303003000"},
      %{"name" => "骆驼山街道", "code" => "320303004000"},
      %{"name" => "大郭庄街道", "code" => "320303005000"},
      %{"name" => "翠屏山街道", "code" => "320303006000"},
      %{"name" => "大龙湖街道", "code" => "320303007000"},
      %{"name" => "潘塘街道", "code" => "320303008000"},
      %{"name" => "汉风街道", "code" => "320303009000"},
      %{"name" => "淮海食品城", "code" => "320303400000"},
      %{"name" => "户部山回龙窝历史文化街区", "code" => "320303401000"}
    ]

  def next(input) when input == "鼓楼区" or input == "320302",
    do: [
      %{"name" => "黄楼街道", "code" => "320302001000"},
      %{"name" => "丰财街道", "code" => "320302002000"},
      %{"name" => "琵琶街道", "code" => "320302003000"},
      %{"name" => "牌楼街道", "code" => "320302004000"},
      %{"name" => "铜沛街道", "code" => "320302005000"},
      %{"name" => "环城街道", "code" => "320302006000"},
      %{"name" => "九里街道", "code" => "320302007000"},
      %{"name" => "拾屯街道", "code" => "320302008000"}
    ]

  def next(input) when input == "宜兴市" or input == "320282",
    do: [
      %{"name" => "宜城街道", "code" => "320282001000"},
      %{"name" => "屺亭街道", "code" => "320282002000"},
      %{"name" => "新庄街道", "code" => "320282003000"},
      %{"name" => "新街街道", "code" => "320282004000"},
      %{"name" => "芳桥街道", "code" => "320282005000"},
      %{"name" => "张渚镇", "code" => "320282100000"},
      %{"name" => "西渚镇", "code" => "320282101000"},
      %{"name" => "太华镇", "code" => "320282102000"},
      %{"name" => "徐舍镇", "code" => "320282103000"},
      %{"name" => "官林镇", "code" => "320282104000"},
      %{"name" => "杨巷镇", "code" => "320282105000"},
      %{"name" => "新建镇", "code" => "320282106000"},
      %{"name" => "和桥镇", "code" => "320282107000"},
      %{"name" => "高塍镇", "code" => "320282108000"},
      %{"name" => "万石镇", "code" => "320282109000"},
      %{"name" => "周铁镇", "code" => "320282110000"},
      %{"name" => "丁蜀镇", "code" => "320282112000"},
      %{"name" => "湖㳇镇", "code" => "320282113000"},
      %{"name" => "环科园", "code" => "320282400000"},
      %{"name" => "宜兴经济开发区", "code" => "320282401000"},
      %{"name" => "阳羡旅游度假区", "code" => "320282402000"}
    ]

  def next(input) when input == "江阴市" or input == "320281",
    do: [
      %{"name" => "澄江街道", "code" => "320281001000"},
      %{"name" => "南闸街道", "code" => "320281004000"},
      %{"name" => "云亭街道", "code" => "320281005000"},
      %{"name" => "申港街道", "code" => "320281007000"},
      %{"name" => "利港街道", "code" => "320281008000"},
      %{"name" => "夏港街道", "code" => "320281009000"},
      %{"name" => "璜土镇", "code" => "320281100000"},
      %{"name" => "月城镇", "code" => "320281102000"},
      %{"name" => "青阳镇", "code" => "320281103000"},
      %{"name" => "徐霞客镇", "code" => "320281104000"},
      %{"name" => "华士镇", "code" => "320281107000"},
      %{"name" => "周庄镇", "code" => "320281108000"},
      %{"name" => "新桥镇", "code" => "320281109000"},
      %{"name" => "长泾镇", "code" => "320281110000"},
      %{"name" => "顾山镇", "code" => "320281111000"},
      %{"name" => "祝塘镇", "code" => "320281112000"},
      %{"name" => "江阴高新技术产业开发区", "code" => "320281400000"},
      %{"name" => "江苏江阴靖江工业园区", "code" => "320281403000"},
      %{"name" => "临港经济开发区", "code" => "320281404000"},
      %{"name" => "青阳园区", "code" => "320281405000"},
      %{"name" => "月城园区", "code" => "320281406000"}
    ]

  def next(input) when input == "新吴区" or input == "320214",
    do: [
      %{"name" => "旺庄街道", "code" => "320214050000"},
      %{"name" => "硕放街道", "code" => "320214051000"},
      %{"name" => "江溪街道", "code" => "320214052000"},
      %{"name" => "新安街道", "code" => "320214053000"},
      %{"name" => "梅村街道", "code" => "320214054000"},
      %{"name" => "鸿山街道", "code" => "320214055000"},
      %{"name" => "无锡新加坡工业园", "code" => "320214450000"},
      %{"name" => "无锡高新技术产业开发区", "code" => "320214451000"},
      %{"name" => "无锡高新区综合保税区", "code" => "320214452000"},
      %{"name" => "无锡太湖国际科技园", "code" => "320214453000"}
    ]

  def next(input) when input == "梁溪区" or input == "320213",
    do: [
      %{"name" => "崇安寺街道", "code" => "320213021000"},
      %{"name" => "清名桥街道", "code" => "320213022000"},
      %{"name" => "惠山街道", "code" => "320213023000"},
      %{"name" => "北大街街道", "code" => "320213024000"},
      %{"name" => "广益街道", "code" => "320213025000"},
      %{"name" => "扬名街道", "code" => "320213026000"},
      %{"name" => "山北街道", "code" => "320213027000"},
      %{"name" => "黄巷街道", "code" => "320213028000"},
      %{"name" => "瞻江街道", "code" => "320213029000"}
    ]

  def next(input) when input == "滨湖区" or input == "320211",
    do: [
      %{"name" => "河埒街道", "code" => "320211001000"},
      %{"name" => "荣巷街道", "code" => "320211002000"},
      %{"name" => "蠡园街道", "code" => "320211003000"},
      %{"name" => "蠡湖街道", "code" => "320211004000"},
      %{"name" => "华庄街道", "code" => "320211006000"},
      %{"name" => "太湖街道", "code" => "320211007000"},
      %{"name" => "雪浪街道", "code" => "320211008000"},
      %{"name" => "马山街道", "code" => "320211009000"},
      %{"name" => "胡埭镇", "code" => "320211101000"}
    ]

  def next(input) when input == "惠山区" or input == "320206",
    do: [
      %{"name" => "堰桥街道", "code" => "320206001000"},
      %{"name" => "长安街道", "code" => "320206002000"},
      %{"name" => "钱桥街道", "code" => "320206003000"},
      %{"name" => "前洲街道", "code" => "320206004000"},
      %{"name" => "玉祁街道", "code" => "320206005000"},
      %{"name" => "洛社镇", "code" => "320206102000"},
      %{"name" => "阳山镇", "code" => "320206103000"},
      %{"name" => "无锡惠山经济开发区", "code" => "320206401000"},
      %{"name" => "无锡惠山工业转型集聚区", "code" => "320206500000"}
    ]

  def next(input) when input == "锡山区" or input == "320205",
    do: [
      %{"name" => "东亭街道", "code" => "320205001000"},
      %{"name" => "安镇街道", "code" => "320205002000"},
      %{"name" => "东北塘街道", "code" => "320205003000"},
      %{"name" => "羊尖镇", "code" => "320205102000"},
      %{"name" => "鹅湖镇", "code" => "320205103000"},
      %{"name" => "锡北镇", "code" => "320205105000"},
      %{"name" => "东港镇", "code" => "320205106000"},
      %{"name" => "无锡锡山开发区", "code" => "320205400000"},
      %{"name" => "锡山台湾农民创业园", "code" => "320205401000"}
    ]

  def next(input) when input == "高淳区" or input == "320118",
    do: [
      %{"name" => "淳溪街道", "code" => "320118001000"},
      %{"name" => "古柏街道", "code" => "320118002000"},
      %{"name" => "漆桥街道", "code" => "320118003000"},
      %{"name" => "固城街道", "code" => "320118004000"},
      %{"name" => "东坝街道", "code" => "320118005000"},
      %{"name" => "桠溪街道", "code" => "320118006000"},
      %{"name" => "阳江镇", "code" => "320118101000"},
      %{"name" => "砖墙镇", "code" => "320118102000"},
      %{"name" => "高淳县团结圩良种繁育场", "code" => "320118400000"},
      %{"name" => "高淳县茶叶实验场", "code" => "320118401000"},
      %{"name" => "高淳监狱", "code" => "320118402000"},
      %{"name" => "高淳县傅家坛林场", "code" => "320118403000"}
    ]

  def next(input) when input == "溧水区" or input == "320117",
    do: [
      %{"name" => "永阳街道", "code" => "320117001000"},
      %{"name" => "柘塘街道", "code" => "320117002000"},
      %{"name" => "东屏街道", "code" => "320117003000"},
      %{"name" => "石湫街道", "code" => "320117004000"},
      %{"name" => "洪蓝街道", "code" => "320117005000"},
      %{"name" => "白马镇", "code" => "320117101000"},
      %{"name" => "晶桥镇", "code" => "320117106000"},
      %{"name" => "和凤镇", "code" => "320117107000"},
      %{"name" => "溧水开发区", "code" => "320117400000"}
    ]

  def next(input) when input == "六合区" or input == "320116",
    do: [
      %{"name" => "大厂街道", "code" => "320116001000"},
      %{"name" => "葛塘街道", "code" => "320116004000"},
      %{"name" => "长芦街道", "code" => "320116005000"},
      %{"name" => "雄州街道", "code" => "320116006000"},
      %{"name" => "龙池街道", "code" => "320116007000"},
      %{"name" => "程桥街道", "code" => "320116008000"},
      %{"name" => "金牛湖街道", "code" => "320116009000"},
      %{"name" => "横梁街道", "code" => "320116010000"},
      %{"name" => "龙袍街道", "code" => "320116011000"},
      %{"name" => "马鞍街道", "code" => "320116012000"},
      %{"name" => "冶山街道", "code" => "320116013000"},
      %{"name" => "竹镇镇", "code" => "320116110000"},
      %{"name" => "六合开发区", "code" => "320116400000"},
      %{"name" => "新材料产业园", "code" => "320116401000"},
      %{"name" => "金牛湖旅游管理办公室", "code" => "320116405000"},
      %{"name" => "化工园区", "code" => "320116450000"}
    ]

  def next(input) when input == "江宁区" or input == "320115",
    do: [
      %{"name" => "东山街道", "code" => "320115001000"},
      %{"name" => "秣陵街道", "code" => "320115002000"},
      %{"name" => "汤山街道", "code" => "320115003000"},
      %{"name" => "淳化街道", "code" => "320115004000"},
      %{"name" => "禄口街道", "code" => "320115005000"},
      %{"name" => "江宁街道", "code" => "320115006000"},
      %{"name" => "谷里街道", "code" => "320115007000"},
      %{"name" => "湖熟街道", "code" => "320115008000"},
      %{"name" => "横溪街道", "code" => "320115009000"},
      %{"name" => "麒麟街道", "code" => "320115010000"},
      %{"name" => "青龙山林场", "code" => "320115401000"},
      %{"name" => "江宁开发区", "code" => "320115402000"},
      %{"name" => "江宁滨江开发区", "code" => "320115403000"},
      %{"name" => "江宁高新技术产业园", "code" => "320115404000"},
      %{"name" => "麒麟科技创新园（生态科技城）", "code" => "320115405000"}
    ]

  def next(input) when input == "雨花台区" or input == "320114",
    do: [
      %{"name" => "雨花街道", "code" => "320114001000"},
      %{"name" => "赛虹桥街道", "code" => "320114002000"},
      %{"name" => "西善桥街道", "code" => "320114004000"},
      %{"name" => "板桥街道", "code" => "320114005000"},
      %{"name" => "铁心桥街道", "code" => "320114006000"},
      %{"name" => "梅山街道", "code" => "320114007000"},
      %{"name" => "古雄街道", "code" => "320114008000"},
      %{"name" => "雨花经济开发区", "code" => "320114400000"},
      %{"name" => "中国（南京）软件谷", "code" => "320114402000"}
    ]

  def next(input) when input == "栖霞区" or input == "320113",
    do: [
      %{"name" => "尧化街道", "code" => "320113001000"},
      %{"name" => "马群街道", "code" => "320113002000"},
      %{"name" => "迈皋桥街道", "code" => "320113003000"},
      %{"name" => "燕子矶街道", "code" => "320113004000"},
      %{"name" => "栖霞街道", "code" => "320113005000"},
      %{"name" => "龙潭街道", "code" => "320113006000"},
      %{"name" => "仙林街道", "code" => "320113007000"},
      %{"name" => "八卦洲街道", "code" => "320113009000"},
      %{"name" => "西岗街道", "code" => "320113010000"},
      %{"name" => "龙潭监狱", "code" => "320113400000"},
      %{"name" => "栖霞经济开发区", "code" => "320113401000"},
      %{"name" => "南京龙潭物流园", "code" => "320113402000"},
      %{"name" => "南京市靖安三江口工业园", "code" => "320113403000"},
      %{"name" => "南京市马群科技园", "code" => "320113405000"},
      %{"name" => "南京仙林大学城", "code" => "320113406000"},
      %{"name" => "江苏生命科技创新园", "code" => "320113407000"},
      %{"name" => "南大科学园", "code" => "320113409000"},
      %{"name" => "南京紫东国际创意园", "code" => "320113410000"},
      %{"name" => "南京金港科技创业中心", "code" => "320113411000"},
      %{"name" => "仙林智谷", "code" => "320113413000"},
      %{"name" => "南京经济技术开发区", "code" => "320113450000"}
    ]

  def next(input) when input == "浦口区" or input == "320111",
    do: [
      %{"name" => "泰山街道", "code" => "320111001000"},
      %{"name" => "顶山街道", "code" => "320111002000"},
      %{"name" => "沿江街道", "code" => "320111003000"},
      %{"name" => "江浦街道", "code" => "320111004000"},
      %{"name" => "桥林街道", "code" => "320111005000"},
      %{"name" => "汤泉街道", "code" => "320111006000"},
      %{"name" => "盘城街道", "code" => "320111007000"},
      %{"name" => "星甸街道", "code" => "320111008000"},
      %{"name" => "永宁街道", "code" => "320111009000"},
      %{"name" => "老山林场", "code" => "320111400000"},
      %{"name" => "汤泉农场", "code" => "320111401000"},
      %{"name" => "珍珠泉旅游度假区", "code" => "320111402000"},
      %{"name" => "浦口经济开发区", "code" => "320111403000"},
      %{"name" => "南京浦口高新技术产业开发区", "code" => "320111404000"},
      %{"name" => "高新技术开发区", "code" => "320111450000"}
    ]

  def next(input) when input == "鼓楼区" or input == "320106",
    do: [
      %{"name" => "宁海路街道", "code" => "320106001000"},
      %{"name" => "华侨路街道", "code" => "320106002000"},
      %{"name" => "湖南路街道", "code" => "320106003000"},
      %{"name" => "中央门街道", "code" => "320106004000"},
      %{"name" => "挹江门街道", "code" => "320106005000"},
      %{"name" => "江东街道", "code" => "320106006000"},
      %{"name" => "凤凰街道", "code" => "320106007000"},
      %{"name" => "下关街道", "code" => "320106008000"},
      %{"name" => "热河南路街道", "code" => "320106009000"},
      %{"name" => "幕府山街道", "code" => "320106010000"},
      %{"name" => "建宁路街道", "code" => "320106011000"},
      %{"name" => "宝塔桥街道", "code" => "320106012000"},
      %{"name" => "小市街道", "code" => "320106013000"}
    ]

  def next(input) when input == "建邺区" or input == "320105",
    do: [
      %{"name" => "莫愁湖街道", "code" => "320105001000"},
      %{"name" => "沙洲街道", "code" => "320105002000"},
      %{"name" => "双闸街道", "code" => "320105003000"},
      %{"name" => "江心洲街道", "code" => "320105004000"},
      %{"name" => "兴隆街道", "code" => "320105006000"},
      %{"name" => "南苑街道", "code" => "320105007000"}
    ]

  def next(input) when input == "秦淮区" or input == "320104",
    do: [
      %{"name" => "秦虹街道", "code" => "320104001000"},
      %{"name" => "夫子庙街道", "code" => "320104002000"},
      %{"name" => "红花街道", "code" => "320104003000"},
      %{"name" => "双塘街道", "code" => "320104004000"},
      %{"name" => "中华门街道", "code" => "320104005000"},
      %{"name" => "五老村街道", "code" => "320104006000"},
      %{"name" => "洪武路街道", "code" => "320104007000"},
      %{"name" => "大光路街道", "code" => "320104008000"},
      %{"name" => "瑞金路街道", "code" => "320104009000"},
      %{"name" => "月牙湖街道", "code" => "320104010000"},
      %{"name" => "光华路街道", "code" => "320104011000"},
      %{"name" => "朝天宫街道", "code" => "320104012000"},
      %{"name" => "夫子庙秦淮风光带", "code" => "320104400000"},
      %{"name" => "高新园区", "code" => "320104401000"},
      %{"name" => "新城发展服务", "code" => "320104402000"},
      %{"name" => "新街口商务商贸街区", "code" => "320104403000"}
    ]

  def next(input) when input == "玄武区" or input == "320102",
    do: [
      %{"name" => "梅园新村街道", "code" => "320102002000"},
      %{"name" => "新街口街道", "code" => "320102003000"},
      %{"name" => "玄武门街道", "code" => "320102005000"},
      %{"name" => "锁金村街道", "code" => "320102007000"},
      %{"name" => "红山街道", "code" => "320102008000"},
      %{"name" => "孝陵卫街道", "code" => "320102009000"},
      %{"name" => "玄武湖街道", "code" => "320102010000"},
      %{"name" => "徐庄高新技术产业开发区", "code" => "320102400000"}
    ]

  def next(_), do: nil
end