defmodule ChinaAdminDivisions.Gen.Lv3x.M33 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "莲都区" or input == "331102",
    do: [
      %{"name" => "紫金街道", "code" => "331102001000"},
      %{"name" => "岩泉街道", "code" => "331102002000"},
      %{"name" => "万象街道", "code" => "331102003000"},
      %{"name" => "白云街道", "code" => "331102004000"},
      %{"name" => "联城街道", "code" => "331102007000"},
      %{"name" => "南明山街道", "code" => "331102008000"},
      %{"name" => "碧湖镇", "code" => "331102100000"},
      %{"name" => "大港头镇", "code" => "331102102000"},
      %{"name" => "老竹畲族镇", "code" => "331102103000"},
      %{"name" => "雅溪镇", "code" => "331102104000"},
      %{"name" => "太平乡", "code" => "331102200000"},
      %{"name" => "仙渡乡", "code" => "331102201000"},
      %{"name" => "峰源乡", "code" => "331102202000"},
      %{"name" => "丽新畲族乡", "code" => "331102204000"},
      %{"name" => "黄村乡", "code" => "331102206000"}
    ]

  def next(input) when input == "青田县" or input == "331121",
    do: [
      %{"name" => "鹤城街道", "code" => "331121001000"},
      %{"name" => "瓯南街道", "code" => "331121002000"},
      %{"name" => "油竹街道", "code" => "331121003000"},
      %{"name" => "三溪口街道", "code" => "331121004000"},
      %{"name" => "温溪镇", "code" => "331121101000"},
      %{"name" => "东源镇", "code" => "331121102000"},
      %{"name" => "高湖镇", "code" => "331121103000"},
      %{"name" => "船寮镇", "code" => "331121104000"},
      %{"name" => "海口镇", "code" => "331121105000"},
      %{"name" => "腊口镇", "code" => "331121106000"},
      %{"name" => "北山镇", "code" => "331121107000"},
      %{"name" => "山口镇", "code" => "331121108000"},
      %{"name" => "仁庄镇", "code" => "331121109000"},
      %{"name" => "祯埠镇", "code" => "331121110000"},
      %{"name" => "万山乡", "code" => "331121200000"},
      %{"name" => "黄垟乡", "code" => "331121201000"},
      %{"name" => "季宅乡", "code" => "331121202000"},
      %{"name" => "高市乡", "code" => "331121203000"},
      %{"name" => "海溪乡", "code" => "331121204000"},
      %{"name" => "章村乡", "code" => "331121205000"},
      %{"name" => "祯旺乡", "code" => "331121206000"},
      %{"name" => "舒桥乡", "code" => "331121208000"},
      %{"name" => "巨浦乡", "code" => "331121209000"},
      %{"name" => "万阜乡", "code" => "331121211000"},
      %{"name" => "方山乡", "code" => "331121212000"},
      %{"name" => "汤垟乡", "code" => "331121213000"},
      %{"name" => "贵岙乡", "code" => "331121214000"},
      %{"name" => "小舟山乡", "code" => "331121215000"},
      %{"name" => "吴坑乡", "code" => "331121216000"},
      %{"name" => "仁宫乡", "code" => "331121217000"},
      %{"name" => "章旦乡", "code" => "331121218000"},
      %{"name" => "阜山乡", "code" => "331121219000"}
    ]

  def next(input) when input == "缙云县" or input == "331122",
    do: [
      %{"name" => "五云街道", "code" => "331122001000"},
      %{"name" => "新碧街道", "code" => "331122002000"},
      %{"name" => "仙都街道", "code" => "331122003000"},
      %{"name" => "壶镇镇", "code" => "331122101000"},
      %{"name" => "新建镇", "code" => "331122102000"},
      %{"name" => "舒洪镇", "code" => "331122103000"},
      %{"name" => "大洋镇", "code" => "331122105000"},
      %{"name" => "东渡镇", "code" => "331122106000"},
      %{"name" => "东方镇", "code" => "331122107000"},
      %{"name" => "大源镇", "code" => "331122108000"},
      %{"name" => "七里乡", "code" => "331122203000"},
      %{"name" => "前路乡", "code" => "331122206000"},
      %{"name" => "三溪乡", "code" => "331122207000"},
      %{"name" => "溶江乡", "code" => "331122208000"},
      %{"name" => "双溪口乡", "code" => "331122209000"},
      %{"name" => "胡源乡", "code" => "331122210000"},
      %{"name" => "方溪乡", "code" => "331122211000"},
      %{"name" => "石笕乡", "code" => "331122212000"}
    ]

  def next(input) when input == "遂昌县" or input == "331123",
    do: [
      %{"name" => "妙高街道", "code" => "331123001000"},
      %{"name" => "云峰街道", "code" => "331123002000"},
      %{"name" => "新路湾镇", "code" => "331123102000"},
      %{"name" => "北界镇", "code" => "331123103000"},
      %{"name" => "金竹镇", "code" => "331123104000"},
      %{"name" => "大柘镇", "code" => "331123105000"},
      %{"name" => "石练镇", "code" => "331123106000"},
      %{"name" => "王村口镇", "code" => "331123107000"},
      %{"name" => "黄沙腰镇", "code" => "331123108000"},
      %{"name" => "三仁畲族乡", "code" => "331123200000"},
      %{"name" => "濂竹乡", "code" => "331123201000"},
      %{"name" => "应村乡", "code" => "331123202000"},
      %{"name" => "高坪乡", "code" => "331123203000"},
      %{"name" => "湖山乡", "code" => "331123204000"},
      %{"name" => "蔡源乡", "code" => "331123205000"},
      %{"name" => "焦滩乡", "code" => "331123206000"},
      %{"name" => "龙洋乡", "code" => "331123207000"},
      %{"name" => "柘岱口乡", "code" => "331123208000"},
      %{"name" => "西畈乡", "code" => "331123209000"},
      %{"name" => "垵口乡", "code" => "331123210000"}
    ]

  def next(input) when input == "松阳县" or input == "331124",
    do: [
      %{"name" => "西屏街道", "code" => "331124001000"},
      %{"name" => "水南街道", "code" => "331124002000"},
      %{"name" => "望松街道", "code" => "331124003000"},
      %{"name" => "古市镇", "code" => "331124101000"},
      %{"name" => "玉岩镇", "code" => "331124102000"},
      %{"name" => "象溪镇", "code" => "331124103000"},
      %{"name" => "大东坝镇", "code" => "331124104000"},
      %{"name" => "新兴镇", "code" => "331124105000"},
      %{"name" => "叶村乡", "code" => "331124201000"},
      %{"name" => "斋坛乡", "code" => "331124202000"},
      %{"name" => "三都乡", "code" => "331124203000"},
      %{"name" => "竹源乡", "code" => "331124204000"},
      %{"name" => "四都乡", "code" => "331124205000"},
      %{"name" => "赤寿乡", "code" => "331124206000"},
      %{"name" => "樟溪乡", "code" => "331124208000"},
      %{"name" => "枫坪乡", "code" => "331124211000"},
      %{"name" => "板桥畲族乡", "code" => "331124212000"},
      %{"name" => "裕溪乡", "code" => "331124213000"},
      %{"name" => "安民乡", "code" => "331124214000"}
    ]

  def next(input) when input == "云和县" or input == "331125",
    do: [
      %{"name" => "浮云街道", "code" => "331125001000"},
      %{"name" => "元和街道", "code" => "331125002000"},
      %{"name" => "白龙山街道", "code" => "331125003000"},
      %{"name" => "凤凰山街道", "code" => "331125004000"},
      %{"name" => "崇头镇", "code" => "331125105000"},
      %{"name" => "石塘镇", "code" => "331125106000"},
      %{"name" => "紧水滩镇", "code" => "331125107000"},
      %{"name" => "雾溪畲族乡", "code" => "331125201000"},
      %{"name" => "安溪畲族乡", "code" => "331125202000"},
      %{"name" => "赤石乡", "code" => "331125206000"}
    ]

  def next(input) when input == "庆元县" or input == "331126",
    do: [
      %{"name" => "松源街道", "code" => "331126001000"},
      %{"name" => "濛洲街道", "code" => "331126002000"},
      %{"name" => "屏都街道", "code" => "331126003000"},
      %{"name" => "黄田镇", "code" => "331126101000"},
      %{"name" => "竹口镇", "code" => "331126102000"},
      %{"name" => "荷地镇", "code" => "331126104000"},
      %{"name" => "左溪镇", "code" => "331126105000"},
      %{"name" => "贤良镇", "code" => "331126106000"},
      %{"name" => "百山祖镇", "code" => "331126107000"},
      %{"name" => "岭头乡", "code" => "331126200000"},
      %{"name" => "五大堡乡", "code" => "331126201000"},
      %{"name" => "淤上乡", "code" => "331126202000"},
      %{"name" => "安南乡", "code" => "331126203000"},
      %{"name" => "张村乡", "code" => "331126204000"},
      %{"name" => "隆宫乡", "code" => "331126205000"},
      %{"name" => "举水乡", "code" => "331126206000"},
      %{"name" => "江根乡", "code" => "331126207000"},
      %{"name" => "龙溪乡", "code" => "331126209000"},
      %{"name" => "官塘乡", "code" => "331126211000"}
    ]

  def next(input) when input == "景宁畲族自治县" or input == "331127",
    do: [
      %{"name" => "红星街道", "code" => "331127001000"},
      %{"name" => "鹤溪街道", "code" => "331127002000"},
      %{"name" => "渤海镇", "code" => "331127101000"},
      %{"name" => "东坑镇", "code" => "331127102000"},
      %{"name" => "英川镇", "code" => "331127103000"},
      %{"name" => "沙湾镇", "code" => "331127104000"},
      %{"name" => "大均乡", "code" => "331127201000"},
      %{"name" => "澄照乡", "code" => "331127202000"},
      %{"name" => "梅岐乡", "code" => "331127203000"},
      %{"name" => "郑坑乡", "code" => "331127205000"},
      %{"name" => "大漈乡", "code" => "331127208000"},
      %{"name" => "景南乡", "code" => "331127209000"},
      %{"name" => "雁溪乡", "code" => "331127210000"},
      %{"name" => "鸬鹚乡", "code" => "331127212000"},
      %{"name" => "梧桐乡", "code" => "331127213000"},
      %{"name" => "标溪乡", "code" => "331127214000"},
      %{"name" => "毛垟乡", "code" => "331127215000"},
      %{"name" => "秋炉乡", "code" => "331127216000"},
      %{"name" => "大地乡", "code" => "331127217000"},
      %{"name" => "家地乡", "code" => "331127218000"},
      %{"name" => "九龙乡", "code" => "331127219000"}
    ]

  def next(input) when input == "龙泉市" or input == "331181",
    do: [
      %{"name" => "龙渊街道", "code" => "331181001000"},
      %{"name" => "西街街道", "code" => "331181002000"},
      %{"name" => "剑池街道", "code" => "331181003000"},
      %{"name" => "石达石街道", "code" => "331181004000"},
      %{"name" => "八都镇", "code" => "331181100000"},
      %{"name" => "上垟镇", "code" => "331181101000"},
      %{"name" => "小梅镇", "code" => "331181102000"},
      %{"name" => "查田镇", "code" => "331181103000"},
      %{"name" => "安仁镇", "code" => "331181104000"},
      %{"name" => "锦溪镇", "code" => "331181105000"},
      %{"name" => "住龙镇", "code" => "331181106000"},
      %{"name" => "屏南镇", "code" => "331181107000"},
      %{"name" => "兰巨乡", "code" => "331181200000"},
      %{"name" => "宝溪乡", "code" => "331181202000"},
      %{"name" => "竹垟畲族乡", "code" => "331181203000"},
      %{"name" => "道太乡", "code" => "331181204000"},
      %{"name" => "岩樟乡", "code" => "331181205000"},
      %{"name" => "城北乡", "code" => "331181206000"},
      %{"name" => "龙南乡", "code" => "331181207000"}
    ]

  def next(input) when input == "椒江区" or input == "331002",
    do: [
      %{"name" => "海门街道", "code" => "331002001000"},
      %{"name" => "白云街道", "code" => "331002002000"},
      %{"name" => "葭沚街道", "code" => "331002003000"},
      %{"name" => "洪家街道", "code" => "331002004000"},
      %{"name" => "三甲街道", "code" => "331002005000"},
      %{"name" => "下陈街道", "code" => "331002006000"},
      %{"name" => "前所街道", "code" => "331002007000"},
      %{"name" => "章安街道", "code" => "331002008000"},
      %{"name" => "海虹街道", "code" => "331002009000"},
      %{"name" => "大陈镇", "code" => "331002101000"},
      %{"name" => "椒江农场", "code" => "331002400000"},
      %{"name" => "月湖新城", "code" => "331002402000"}
    ]

  def next(input) when input == "黄岩区" or input == "331003",
    do: [
      %{"name" => "东城街道", "code" => "331003001000"},
      %{"name" => "南城街道", "code" => "331003002000"},
      %{"name" => "西城街道", "code" => "331003003000"},
      %{"name" => "北城街道", "code" => "331003004000"},
      %{"name" => "新前街道", "code" => "331003005000"},
      %{"name" => "澄江街道", "code" => "331003006000"},
      %{"name" => "江口街道", "code" => "331003007000"},
      %{"name" => "高桥街道", "code" => "331003008000"},
      %{"name" => "宁溪镇", "code" => "331003101000"},
      %{"name" => "北洋镇", "code" => "331003102000"},
      %{"name" => "头陀镇", "code" => "331003103000"},
      %{"name" => "院桥镇", "code" => "331003107000"},
      %{"name" => "沙埠镇", "code" => "331003108000"},
      %{"name" => "屿头乡", "code" => "331003200000"},
      %{"name" => "上郑乡", "code" => "331003201000"},
      %{"name" => "富山乡", "code" => "331003202000"},
      %{"name" => "茅畲乡", "code" => "331003203000"},
      %{"name" => "上垟乡", "code" => "331003204000"},
      %{"name" => "平田乡", "code" => "331003205000"}
    ]

  def next(input) when input == "路桥区" or input == "331004",
    do: [
      %{"name" => "路南街道", "code" => "331004001000"},
      %{"name" => "路桥街道", "code" => "331004002000"},
      %{"name" => "路北街道", "code" => "331004003000"},
      %{"name" => "螺洋街道", "code" => "331004004000"},
      %{"name" => "桐屿街道", "code" => "331004005000"},
      %{"name" => "峰江街道", "code" => "331004006000"},
      %{"name" => "新桥镇", "code" => "331004103000"},
      %{"name" => "横街镇", "code" => "331004104000"},
      %{"name" => "金清镇", "code" => "331004106000"},
      %{"name" => "蓬街镇", "code" => "331004107000"},
      %{"name" => "滨海工业城", "code" => "331004400000"},
      %{"name" => "滨海新区", "code" => "331004401000"}
    ]

  def next(input) when input == "三门县" or input == "331022",
    do: [
      %{"name" => "海游街道", "code" => "331022001000"},
      %{"name" => "海润街道", "code" => "331022002000"},
      %{"name" => "沙柳街道", "code" => "331022003000"},
      %{"name" => "珠岙镇", "code" => "331022102000"},
      %{"name" => "亭旁镇", "code" => "331022103000"},
      %{"name" => "健跳镇", "code" => "331022105000"},
      %{"name" => "横渡镇", "code" => "331022106000"},
      %{"name" => "浦坝港镇", "code" => "331022107000"},
      %{"name" => "花桥镇", "code" => "331022108000"},
      %{"name" => "蛇蟠乡", "code" => "331022205000"}
    ]

  def next(input) when input == "天台县" or input == "331023",
    do: [
      %{"name" => "赤城街道", "code" => "331023001000"},
      %{"name" => "始丰街道", "code" => "331023002000"},
      %{"name" => "福溪街道", "code" => "331023003000"},
      %{"name" => "白鹤镇", "code" => "331023101000"},
      %{"name" => "石梁镇", "code" => "331023102000"},
      %{"name" => "街头镇", "code" => "331023104000"},
      %{"name" => "平桥镇", "code" => "331023105000"},
      %{"name" => "坦头镇", "code" => "331023106000"},
      %{"name" => "三合镇", "code" => "331023107000"},
      %{"name" => "洪畴镇", "code" => "331023108000"},
      %{"name" => "三州乡", "code" => "331023200000"},
      %{"name" => "龙溪乡", "code" => "331023203000"},
      %{"name" => "雷峰乡", "code" => "331023204000"},
      %{"name" => "南屏乡", "code" => "331023207000"},
      %{"name" => "泳溪乡", "code" => "331023209000"}
    ]

  def next(input) when input == "仙居县" or input == "331024",
    do: [
      %{"name" => "安洲街道", "code" => "331024001000"},
      %{"name" => "南峰街道", "code" => "331024002000"},
      %{"name" => "福应街道", "code" => "331024003000"},
      %{"name" => "横溪镇", "code" => "331024101000"},
      %{"name" => "埠头镇", "code" => "331024102000"},
      %{"name" => "白塔镇", "code" => "331024103000"},
      %{"name" => "田市镇", "code" => "331024104000"},
      %{"name" => "官路镇", "code" => "331024105000"},
      %{"name" => "下各镇", "code" => "331024106000"},
      %{"name" => "朱溪镇", "code" => "331024107000"},
      %{"name" => "安岭乡", "code" => "331024200000"},
      %{"name" => "溪港乡", "code" => "331024201000"},
      %{"name" => "湫山乡", "code" => "331024202000"},
      %{"name" => "淡竹乡", "code" => "331024203000"},
      %{"name" => "皤滩乡", "code" => "331024204000"},
      %{"name" => "上张乡", "code" => "331024205000"},
      %{"name" => "步路乡", "code" => "331024206000"},
      %{"name" => "广度乡", "code" => "331024207000"},
      %{"name" => "大战乡", "code" => "331024209000"},
      %{"name" => "双庙乡", "code" => "331024210000"}
    ]

  def next(input) when input == "温岭市" or input == "331081",
    do: [
      %{"name" => "太平街道", "code" => "331081001000"},
      %{"name" => "城东街道", "code" => "331081002000"},
      %{"name" => "城西街道", "code" => "331081003000"},
      %{"name" => "城北街道", "code" => "331081004000"},
      %{"name" => "横峰街道", "code" => "331081005000"},
      %{"name" => "泽国镇", "code" => "331081100000"},
      %{"name" => "大溪镇", "code" => "331081101000"},
      %{"name" => "松门镇", "code" => "331081102000"},
      %{"name" => "箬横镇", "code" => "331081103000"},
      %{"name" => "新河镇", "code" => "331081104000"},
      %{"name" => "石塘镇", "code" => "331081105000"},
      %{"name" => "滨海镇", "code" => "331081106000"},
      %{"name" => "温峤镇", "code" => "331081107000"},
      %{"name" => "城南镇", "code" => "331081108000"},
      %{"name" => "石桥头镇", "code" => "331081109000"},
      %{"name" => "坞根镇", "code" => "331081110000"},
      %{"name" => "东部新区", "code" => "331081400000"}
    ]

  def next(input) when input == "临海市" or input == "331082",
    do: [
      %{"name" => "古城街道", "code" => "331082001000"},
      %{"name" => "大洋街道", "code" => "331082002000"},
      %{"name" => "江南街道", "code" => "331082003000"},
      %{"name" => "大田街道", "code" => "331082004000"},
      %{"name" => "邵家渡街道", "code" => "331082005000"},
      %{"name" => "汛桥镇", "code" => "331082100000"},
      %{"name" => "东塍镇", "code" => "331082101000"},
      %{"name" => "汇溪镇", "code" => "331082103000"},
      %{"name" => "小芝镇", "code" => "331082104000"},
      %{"name" => "河头镇", "code" => "331082105000"},
      %{"name" => "白水洋镇", "code" => "331082106000"},
      %{"name" => "括苍镇", "code" => "331082107000"},
      %{"name" => "永丰镇", "code" => "331082108000"},
      %{"name" => "尤溪镇", "code" => "331082109000"},
      %{"name" => "涌泉镇", "code" => "331082110000"},
      %{"name" => "沿江镇", "code" => "331082111000"},
      %{"name" => "杜桥镇", "code" => "331082112000"},
      %{"name" => "上盘镇", "code" => "331082113000"},
      %{"name" => "桃渚镇", "code" => "331082114000"}
    ]

  def next(input) when input == "玉环市" or input == "331083",
    do: [
      %{"name" => "玉城街道", "code" => "331083001000"},
      %{"name" => "坎门街道", "code" => "331083002000"},
      %{"name" => "大麦屿街道", "code" => "331083003000"},
      %{"name" => "清港镇", "code" => "331083101000"},
      %{"name" => "楚门镇", "code" => "331083102000"},
      %{"name" => "干江镇", "code" => "331083103000"},
      %{"name" => "沙门镇", "code" => "331083105000"},
      %{"name" => "芦浦镇", "code" => "331083106000"},
      %{"name" => "龙溪镇", "code" => "331083107000"},
      %{"name" => "鸡山乡", "code" => "331083201000"},
      %{"name" => "海山乡", "code" => "331083202000"},
      %{"name" => "玉环经济开发区", "code" => "331083400000"}
    ]

  def next(input) when input == "定海区" or input == "330902",
    do: [
      %{"name" => "昌国街道", "code" => "330902002000"},
      %{"name" => "环南街道", "code" => "330902003000"},
      %{"name" => "城东街道", "code" => "330902004000"},
      %{"name" => "盐仓街道", "code" => "330902005000"},
      %{"name" => "临城街道", "code" => "330902006000"},
      %{"name" => "岑港街道", "code" => "330902007000"},
      %{"name" => "马岙街道", "code" => "330902008000"},
      %{"name" => "双桥街道", "code" => "330902009000"},
      %{"name" => "小沙街道", "code" => "330902010000"},
      %{"name" => "千岛街道", "code" => "330902050000"},
      %{"name" => "金塘镇", "code" => "330902100000"},
      %{"name" => "白泉镇", "code" => "330902104000"},
      %{"name" => "干览镇", "code" => "330902105000"}
    ]

  def next(input) when input == "普陀区" or input == "330903",
    do: [
      %{"name" => "沈家门街道", "code" => "330903001000"},
      %{"name" => "东港街道", "code" => "330903003000"},
      %{"name" => "朱家尖街道", "code" => "330903004000"},
      %{"name" => "展茅街道", "code" => "330903005000"},
      %{"name" => "六横镇", "code" => "330903100000"},
      %{"name" => "虾峙镇", "code" => "330903102000"},
      %{"name" => "桃花镇", "code" => "330903104000"},
      %{"name" => "东极镇", "code" => "330903105000"},
      %{"name" => "普陀山镇", "code" => "330903106000"}
    ]

  def next(input) when input == "岱山县" or input == "330921",
    do: [
      %{"name" => "高亭镇", "code" => "330921100000"},
      %{"name" => "东沙镇", "code" => "330921101000"},
      %{"name" => "岱东镇", "code" => "330921102000"},
      %{"name" => "岱西镇", "code" => "330921103000"},
      %{"name" => "长涂镇", "code" => "330921105000"},
      %{"name" => "衢山镇", "code" => "330921106000"},
      %{"name" => "秀山乡", "code" => "330921200000"}
    ]

  def next(input) when input == "嵊泗县" or input == "330922",
    do: [
      %{"name" => "菜园镇", "code" => "330922100000"},
      %{"name" => "嵊山镇", "code" => "330922101000"},
      %{"name" => "洋山镇", "code" => "330922102000"},
      %{"name" => "五龙乡", "code" => "330922200000"},
      %{"name" => "黄龙乡", "code" => "330922201000"},
      %{"name" => "枸杞乡", "code" => "330922202000"},
      %{"name" => "花鸟乡", "code" => "330922203000"}
    ]

  def next(input) when input == "柯城区" or input == "330802",
    do: [
      %{"name" => "新新街道", "code" => "330802005000"},
      %{"name" => "府山街道", "code" => "330802006000"},
      %{"name" => "荷花街道", "code" => "330802007000"},
      %{"name" => "信安街道", "code" => "330802008000"},
      %{"name" => "白云街道", "code" => "330802009000"},
      %{"name" => "双港街道", "code" => "330802010000"},
      %{"name" => "衢化街道", "code" => "330802012000"},
      %{"name" => "花园街道", "code" => "330802013000"},
      %{"name" => "石梁镇", "code" => "330802100000"},
      %{"name" => "航埠镇", "code" => "330802101000"},
      %{"name" => "黄家乡", "code" => "330802205000"},
      %{"name" => "七里乡", "code" => "330802209000"},
      %{"name" => "九华乡", "code" => "330802210000"},
      %{"name" => "沟溪乡", "code" => "330802211000"},
      %{"name" => "华墅乡", "code" => "330802212000"},
      %{"name" => "姜家山乡", "code" => "330802213000"},
      %{"name" => "万田乡", "code" => "330802214000"},
      %{"name" => "石室乡", "code" => "330802215000"}
    ]

  def next(input) when input == "衢江区" or input == "330803",
    do: [
      %{"name" => "樟潭街道", "code" => "330803001000"},
      %{"name" => "浮石街道", "code" => "330803002000"},
      %{"name" => "上方镇", "code" => "330803100000"},
      %{"name" => "峡川镇", "code" => "330803101000"},
      %{"name" => "莲花镇", "code" => "330803103000"},
      %{"name" => "全旺镇", "code" => "330803109000"},
      %{"name" => "大洲镇", "code" => "330803110000"},
      %{"name" => "后溪镇", "code" => "330803111000"},
      %{"name" => "廿里镇", "code" => "330803112000"},
      %{"name" => "湖南镇", "code" => "330803113000"},
      %{"name" => "高家镇", "code" => "330803114000"},
      %{"name" => "杜泽镇", "code" => "330803115000"},
      %{"name" => "灰坪乡", "code" => "330803200000"},
      %{"name" => "太真乡", "code" => "330803202000"},
      %{"name" => "双桥乡", "code" => "330803203000"},
      %{"name" => "周家乡", "code" => "330803206000"},
      %{"name" => "云溪乡", "code" => "330803207000"},
      %{"name" => "举村乡", "code" => "330803213000"},
      %{"name" => "岭洋乡", "code" => "330803218000"},
      %{"name" => "黄坛口乡", "code" => "330803219000"}
    ]

  def next(input) when input == "常山县" or input == "330822",
    do: [
      %{"name" => "天马街道", "code" => "330822001000"},
      %{"name" => "紫港街道", "code" => "330822002000"},
      %{"name" => "金川街道", "code" => "330822003000"},
      %{"name" => "白石镇", "code" => "330822104000"},
      %{"name" => "招贤镇", "code" => "330822108000"},
      %{"name" => "青石镇", "code" => "330822109000"},
      %{"name" => "球川镇", "code" => "330822111000"},
      %{"name" => "辉埠镇", "code" => "330822115000"},
      %{"name" => "芳村镇", "code" => "330822116000"},
      %{"name" => "何家乡", "code" => "330822200000"},
      %{"name" => "同弓乡", "code" => "330822211000"},
      %{"name" => "大桥头乡", "code" => "330822213000"},
      %{"name" => "新昌乡", "code" => "330822219000"},
      %{"name" => "东案乡", "code" => "330822221000"}
    ]

  def next(input) when input == "开化县" or input == "330824",
    do: [
      %{"name" => "桐村镇", "code" => "330824106000"},
      %{"name" => "杨林镇", "code" => "330824107000"},
      %{"name" => "苏庄镇", "code" => "330824108000"},
      %{"name" => "齐溪镇", "code" => "330824109000"},
      %{"name" => "村头镇", "code" => "330824113000"},
      %{"name" => "华埠镇", "code" => "330824115000"},
      %{"name" => "马金镇", "code" => "330824116000"},
      %{"name" => "池淮镇", "code" => "330824117000"},
      %{"name" => "中村乡", "code" => "330824202000"},
      %{"name" => "长虹乡", "code" => "330824205000"},
      %{"name" => "何田乡", "code" => "330824208000"},
      %{"name" => "林山乡", "code" => "330824216000"},
      %{"name" => "音坑乡", "code" => "330824217000"},
      %{"name" => "大溪边乡", "code" => "330824218000"}
    ]

  def next(input) when input == "龙游县" or input == "330825",
    do: [
      %{"name" => "龙洲街道", "code" => "330825001000"},
      %{"name" => "东华街道", "code" => "330825002000"},
      %{"name" => "湖镇镇", "code" => "330825101000"},
      %{"name" => "小南海镇", "code" => "330825102000"},
      %{"name" => "詹家镇", "code" => "330825106000"},
      %{"name" => "溪口镇", "code" => "330825109000"},
      %{"name" => "横山镇", "code" => "330825110000"},
      %{"name" => "塔石镇", "code" => "330825111000"},
      %{"name" => "罗家乡", "code" => "330825201000"},
      %{"name" => "庙下乡", "code" => "330825203000"},
      %{"name" => "石佛乡", "code" => "330825207000"},
      %{"name" => "社阳乡", "code" => "330825209000"},
      %{"name" => "大街乡", "code" => "330825211000"},
      %{"name" => "沐尘畲族乡", "code" => "330825212000"},
      %{"name" => "模环乡", "code" => "330825213000"}
    ]

  def next(input) when input == "江山市" or input == "330881",
    do: [
      %{"name" => "双塔街道", "code" => "330881001000"},
      %{"name" => "虎山街道", "code" => "330881002000"},
      %{"name" => "清湖街道", "code" => "330881003000"},
      %{"name" => "四都镇", "code" => "330881102000"},
      %{"name" => "坛石镇", "code" => "330881105000"},
      %{"name" => "大桥镇", "code" => "330881106000"},
      %{"name" => "新塘边镇", "code" => "330881109000"},
      %{"name" => "廿八都镇", "code" => "330881112000"},
      %{"name" => "长台镇", "code" => "330881113000"},
      %{"name" => "上余镇", "code" => "330881116000"},
      %{"name" => "凤林镇", "code" => "330881118000"},
      %{"name" => "峡口镇", "code" => "330881119000"},
      %{"name" => "石门镇", "code" => "330881120000"},
      %{"name" => "贺村镇", "code" => "330881121000"},
      %{"name" => "大陈乡", "code" => "330881201000"},
      %{"name" => "碗窑乡", "code" => "330881203000"},
      %{"name" => "保安乡", "code" => "330881207000"},
      %{"name" => "塘源口乡", "code" => "330881213000"},
      %{"name" => "张村乡", "code" => "330881214000"}
    ]

  def next(input) when input == "婺城区" or input == "330702",
    do: [
      %{"name" => "城东街道", "code" => "330702001000"},
      %{"name" => "城中街道", "code" => "330702002000"},
      %{"name" => "城西街道", "code" => "330702003000"},
      %{"name" => "城北街道", "code" => "330702004000"},
      %{"name" => "江南街道", "code" => "330702005000"},
      %{"name" => "三江街道", "code" => "330702006000"},
      %{"name" => "西关街道", "code" => "330702007000"},
      %{"name" => "秋滨街道", "code" => "330702008000"},
      %{"name" => "新狮街道", "code" => "330702009000"},
      %{"name" => "罗店镇", "code" => "330702100000"},
      %{"name" => "雅畈镇", "code" => "330702101000"},
      %{"name" => "安地镇", "code" => "330702102000"},
      %{"name" => "白龙桥镇", "code" => "330702103000"},
      %{"name" => "琅琊镇", "code" => "330702104000"},
      %{"name" => "蒋堂镇", "code" => "330702105000"},
      %{"name" => "汤溪镇", "code" => "330702106000"},
      %{"name" => "罗埠镇", "code" => "330702107000"},
      %{"name" => "洋埠镇", "code" => "330702108000"},
      %{"name" => "乾西乡", "code" => "330702201000"},
      %{"name" => "竹马乡", "code" => "330702202000"},
      %{"name" => "长山乡", "code" => "330702203000"},
      %{"name" => "箬阳乡", "code" => "330702204000"},
      %{"name" => "沙畈乡", "code" => "330702205000"},
      %{"name" => "塔石乡", "code" => "330702206000"},
      %{"name" => "莘畈乡", "code" => "330702208000"},
      %{"name" => "苏孟乡", "code" => "330702209000"}
    ]

  def next(input) when input == "金东区" or input == "330703",
    do: [
      %{"name" => "多湖街道", "code" => "330703001000"},
      %{"name" => "东孝街道", "code" => "330703002000"},
      %{"name" => "孝顺镇", "code" => "330703101000"},
      %{"name" => "傅村镇", "code" => "330703102000"},
      %{"name" => "曹宅镇", "code" => "330703103000"},
      %{"name" => "澧浦镇", "code" => "330703104000"},
      %{"name" => "岭下镇", "code" => "330703105000"},
      %{"name" => "江东镇", "code" => "330703106000"},
      %{"name" => "塘雅镇", "code" => "330703107000"},
      %{"name" => "赤松镇", "code" => "330703108000"},
      %{"name" => "源东乡", "code" => "330703200000"}
    ]

  def next(input) when input == "武义县" or input == "330723",
    do: [
      %{"name" => "白洋街道", "code" => "330723001000"},
      %{"name" => "壶山街道", "code" => "330723002000"},
      %{"name" => "熟溪街道", "code" => "330723003000"},
      %{"name" => "柳城畲族镇", "code" => "330723100000"},
      %{"name" => "履坦镇", "code" => "330723101000"},
      %{"name" => "桐琴镇", "code" => "330723102000"},
      %{"name" => "泉溪镇", "code" => "330723103000"},
      %{"name" => "新宅镇", "code" => "330723104000"},
      %{"name" => "王宅镇", "code" => "330723105000"},
      %{"name" => "桃溪镇", "code" => "330723106000"},
      %{"name" => "茭道镇", "code" => "330723107000"},
      %{"name" => "大田乡", "code" => "330723200000"},
      %{"name" => "白姆乡", "code" => "330723201000"},
      %{"name" => "俞源乡", "code" => "330723202000"},
      %{"name" => "坦洪乡", "code" => "330723203000"},
      %{"name" => "西联乡", "code" => "330723204000"},
      %{"name" => "三港乡", "code" => "330723205000"},
      %{"name" => "大溪口乡", "code" => "330723206000"}
    ]

  def next(input) when input == "浦江县" or input == "330726",
    do: [
      %{"name" => "浦南街道", "code" => "330726001000"},
      %{"name" => "仙华街道", "code" => "330726002000"},
      %{"name" => "浦阳街道", "code" => "330726003000"},
      %{"name" => "黄宅镇", "code" => "330726101000"},
      %{"name" => "白马镇", "code" => "330726102000"},
      %{"name" => "郑家坞镇", "code" => "330726103000"},
      %{"name" => "郑宅镇", "code" => "330726104000"},
      %{"name" => "岩头镇", "code" => "330726105000"},
      %{"name" => "檀溪镇", "code" => "330726106000"},
      %{"name" => "杭坪镇", "code" => "330726107000"},
      %{"name" => "大畈乡", "code" => "330726200000"},
      %{"name" => "中余乡", "code" => "330726201000"},
      %{"name" => "前吴乡", "code" => "330726202000"},
      %{"name" => "花桥乡", "code" => "330726203000"},
      %{"name" => "虞宅乡", "code" => "330726204000"}
    ]

  def next(input) when input == "磐安县" or input == "330727",
    do: [
      %{"name" => "安文街道", "code" => "330727001000"},
      %{"name" => "新渥街道", "code" => "330727002000"},
      %{"name" => "仁川镇", "code" => "330727103000"},
      %{"name" => "大盘镇", "code" => "330727104000"},
      %{"name" => "方前镇", "code" => "330727105000"},
      %{"name" => "玉山镇", "code" => "330727106000"},
      %{"name" => "尚湖镇", "code" => "330727107000"},
      %{"name" => "冷水镇", "code" => "330727108000"},
      %{"name" => "尖山镇", "code" => "330727109000"},
      %{"name" => "双峰乡", "code" => "330727201000"},
      %{"name" => "双溪乡", "code" => "330727203000"},
      %{"name" => "窈川乡", "code" => "330727205000"},
      %{"name" => "九和乡", "code" => "330727211000"},
      %{"name" => "盘峰乡", "code" => "330727212000"}
    ]

  def next(input) when input == "兰溪市" or input == "330781",
    do: [
      %{"name" => "兰江街道", "code" => "330781001000"},
      %{"name" => "云山街道", "code" => "330781002000"},
      %{"name" => "永昌街道", "code" => "330781004000"},
      %{"name" => "赤溪街道", "code" => "330781005000"},
      %{"name" => "女埠街道", "code" => "330781006000"},
      %{"name" => "上华街道", "code" => "330781007000"},
      %{"name" => "游埠镇", "code" => "330781102000"},
      %{"name" => "诸葛镇", "code" => "330781104000"},
      %{"name" => "黄店镇", "code" => "330781106000"},
      %{"name" => "香溪镇", "code" => "330781108000"},
      %{"name" => "马涧镇", "code" => "330781109000"},
      %{"name" => "梅江镇", "code" => "330781111000"},
      %{"name" => "横溪镇", "code" => "330781112000"},
      %{"name" => "灵洞乡", "code" => "330781200000"},
      %{"name" => "水亭畲族乡", "code" => "330781203000"},
      %{"name" => "柏社乡", "code" => "330781209000"}
    ]

  def next(input) when input == "义乌市" or input == "330782",
    do: [
      %{"name" => "稠城街道", "code" => "330782001000"},
      %{"name" => "江东街道", "code" => "330782002000"},
      %{"name" => "稠江街道", "code" => "330782003000"},
      %{"name" => "北苑街道", "code" => "330782004000"},
      %{"name" => "后宅街道", "code" => "330782005000"},
      %{"name" => "城西街道", "code" => "330782006000"},
      %{"name" => "廿三里街道", "code" => "330782007000"},
      %{"name" => "福田街道", "code" => "330782008000"},
      %{"name" => "佛堂镇", "code" => "330782100000"},
      %{"name" => "赤岸镇", "code" => "330782101000"},
      %{"name" => "义亭镇", "code" => "330782102000"},
      %{"name" => "上溪镇", "code" => "330782104000"},
      %{"name" => "苏溪镇", "code" => "330782105000"},
      %{"name" => "大陈镇", "code" => "330782106000"}
    ]

  def next(input) when input == "东阳市" or input == "330783",
    do: [
      %{"name" => "吴宁街道", "code" => "330783001000"},
      %{"name" => "南市街道", "code" => "330783003000"},
      %{"name" => "白云街道", "code" => "330783004000"},
      %{"name" => "江北街道", "code" => "330783005000"},
      %{"name" => "城东街道", "code" => "330783006000"},
      %{"name" => "六石街道", "code" => "330783007000"},
      %{"name" => "巍山镇", "code" => "330783106000"},
      %{"name" => "虎鹿镇", "code" => "330783107000"},
      %{"name" => "歌山镇", "code" => "330783108000"},
      %{"name" => "佐村镇", "code" => "330783109000"},
      %{"name" => "东阳江镇", "code" => "330783110000"},
      %{"name" => "湖溪镇", "code" => "330783112000"},
      %{"name" => "马宅镇", "code" => "330783114000"},
      %{"name" => "千祥镇", "code" => "330783116000"},
      %{"name" => "南马镇", "code" => "330783118000"},
      %{"name" => "画水镇", "code" => "330783122000"},
      %{"name" => "横店镇", "code" => "330783123000"},
      %{"name" => "三单乡", "code" => "330783201000"}
    ]

  def next(input) when input == "永康市" or input == "330784",
    do: [
      %{"name" => "东城街道", "code" => "330784001000"},
      %{"name" => "西城街道", "code" => "330784002000"},
      %{"name" => "江南街道", "code" => "330784003000"},
      %{"name" => "石柱镇", "code" => "330784105000"},
      %{"name" => "前仓镇", "code" => "330784106000"},
      %{"name" => "舟山镇", "code" => "330784107000"},
      %{"name" => "古山镇", "code" => "330784108000"},
      %{"name" => "方岩镇", "code" => "330784109000"},
      %{"name" => "龙山镇", "code" => "330784110000"},
      %{"name" => "西溪镇", "code" => "330784111000"},
      %{"name" => "象珠镇", "code" => "330784112000"},
      %{"name" => "唐先镇", "code" => "330784113000"},
      %{"name" => "花街镇", "code" => "330784114000"},
      %{"name" => "芝英镇", "code" => "330784115000"}
    ]

  def next(input) when input == "越城区" or input == "330602",
    do: [
      %{"name" => "塔山街道", "code" => "330602001000"},
      %{"name" => "府山街道", "code" => "330602002000"},
      %{"name" => "北海街道", "code" => "330602004000"},
      %{"name" => "城南街道", "code" => "330602005000"},
      %{"name" => "稽山街道", "code" => "330602006000"},
      %{"name" => "迪荡街道", "code" => "330602007000"},
      %{"name" => "东湖街道", "code" => "330602008000"},
      %{"name" => "灵芝街道", "code" => "330602009000"},
      %{"name" => "东浦街道", "code" => "330602010000"},
      %{"name" => "鉴湖街道", "code" => "330602011000"},
      %{"name" => "斗门街道", "code" => "330602012000"},
      %{"name" => "皋埠街道", "code" => "330602013000"},
      %{"name" => "马山街道", "code" => "330602014000"},
      %{"name" => "孙端街道", "code" => "330602015000"},
      %{"name" => "陶堰街道", "code" => "330602016000"},
      %{"name" => "沥海街道", "code" => "330602017000"},
      %{"name" => "富盛镇", "code" => "330602108000"}
    ]

  def next(input) when input == "柯桥区" or input == "330603",
    do: [
      %{"name" => "柯桥街道", "code" => "330603001000"},
      %{"name" => "柯岩街道", "code" => "330603002000"},
      %{"name" => "华舍街道", "code" => "330603003000"},
      %{"name" => "湖塘街道", "code" => "330603004000"},
      %{"name" => "齐贤街道", "code" => "330603005000"},
      %{"name" => "福全街道", "code" => "330603006000"},
      %{"name" => "安昌街道", "code" => "330603007000"},
      %{"name" => "兰亭街道", "code" => "330603008000"},
      %{"name" => "钱清街道", "code" => "330603009000"},
      %{"name" => "杨汛桥街道", "code" => "330603010000"},
      %{"name" => "马鞍街道", "code" => "330603011000"},
      %{"name" => "平水镇", "code" => "330603105000"},
      %{"name" => "王坛镇", "code" => "330603107000"},
      %{"name" => "稽东镇", "code" => "330603109000"},
      %{"name" => "漓渚镇", "code" => "330603111000"},
      %{"name" => "夏履镇", "code" => "330603114000"}
    ]

  def next(input) when input == "上虞区" or input == "330604",
    do: [
      %{"name" => "百官街道", "code" => "330604001000"},
      %{"name" => "曹娥街道", "code" => "330604002000"},
      %{"name" => "东关街道", "code" => "330604003000"},
      %{"name" => "道墟街道", "code" => "330604004000"},
      %{"name" => "梁湖街道", "code" => "330604005000"},
      %{"name" => "小越街道", "code" => "330604006000"},
      %{"name" => "崧厦街道", "code" => "330604007000"},
      %{"name" => "长塘镇", "code" => "330604101000"},
      %{"name" => "上浦镇", "code" => "330604102000"},
      %{"name" => "汤浦镇", "code" => "330604103000"},
      %{"name" => "章镇镇", "code" => "330604104000"},
      %{"name" => "下管镇", "code" => "330604105000"},
      %{"name" => "丰惠镇", "code" => "330604106000"},
      %{"name" => "永和镇", "code" => "330604107000"},
      %{"name" => "驿亭镇", "code" => "330604109000"},
      %{"name" => "谢塘镇", "code" => "330604111000"},
      %{"name" => "盖北镇", "code" => "330604112000"},
      %{"name" => "岭南乡", "code" => "330604200000"},
      %{"name" => "陈溪乡", "code" => "330604201000"},
      %{"name" => "丁宅乡", "code" => "330604202000"}
    ]

  def next(input) when input == "新昌县" or input == "330624",
    do: [
      %{"name" => "羽林街道", "code" => "330624001000"},
      %{"name" => "南明街道", "code" => "330624002000"},
      %{"name" => "七星街道", "code" => "330624003000"},
      %{"name" => "澄潭街道", "code" => "330624004000"},
      %{"name" => "回山镇", "code" => "330624104000"},
      %{"name" => "小将镇", "code" => "330624107000"},
      %{"name" => "沙溪镇", "code" => "330624108000"},
      %{"name" => "镜岭镇", "code" => "330624109000"},
      %{"name" => "儒岙镇", "code" => "330624110000"},
      %{"name" => "沃洲镇", "code" => "330624112000"},
      %{"name" => "城南乡", "code" => "330624200000"},
      %{"name" => "东茗乡", "code" => "330624201000"}
    ]

  def next(input) when input == "诸暨市" or input == "330681",
    do: [
      %{"name" => "暨阳街道", "code" => "330681001000"},
      %{"name" => "浣东街道", "code" => "330681002000"},
      %{"name" => "陶朱街道", "code" => "330681003000"},
      %{"name" => "暨南街道", "code" => "330681004000"},
      %{"name" => "大唐街道", "code" => "330681005000"},
      %{"name" => "应店街镇", "code" => "330681102000"},
      %{"name" => "次坞镇", "code" => "330681103000"},
      %{"name" => "店口镇", "code" => "330681104000"},
      %{"name" => "姚江镇", "code" => "330681106000"},
      %{"name" => "山下湖镇", "code" => "330681108000"},
      %{"name" => "枫桥镇", "code" => "330681109000"},
      %{"name" => "赵家镇", "code" => "330681110000"},
      %{"name" => "马剑镇", "code" => "330681111000"},
      %{"name" => "五泄镇", "code" => "330681112000"},
      %{"name" => "牌头镇", "code" => "330681115000"},
      %{"name" => "同山镇", "code" => "330681116000"},
      %{"name" => "安华镇", "code" => "330681117000"},
      %{"name" => "璜山镇", "code" => "330681119000"},
      %{"name" => "陈宅镇", "code" => "330681120000"},
      %{"name" => "岭北镇", "code" => "330681121000"},
      %{"name" => "浬浦镇", "code" => "330681122000"},
      %{"name" => "东白湖镇", "code" => "330681124000"},
      %{"name" => "东和乡", "code" => "330681201000"}
    ]

  def next(input) when input == "嵊州市" or input == "330683",
    do: [
      %{"name" => "剡湖街道", "code" => "330683001000"},
      %{"name" => "三江街道", "code" => "330683002000"},
      %{"name" => "鹿山街道", "code" => "330683003000"},
      %{"name" => "浦口街道", "code" => "330683005000"},
      %{"name" => "甘霖镇", "code" => "330683100000"},
      %{"name" => "长乐镇", "code" => "330683101000"},
      %{"name" => "崇仁镇", "code" => "330683102000"},
      %{"name" => "黄泽镇", "code" => "330683103000"},
      %{"name" => "三界镇", "code" => "330683104000"},
      %{"name" => "石璜镇", "code" => "330683105000"},
      %{"name" => "谷来镇", "code" => "330683106000"},
      %{"name" => "仙岩镇", "code" => "330683107000"},
      %{"name" => "金庭镇", "code" => "330683108000"},
      %{"name" => "下王镇", "code" => "330683110000"},
      %{"name" => "贵门乡", "code" => "330683200000"}
    ]

  def next(input) when input == "吴兴区" or input == "330502",
    do: [
      %{"name" => "月河街道", "code" => "330502001000"},
      %{"name" => "朝阳街道", "code" => "330502002000"},
      %{"name" => "爱山街道", "code" => "330502003000"},
      %{"name" => "飞英街道", "code" => "330502004000"},
      %{"name" => "龙泉街道", "code" => "330502005000"},
      %{"name" => "凤凰街道", "code" => "330502006000"},
      %{"name" => "康山街道", "code" => "330502007000"},
      %{"name" => "仁皇山街道", "code" => "330502008000"},
      %{"name" => "滨湖街道", "code" => "330502009000"},
      %{"name" => "龙溪街道", "code" => "330502010000"},
      %{"name" => "杨家埠街道", "code" => "330502011000"},
      %{"name" => "环渚街道", "code" => "330502012000"},
      %{"name" => "湖东街道", "code" => "330502013000"},
      %{"name" => "织里镇", "code" => "330502100000"},
      %{"name" => "八里店镇", "code" => "330502101000"},
      %{"name" => "妙西镇", "code" => "330502102000"},
      %{"name" => "埭溪镇", "code" => "330502104000"},
      %{"name" => "东林镇", "code" => "330502105000"},
      %{"name" => "道场乡", "code" => "330502200000"}
    ]

  def next(input) when input == "南浔区" or input == "330503",
    do: [
      %{"name" => "东迁街道", "code" => "330503001000"},
      %{"name" => "旧馆街道", "code" => "330503002000"},
      %{"name" => "南浔镇", "code" => "330503100000"},
      %{"name" => "双林镇", "code" => "330503101000"},
      %{"name" => "练市镇", "code" => "330503102000"},
      %{"name" => "善琏镇", "code" => "330503103000"},
      %{"name" => "菱湖镇", "code" => "330503105000"},
      %{"name" => "和孚镇", "code" => "330503106000"},
      %{"name" => "千金镇", "code" => "330503107000"},
      %{"name" => "石淙镇", "code" => "330503108000"}
    ]

  def next(input) when input == "德清县" or input == "330521",
    do: [
      %{"name" => "武康街道", "code" => "330521001000"},
      %{"name" => "舞阳街道", "code" => "330521002000"},
      %{"name" => "阜溪街道", "code" => "330521003000"},
      %{"name" => "下渚湖街道", "code" => "330521004000"},
      %{"name" => "康乾街道", "code" => "330521005000"},
      %{"name" => "乾元镇", "code" => "330521101000"},
      %{"name" => "新市镇", "code" => "330521102000"},
      %{"name" => "洛舍镇", "code" => "330521103000"},
      %{"name" => "钟管镇", "code" => "330521104000"},
      %{"name" => "雷甸镇", "code" => "330521110000"},
      %{"name" => "禹越镇", "code" => "330521113000"},
      %{"name" => "新安镇", "code" => "330521114000"},
      %{"name" => "莫干山镇", "code" => "330521115000"}
    ]

  def next(input) when input == "长兴县" or input == "330522",
    do: [
      %{"name" => "雉城街道", "code" => "330522001000"},
      %{"name" => "画溪街道", "code" => "330522002000"},
      %{"name" => "太湖街道", "code" => "330522003000"},
      %{"name" => "龙山街道", "code" => "330522004000"},
      %{"name" => "洪桥镇", "code" => "330522101000"},
      %{"name" => "李家巷镇", "code" => "330522102000"},
      %{"name" => "夹浦镇", "code" => "330522103000"},
      %{"name" => "林城镇", "code" => "330522104000"},
      %{"name" => "虹星桥镇", "code" => "330522106000"},
      %{"name" => "小浦镇", "code" => "330522108000"},
      %{"name" => "和平镇", "code" => "330522110000"},
      %{"name" => "泗安镇", "code" => "330522111000"},
      %{"name" => "煤山镇", "code" => "330522112000"},
      %{"name" => "水口乡", "code" => "330522200000"},
      %{"name" => "吕山乡", "code" => "330522202000"}
    ]

  def next(input) when input == "安吉县" or input == "330523",
    do: [
      %{"name" => "递铺街道", "code" => "330523001000"},
      %{"name" => "昌硕街道", "code" => "330523002000"},
      %{"name" => "灵峰街道", "code" => "330523003000"},
      %{"name" => "孝源街道", "code" => "330523004000"},
      %{"name" => "鄣吴镇", "code" => "330523103000"},
      %{"name" => "杭垓镇", "code" => "330523104000"},
      %{"name" => "孝丰镇", "code" => "330523105000"},
      %{"name" => "报福镇", "code" => "330523106000"},
      %{"name" => "章村镇", "code" => "330523107000"},
      %{"name" => "天荒坪镇", "code" => "330523108000"},
      %{"name" => "梅溪镇", "code" => "330523110000"},
      %{"name" => "天子湖镇", "code" => "330523111000"},
      %{"name" => "溪龙乡", "code" => "330523201000"},
      %{"name" => "上墅乡", "code" => "330523205000"},
      %{"name" => "山川乡", "code" => "330523206000"}
    ]

  def next(input) when input == "南湖区" or input == "330402",
    do: [
      %{"name" => "建设街道", "code" => "330402007000"},
      %{"name" => "解放街道", "code" => "330402008000"},
      %{"name" => "新嘉街道", "code" => "330402009000"},
      %{"name" => "南湖街道", "code" => "330402010000"},
      %{"name" => "新兴街道", "code" => "330402011000"},
      %{"name" => "城南街道", "code" => "330402012000"},
      %{"name" => "东栅街道", "code" => "330402013000"},
      %{"name" => "长水街道", "code" => "330402014000"},
      %{"name" => "七星街道", "code" => "330402015000"},
      %{"name" => "凤桥镇", "code" => "330402100000"},
      %{"name" => "余新镇", "code" => "330402101000"},
      %{"name" => "新丰镇", "code" => "330402103000"},
      %{"name" => "大桥镇", "code" => "330402105000"}
    ]

  def next(input) when input == "秀洲区" or input == "330411",
    do: [
      %{"name" => "新城街道", "code" => "330411002000"},
      %{"name" => "嘉北街道", "code" => "330411003000"},
      %{"name" => "塘汇街道", "code" => "330411004000"},
      %{"name" => "高照街道", "code" => "330411005000"},
      %{"name" => "王江泾镇", "code" => "330411101000"},
      %{"name" => "油车港镇", "code" => "330411103000"},
      %{"name" => "新塍镇", "code" => "330411104000"},
      %{"name" => "王店镇", "code" => "330411105000"},
      %{"name" => "洪合镇", "code" => "330411106000"}
    ]

  def next(input) when input == "嘉善县" or input == "330421",
    do: [
      %{"name" => "魏塘街道", "code" => "330421001000"},
      %{"name" => "罗星街道", "code" => "330421002000"},
      %{"name" => "惠民街道", "code" => "330421003000"},
      %{"name" => "大云镇", "code" => "330421102000"},
      %{"name" => "西塘镇", "code" => "330421103000"},
      %{"name" => "干窑镇", "code" => "330421105000"},
      %{"name" => "陶庄镇", "code" => "330421107000"},
      %{"name" => "姚庄镇", "code" => "330421111000"},
      %{"name" => "天凝镇", "code" => "330421112000"}
    ]

  def next(input) when input == "海盐县" or input == "330424",
    do: [
      %{"name" => "武原街道", "code" => "330424001000"},
      %{"name" => "西塘桥街道", "code" => "330424002000"},
      %{"name" => "秦山街道", "code" => "330424004000"},
      %{"name" => "望海街道", "code" => "330424005000"},
      %{"name" => "沈荡镇", "code" => "330424101000"},
      %{"name" => "百步镇", "code" => "330424102000"},
      %{"name" => "于城镇", "code" => "330424103000"},
      %{"name" => "澉浦镇", "code" => "330424105000"},
      %{"name" => "通元镇", "code" => "330424106000"}
    ]

  def next(input) when input == "海宁市" or input == "330481",
    do: [
      %{"name" => "硖石街道", "code" => "330481001000"},
      %{"name" => "海洲街道", "code" => "330481002000"},
      %{"name" => "海昌街道", "code" => "330481003000"},
      %{"name" => "马桥街道", "code" => "330481004000"},
      %{"name" => "许村镇", "code" => "330481101000"},
      %{"name" => "长安镇", "code" => "330481103000"},
      %{"name" => "周王庙镇", "code" => "330481105000"},
      %{"name" => "丁桥镇", "code" => "330481106000"},
      %{"name" => "斜桥镇", "code" => "330481107000"},
      %{"name" => "黄湾镇", "code" => "330481108000"},
      %{"name" => "盐官镇", "code" => "330481110000"},
      %{"name" => "袁花镇", "code" => "330481112000"}
    ]

  def next(input) when input == "平湖市" or input == "330482",
    do: [
      %{"name" => "当湖街道", "code" => "330482001000"},
      %{"name" => "钟埭街道", "code" => "330482002000"},
      %{"name" => "曹桥街道", "code" => "330482003000"},
      %{"name" => "乍浦镇", "code" => "330482101000"},
      %{"name" => "新埭镇", "code" => "330482102000"},
      %{"name" => "新仓镇", "code" => "330482103000"},
      %{"name" => "广陈镇", "code" => "330482106000"},
      %{"name" => "林埭镇", "code" => "330482107000"},
      %{"name" => "独山港镇", "code" => "330482108000"}
    ]

  def next(input) when input == "桐乡市" or input == "330483",
    do: [
      %{"name" => "梧桐街道", "code" => "330483001000"},
      %{"name" => "凤鸣街道", "code" => "330483003000"},
      %{"name" => "高桥街道", "code" => "330483004000"},
      %{"name" => "乌镇镇", "code" => "330483100000"},
      %{"name" => "濮院镇", "code" => "330483101000"},
      %{"name" => "屠甸镇", "code" => "330483102000"},
      %{"name" => "石门镇", "code" => "330483103000"},
      %{"name" => "河山镇", "code" => "330483104000"},
      %{"name" => "洲泉镇", "code" => "330483105000"},
      %{"name" => "大麻镇", "code" => "330483106000"},
      %{"name" => "崇福镇", "code" => "330483107000"}
    ]

  def next(input) when input == "鹿城区" or input == "330302",
    do: [
      %{"name" => "五马街道", "code" => "330302006000"},
      %{"name" => "七都街道", "code" => "330302023000"},
      %{"name" => "滨江街道", "code" => "330302024000"},
      %{"name" => "南汇街道", "code" => "330302025000"},
      %{"name" => "松台街道", "code" => "330302026000"},
      %{"name" => "双屿街道", "code" => "330302027000"},
      %{"name" => "仰义街道", "code" => "330302028000"},
      %{"name" => "大南街道", "code" => "330302029000"},
      %{"name" => "蒲鞋市街道", "code" => "330302030000"},
      %{"name" => "南郊街道", "code" => "330302031000"},
      %{"name" => "广化街道", "code" => "330302032000"},
      %{"name" => "丰门街道", "code" => "330302033000"},
      %{"name" => "藤桥镇", "code" => "330302102000"},
      %{"name" => "山福镇", "code" => "330302105000"}
    ]

  def next(input) when input == "龙湾区" or input == "330303",
    do: [
      %{"name" => "永中街道", "code" => "330303001000"},
      %{"name" => "蒲州街道", "code" => "330303002000"},
      %{"name" => "海滨街道", "code" => "330303003000"},
      %{"name" => "永兴街道", "code" => "330303004000"},
      %{"name" => "状元街道", "code" => "330303006000"},
      %{"name" => "瑶溪街道", "code" => "330303007000"},
      %{"name" => "海城街道", "code" => "330303012000"},
      %{"name" => "沙城街道", "code" => "330303013000"},
      %{"name" => "天河街道", "code" => "330303014000"},
      %{"name" => "星海街道", "code" => "330303015000"}
    ]

  def next(input) when input == "瓯海区" or input == "330304",
    do: [
      %{"name" => "景山街道", "code" => "330304001000"},
      %{"name" => "梧田街道", "code" => "330304002000"},
      %{"name" => "南白象街道", "code" => "330304003000"},
      %{"name" => "茶山街道", "code" => "330304004000"},
      %{"name" => "娄桥街道", "code" => "330304005000"},
      %{"name" => "新桥街道", "code" => "330304006000"},
      %{"name" => "三垟街道", "code" => "330304007000"},
      %{"name" => "瞿溪街道", "code" => "330304008000"},
      %{"name" => "郭溪街道", "code" => "330304009000"},
      %{"name" => "潘桥街道", "code" => "330304010000"},
      %{"name" => "丽岙街道", "code" => "330304011000"},
      %{"name" => "仙岩街道", "code" => "330304012000"},
      %{"name" => "泽雅镇", "code" => "330304108000"}
    ]

  def next(input) when input == "洞头区" or input == "330305",
    do: [
      %{"name" => "北岙街道", "code" => "330305001000"},
      %{"name" => "灵昆街道", "code" => "330305002000"},
      %{"name" => "东屏街道", "code" => "330305003000"},
      %{"name" => "元觉街道", "code" => "330305004000"},
      %{"name" => "霓屿街道", "code" => "330305005000"},
      %{"name" => "昆鹏街道", "code" => "330305006000"},
      %{"name" => "大门镇", "code" => "330305101000"},
      %{"name" => "鹿西乡", "code" => "330305202000"}
    ]

  def next(input) when input == "永嘉县" or input == "330324",
    do: [
      %{"name" => "东城街道", "code" => "330324001000"},
      %{"name" => "北城街道", "code" => "330324002000"},
      %{"name" => "南城街道", "code" => "330324003000"},
      %{"name" => "三江街道", "code" => "330324006000"},
      %{"name" => "黄田街道", "code" => "330324007000"},
      %{"name" => "乌牛街道", "code" => "330324008000"},
      %{"name" => "瓯北街道", "code" => "330324009000"},
      %{"name" => "桥头镇", "code" => "330324102000"},
      %{"name" => "桥下镇", "code" => "330324104000"},
      %{"name" => "大若岩镇", "code" => "330324105000"},
      %{"name" => "碧莲镇", "code" => "330324106000"},
      %{"name" => "巽宅镇", "code" => "330324107000"},
      %{"name" => "岩头镇", "code" => "330324108000"},
      %{"name" => "枫林镇", "code" => "330324109000"},
      %{"name" => "岩坦镇", "code" => "330324110000"},
      %{"name" => "沙头镇", "code" => "330324111000"},
      %{"name" => "鹤盛镇", "code" => "330324112000"},
      %{"name" => "金溪镇", "code" => "330324113000"},
      %{"name" => "云岭乡", "code" => "330324226000"},
      %{"name" => "茗岙乡", "code" => "330324227000"},
      %{"name" => "溪下乡", "code" => "330324228000"},
      %{"name" => "界坑乡", "code" => "330324229000"},
      %{"name" => "县特产场场区", "code" => "330324400000"},
      %{"name" => "四海山林场", "code" => "330324401000"},
      %{"name" => "正江山林场", "code" => "330324402000"}
    ]

  def next(input) when input == "平阳县" or input == "330326",
    do: [
      %{"name" => "昆阳镇", "code" => "330326100000"},
      %{"name" => "鳌江镇", "code" => "330326101000"},
      %{"name" => "水头镇", "code" => "330326102000"},
      %{"name" => "萧江镇", "code" => "330326103000"},
      %{"name" => "腾蛟镇", "code" => "330326105000"},
      %{"name" => "山门镇", "code" => "330326107000"},
      %{"name" => "顺溪镇", "code" => "330326108000"},
      %{"name" => "南雁镇", "code" => "330326109000"},
      %{"name" => "万全镇", "code" => "330326117000"},
      %{"name" => "海西镇", "code" => "330326118000"},
      %{"name" => "南麂镇", "code" => "330326119000"},
      %{"name" => "麻步镇", "code" => "330326120000"},
      %{"name" => "凤卧镇", "code" => "330326121000"},
      %{"name" => "怀溪镇", "code" => "330326122000"},
      %{"name" => "青街畲族乡", "code" => "330326214000"},
      %{"name" => "闹村乡", "code" => "330326217000"},
      %{"name" => "开发区", "code" => "330326401000"}
    ]

  def next(input) when input == "苍南县" or input == "330327",
    do: [
      %{"name" => "灵溪镇", "code" => "330327100000"},
      %{"name" => "宜山镇", "code" => "330327103000"},
      %{"name" => "钱库镇", "code" => "330327104000"},
      %{"name" => "金乡镇", "code" => "330327107000"},
      %{"name" => "藻溪镇", "code" => "330327112000"},
      %{"name" => "桥墩镇", "code" => "330327113000"},
      %{"name" => "矾山镇", "code" => "330327116000"},
      %{"name" => "赤溪镇", "code" => "330327117000"},
      %{"name" => "马站镇", "code" => "330327118000"},
      %{"name" => "望里镇", "code" => "330327122000"},
      %{"name" => "炎亭镇", "code" => "330327123000"},
      %{"name" => "大渔镇", "code" => "330327124000"},
      %{"name" => "莒溪镇", "code" => "330327125000"},
      %{"name" => "南宋镇", "code" => "330327126000"},
      %{"name" => "霞关镇", "code" => "330327127000"},
      %{"name" => "沿浦镇", "code" => "330327128000"},
      %{"name" => "凤阳畲族乡", "code" => "330327216000"},
      %{"name" => "岱岭畲族乡", "code" => "330327218000"}
    ]

  def next(input) when input == "文成县" or input == "330328",
    do: [
      %{"name" => "大峃镇", "code" => "330328100000"},
      %{"name" => "百丈漈镇", "code" => "330328101000"},
      %{"name" => "南田镇", "code" => "330328102000"},
      %{"name" => "西坑畲族镇", "code" => "330328103000"},
      %{"name" => "黄坦镇", "code" => "330328104000"},
      %{"name" => "珊溪镇", "code" => "330328105000"},
      %{"name" => "巨屿镇", "code" => "330328106000"},
      %{"name" => "玉壶镇", "code" => "330328107000"},
      %{"name" => "峃口镇", "code" => "330328108000"},
      %{"name" => "周壤镇", "code" => "330328109000"},
      %{"name" => "铜铃山镇", "code" => "330328110000"},
      %{"name" => "二源镇", "code" => "330328111000"},
      %{"name" => "周山畲族乡", "code" => "330328217000"},
      %{"name" => "桂山乡", "code" => "330328225000"},
      %{"name" => "双桂乡", "code" => "330328226000"},
      %{"name" => "平和乡", "code" => "330328227000"},
      %{"name" => "公阳乡", "code" => "330328228000"}
    ]

  def next(input) when input == "泰顺县" or input == "330329",
    do: [
      %{"name" => "罗阳镇", "code" => "330329100000"},
      %{"name" => "司前畲族镇", "code" => "330329101000"},
      %{"name" => "百丈镇", "code" => "330329102000"},
      %{"name" => "筱村镇", "code" => "330329103000"},
      %{"name" => "泗溪镇", "code" => "330329104000"},
      %{"name" => "彭溪镇", "code" => "330329105000"},
      %{"name" => "雅阳镇", "code" => "330329106000"},
      %{"name" => "仕阳镇", "code" => "330329107000"},
      %{"name" => "三魁镇", "code" => "330329109000"},
      %{"name" => "南浦溪镇", "code" => "330329111000"},
      %{"name" => "龟湖镇", "code" => "330329112000"},
      %{"name" => "西旸镇", "code" => "330329113000"},
      %{"name" => "竹里畲族乡", "code" => "330329204000"},
      %{"name" => "包垟乡", "code" => "330329225000"},
      %{"name" => "凤垟乡", "code" => "330329226000"},
      %{"name" => "东溪乡", "code" => "330329227000"},
      %{"name" => "柳峰乡", "code" => "330329228000"},
      %{"name" => "雪溪乡", "code" => "330329229000"},
      %{"name" => "大安乡", "code" => "330329230000"},
      %{"name" => "乌岩岭自然保护区", "code" => "330329400000"}
    ]

  def next(input) when input == "瑞安市" or input == "330381",
    do: [
      %{"name" => "安阳街道", "code" => "330381001000"},
      %{"name" => "玉海街道", "code" => "330381002000"},
      %{"name" => "锦湖街道", "code" => "330381003000"},
      %{"name" => "东山街道", "code" => "330381004000"},
      %{"name" => "上望街道", "code" => "330381005000"},
      %{"name" => "莘塍街道", "code" => "330381007000"},
      %{"name" => "汀田街道", "code" => "330381008000"},
      %{"name" => "飞云街道", "code" => "330381009000"},
      %{"name" => "仙降街道", "code" => "330381010000"},
      %{"name" => "南滨街道", "code" => "330381011000"},
      %{"name" => "潘岱街道", "code" => "330381012000"},
      %{"name" => "云周街道", "code" => "330381013000"},
      %{"name" => "塘下镇", "code" => "330381101000"},
      %{"name" => "马屿镇", "code" => "330381116000"},
      %{"name" => "陶山镇", "code" => "330381120000"},
      %{"name" => "湖岭镇", "code" => "330381122000"},
      %{"name" => "高楼镇", "code" => "330381125000"},
      %{"name" => "桐浦镇", "code" => "330381126000"},
      %{"name" => "林川镇", "code" => "330381127000"},
      %{"name" => "曹村镇", "code" => "330381128000"},
      %{"name" => "平阳坑镇", "code" => "330381129000"},
      %{"name" => "芳庄乡", "code" => "330381221000"},
      %{"name" => "北麂乡", "code" => "330381222000"}
    ]

  def next(input) when input == "乐清市" or input == "330382",
    do: [
      %{"name" => "城东街道", "code" => "330382001000"},
      %{"name" => "乐成街道", "code" => "330382002000"},
      %{"name" => "城南街道", "code" => "330382003000"},
      %{"name" => "盐盆街道", "code" => "330382004000"},
      %{"name" => "翁垟街道", "code" => "330382005000"},
      %{"name" => "白石街道", "code" => "330382006000"},
      %{"name" => "石帆街道", "code" => "330382007000"},
      %{"name" => "天成街道", "code" => "330382008000"},
      %{"name" => "大荆镇", "code" => "330382101000"},
      %{"name" => "仙溪镇", "code" => "330382102000"},
      %{"name" => "雁荡镇", "code" => "330382104000"},
      %{"name" => "芙蓉镇", "code" => "330382105000"},
      %{"name" => "清江镇", "code" => "330382106000"},
      %{"name" => "虹桥镇", "code" => "330382108000"},
      %{"name" => "淡溪镇", "code" => "330382111000"},
      %{"name" => "柳市镇", "code" => "330382114000"},
      %{"name" => "北白象镇", "code" => "330382115000"},
      %{"name" => "湖雾镇", "code" => "330382121000"},
      %{"name" => "南塘镇", "code" => "330382122000"},
      %{"name" => "南岳镇", "code" => "330382123000"},
      %{"name" => "蒲岐镇", "code" => "330382124000"},
      %{"name" => "磐石镇", "code" => "330382125000"},
      %{"name" => "智仁乡", "code" => "330382210000"},
      %{"name" => "龙西乡", "code" => "330382211000"},
      %{"name" => "岭底乡", "code" => "330382212000"}
    ]

  def next(input) when input == "龙港市" or input == "330383",
    do: [%{"name" => "龙港县直辖村级区划", "code" => "330383198000"}]

  def next(input) when input == "海曙区" or input == "330203",
    do: [
      %{"name" => "南门街道", "code" => "330203001000"},
      %{"name" => "江厦街道", "code" => "330203002000"},
      %{"name" => "西门街道", "code" => "330203003000"},
      %{"name" => "月湖街道", "code" => "330203004000"},
      %{"name" => "鼓楼街道", "code" => "330203005000"},
      %{"name" => "白云街道", "code" => "330203006000"},
      %{"name" => "段塘街道", "code" => "330203007000"},
      %{"name" => "望春街道", "code" => "330203008000"},
      %{"name" => "石碶街道", "code" => "330203009000"},
      %{"name" => "高桥镇", "code" => "330203100000"},
      %{"name" => "横街镇", "code" => "330203101000"},
      %{"name" => "集士港镇", "code" => "330203102000"},
      %{"name" => "古林镇", "code" => "330203103000"},
      %{"name" => "洞桥镇", "code" => "330203104000"},
      %{"name" => "鄞江镇", "code" => "330203105000"},
      %{"name" => "章水镇", "code" => "330203106000"},
      %{"name" => "龙观乡", "code" => "330203200000"}
    ]

  def next(input) when input == "江北区" or input == "330205",
    do: [
      %{"name" => "外滩街道", "code" => "330205001000"},
      %{"name" => "孔浦街道", "code" => "330205003000"},
      %{"name" => "文教街道", "code" => "330205004000"},
      %{"name" => "甬江街道", "code" => "330205005000"},
      %{"name" => "庄桥街道", "code" => "330205006000"},
      %{"name" => "洪塘街道", "code" => "330205007000"},
      %{"name" => "前江街道", "code" => "330205008000"},
      %{"name" => "慈城镇", "code" => "330205103000"}
    ]

  def next(input) when input == "北仑区" or input == "330206",
    do: [
      %{"name" => "大榭街道", "code" => "330206001000"},
      %{"name" => "新碶街道", "code" => "330206002000"},
      %{"name" => "小港街道", "code" => "330206003000"},
      %{"name" => "大碶街道", "code" => "330206004000"},
      %{"name" => "霞浦街道", "code" => "330206005000"},
      %{"name" => "柴桥街道", "code" => "330206006000"},
      %{"name" => "戚家山街道", "code" => "330206007000"},
      %{"name" => "春晓街道", "code" => "330206008000"},
      %{"name" => "梅山街道", "code" => "330206009000"},
      %{"name" => "郭巨街道", "code" => "330206010000"},
      %{"name" => "白峰街道", "code" => "330206011000"},
      %{"name" => "保税区", "code" => "330206401000"}
    ]

  def next(input) when input == "镇海区" or input == "330211",
    do: [
      %{"name" => "招宝山街道", "code" => "330211001000"},
      %{"name" => "蛟川街道", "code" => "330211002000"},
      %{"name" => "骆驼街道", "code" => "330211003000"},
      %{"name" => "庄市街道", "code" => "330211004000"},
      %{"name" => "贵驷街道", "code" => "330211005000"},
      %{"name" => "澥浦镇", "code" => "330211100000"},
      %{"name" => "九龙湖镇", "code" => "330211101000"}
    ]

  def next(input) when input == "鄞州区" or input == "330212",
    do: [
      %{"name" => "下应街道", "code" => "330212001000"},
      %{"name" => "钟公庙街道", "code" => "330212002000"},
      %{"name" => "梅墟街道", "code" => "330212004000"},
      %{"name" => "中河街道", "code" => "330212005000"},
      %{"name" => "首南街道", "code" => "330212006000"},
      %{"name" => "潘火街道", "code" => "330212007000"},
      %{"name" => "百丈街道", "code" => "330212008000"},
      %{"name" => "东胜街道", "code" => "330212009000"},
      %{"name" => "明楼街道", "code" => "330212010000"},
      %{"name" => "白鹤街道", "code" => "330212011000"},
      %{"name" => "东柳街道", "code" => "330212012000"},
      %{"name" => "东郊街道", "code" => "330212013000"},
      %{"name" => "福明街道", "code" => "330212014000"},
      %{"name" => "新明街道", "code" => "330212015000"},
      %{"name" => "聚贤街道", "code" => "330212016000"},
      %{"name" => "瞻岐镇", "code" => "330212100000"},
      %{"name" => "咸祥镇", "code" => "330212101000"},
      %{"name" => "塘溪镇", "code" => "330212102000"},
      %{"name" => "东钱湖镇", "code" => "330212103000"},
      %{"name" => "东吴镇", "code" => "330212104000"},
      %{"name" => "五乡镇", "code" => "330212105000"},
      %{"name" => "邱隘镇", "code" => "330212106000"},
      %{"name" => "云龙镇", "code" => "330212108000"},
      %{"name" => "横溪镇", "code" => "330212109000"},
      %{"name" => "姜山镇", "code" => "330212110000"}
    ]

  def next(input) when input == "奉化区" or input == "330213",
    do: [
      %{"name" => "锦屏街道", "code" => "330213001000"},
      %{"name" => "岳林街道", "code" => "330213002000"},
      %{"name" => "江口街道", "code" => "330213003000"},
      %{"name" => "西坞街道", "code" => "330213004000"},
      %{"name" => "萧王庙街道", "code" => "330213005000"},
      %{"name" => "方桥街道", "code" => "330213006000"},
      %{"name" => "尚田街道", "code" => "330213007000"},
      %{"name" => "莼湖街道", "code" => "330213008000"},
      %{"name" => "溪口镇", "code" => "330213100000"},
      %{"name" => "裘村镇", "code" => "330213106000"},
      %{"name" => "大堰镇", "code" => "330213107000"},
      %{"name" => "松岙镇", "code" => "330213108000"}
    ]

  def next(input) when input == "象山县" or input == "330225",
    do: [
      %{"name" => "丹东街道", "code" => "330225001000"},
      %{"name" => "丹西街道", "code" => "330225002000"},
      %{"name" => "爵溪街道", "code" => "330225003000"},
      %{"name" => "石浦镇", "code" => "330225101000"},
      %{"name" => "西周镇", "code" => "330225102000"},
      %{"name" => "鹤浦镇", "code" => "330225103000"},
      %{"name" => "贤庠镇", "code" => "330225104000"},
      %{"name" => "墙头镇", "code" => "330225105000"},
      %{"name" => "泗洲头镇", "code" => "330225106000"},
      %{"name" => "定塘镇", "code" => "330225107000"},
      %{"name" => "涂茨镇", "code" => "330225108000"},
      %{"name" => "大徐镇", "code" => "330225109000"},
      %{"name" => "新桥镇", "code" => "330225110000"},
      %{"name" => "东陈乡", "code" => "330225200000"},
      %{"name" => "晓塘乡", "code" => "330225201000"},
      %{"name" => "黄避岙乡", "code" => "330225202000"},
      %{"name" => "茅洋乡", "code" => "330225203000"},
      %{"name" => "高塘岛乡", "code" => "330225204000"}
    ]

  def next(input) when input == "宁海县" or input == "330226",
    do: [
      %{"name" => "跃龙街道", "code" => "330226001000"},
      %{"name" => "桃源街道", "code" => "330226002000"},
      %{"name" => "梅林街道", "code" => "330226003000"},
      %{"name" => "桥头胡街道", "code" => "330226004000"},
      %{"name" => "长街镇", "code" => "330226101000"},
      %{"name" => "力洋镇", "code" => "330226102000"},
      %{"name" => "一市镇", "code" => "330226104000"},
      %{"name" => "岔路镇", "code" => "330226105000"},
      %{"name" => "前童镇", "code" => "330226106000"},
      %{"name" => "桑洲镇", "code" => "330226107000"},
      %{"name" => "黄坛镇", "code" => "330226108000"},
      %{"name" => "大佳何镇", "code" => "330226109000"},
      %{"name" => "强蛟镇", "code" => "330226110000"},
      %{"name" => "西店镇", "code" => "330226111000"},
      %{"name" => "深甽镇", "code" => "330226112000"},
      %{"name" => "胡陈乡", "code" => "330226200000"},
      %{"name" => "茶院乡", "code" => "330226201000"},
      %{"name" => "越溪乡", "code" => "330226202000"}
    ]

  def next(input) when input == "余姚市" or input == "330281",
    do: [
      %{"name" => "梨洲街道", "code" => "330281001000"},
      %{"name" => "凤山街道", "code" => "330281002000"},
      %{"name" => "兰江街道", "code" => "330281003000"},
      %{"name" => "阳明街道", "code" => "330281004000"},
      %{"name" => "低塘街道", "code" => "330281005000"},
      %{"name" => "朗霞街道", "code" => "330281006000"},
      %{"name" => "临山镇", "code" => "330281100000"},
      %{"name" => "黄家埠镇", "code" => "330281101000"},
      %{"name" => "小曹娥镇", "code" => "330281102000"},
      %{"name" => "泗门镇", "code" => "330281103000"},
      %{"name" => "马渚镇", "code" => "330281106000"},
      %{"name" => "牟山镇", "code" => "330281108000"},
      %{"name" => "丈亭镇", "code" => "330281109000"},
      %{"name" => "三七市镇", "code" => "330281110000"},
      %{"name" => "河姆渡镇", "code" => "330281111000"},
      %{"name" => "大隐镇", "code" => "330281112000"},
      %{"name" => "陆埠镇", "code" => "330281113000"},
      %{"name" => "梁弄镇", "code" => "330281114000"},
      %{"name" => "大岚镇", "code" => "330281115000"},
      %{"name" => "四明山镇", "code" => "330281116000"},
      %{"name" => "鹿亭乡", "code" => "330281201000"}
    ]

  def next(input) when input == "慈溪市" or input == "330282",
    do: [
      %{"name" => "宗汉街道", "code" => "330282002000"},
      %{"name" => "坎墩街道", "code" => "330282003000"},
      %{"name" => "浒山街道", "code" => "330282004000"},
      %{"name" => "白沙路街道", "code" => "330282005000"},
      %{"name" => "古塘街道", "code" => "330282006000"},
      %{"name" => "掌起镇", "code" => "330282104000"},
      %{"name" => "观海卫镇", "code" => "330282107000"},
      %{"name" => "附海镇", "code" => "330282108000"},
      %{"name" => "桥头镇", "code" => "330282109000"},
      %{"name" => "匡堰镇", "code" => "330282110000"},
      %{"name" => "逍林镇", "code" => "330282111000"},
      %{"name" => "新浦镇", "code" => "330282112000"},
      %{"name" => "胜山镇", "code" => "330282113000"},
      %{"name" => "横河镇", "code" => "330282114000"},
      %{"name" => "崇寿镇", "code" => "330282116000"},
      %{"name" => "庵东镇", "code" => "330282118000"},
      %{"name" => "长河镇", "code" => "330282120000"},
      %{"name" => "周巷镇", "code" => "330282121000"},
      %{"name" => "龙山镇", "code" => "330282123000"},
      %{"name" => "滨海经济开发区", "code" => "330282402000"},
      %{"name" => "高新技术产业园区", "code" => "330282403000"},
      %{"name" => "环杭州湾创新中心", "code" => "330282404000"},
      %{"name" => "现代农业开发区", "code" => "330282405000"},
      %{"name" => "长三角商贸园区", "code" => "330282406000"}
    ]

  def next(input) when input == "上城区" or input == "330102",
    do: [
      %{"name" => "清波街道", "code" => "330102001000"},
      %{"name" => "湖滨街道", "code" => "330102003000"},
      %{"name" => "小营街道", "code" => "330102004000"},
      %{"name" => "南星街道", "code" => "330102008000"},
      %{"name" => "紫阳街道", "code" => "330102009000"},
      %{"name" => "望江街道", "code" => "330102010000"},
      %{"name" => "凯旋街道", "code" => "330102011000"},
      %{"name" => "采荷街道", "code" => "330102012000"},
      %{"name" => "闸弄口街道", "code" => "330102013000"},
      %{"name" => "四季青街道", "code" => "330102014000"},
      %{"name" => "彭埠街道", "code" => "330102015000"},
      %{"name" => "笕桥街道", "code" => "330102016000"},
      %{"name" => "丁兰街道", "code" => "330102017000"},
      %{"name" => "九堡街道", "code" => "330102018000"}
    ]

  def next(input) when input == "拱墅区" or input == "330105",
    do: [
      %{"name" => "米市巷街道", "code" => "330105001000"},
      %{"name" => "湖墅街道", "code" => "330105002000"},
      %{"name" => "小河街道", "code" => "330105003000"},
      %{"name" => "和睦街道", "code" => "330105004000"},
      %{"name" => "拱宸桥街道", "code" => "330105005000"},
      %{"name" => "大关街道", "code" => "330105007000"},
      %{"name" => "上塘街道", "code" => "330105008000"},
      %{"name" => "祥符街道", "code" => "330105009000"},
      %{"name" => "康桥街道", "code" => "330105010000"},
      %{"name" => "半山街道", "code" => "330105011000"},
      %{"name" => "天水街道", "code" => "330105012000"},
      %{"name" => "武林街道", "code" => "330105013000"},
      %{"name" => "长庆街道", "code" => "330105014000"},
      %{"name" => "潮鸣街道", "code" => "330105015000"},
      %{"name" => "朝晖街道", "code" => "330105016000"},
      %{"name" => "文晖街道", "code" => "330105017000"},
      %{"name" => "东新街道", "code" => "330105018000"},
      %{"name" => "石桥街道", "code" => "330105019000"}
    ]

  def next(input) when input == "西湖区" or input == "330106",
    do: [
      %{"name" => "北山街道", "code" => "330106002000"},
      %{"name" => "西溪街道", "code" => "330106004000"},
      %{"name" => "翠苑街道", "code" => "330106005000"},
      %{"name" => "古荡街道", "code" => "330106007000"},
      %{"name" => "西湖街道", "code" => "330106008000"},
      %{"name" => "留下街道", "code" => "330106009000"},
      %{"name" => "转塘街道", "code" => "330106010000"},
      %{"name" => "蒋村街道", "code" => "330106011000"},
      %{"name" => "灵隐街道", "code" => "330106012000"},
      %{"name" => "文新街道", "code" => "330106013000"},
      %{"name" => "三墩镇", "code" => "330106109000"},
      %{"name" => "双浦镇", "code" => "330106110000"}
    ]

  def next(input) when input == "滨江区" or input == "330108",
    do: [
      %{"name" => "西兴街道", "code" => "330108001000"},
      %{"name" => "长河街道", "code" => "330108002000"},
      %{"name" => "浦沿街道", "code" => "330108003000"}
    ]

  def next(input) when input == "萧山区" or input == "330109",
    do: [
      %{"name" => "城厢街道", "code" => "330109001000"},
      %{"name" => "北干街道", "code" => "330109002000"},
      %{"name" => "蜀山街道", "code" => "330109003000"},
      %{"name" => "新塘街道", "code" => "330109004000"},
      %{"name" => "靖江街道", "code" => "330109005000"},
      %{"name" => "南阳街道", "code" => "330109006000"},
      %{"name" => "闻堰街道", "code" => "330109012000"},
      %{"name" => "宁围街道", "code" => "330109013000"},
      %{"name" => "新街街道", "code" => "330109014000"},
      %{"name" => "盈丰街道", "code" => "330109015000"},
      %{"name" => "楼塔镇", "code" => "330109100000"},
      %{"name" => "河上镇", "code" => "330109101000"},
      %{"name" => "戴村镇", "code" => "330109102000"},
      %{"name" => "浦阳镇", "code" => "330109103000"},
      %{"name" => "进化镇", "code" => "330109104000"},
      %{"name" => "临浦镇", "code" => "330109105000"},
      %{"name" => "义桥镇", "code" => "330109106000"},
      %{"name" => "所前镇", "code" => "330109107000"},
      %{"name" => "衙前镇", "code" => "330109108000"},
      %{"name" => "瓜沥镇", "code" => "330109113000"},
      %{"name" => "益农镇", "code" => "330109115000"},
      %{"name" => "党湾镇", "code" => "330109120000"},
      %{"name" => "萧山经济技术开发区", "code" => "330109401000"},
      %{"name" => "萧山商业城", "code" => "330109403000"},
      %{"name" => "围垦区", "code" => "330109501000"},
      %{"name" => "红山农场", "code" => "330109503000"},
      %{"name" => "萧山钱江世纪城", "code" => "330109505000"}
    ]

  def next(input) when input == "余杭区" or input == "330110",
    do: [
      %{"name" => "五常街道", "code" => "330110005000"},
      %{"name" => "仁和街道", "code" => "330110009000"},
      %{"name" => "良渚街道", "code" => "330110010000"},
      %{"name" => "闲林街道", "code" => "330110011000"},
      %{"name" => "仓前街道", "code" => "330110012000"},
      %{"name" => "余杭街道", "code" => "330110013000"},
      %{"name" => "中泰街道", "code" => "330110014000"},
      %{"name" => "径山镇", "code" => "330110109000"},
      %{"name" => "瓶窑镇", "code" => "330110110000"},
      %{"name" => "鸬鸟镇", "code" => "330110111000"},
      %{"name" => "百丈镇", "code" => "330110112000"},
      %{"name" => "黄湖镇", "code" => "330110113000"}
    ]

  def next(input) when input == "富阳区" or input == "330111",
    do: [
      %{"name" => "富春街道", "code" => "330111001000"},
      %{"name" => "春江街道", "code" => "330111002000"},
      %{"name" => "鹿山街道", "code" => "330111004000"},
      %{"name" => "东洲街道", "code" => "330111005000"},
      %{"name" => "银湖街道", "code" => "330111006000"},
      %{"name" => "万市镇", "code" => "330111100000"},
      %{"name" => "洞桥镇", "code" => "330111101000"},
      %{"name" => "渌渚镇", "code" => "330111103000"},
      %{"name" => "永昌镇", "code" => "330111105000"},
      %{"name" => "里山镇", "code" => "330111108000"},
      %{"name" => "常绿镇", "code" => "330111109000"},
      %{"name" => "场口镇", "code" => "330111110000"},
      %{"name" => "常安镇", "code" => "330111111000"},
      %{"name" => "龙门镇", "code" => "330111112000"},
      %{"name" => "新登镇", "code" => "330111115000"},
      %{"name" => "胥口镇", "code" => "330111116000"},
      %{"name" => "大源镇", "code" => "330111117000"},
      %{"name" => "灵桥镇", "code" => "330111118000"},
      %{"name" => "新桐乡", "code" => "330111200000"},
      %{"name" => "上官乡", "code" => "330111201000"},
      %{"name" => "环山乡", "code" => "330111204000"},
      %{"name" => "湖源乡", "code" => "330111205000"},
      %{"name" => "春建乡", "code" => "330111206000"},
      %{"name" => "渔山乡", "code" => "330111207000"}
    ]

  def next(input) when input == "临安区" or input == "330112",
    do: [
      %{"name" => "玲珑街道", "code" => "330112002000"},
      %{"name" => "锦南街道", "code" => "330112005000"},
      %{"name" => "锦城街道", "code" => "330112006000"},
      %{"name" => "锦北街道", "code" => "330112007000"},
      %{"name" => "青山湖街道", "code" => "330112008000"},
      %{"name" => "高虹镇", "code" => "330112102000"},
      %{"name" => "太湖源镇", "code" => "330112103000"},
      %{"name" => "於潜镇", "code" => "330112104000"},
      %{"name" => "太阳镇", "code" => "330112106000"},
      %{"name" => "潜川镇", "code" => "330112107000"},
      %{"name" => "昌化镇", "code" => "330112108000"},
      %{"name" => "河桥镇", "code" => "330112109000"},
      %{"name" => "湍口镇", "code" => "330112111000"},
      %{"name" => "清凉峰镇", "code" => "330112112000"},
      %{"name" => "岛石镇", "code" => "330112113000"},
      %{"name" => "板桥镇", "code" => "330112115000"},
      %{"name" => "天目山镇", "code" => "330112116000"},
      %{"name" => "龙岗镇", "code" => "330112117000"}
    ]

  def next(input) when input == "临平区" or input == "330113",
    do: [
      %{"name" => "临平街道", "code" => "330113001000"},
      %{"name" => "南苑街道", "code" => "330113002000"},
      %{"name" => "东湖街道", "code" => "330113003000"},
      %{"name" => "星桥街道", "code" => "330113004000"},
      %{"name" => "乔司街道", "code" => "330113005000"},
      %{"name" => "运河街道", "code" => "330113006000"},
      %{"name" => "崇贤街道", "code" => "330113007000"},
      %{"name" => "塘栖镇", "code" => "330113100000"}
    ]

  def next(input) when input == "钱塘区" or input == "330114",
    do: [
      %{"name" => "下沙街道", "code" => "330114001000"},
      %{"name" => "白杨街道", "code" => "330114002000"},
      %{"name" => "河庄街道", "code" => "330114003000"},
      %{"name" => "义蓬街道", "code" => "330114004000"},
      %{"name" => "新湾街道", "code" => "330114005000"},
      %{"name" => "临江街道", "code" => "330114006000"},
      %{"name" => "前进街道", "code" => "330114007000"}
    ]

  def next(input) when input == "桐庐县" or input == "330122",
    do: [
      %{"name" => "旧县街道", "code" => "330122002000"},
      %{"name" => "桐君街道", "code" => "330122003000"},
      %{"name" => "城南街道", "code" => "330122004000"},
      %{"name" => "凤川街道", "code" => "330122005000"},
      %{"name" => "富春江镇", "code" => "330122101000"},
      %{"name" => "横村镇", "code" => "330122102000"},
      %{"name" => "分水镇", "code" => "330122109000"},
      %{"name" => "瑶琳镇", "code" => "330122110000"},
      %{"name" => "百江镇", "code" => "330122112000"},
      %{"name" => "江南镇", "code" => "330122113000"},
      %{"name" => "莪山畲族乡", "code" => "330122201000"},
      %{"name" => "钟山乡", "code" => "330122202000"},
      %{"name" => "新合乡", "code" => "330122204000"},
      %{"name" => "合村乡", "code" => "330122210000"}
    ]

  def next(input) when input == "淳安县" or input == "330127",
    do: [
      %{"name" => "千岛湖镇", "code" => "330127100000"},
      %{"name" => "文昌镇", "code" => "330127101000"},
      %{"name" => "石林镇", "code" => "330127102000"},
      %{"name" => "临岐镇", "code" => "330127103000"},
      %{"name" => "威坪镇", "code" => "330127104000"},
      %{"name" => "姜家镇", "code" => "330127106000"},
      %{"name" => "梓桐镇", "code" => "330127107000"},
      %{"name" => "汾口镇", "code" => "330127108000"},
      %{"name" => "中洲镇", "code" => "330127109000"},
      %{"name" => "大墅镇", "code" => "330127110000"},
      %{"name" => "枫树岭镇", "code" => "330127111000"},
      %{"name" => "里商乡", "code" => "330127200000"},
      %{"name" => "金峰乡", "code" => "330127201000"},
      %{"name" => "富文乡", "code" => "330127202000"},
      %{"name" => "左口乡", "code" => "330127203000"},
      %{"name" => "屏门乡", "code" => "330127205000"},
      %{"name" => "瑶山乡", "code" => "330127206000"},
      %{"name" => "王阜乡", "code" => "330127208000"},
      %{"name" => "宋村乡", "code" => "330127210000"},
      %{"name" => "鸠坑乡", "code" => "330127211000"},
      %{"name" => "浪川乡", "code" => "330127212000"},
      %{"name" => "界首乡", "code" => "330127214000"},
      %{"name" => "安阳乡", "code" => "330127216000"}
    ]

  def next(input) when input == "建德市" or input == "330182",
    do: [
      %{"name" => "新安江街道", "code" => "330182001000"},
      %{"name" => "洋溪街道", "code" => "330182002000"},
      %{"name" => "更楼街道", "code" => "330182003000"},
      %{"name" => "莲花镇", "code" => "330182101000"},
      %{"name" => "乾潭镇", "code" => "330182102000"},
      %{"name" => "梅城镇", "code" => "330182104000"},
      %{"name" => "杨村桥镇", "code" => "330182105000"},
      %{"name" => "下涯镇", "code" => "330182106000"},
      %{"name" => "大洋镇", "code" => "330182107000"},
      %{"name" => "三都镇", "code" => "330182108000"},
      %{"name" => "寿昌镇", "code" => "330182109000"},
      %{"name" => "航头镇", "code" => "330182110000"},
      %{"name" => "大慈岩镇", "code" => "330182111000"},
      %{"name" => "大同镇", "code" => "330182112000"},
      %{"name" => "李家镇", "code" => "330182113000"},
      %{"name" => "钦堂乡", "code" => "330182202000"}
    ]

  def next(_), do: nil
end