defmodule ChinaAdminDivisions.Gen.Lv3x.M34 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "宣州区" or input == "341802",
    do: [
      %{"name" => "西林街道", "code" => "341802001"},
      %{"name" => "澄江街道", "code" => "341802002"},
      %{"name" => "鳌峰街道", "code" => "341802003"},
      %{"name" => "济川街道", "code" => "341802004"},
      %{"name" => "敬亭山街道", "code" => "341802005"},
      %{"name" => "双桥街道", "code" => "341802006"},
      %{"name" => "向阳街道", "code" => "341802009"},
      %{"name" => "水阳镇", "code" => "341802100"},
      %{"name" => "狸桥镇", "code" => "341802101"},
      %{"name" => "沈村镇", "code" => "341802102"},
      %{"name" => "古泉镇", "code" => "341802103"},
      %{"name" => "洪林镇", "code" => "341802104"},
      %{"name" => "寒亭镇", "code" => "341802105"},
      %{"name" => "文昌镇", "code" => "341802106"},
      %{"name" => "孙埠镇", "code" => "341802107"},
      %{"name" => "杨柳镇", "code" => "341802109"},
      %{"name" => "水东镇", "code" => "341802110"},
      %{"name" => "新田镇", "code" => "341802111"},
      %{"name" => "周王镇", "code" => "341802112"},
      %{"name" => "溪口镇", "code" => "341802113"},
      %{"name" => "朱桥乡", "code" => "341802200"},
      %{"name" => "养贤乡", "code" => "341802201"},
      %{"name" => "五星乡", "code" => "341802202"},
      %{"name" => "黄渡乡", "code" => "341802204"}
    ]

  def next(input) when input == "郎溪县" or input == "341821",
    do: [
      %{"name" => "郎步街道", "code" => "341821001"},
      %{"name" => "郎川街道", "code" => "341821002"},
      %{"name" => "钟桥街道", "code" => "341821003"},
      %{"name" => "建平镇", "code" => "341821100"},
      %{"name" => "十字镇", "code" => "341821101"},
      %{"name" => "新发镇", "code" => "341821102"},
      %{"name" => "涛城镇", "code" => "341821103"},
      %{"name" => "梅渚镇", "code" => "341821105"},
      %{"name" => "毕桥镇", "code" => "341821107"},
      %{"name" => "飞鲤镇", "code" => "341821108"},
      %{"name" => "凌笪镇", "code" => "341821109"},
      %{"name" => "姚村镇", "code" => "341821110"},
      %{"name" => "郎溪经济开发区", "code" => "341821400"},
      %{"name" => "安徽省国营十字铺茶场", "code" => "341821500"},
      %{"name" => "上海市白茅岭监狱", "code" => "341821501"}
    ]

  def next(input) when input == "泾县" or input == "341823",
    do: [
      %{"name" => "泾川镇", "code" => "341823100"},
      %{"name" => "茂林镇", "code" => "341823101"},
      %{"name" => "榔桥镇", "code" => "341823102"},
      %{"name" => "桃花潭镇", "code" => "341823103"},
      %{"name" => "琴溪镇", "code" => "341823104"},
      %{"name" => "蔡村镇", "code" => "341823105"},
      %{"name" => "云岭镇", "code" => "341823106"},
      %{"name" => "黄村镇", "code" => "341823107"},
      %{"name" => "丁家桥镇", "code" => "341823108"},
      %{"name" => "汀溪乡", "code" => "341823200"},
      %{"name" => "昌桥乡", "code" => "341823201"}
    ]

  def next(input) when input == "绩溪县" or input == "341824",
    do: [
      %{"name" => "华阳镇", "code" => "341824100"},
      %{"name" => "临溪镇", "code" => "341824101"},
      %{"name" => "长安镇", "code" => "341824102"},
      %{"name" => "上庄镇", "code" => "341824103"},
      %{"name" => "扬溪镇", "code" => "341824104"},
      %{"name" => "伏岭镇", "code" => "341824105"},
      %{"name" => "金沙镇", "code" => "341824106"},
      %{"name" => "瀛洲镇", "code" => "341824107"},
      %{"name" => "板桥头乡", "code" => "341824201"},
      %{"name" => "家朋乡", "code" => "341824202"},
      %{"name" => "荆州乡", "code" => "341824203"},
      %{"name" => "安徽绩溪经济开发区", "code" => "341824400"}
    ]

  def next(input) when input == "旌德县" or input == "341825",
    do: [
      %{"name" => "旌阳镇", "code" => "341825100"},
      %{"name" => "蔡家桥镇", "code" => "341825101"},
      %{"name" => "三溪镇", "code" => "341825102"},
      %{"name" => "庙首镇", "code" => "341825103"},
      %{"name" => "白地镇", "code" => "341825104"},
      %{"name" => "俞村镇", "code" => "341825105"},
      %{"name" => "兴隆镇", "code" => "341825106"},
      %{"name" => "孙村镇", "code" => "341825107"},
      %{"name" => "版书镇", "code" => "341825108"},
      %{"name" => "云乐镇", "code" => "341825109"}
    ]

  def next(input) when input == "宣城市经济开发区" or input == "341871",
    do: [
      %{"name" => "天湖街道", "code" => "341871001"},
      %{"name" => "飞彩街道", "code" => "341871002"},
      %{"name" => "金坝街道", "code" => "341871003"}
    ]

  def next(input) when input == "宁国市" or input == "341881",
    do: [
      %{"name" => "西津街道", "code" => "341881001"},
      %{"name" => "南山街道", "code" => "341881002"},
      %{"name" => "河沥溪街道", "code" => "341881003"},
      %{"name" => "汪溪街道", "code" => "341881004"},
      %{"name" => "竹峰街道", "code" => "341881005"},
      %{"name" => "港口镇", "code" => "341881100"},
      %{"name" => "梅林镇", "code" => "341881101"},
      %{"name" => "中溪镇", "code" => "341881102"},
      %{"name" => "宁墩镇", "code" => "341881103"},
      %{"name" => "仙霞镇", "code" => "341881104"},
      %{"name" => "甲路镇", "code" => "341881105"},
      %{"name" => "胡乐镇", "code" => "341881106"},
      %{"name" => "霞西镇", "code" => "341881107"},
      %{"name" => "云梯畲族乡", "code" => "341881200"},
      %{"name" => "南极乡", "code" => "341881201"},
      %{"name" => "万家乡", "code" => "341881202"},
      %{"name" => "青龙乡", "code" => "341881203"},
      %{"name" => "方塘乡", "code" => "341881204"},
      %{"name" => "经济技术开发区", "code" => "341881400"}
    ]

  def next(input) when input == "广德市" or input == "341882",
    do: [
      %{"name" => "桐汭街道", "code" => "341882001"},
      %{"name" => "祠山街道", "code" => "341882002"},
      %{"name" => "升平街道", "code" => "341882003"},
      %{"name" => "桃州镇", "code" => "341882100"},
      %{"name" => "柏垫镇", "code" => "341882101"},
      %{"name" => "誓节镇", "code" => "341882102"},
      %{"name" => "邱村镇", "code" => "341882103"},
      %{"name" => "新杭镇", "code" => "341882104"},
      %{"name" => "杨滩镇", "code" => "341882105"},
      %{"name" => "卢村乡", "code" => "341882200"},
      %{"name" => "东亭乡", "code" => "341882201"},
      %{"name" => "四合乡", "code" => "341882202"},
      %{"name" => "广德经济开发区", "code" => "341882400"}
    ]

  def next(input) when input == "贵池区" or input == "341702",
    do: [
      %{"name" => "池阳街道", "code" => "341702001"},
      %{"name" => "秋浦街道", "code" => "341702002"},
      %{"name" => "里山街道", "code" => "341702003"},
      %{"name" => "江口街道", "code" => "341702004"},
      %{"name" => "马衙街道", "code" => "341702005"},
      %{"name" => "墩上街道", "code" => "341702006"},
      %{"name" => "梅龙街道", "code" => "341702007"},
      %{"name" => "秋江街道", "code" => "341702008"},
      %{"name" => "杏花村街道", "code" => "341702009"},
      %{"name" => "清风街道", "code" => "341702010"},
      %{"name" => "清溪街道", "code" => "341702011"},
      %{"name" => "殷汇镇", "code" => "341702100"},
      %{"name" => "牛头山镇", "code" => "341702101"},
      %{"name" => "涓桥镇", "code" => "341702102"},
      %{"name" => "梅街镇", "code" => "341702103"},
      %{"name" => "梅村镇", "code" => "341702104"},
      %{"name" => "唐田镇", "code" => "341702105"},
      %{"name" => "牌楼镇", "code" => "341702106"},
      %{"name" => "乌沙镇", "code" => "341702107"},
      %{"name" => "棠溪镇", "code" => "341702108"},
      %{"name" => "安徽池州高新技术产业开发区", "code" => "341702400"},
      %{"name" => "池州经济技术开发区", "code" => "341702401"},
      %{"name" => "平天湖风景区", "code" => "341702402"},
      %{"name" => "皖江江南新兴产业集中区", "code" => "341702404"},
      %{"name" => "池州承接产业转移集中示范园区", "code" => "341702405"},
      %{"name" => "池州市杏花村文化旅游区", "code" => "341702406"}
    ]

  def next(input) when input == "东至县" or input == "341721",
    do: [
      %{"name" => "尧渡镇", "code" => "341721100"},
      %{"name" => "东流镇", "code" => "341721101"},
      %{"name" => "大渡口镇", "code" => "341721102"},
      %{"name" => "胜利镇", "code" => "341721103"},
      %{"name" => "张溪镇", "code" => "341721104"},
      %{"name" => "洋湖镇", "code" => "341721105"},
      %{"name" => "葛公镇", "code" => "341721106"},
      %{"name" => "香隅镇", "code" => "341721107"},
      %{"name" => "官港镇", "code" => "341721108"},
      %{"name" => "昭潭镇", "code" => "341721109"},
      %{"name" => "龙泉镇", "code" => "341721110"},
      %{"name" => "泥溪镇", "code" => "341721111"},
      %{"name" => "花园乡", "code" => "341721200"},
      %{"name" => "木塔乡", "code" => "341721201"},
      %{"name" => "青山乡", "code" => "341721202"},
      %{"name" => "东至经济开发区", "code" => "341721400"},
      %{"name" => "大渡口经济开发区", "code" => "341721401"}
    ]

  def next(input) when input == "石台县" or input == "341722",
    do: [
      %{"name" => "仁里镇", "code" => "341722100"},
      %{"name" => "七都镇", "code" => "341722101"},
      %{"name" => "仙寓镇", "code" => "341722102"},
      %{"name" => "丁香镇", "code" => "341722103"},
      %{"name" => "小河镇", "code" => "341722104"},
      %{"name" => "横渡镇", "code" => "341722105"},
      %{"name" => "大演乡", "code" => "341722200"},
      %{"name" => "矶滩乡", "code" => "341722201"},
      %{"name" => "池州经济技术开发区石台工业园区", "code" => "341722401"}
    ]

  def next(input) when input == "青阳县" or input == "341723",
    do: [
      %{"name" => "蓉城镇", "code" => "341723100"},
      %{"name" => "木镇镇", "code" => "341723101"},
      %{"name" => "庙前镇", "code" => "341723102"},
      %{"name" => "陵阳镇", "code" => "341723103"},
      %{"name" => "新河镇", "code" => "341723104"},
      %{"name" => "丁桥镇", "code" => "341723105"},
      %{"name" => "朱备镇", "code" => "341723106"},
      %{"name" => "杨田镇", "code" => "341723107"},
      %{"name" => "九华镇", "code" => "341723108"},
      %{"name" => "酉华镇", "code" => "341723109"},
      %{"name" => "乔木乡", "code" => "341723200"},
      %{"name" => "杜村乡", "code" => "341723202"},
      %{"name" => "九华乡", "code" => "341723203"},
      %{"name" => "青阳县开发区", "code" => "341723400"}
    ]

  def next(input) when input == "谯城区" or input == "341602",
    do: [
      %{"name" => "花戏楼街道", "code" => "341602001"},
      %{"name" => "薛阁街道", "code" => "341602002"},
      %{"name" => "汤陵街道", "code" => "341602003"},
      %{"name" => "古井镇", "code" => "341602100"},
      %{"name" => "芦庙镇", "code" => "341602101"},
      %{"name" => "华佗镇", "code" => "341602102"},
      %{"name" => "魏岗镇", "code" => "341602103"},
      %{"name" => "牛集镇", "code" => "341602104"},
      %{"name" => "颜集镇", "code" => "341602105"},
      %{"name" => "五马镇", "code" => "341602106"},
      %{"name" => "十八里镇", "code" => "341602107"},
      %{"name" => "谯东镇", "code" => "341602108"},
      %{"name" => "十九里镇", "code" => "341602109"},
      %{"name" => "沙土镇", "code" => "341602110"},
      %{"name" => "观堂镇", "code" => "341602111"},
      %{"name" => "大杨镇", "code" => "341602112"},
      %{"name" => "城父镇", "code" => "341602113"},
      %{"name" => "十河镇", "code" => "341602114"},
      %{"name" => "双沟镇", "code" => "341602115"},
      %{"name" => "淝河镇", "code" => "341602116"},
      %{"name" => "古城镇", "code" => "341602117"},
      %{"name" => "龙扬镇", "code" => "341602118"},
      %{"name" => "立德镇", "code" => "341602119"},
      %{"name" => "张店乡", "code" => "341602200"},
      %{"name" => "赵桥乡", "code" => "341602201"},
      %{"name" => "亳州高新技术产业开发区", "code" => "341602400"},
      %{"name" => "谯城经济开发区", "code" => "341602401"},
      %{"name" => "亳州芜湖现代产业园区", "code" => "341602403"}
    ]

  def next(input) when input == "涡阳县" or input == "341621",
    do: [
      %{"name" => "城关街道", "code" => "341621001"},
      %{"name" => "星园街道", "code" => "341621003"},
      %{"name" => "天静宫街道", "code" => "341621004"},
      %{"name" => "西阳镇", "code" => "341621103"},
      %{"name" => "涡南镇", "code" => "341621104"},
      %{"name" => "楚店镇", "code" => "341621105"},
      %{"name" => "高公镇", "code" => "341621106"},
      %{"name" => "高炉镇", "code" => "341621108"},
      %{"name" => "曹市镇", "code" => "341621109"},
      %{"name" => "青疃镇", "code" => "341621110"},
      %{"name" => "石弓镇", "code" => "341621111"},
      %{"name" => "龙山镇", "code" => "341621112"},
      %{"name" => "义门镇", "code" => "341621113"},
      %{"name" => "新兴镇", "code" => "341621114"},
      %{"name" => "临湖镇", "code" => "341621115"},
      %{"name" => "丹城镇", "code" => "341621116"},
      %{"name" => "马店集镇", "code" => "341621117"},
      %{"name" => "花沟镇", "code" => "341621118"},
      %{"name" => "店集镇", "code" => "341621119"},
      %{"name" => "陈大镇", "code" => "341621120"},
      %{"name" => "牌坊镇", "code" => "341621121"},
      %{"name" => "公吉寺镇", "code" => "341621122"},
      %{"name" => "标里镇", "code" => "341621123"},
      %{"name" => "安徽涡阳经济开发区", "code" => "341621402"}
    ]

  def next(input) when input == "蒙城县" or input == "341622",
    do: [
      %{"name" => "漆园街道", "code" => "341622001"},
      %{"name" => "庄周街道", "code" => "341622002"},
      %{"name" => "城关街道", "code" => "341622003"},
      %{"name" => "双涧镇", "code" => "341622101"},
      %{"name" => "小涧镇", "code" => "341622102"},
      %{"name" => "坛城镇", "code" => "341622104"},
      %{"name" => "许疃镇", "code" => "341622106"},
      %{"name" => "板桥集镇", "code" => "341622107"},
      %{"name" => "马集镇", "code" => "341622108"},
      %{"name" => "岳坊镇", "code" => "341622109"},
      %{"name" => "立仓镇", "code" => "341622110"},
      %{"name" => "楚村镇", "code" => "341622111"},
      %{"name" => "乐土镇", "code" => "341622112"},
      %{"name" => "三义镇", "code" => "341622113"},
      %{"name" => "篱笆镇", "code" => "341622114"},
      %{"name" => "王集乡", "code" => "341622201"},
      %{"name" => "小辛集乡", "code" => "341622202"},
      %{"name" => "安徽蒙城经济开发区管理委员会", "code" => "341622400"},
      %{"name" => "淮北矿业集团有限责任公司许疃煤矿", "code" => "341622401"}
    ]

  def next(input) when input == "利辛县" or input == "341623",
    do: [
      %{"name" => "城关镇", "code" => "341623100"},
      %{"name" => "阚疃镇", "code" => "341623101"},
      %{"name" => "张村镇", "code" => "341623102"},
      %{"name" => "江集镇", "code" => "341623103"},
      %{"name" => "旧城镇", "code" => "341623104"},
      %{"name" => "西潘楼镇", "code" => "341623105"},
      %{"name" => "孙集镇", "code" => "341623106"},
      %{"name" => "汝集镇", "code" => "341623107"},
      %{"name" => "巩店镇", "code" => "341623108"},
      %{"name" => "王人镇", "code" => "341623109"},
      %{"name" => "王市镇", "code" => "341623110"},
      %{"name" => "永兴镇", "code" => "341623111"},
      %{"name" => "马店孜镇", "code" => "341623112"},
      %{"name" => "大李集镇", "code" => "341623113"},
      %{"name" => "胡集镇", "code" => "341623114"},
      %{"name" => "展沟镇", "code" => "341623115"},
      %{"name" => "程家集镇", "code" => "341623116"},
      %{"name" => "中疃镇", "code" => "341623117"},
      %{"name" => "望疃镇", "code" => "341623118"},
      %{"name" => "城北镇", "code" => "341623119"},
      %{"name" => "纪王场乡", "code" => "341623203"},
      %{"name" => "孙庙乡", "code" => "341623204"},
      %{"name" => "新张集乡", "code" => "341623205"},
      %{"name" => "利辛县工业园区", "code" => "341623401"},
      %{"name" => "利辛县煤电产业园区", "code" => "341623402"}
    ]

  def next(input) when input == "金安区" or input == "341502",
    do: [
      %{"name" => "中市街道", "code" => "341502001"},
      %{"name" => "东市街道", "code" => "341502002"},
      %{"name" => "三里桥街道", "code" => "341502003"},
      %{"name" => "望城街道", "code" => "341502004"},
      %{"name" => "清水河街道", "code" => "341502005"},
      %{"name" => "木厂镇", "code" => "341502100"},
      %{"name" => "马头镇", "code" => "341502101"},
      %{"name" => "东桥镇", "code" => "341502102"},
      %{"name" => "张店镇", "code" => "341502103"},
      %{"name" => "毛坦厂镇", "code" => "341502104"},
      %{"name" => "东河口镇", "code" => "341502105"},
      %{"name" => "双河镇", "code" => "341502106"},
      %{"name" => "施桥镇", "code" => "341502107"},
      %{"name" => "孙岗镇", "code" => "341502108"},
      %{"name" => "三十铺镇", "code" => "341502109"},
      %{"name" => "椿树镇", "code" => "341502110"},
      %{"name" => "城北镇", "code" => "341502111"},
      %{"name" => "中店镇", "code" => "341502112"},
      %{"name" => "先生店镇", "code" => "341502113"},
      %{"name" => "翁墩乡", "code" => "341502201"},
      %{"name" => "淠东乡", "code" => "341502202"},
      %{"name" => "横塘岗乡", "code" => "341502204"},
      %{"name" => "六安经济开发区", "code" => "341502400"}
    ]

  def next(input) when input == "裕安区" or input == "341503",
    do: [
      %{"name" => "鼓楼街道", "code" => "341503001"},
      %{"name" => "西市街道", "code" => "341503002"},
      %{"name" => "小华山街道", "code" => "341503003"},
      %{"name" => "苏埠镇", "code" => "341503100"},
      %{"name" => "韩摆渡镇", "code" => "341503101"},
      %{"name" => "新安镇", "code" => "341503102"},
      %{"name" => "顺河镇", "code" => "341503103"},
      %{"name" => "独山镇", "code" => "341503104"},
      %{"name" => "石婆店镇", "code" => "341503105"},
      %{"name" => "城南镇", "code" => "341503106"},
      %{"name" => "丁集镇", "code" => "341503107"},
      %{"name" => "固镇镇", "code" => "341503108"},
      %{"name" => "徐集镇", "code" => "341503109"},
      %{"name" => "分路口镇", "code" => "341503110"},
      %{"name" => "江家店镇", "code" => "341503111"},
      %{"name" => "单王乡", "code" => "341503200"},
      %{"name" => "青山乡", "code" => "341503201"},
      %{"name" => "石板冲乡", "code" => "341503202"},
      %{"name" => "西河口乡", "code" => "341503203"},
      %{"name" => "平桥乡", "code" => "341503204"},
      %{"name" => "罗集乡", "code" => "341503205"},
      %{"name" => "狮子岗乡", "code" => "341503206"},
      %{"name" => "六安高新技术产业开发区", "code" => "341503400"}
    ]

  def next(input) when input == "叶集区" or input == "341504",
    do: [
      %{"name" => "史河街道", "code" => "341504001"},
      %{"name" => "平岗街道", "code" => "341504002"},
      %{"name" => "三元镇", "code" => "341504102"},
      %{"name" => "洪集镇", "code" => "341504103"},
      %{"name" => "姚李镇", "code" => "341504104"},
      %{"name" => "孙岗乡", "code" => "341504200"}
    ]

  def next(input) when input == "霍邱县" or input == "341522",
    do: [
      %{"name" => "城关镇", "code" => "341522100"},
      %{"name" => "河口镇", "code" => "341522101"},
      %{"name" => "周集镇", "code" => "341522102"},
      %{"name" => "临水镇", "code" => "341522103"},
      %{"name" => "新店镇", "code" => "341522104"},
      %{"name" => "石店镇", "code" => "341522105"},
      %{"name" => "马店镇", "code" => "341522106"},
      %{"name" => "孟集镇", "code" => "341522107"},
      %{"name" => "花园镇", "code" => "341522108"},
      %{"name" => "扈胡镇", "code" => "341522109"},
      %{"name" => "长集镇", "code" => "341522110"},
      %{"name" => "乌龙镇", "code" => "341522113"},
      %{"name" => "高塘镇", "code" => "341522114"},
      %{"name" => "龙潭镇", "code" => "341522115"},
      %{"name" => "岔路镇", "code" => "341522116"},
      %{"name" => "冯井镇", "code" => "341522117"},
      %{"name" => "众兴集镇", "code" => "341522118"},
      %{"name" => "夏店镇", "code" => "341522119"},
      %{"name" => "曹庙镇", "code" => "341522120"},
      %{"name" => "范桥镇", "code" => "341522123"},
      %{"name" => "潘集镇", "code" => "341522124"},
      %{"name" => "彭塔镇", "code" => "341522126"},
      %{"name" => "宋店镇", "code" => "341522127"},
      %{"name" => "临淮岗镇", "code" => "341522128"},
      %{"name" => "冯瓴镇", "code" => "341522129"},
      %{"name" => "王截流乡", "code" => "341522201"},
      %{"name" => "城西湖乡", "code" => "341522204"},
      %{"name" => "三流乡", "code" => "341522206"},
      %{"name" => "邵岗乡", "code" => "341522207"},
      %{"name" => "白莲乡", "code" => "341522208"},
      %{"name" => "安徽霍邱经济开发区", "code" => "341522400"},
      %{"name" => "水产局管辖村", "code" => "341522500"}
    ]

  def next(input) when input == "舒城县" or input == "341523",
    do: [
      %{"name" => "城关镇", "code" => "341523100"},
      %{"name" => "晓天镇", "code" => "341523101"},
      %{"name" => "桃溪镇", "code" => "341523102"},
      %{"name" => "万佛湖镇", "code" => "341523103"},
      %{"name" => "千人桥镇", "code" => "341523104"},
      %{"name" => "百神庙镇", "code" => "341523105"},
      %{"name" => "杭埠镇", "code" => "341523106"},
      %{"name" => "舒茶镇", "code" => "341523107"},
      %{"name" => "南港镇", "code" => "341523108"},
      %{"name" => "干汊河镇", "code" => "341523109"},
      %{"name" => "张母桥镇", "code" => "341523110"},
      %{"name" => "五显镇", "code" => "341523111"},
      %{"name" => "山七镇", "code" => "341523112"},
      %{"name" => "河棚镇", "code" => "341523113"},
      %{"name" => "汤池镇", "code" => "341523114"},
      %{"name" => "春秋乡", "code" => "341523200"},
      %{"name" => "柏林乡", "code" => "341523201"},
      %{"name" => "棠树乡", "code" => "341523202"},
      %{"name" => "阙店乡", "code" => "341523203"},
      %{"name" => "高峰乡", "code" => "341523204"},
      %{"name" => "庐镇乡", "code" => "341523205"},
      %{"name" => "舒城县经济开发区", "code" => "341523400"}
    ]

  def next(input) when input == "金寨县" or input == "341524",
    do: [
      %{"name" => "梅山镇", "code" => "341524100"},
      %{"name" => "麻埠镇", "code" => "341524101"},
      %{"name" => "青山镇", "code" => "341524102"},
      %{"name" => "燕子河镇", "code" => "341524103"},
      %{"name" => "天堂寨镇", "code" => "341524104"},
      %{"name" => "古碑镇", "code" => "341524105"},
      %{"name" => "吴家店镇", "code" => "341524106"},
      %{"name" => "斑竹园镇", "code" => "341524107"},
      %{"name" => "汤家汇镇", "code" => "341524108"},
      %{"name" => "南溪镇", "code" => "341524109"},
      %{"name" => "双河镇", "code" => "341524110"},
      %{"name" => "白塔畈镇", "code" => "341524111"},
      %{"name" => "流波䃥镇", "code" => "341524112"},
      %{"name" => "油坊店乡", "code" => "341524202"},
      %{"name" => "长岭乡", "code" => "341524203"},
      %{"name" => "槐树湾乡", "code" => "341524204"},
      %{"name" => "花石乡", "code" => "341524205"},
      %{"name" => "沙河乡", "code" => "341524206"},
      %{"name" => "桃岭乡", "code" => "341524207"},
      %{"name" => "果子园乡", "code" => "341524208"},
      %{"name" => "关庙乡", "code" => "341524209"},
      %{"name" => "全军乡", "code" => "341524211"},
      %{"name" => "铁冲乡", "code" => "341524214"}
    ]

  def next(input) when input == "霍山县" or input == "341525",
    do: [
      %{"name" => "衡山镇", "code" => "341525100"},
      %{"name" => "佛子岭镇", "code" => "341525101"},
      %{"name" => "下符桥镇", "code" => "341525102"},
      %{"name" => "但家庙镇", "code" => "341525103"},
      %{"name" => "与儿街镇", "code" => "341525104"},
      %{"name" => "黑石渡镇", "code" => "341525105"},
      %{"name" => "诸佛庵镇", "code" => "341525106"},
      %{"name" => "落儿岭镇", "code" => "341525107"},
      %{"name" => "磨子潭镇", "code" => "341525108"},
      %{"name" => "大化坪镇", "code" => "341525109"},
      %{"name" => "漫水河镇", "code" => "341525110"},
      %{"name" => "上土市镇", "code" => "341525111"},
      %{"name" => "单龙寺镇", "code" => "341525112"},
      %{"name" => "东西溪乡", "code" => "341525201"},
      %{"name" => "太平畈乡", "code" => "341525202"},
      %{"name" => "太阳乡", "code" => "341525203"},
      %{"name" => "经济开发区", "code" => "341525400"}
    ]

  def next(input) when input == "埇桥区" or input == "341302",
    do: [
      %{"name" => "埇桥街道", "code" => "341302001"},
      %{"name" => "沱河街道", "code" => "341302002"},
      %{"name" => "道东街道", "code" => "341302003"},
      %{"name" => "东关街道", "code" => "341302004"},
      %{"name" => "三里湾街道", "code" => "341302005"},
      %{"name" => "南关街道", "code" => "341302006"},
      %{"name" => "西关街道", "code" => "341302007"},
      %{"name" => "北关街道", "code" => "341302008"},
      %{"name" => "汴河街道", "code" => "341302009"},
      %{"name" => "三八街道", "code" => "341302010"},
      %{"name" => "城东街道", "code" => "341302011"},
      %{"name" => "符离镇", "code" => "341302100"},
      %{"name" => "芦岭镇", "code" => "341302101"},
      %{"name" => "朱仙庄镇", "code" => "341302102"},
      %{"name" => "褚兰镇", "code" => "341302103"},
      %{"name" => "曹村镇", "code" => "341302104"},
      %{"name" => "夹沟镇", "code" => "341302105"},
      %{"name" => "栏杆镇", "code" => "341302106"},
      %{"name" => "时村镇", "code" => "341302107"},
      %{"name" => "永安镇", "code" => "341302108"},
      %{"name" => "灰古镇", "code" => "341302109"},
      %{"name" => "大店镇", "code" => "341302110"},
      %{"name" => "大泽乡镇", "code" => "341302111"},
      %{"name" => "桃园镇", "code" => "341302112"},
      %{"name" => "蕲县镇", "code" => "341302113"},
      %{"name" => "大营镇", "code" => "341302114"},
      %{"name" => "顺河镇", "code" => "341302115"},
      %{"name" => "蒿沟镇", "code" => "341302116"},
      %{"name" => "杨庄镇", "code" => "341302117"},
      %{"name" => "解集镇", "code" => "341302118"},
      %{"name" => "苗安镇", "code" => "341302119"},
      %{"name" => "支河镇", "code" => "341302120"},
      %{"name" => "桃沟镇", "code" => "341302121"},
      %{"name" => "永镇镇", "code" => "341302122"},
      %{"name" => "西二铺镇", "code" => "341302123"},
      %{"name" => "北杨寨乡", "code" => "341302209"},
      %{"name" => "宿州高新技术产业开发区", "code" => "341302402"},
      %{"name" => "宿州埇桥经济开发区", "code" => "341302403"}
    ]

  def next(input) when input == "砀山县" or input == "341321",
    do: [
      %{"name" => "砀城镇", "code" => "341321100"},
      %{"name" => "赵屯镇", "code" => "341321101"},
      %{"name" => "李庄镇", "code" => "341321102"},
      %{"name" => "唐寨镇", "code" => "341321103"},
      %{"name" => "葛集镇", "code" => "341321104"},
      %{"name" => "周寨镇", "code" => "341321105"},
      %{"name" => "玄庙镇", "code" => "341321106"},
      %{"name" => "官庄坝镇", "code" => "341321107"},
      %{"name" => "曹庄镇", "code" => "341321108"},
      %{"name" => "关帝庙镇", "code" => "341321109"},
      %{"name" => "朱楼镇", "code" => "341321110"},
      %{"name" => "良梨镇", "code" => "341321111"},
      %{"name" => "程庄镇", "code" => "341321112"},
      %{"name" => "经济开发区", "code" => "341321400"},
      %{"name" => "薛楼板材加工园", "code" => "341321401"},
      %{"name" => "高铁新区", "code" => "341321402"}
    ]

  def next(input) when input == "萧县" or input == "341322",
    do: [
      %{"name" => "凤城街道", "code" => "341322001"},
      %{"name" => "龙河街道", "code" => "341322002"},
      %{"name" => "锦屏街道", "code" => "341322003"},
      %{"name" => "龙城镇", "code" => "341322100"},
      %{"name" => "黄口镇", "code" => "341322101"},
      %{"name" => "杨楼镇", "code" => "341322102"},
      %{"name" => "闫集镇", "code" => "341322103"},
      %{"name" => "新庄镇", "code" => "341322104"},
      %{"name" => "刘套镇", "code" => "341322105"},
      %{"name" => "马井镇", "code" => "341322106"},
      %{"name" => "大屯镇", "code" => "341322107"},
      %{"name" => "赵庄镇", "code" => "341322108"},
      %{"name" => "杜楼镇", "code" => "341322109"},
      %{"name" => "丁里镇", "code" => "341322110"},
      %{"name" => "王寨镇", "code" => "341322111"},
      %{"name" => "祖楼镇", "code" => "341322112"},
      %{"name" => "青龙集镇", "code" => "341322113"},
      %{"name" => "张庄寨镇", "code" => "341322114"},
      %{"name" => "永堌镇", "code" => "341322115"},
      %{"name" => "白土镇", "code" => "341322116"},
      %{"name" => "官桥镇", "code" => "341322117"},
      %{"name" => "圣泉镇", "code" => "341322118"},
      %{"name" => "庄里镇", "code" => "341322119"},
      %{"name" => "酒店镇", "code" => "341322120"},
      %{"name" => "孙圩子镇", "code" => "341322121"},
      %{"name" => "石林乡", "code" => "341322204"},
      %{"name" => "萧县经济开发区", "code" => "341322400"}
    ]

  def next(input) when input == "灵璧县" or input == "341323",
    do: [
      %{"name" => "灵城镇", "code" => "341323100"},
      %{"name" => "韦集镇", "code" => "341323101"},
      %{"name" => "黄湾镇", "code" => "341323102"},
      %{"name" => "娄庄镇", "code" => "341323103"},
      %{"name" => "杨疃镇", "code" => "341323104"},
      %{"name" => "尹集镇", "code" => "341323105"},
      %{"name" => "浍沟镇", "code" => "341323106"},
      %{"name" => "游集镇", "code" => "341323107"},
      %{"name" => "下楼镇", "code" => "341323108"},
      %{"name" => "朝阳镇", "code" => "341323109"},
      %{"name" => "渔沟镇", "code" => "341323110"},
      %{"name" => "高楼镇", "code" => "341323111"},
      %{"name" => "冯庙镇", "code" => "341323112"},
      %{"name" => "禅堂镇", "code" => "341323113"},
      %{"name" => "虞姬镇", "code" => "341323114"},
      %{"name" => "向阳镇", "code" => "341323115"},
      %{"name" => "大庙镇", "code" => "341323116"},
      %{"name" => "朱集镇", "code" => "341323117"},
      %{"name" => "大路镇", "code" => "341323118"},
      %{"name" => "灵璧县经济开发区", "code" => "341323400"}
    ]

  def next(input) when input == "泗县" or input == "341324",
    do: [
      %{"name" => "运河街道", "code" => "341324001"},
      %{"name" => "泗水街道", "code" => "341324002"},
      %{"name" => "虹城街道", "code" => "341324003"},
      %{"name" => "泗城镇", "code" => "341324100"},
      %{"name" => "墩集镇", "code" => "341324101"},
      %{"name" => "丁湖镇", "code" => "341324102"},
      %{"name" => "草沟镇", "code" => "341324103"},
      %{"name" => "长沟镇", "code" => "341324104"},
      %{"name" => "黄圩镇", "code" => "341324105"},
      %{"name" => "大庄镇", "code" => "341324106"},
      %{"name" => "山头镇", "code" => "341324107"},
      %{"name" => "刘圩镇", "code" => "341324108"},
      %{"name" => "黑塔镇", "code" => "341324109"},
      %{"name" => "草庙镇", "code" => "341324110"},
      %{"name" => "屏山镇", "code" => "341324111"},
      %{"name" => "大路口镇", "code" => "341324112"},
      %{"name" => "大杨镇", "code" => "341324113"},
      %{"name" => "瓦坊镇", "code" => "341324114"},
      %{"name" => "泗县开发区管委会（泗县当涂现代产业园）", "code" => "341324400"}
    ]

  def next(input) when input == "宿州马鞍山现代产业园区" or input == "341371",
    do: [%{"name" => "宿州东部新城行政管理区", "code" => "341371400"}]

  def next(input) when input == "宿州经济技术开发区" or input == "341372",
    do: [%{"name" => "金海街道", "code" => "341372001"}]

  def next(input) when input == "颍州区" or input == "341202",
    do: [
      %{"name" => "鼓楼街道", "code" => "341202001"},
      %{"name" => "文峰街道", "code" => "341202002"},
      %{"name" => "清河街道", "code" => "341202003"},
      %{"name" => "颍西街道", "code" => "341202004"},
      %{"name" => "王店镇", "code" => "341202100"},
      %{"name" => "程集镇", "code" => "341202101"},
      %{"name" => "三合镇", "code" => "341202102"},
      %{"name" => "西湖镇", "code" => "341202103"},
      %{"name" => "九龙镇", "code" => "341202104"},
      %{"name" => "三十里铺镇", "code" => "341202105"},
      %{"name" => "三塔集镇", "code" => "341202106"},
      %{"name" => "马寨乡", "code" => "341202200"},
      %{"name" => "安徽颍州经济开发区", "code" => "341202400"}
    ]

  def next(input) when input == "颍东区" or input == "341203",
    do: [
      %{"name" => "河东街道", "code" => "341203001"},
      %{"name" => "新华街道", "code" => "341203002"},
      %{"name" => "向阳街道", "code" => "341203003"},
      %{"name" => "口孜镇", "code" => "341203100"},
      %{"name" => "插花镇", "code" => "341203101"},
      %{"name" => "袁寨镇", "code" => "341203102"},
      %{"name" => "枣庄镇", "code" => "341203103"},
      %{"name" => "老庙镇", "code" => "341203104"},
      %{"name" => "正午镇", "code" => "341203105"},
      %{"name" => "杨楼孜镇", "code" => "341203106"},
      %{"name" => "新乌江镇", "code" => "341203107"},
      %{"name" => "冉庙乡", "code" => "341203200"}
    ]

  def next(input) when input == "颍泉区" or input == "341204",
    do: [
      %{"name" => "中市街道", "code" => "341204001"},
      %{"name" => "周棚街道", "code" => "341204002"},
      %{"name" => "伍明镇", "code" => "341204100"},
      %{"name" => "宁老庄镇", "code" => "341204101"},
      %{"name" => "闻集镇", "code" => "341204102"},
      %{"name" => "行流镇", "code" => "341204103"}
    ]

  def next(input) when input == "临泉县" or input == "341221",
    do: [
      %{"name" => "城关街道", "code" => "341221001"},
      %{"name" => "邢塘街道", "code" => "341221002"},
      %{"name" => "田桥街道", "code" => "341221003"},
      %{"name" => "城东街道", "code" => "341221004"},
      %{"name" => "城南街道", "code" => "341221005"},
      %{"name" => "杨桥镇", "code" => "341221101"},
      %{"name" => "鲖城镇", "code" => "341221102"},
      %{"name" => "谭棚镇", "code" => "341221103"},
      %{"name" => "老集镇", "code" => "341221104"},
      %{"name" => "滑集镇", "code" => "341221105"},
      %{"name" => "吕寨镇", "code" => "341221106"},
      %{"name" => "单桥镇", "code" => "341221107"},
      %{"name" => "长官镇", "code" => "341221108"},
      %{"name" => "宋集镇", "code" => "341221109"},
      %{"name" => "张新镇", "code" => "341221110"},
      %{"name" => "艾亭镇", "code" => "341221111"},
      %{"name" => "陈集镇", "code" => "341221112"},
      %{"name" => "韦寨镇", "code" => "341221113"},
      %{"name" => "迎仙镇", "code" => "341221114"},
      %{"name" => "瓦店镇", "code" => "341221115"},
      %{"name" => "姜寨镇", "code" => "341221116"},
      %{"name" => "庙岔镇", "code" => "341221117"},
      %{"name" => "黄岭镇", "code" => "341221118"},
      %{"name" => "白庙镇", "code" => "341221119"},
      %{"name" => "关庙镇", "code" => "341221120"},
      %{"name" => "高塘镇", "code" => "341221122"},
      %{"name" => "土陂乡", "code" => "341221203"},
      %{"name" => "陶老乡", "code" => "341221206"}
    ]

  def next(input) when input == "太和县" or input == "341222",
    do: [
      %{"name" => "城关镇", "code" => "341222100"},
      %{"name" => "旧县镇", "code" => "341222101"},
      %{"name" => "税镇镇", "code" => "341222102"},
      %{"name" => "皮条孙镇", "code" => "341222103"},
      %{"name" => "原墙镇", "code" => "341222104"},
      %{"name" => "倪邱镇", "code" => "341222105"},
      %{"name" => "李兴镇", "code" => "341222106"},
      %{"name" => "大新镇", "code" => "341222107"},
      %{"name" => "肖口镇", "code" => "341222108"},
      %{"name" => "关集镇", "code" => "341222109"},
      %{"name" => "三塔镇", "code" => "341222110"},
      %{"name" => "双浮镇", "code" => "341222111"},
      %{"name" => "蔡庙镇", "code" => "341222112"},
      %{"name" => "三堂镇", "code" => "341222113"},
      %{"name" => "苗老集镇", "code" => "341222114"},
      %{"name" => "赵庙镇", "code" => "341222115"},
      %{"name" => "宫集镇", "code" => "341222116"},
      %{"name" => "坟台镇", "code" => "341222117"},
      %{"name" => "洪山镇", "code" => "341222118"},
      %{"name" => "清浅镇", "code" => "341222119"},
      %{"name" => "五星镇", "code" => "341222120"},
      %{"name" => "高庙镇", "code" => "341222121"},
      %{"name" => "桑营镇", "code" => "341222122"},
      %{"name" => "大庙集镇", "code" => "341222123"},
      %{"name" => "阮桥镇", "code" => "341222124"},
      %{"name" => "双庙镇", "code" => "341222125"},
      %{"name" => "胡总镇", "code" => "341222126"},
      %{"name" => "郭庙镇", "code" => "341222127"},
      %{"name" => "二郎镇", "code" => "341222128"},
      %{"name" => "马集镇", "code" => "341222129"},
      %{"name" => "赵集乡", "code" => "341222201"},
      %{"name" => "开发区管理委员会", "code" => "341222400"}
    ]

  def next(input) when input == "阜南县" or input == "341225",
    do: [
      %{"name" => "方集镇", "code" => "341225101"},
      %{"name" => "中岗镇", "code" => "341225102"},
      %{"name" => "柴集镇", "code" => "341225103"},
      %{"name" => "新村镇", "code" => "341225104"},
      %{"name" => "朱寨镇", "code" => "341225106"},
      %{"name" => "柳沟镇", "code" => "341225107"},
      %{"name" => "赵集镇", "code" => "341225108"},
      %{"name" => "田集镇", "code" => "341225109"},
      %{"name" => "苗集镇", "code" => "341225110"},
      %{"name" => "黄岗镇", "code" => "341225111"},
      %{"name" => "焦陂镇", "code" => "341225112"},
      %{"name" => "张寨镇", "code" => "341225113"},
      %{"name" => "王堰镇", "code" => "341225114"},
      %{"name" => "地城镇", "code" => "341225115"},
      %{"name" => "洪河桥镇", "code" => "341225116"},
      %{"name" => "王家坝镇", "code" => "341225117"},
      %{"name" => "王化镇", "code" => "341225118"},
      %{"name" => "曹集镇", "code" => "341225119"},
      %{"name" => "鹿城镇", "code" => "341225120"},
      %{"name" => "会龙镇", "code" => "341225121"},
      %{"name" => "王店孜乡", "code" => "341225200"},
      %{"name" => "许堂乡", "code" => "341225201"},
      %{"name" => "段郢乡", "code" => "341225204"},
      %{"name" => "公桥乡", "code" => "341225205"},
      %{"name" => "龙王乡", "code" => "341225206"},
      %{"name" => "于集乡", "code" => "341225207"},
      %{"name" => "老观乡", "code" => "341225208"},
      %{"name" => "郜台乡", "code" => "341225209"},
      %{"name" => "安徽阜南经济开发区", "code" => "341225401"}
    ]

  def next(input) when input == "颍上县" or input == "341226",
    do: [
      %{"name" => "慎城镇", "code" => "341226100"},
      %{"name" => "谢桥镇", "code" => "341226101"},
      %{"name" => "南照镇", "code" => "341226102"},
      %{"name" => "杨湖镇", "code" => "341226103"},
      %{"name" => "江口镇", "code" => "341226104"},
      %{"name" => "润河镇", "code" => "341226105"},
      %{"name" => "新集镇", "code" => "341226106"},
      %{"name" => "六十铺镇", "code" => "341226107"},
      %{"name" => "耿棚镇", "code" => "341226108"},
      %{"name" => "半岗镇", "code" => "341226109"},
      %{"name" => "王岗镇", "code" => "341226110"},
      %{"name" => "夏桥镇", "code" => "341226111"},
      %{"name" => "江店孜镇", "code" => "341226112"},
      %{"name" => "陈桥镇", "code" => "341226113"},
      %{"name" => "黄桥镇", "code" => "341226114"},
      %{"name" => "八里河镇", "code" => "341226115"},
      %{"name" => "迪沟镇", "code" => "341226116"},
      %{"name" => "西三十铺镇", "code" => "341226117"},
      %{"name" => "红星镇", "code" => "341226118"},
      %{"name" => "十八里铺镇", "code" => "341226119"},
      %{"name" => "鲁口镇", "code" => "341226120"},
      %{"name" => "古城镇", "code" => "341226121"},
      %{"name" => "建颍乡", "code" => "341226200"},
      %{"name" => "五十铺乡", "code" => "341226201"},
      %{"name" => "盛堂乡", "code" => "341226202"},
      %{"name" => "关屯乡", "code" => "341226203"},
      %{"name" => "垂岗乡", "code" => "341226204"},
      %{"name" => "赛涧回族乡", "code" => "341226205"},
      %{"name" => "刘集乡", "code" => "341226206"},
      %{"name" => "黄坝乡", "code" => "341226207"}
    ]

  def next(input) when input == "阜阳合肥现代产业园区" or input == "341271",
    do: [%{"name" => "袁集镇", "code" => "341271100"}]

  def next(input) when input == "阜阳经济技术开发区" or input == "341272",
    do: [%{"name" => "阜阳开发区京九街道", "code" => "341272001"}]

  def next(input) when input == "界首市" or input == "341282",
    do: [
      %{"name" => "东城街道", "code" => "341282001"},
      %{"name" => "西城街道", "code" => "341282002"},
      %{"name" => "颍南街道", "code" => "341282003"},
      %{"name" => "光武镇", "code" => "341282100"},
      %{"name" => "泉阳镇", "code" => "341282101"},
      %{"name" => "芦村镇", "code" => "341282102"},
      %{"name" => "新马集镇", "code" => "341282103"},
      %{"name" => "大黄镇", "code" => "341282104"},
      %{"name" => "田营镇", "code" => "341282105"},
      %{"name" => "陶庙镇", "code" => "341282106"},
      %{"name" => "王集镇", "code" => "341282107"},
      %{"name" => "砖集镇", "code" => "341282108"},
      %{"name" => "顾集镇", "code" => "341282109"},
      %{"name" => "戴桥镇", "code" => "341282110"},
      %{"name" => "舒庄镇", "code" => "341282111"},
      %{"name" => "邴集乡", "code" => "341282200"},
      %{"name" => "靳寨乡", "code" => "341282201"},
      %{"name" => "任寨乡", "code" => "341282202"}
    ]

  def next(input) when input == "琅琊区" or input == "341102",
    do: [
      %{"name" => "琅琊街道", "code" => "341102001"},
      %{"name" => "丰山街道", "code" => "341102004"},
      %{"name" => "清流街道", "code" => "341102006"},
      %{"name" => "扬子街道", "code" => "341102007"},
      %{"name" => "西涧街道", "code" => "341102010"},
      %{"name" => "遵阳街道", "code" => "341102011"},
      %{"name" => "滁阳街道", "code" => "341102012"},
      %{"name" => "三官街道", "code" => "341102013"},
      %{"name" => "安徽滁州琅琊经济开发区", "code" => "341102400"}
    ]

  def next(input) when input == "南谯区" or input == "341103",
    do: [
      %{"name" => "龙蟠街道", "code" => "341103003"},
      %{"name" => "银花街道", "code" => "341103004"},
      %{"name" => "同乐街道", "code" => "341103005"},
      %{"name" => "乌衣镇", "code" => "341103100"},
      %{"name" => "沙河镇", "code" => "341103101"},
      %{"name" => "章广镇", "code" => "341103102"},
      %{"name" => "黄泥岗镇", "code" => "341103103"},
      %{"name" => "珠龙镇", "code" => "341103104"},
      %{"name" => "大柳镇", "code" => "341103105"},
      %{"name" => "腰铺镇", "code" => "341103106"},
      %{"name" => "施集镇", "code" => "341103107"},
      %{"name" => "南谯工业园区", "code" => "341103400"},
      %{"name" => "滁州高教科创城管委会", "code" => "341103401"}
    ]

  def next(input) when input == "来安县" or input == "341122",
    do: [
      %{"name" => "新安镇", "code" => "341122100"},
      %{"name" => "半塔镇", "code" => "341122101"},
      %{"name" => "水口镇", "code" => "341122102"},
      %{"name" => "汊河镇", "code" => "341122103"},
      %{"name" => "大英镇", "code" => "341122104"},
      %{"name" => "雷官镇", "code" => "341122105"},
      %{"name" => "施官镇", "code" => "341122106"},
      %{"name" => "舜山镇", "code" => "341122107"},
      %{"name" => "三城镇", "code" => "341122108"},
      %{"name" => "独山镇", "code" => "341122109"},
      %{"name" => "张山镇", "code" => "341122110"},
      %{"name" => "杨郢乡", "code" => "341122203"}
    ]

  def next(input) when input == "全椒县" or input == "341124",
    do: [
      %{"name" => "襄河镇", "code" => "341124100"},
      %{"name" => "古河镇", "code" => "341124101"},
      %{"name" => "大墅镇", "code" => "341124102"},
      %{"name" => "二郎口镇", "code" => "341124103"},
      %{"name" => "武岗镇", "code" => "341124104"},
      %{"name" => "马厂镇", "code" => "341124105"},
      %{"name" => "石沛镇", "code" => "341124106"},
      %{"name" => "十字镇", "code" => "341124107"},
      %{"name" => "西王镇", "code" => "341124108"},
      %{"name" => "六镇镇", "code" => "341124109"}
    ]

  def next(input) when input == "定远县" or input == "341125",
    do: [
      %{"name" => "定城镇", "code" => "341125100"},
      %{"name" => "炉桥镇", "code" => "341125101"},
      %{"name" => "永康镇", "code" => "341125102"},
      %{"name" => "吴圩镇", "code" => "341125103"},
      %{"name" => "朱湾镇", "code" => "341125104"},
      %{"name" => "张桥镇", "code" => "341125105"},
      %{"name" => "藕塘镇", "code" => "341125106"},
      %{"name" => "池河镇", "code" => "341125107"},
      %{"name" => "连江镇", "code" => "341125108"},
      %{"name" => "界牌集镇", "code" => "341125109"},
      %{"name" => "仓镇", "code" => "341125110"},
      %{"name" => "三和集镇", "code" => "341125111"},
      %{"name" => "西卅店镇", "code" => "341125112"},
      %{"name" => "桑涧镇", "code" => "341125113"},
      %{"name" => "蒋集镇", "code" => "341125114"},
      %{"name" => "大桥镇", "code" => "341125115"},
      %{"name" => "严桥乡", "code" => "341125200"},
      %{"name" => "拂晓乡", "code" => "341125201"},
      %{"name" => "能仁乡", "code" => "341125202"},
      %{"name" => "七里塘乡", "code" => "341125203"},
      %{"name" => "二龙回族乡", "code" => "341125204"},
      %{"name" => "范岗乡", "code" => "341125205"},
      %{"name" => "安徽定远经济开发区", "code" => "341125400"},
      %{"name" => "定远盐化工业园", "code" => "341125401"},
      %{"name" => "凌家湖农场", "code" => "341125402"}
    ]

  def next(input) when input == "凤阳县" or input == "341126",
    do: [
      %{"name" => "中都街道", "code" => "341126001"},
      %{"name" => "玄武街道", "code" => "341126002"},
      %{"name" => "府城镇", "code" => "341126100"},
      %{"name" => "临淮关镇", "code" => "341126101"},
      %{"name" => "武店镇", "code" => "341126102"},
      %{"name" => "西泉镇", "code" => "341126103"},
      %{"name" => "官塘镇", "code" => "341126104"},
      %{"name" => "刘府镇", "code" => "341126105"},
      %{"name" => "大庙镇", "code" => "341126106"},
      %{"name" => "殷涧镇", "code" => "341126107"},
      %{"name" => "总铺镇", "code" => "341126108"},
      %{"name" => "红心镇", "code" => "341126109"},
      %{"name" => "板桥镇", "code" => "341126110"},
      %{"name" => "大溪河镇", "code" => "341126111"},
      %{"name" => "小溪河镇", "code" => "341126112"},
      %{"name" => "枣巷镇", "code" => "341126113"},
      %{"name" => "黄湾乡", "code" => "341126201"},
      %{"name" => "安徽凤阳经济开发区管理委员会", "code" => "341126401"}
    ]

  def next(input) when input == "中新苏滁高新技术产业开发区" or input == "341171",
    do: [%{"name" => "大王街道", "code" => "341171001"}]

  def next(input) when input == "滁州经济技术开发区" or input == "341172",
    do: [
      %{"name" => "凤凰街道", "code" => "341172001"},
      %{"name" => "紫薇街道", "code" => "341172002"},
      %{"name" => "滁州市经济技术开发区", "code" => "341172401"}
    ]

  def next(input) when input == "天长市" or input == "341181",
    do: [
      %{"name" => "广陵街道", "code" => "341181003"},
      %{"name" => "千秋街道", "code" => "341181004"},
      %{"name" => "铜城镇", "code" => "341181100"},
      %{"name" => "汊涧镇", "code" => "341181101"},
      %{"name" => "秦栏镇", "code" => "341181102"},
      %{"name" => "大通镇", "code" => "341181103"},
      %{"name" => "杨村镇", "code" => "341181104"},
      %{"name" => "石梁镇", "code" => "341181105"},
      %{"name" => "金集镇", "code" => "341181106"},
      %{"name" => "永丰镇", "code" => "341181107"},
      %{"name" => "仁和集镇", "code" => "341181108"},
      %{"name" => "冶山镇", "code" => "341181109"},
      %{"name" => "郑集镇", "code" => "341181110"},
      %{"name" => "张铺镇", "code" => "341181111"},
      %{"name" => "新街镇", "code" => "341181112"},
      %{"name" => "万寿镇", "code" => "341181113"}
    ]

  def next(input) when input == "明光市" or input == "341182",
    do: [
      %{"name" => "明光街道", "code" => "341182001"},
      %{"name" => "明东街道", "code" => "341182002"},
      %{"name" => "明南街道", "code" => "341182003"},
      %{"name" => "明西街道", "code" => "341182004"},
      %{"name" => "张八岭镇", "code" => "341182100"},
      %{"name" => "三界镇", "code" => "341182101"},
      %{"name" => "管店镇", "code" => "341182102"},
      %{"name" => "自来桥镇", "code" => "341182103"},
      %{"name" => "涧溪镇", "code" => "341182104"},
      %{"name" => "石坝镇", "code" => "341182105"},
      %{"name" => "苏巷镇", "code" => "341182106"},
      %{"name" => "桥头镇", "code" => "341182107"},
      %{"name" => "女山湖镇", "code" => "341182108"},
      %{"name" => "古沛镇", "code" => "341182109"},
      %{"name" => "潘村镇", "code" => "341182110"},
      %{"name" => "柳巷镇", "code" => "341182111"},
      %{"name" => "泊岗乡", "code" => "341182200"}
    ]

  def next(input) when input == "屯溪区" or input == "341002",
    do: [
      %{"name" => "昱东街道", "code" => "341002001"},
      %{"name" => "昱中街道", "code" => "341002002"},
      %{"name" => "昱西街道", "code" => "341002003"},
      %{"name" => "老街街道", "code" => "341002004"},
      %{"name" => "屯光镇", "code" => "341002100"},
      %{"name" => "阳湖镇", "code" => "341002101"},
      %{"name" => "黎阳镇", "code" => "341002102"},
      %{"name" => "新潭镇", "code" => "341002103"},
      %{"name" => "奕棋镇", "code" => "341002104"}
    ]

  def next(input) when input == "黄山区" or input == "341003",
    do: [
      %{"name" => "甘棠镇", "code" => "341003100"},
      %{"name" => "仙源镇", "code" => "341003101"},
      %{"name" => "汤口镇", "code" => "341003102"},
      %{"name" => "谭家桥镇", "code" => "341003103"},
      %{"name" => "太平湖镇", "code" => "341003104"},
      %{"name" => "焦村镇", "code" => "341003105"},
      %{"name" => "耿城镇", "code" => "341003106"},
      %{"name" => "三口镇", "code" => "341003107"},
      %{"name" => "乌石镇", "code" => "341003108"},
      %{"name" => "新明乡", "code" => "341003200"},
      %{"name" => "龙门乡", "code" => "341003201"},
      %{"name" => "新华乡", "code" => "341003203"},
      %{"name" => "新丰乡", "code" => "341003204"},
      %{"name" => "永丰乡", "code" => "341003205"},
      %{"name" => "黄山风景区", "code" => "341003400"}
    ]

  def next(input) when input == "徽州区" or input == "341004",
    do: [
      %{"name" => "岩寺镇", "code" => "341004100"},
      %{"name" => "西溪南镇", "code" => "341004101"},
      %{"name" => "潜口镇", "code" => "341004102"},
      %{"name" => "呈坎镇", "code" => "341004103"},
      %{"name" => "徽州区直辖村级区划", "code" => "341004198"},
      %{"name" => "洽舍乡", "code" => "341004200"},
      %{"name" => "杨村乡", "code" => "341004201"},
      %{"name" => "富溪乡", "code" => "341004202"},
      %{"name" => "安徽徽州经济开发区", "code" => "341004400"}
    ]

  def next(input) when input == "歙县" or input == "341021",
    do: [
      %{"name" => "徽城镇", "code" => "341021100"},
      %{"name" => "深渡镇", "code" => "341021101"},
      %{"name" => "北岸镇", "code" => "341021102"},
      %{"name" => "富堨镇", "code" => "341021103"},
      %{"name" => "郑村镇", "code" => "341021104"},
      %{"name" => "桂林镇", "code" => "341021105"},
      %{"name" => "许村镇", "code" => "341021106"},
      %{"name" => "溪头镇", "code" => "341021107"},
      %{"name" => "杞梓里镇", "code" => "341021108"},
      %{"name" => "霞坑镇", "code" => "341021109"},
      %{"name" => "岔口镇", "code" => "341021110"},
      %{"name" => "街口镇", "code" => "341021111"},
      %{"name" => "王村镇", "code" => "341021112"},
      %{"name" => "雄村镇", "code" => "341021113"},
      %{"name" => "三阳镇", "code" => "341021114"},
      %{"name" => "坑口乡", "code" => "341021200"},
      %{"name" => "上丰乡", "code" => "341021202"},
      %{"name" => "昌溪乡", "code" => "341021203"},
      %{"name" => "武阳乡", "code" => "341021204"},
      %{"name" => "金川乡", "code" => "341021206"},
      %{"name" => "小川乡", "code" => "341021207"},
      %{"name" => "新溪口乡", "code" => "341021208"},
      %{"name" => "璜田乡", "code" => "341021209"},
      %{"name" => "长陔乡", "code" => "341021210"},
      %{"name" => "森村乡", "code" => "341021211"},
      %{"name" => "绍濂乡", "code" => "341021212"},
      %{"name" => "石门乡", "code" => "341021213"},
      %{"name" => "狮石乡", "code" => "341021214"},
      %{"name" => "歙县经济开发区", "code" => "341021400"}
    ]

  def next(input) when input == "休宁县" or input == "341022",
    do: [
      %{"name" => "海阳镇", "code" => "341022100"},
      %{"name" => "齐云山镇", "code" => "341022101"},
      %{"name" => "万安镇", "code" => "341022102"},
      %{"name" => "五城镇", "code" => "341022103"},
      %{"name" => "东临溪镇", "code" => "341022104"},
      %{"name" => "蓝田镇", "code" => "341022105"},
      %{"name" => "溪口镇", "code" => "341022106"},
      %{"name" => "流口镇", "code" => "341022107"},
      %{"name" => "汪村镇", "code" => "341022108"},
      %{"name" => "商山镇", "code" => "341022109"},
      %{"name" => "月潭湖镇", "code" => "341022110"},
      %{"name" => "山斗乡", "code" => "341022201"},
      %{"name" => "岭南乡", "code" => "341022202"},
      %{"name" => "渭桥乡", "code" => "341022203"},
      %{"name" => "板桥乡", "code" => "341022204"},
      %{"name" => "鹤城乡", "code" => "341022206"},
      %{"name" => "源芳乡", "code" => "341022207"},
      %{"name" => "榆村乡", "code" => "341022208"},
      %{"name" => "龙田乡", "code" => "341022209"},
      %{"name" => "璜尖乡", "code" => "341022210"},
      %{"name" => "白际乡", "code" => "341022211"}
    ]

  def next(input) when input == "黟县" or input == "341023",
    do: [
      %{"name" => "碧阳镇", "code" => "341023100"},
      %{"name" => "宏村镇", "code" => "341023101"},
      %{"name" => "渔亭镇", "code" => "341023102"},
      %{"name" => "西递镇", "code" => "341023103"},
      %{"name" => "柯村镇", "code" => "341023104"},
      %{"name" => "美溪乡", "code" => "341023201"},
      %{"name" => "宏潭乡", "code" => "341023202"},
      %{"name" => "洪星乡", "code" => "341023203"}
    ]

  def next(input) when input == "祁门县" or input == "341024",
    do: [
      %{"name" => "祁山镇", "code" => "341024100"},
      %{"name" => "小路口镇", "code" => "341024101"},
      %{"name" => "金字牌镇", "code" => "341024102"},
      %{"name" => "平里镇", "code" => "341024103"},
      %{"name" => "历口镇", "code" => "341024104"},
      %{"name" => "闪里镇", "code" => "341024105"},
      %{"name" => "安凌镇", "code" => "341024106"},
      %{"name" => "凫峰镇", "code" => "341024107"},
      %{"name" => "塔坊镇", "code" => "341024108"},
      %{"name" => "新安镇", "code" => "341024109"},
      %{"name" => "大坦乡", "code" => "341024200"},
      %{"name" => "柏溪乡", "code" => "341024202"},
      %{"name" => "祁红乡", "code" => "341024204"},
      %{"name" => "溶口乡", "code" => "341024205"},
      %{"name" => "芦溪乡", "code" => "341024206"},
      %{"name" => "渚口乡", "code" => "341024207"},
      %{"name" => "古溪乡", "code" => "341024208"},
      %{"name" => "箬坑乡", "code" => "341024210"}
    ]

  def next(input) when input == "迎江区" or input == "340802",
    do: [
      %{"name" => "宜城路街道", "code" => "340802001"},
      %{"name" => "新河路街道", "code" => "340802002"},
      %{"name" => "华中路街道", "code" => "340802003"},
      %{"name" => "人民路街道", "code" => "340802004"},
      %{"name" => "孝肃路街道", "code" => "340802005"},
      %{"name" => "滨江街道", "code" => "340802006"},
      %{"name" => "龙狮桥乡", "code" => "340802200"},
      %{"name" => "长风乡", "code" => "340802201"},
      %{"name" => "新洲乡", "code" => "340802202"},
      %{"name" => "迎江经济开发区", "code" => "340802403"}
    ]

  def next(input) when input == "大观区" or input == "340803",
    do: [
      %{"name" => "德宽路街道", "code" => "340803001"},
      %{"name" => "玉琳路街道", "code" => "340803002"},
      %{"name" => "龙山路街道", "code" => "340803003"},
      %{"name" => "菱湖街道", "code" => "340803004"},
      %{"name" => "集贤路街道", "code" => "340803005"},
      %{"name" => "石化路街道", "code" => "340803006"},
      %{"name" => "花亭路街道", "code" => "340803007"},
      %{"name" => "海口镇", "code" => "340803100"},
      %{"name" => "十里铺乡", "code" => "340803200"},
      %{"name" => "山口乡", "code" => "340803201"},
      %{"name" => "大观开发区", "code" => "340803400"},
      %{"name" => "安徽安庆海口经济开发区", "code" => "340803401"},
      %{"name" => "高新技术产业开发区", "code" => "340803402"},
      %{"name" => "皖河农场", "code" => "340803500"}
    ]

  def next(input) when input == "宜秀区" or input == "340811",
    do: [
      %{"name" => "大桥街道", "code" => "340811001"},
      %{"name" => "大龙山镇", "code" => "340811100"},
      %{"name" => "杨桥镇", "code" => "340811101"},
      %{"name" => "罗岭镇", "code" => "340811102"},
      %{"name" => "白泽湖乡", "code" => "340811200"},
      %{"name" => "五横乡", "code" => "340811201"}
    ]

  def next(input) when input == "怀宁县" or input == "340822",
    do: [
      %{"name" => "高河镇", "code" => "340822100"},
      %{"name" => "石牌镇", "code" => "340822101"},
      %{"name" => "月山镇", "code" => "340822102"},
      %{"name" => "马庙镇", "code" => "340822103"},
      %{"name" => "金拱镇", "code" => "340822104"},
      %{"name" => "茶岭镇", "code" => "340822105"},
      %{"name" => "公岭镇", "code" => "340822106"},
      %{"name" => "黄墩镇", "code" => "340822107"},
      %{"name" => "三桥镇", "code" => "340822108"},
      %{"name" => "小市镇", "code" => "340822109"},
      %{"name" => "黄龙镇", "code" => "340822110"},
      %{"name" => "平山镇", "code" => "340822111"},
      %{"name" => "腊树镇", "code" => "340822112"},
      %{"name" => "洪铺镇", "code" => "340822113"},
      %{"name" => "江镇镇", "code" => "340822114"},
      %{"name" => "凉亭乡", "code" => "340822200"},
      %{"name" => "石镜乡", "code" => "340822201"},
      %{"name" => "秀山乡", "code" => "340822202"},
      %{"name" => "清河乡", "code" => "340822203"},
      %{"name" => "雷埠乡", "code" => "340822204"}
    ]

  def next(input) when input == "太湖县" or input == "340825",
    do: [
      %{"name" => "晋熙镇", "code" => "340825100"},
      %{"name" => "徐桥镇", "code" => "340825101"},
      %{"name" => "新仓镇", "code" => "340825102"},
      %{"name" => "小池镇", "code" => "340825103"},
      %{"name" => "寺前镇", "code" => "340825104"},
      %{"name" => "天华镇", "code" => "340825105"},
      %{"name" => "牛镇镇", "code" => "340825106"},
      %{"name" => "弥陀镇", "code" => "340825107"},
      %{"name" => "北中镇", "code" => "340825108"},
      %{"name" => "百里镇", "code" => "340825109"},
      %{"name" => "大石乡", "code" => "340825200"},
      %{"name" => "城西乡", "code" => "340825201"},
      %{"name" => "江塘乡", "code" => "340825202"},
      %{"name" => "汤泉乡", "code" => "340825203"},
      %{"name" => "刘畈乡", "code" => "340825204"},
      %{"name" => "经济开发区", "code" => "340825400"}
    ]

  def next(input) when input == "宿松县" or input == "340826",
    do: [
      %{"name" => "松兹街道", "code" => "340826001"},
      %{"name" => "龙山街道", "code" => "340826002"},
      %{"name" => "孚玉镇", "code" => "340826100"},
      %{"name" => "复兴镇", "code" => "340826101"},
      %{"name" => "汇口镇", "code" => "340826102"},
      %{"name" => "许岭镇", "code" => "340826103"},
      %{"name" => "下仓镇", "code" => "340826104"},
      %{"name" => "二郎镇", "code" => "340826105"},
      %{"name" => "华亭镇", "code" => "340826106"},
      %{"name" => "凉亭镇", "code" => "340826107"},
      %{"name" => "长铺镇", "code" => "340826108"},
      %{"name" => "高岭乡", "code" => "340826200"},
      %{"name" => "程岭乡", "code" => "340826201"},
      %{"name" => "九姑乡", "code" => "340826202"},
      %{"name" => "千岭乡", "code" => "340826203"},
      %{"name" => "洲头乡", "code" => "340826204"},
      %{"name" => "佐坝乡", "code" => "340826205"},
      %{"name" => "北浴乡", "code" => "340826206"},
      %{"name" => "陈汉乡", "code" => "340826207"},
      %{"name" => "隘口乡", "code" => "340826208"},
      %{"name" => "柳坪乡", "code" => "340826209"},
      %{"name" => "趾凤乡", "code" => "340826210"},
      %{"name" => "河塌乡", "code" => "340826211"},
      %{"name" => "九成监狱管理分局", "code" => "340826400"},
      %{"name" => "华阳河农场总场", "code" => "340826401"},
      %{"name" => "安徽宿松经济开发区", "code" => "340826403"}
    ]

  def next(input) when input == "望江县" or input == "340827",
    do: [
      %{"name" => "雷阳街道", "code" => "340827001"},
      %{"name" => "吉水街道", "code" => "340827002"},
      %{"name" => "回龙街道", "code" => "340827003"},
      %{"name" => "华阳镇", "code" => "340827100"},
      %{"name" => "杨湾镇", "code" => "340827101"},
      %{"name" => "漳湖镇", "code" => "340827102"},
      %{"name" => "赛口镇", "code" => "340827103"},
      %{"name" => "高士镇", "code" => "340827104"},
      %{"name" => "鸦滩镇", "code" => "340827105"},
      %{"name" => "长岭镇", "code" => "340827106"},
      %{"name" => "太慈镇", "code" => "340827107"},
      %{"name" => "雷池镇", "code" => "340827109"},
      %{"name" => "凉泉乡", "code" => "340827200"},
      %{"name" => "望江县经济开发区", "code" => "340827400"}
    ]

  def next(input) when input == "岳西县" or input == "340828",
    do: [
      %{"name" => "天堂镇", "code" => "340828100"},
      %{"name" => "店前镇", "code" => "340828101"},
      %{"name" => "来榜镇", "code" => "340828102"},
      %{"name" => "菖蒲镇", "code" => "340828103"},
      %{"name" => "头陀镇", "code" => "340828104"},
      %{"name" => "白帽镇", "code" => "340828105"},
      %{"name" => "温泉镇", "code" => "340828106"},
      %{"name" => "响肠镇", "code" => "340828107"},
      %{"name" => "河图镇", "code" => "340828108"},
      %{"name" => "五河镇", "code" => "340828109"},
      %{"name" => "主簿镇", "code" => "340828110"},
      %{"name" => "冶溪镇", "code" => "340828111"},
      %{"name" => "黄尾镇", "code" => "340828112"},
      %{"name" => "中关镇", "code" => "340828113"},
      %{"name" => "毛尖山乡", "code" => "340828200"},
      %{"name" => "莲云乡", "code" => "340828201"},
      %{"name" => "青天乡", "code" => "340828202"},
      %{"name" => "包家乡", "code" => "340828203"},
      %{"name" => "古坊乡", "code" => "340828204"},
      %{"name" => "田头乡", "code" => "340828205"},
      %{"name" => "石关乡", "code" => "340828207"},
      %{"name" => "姚河乡", "code" => "340828208"},
      %{"name" => "和平乡", "code" => "340828209"},
      %{"name" => "巍岭乡", "code" => "340828210"},
      %{"name" => "安徽岳西县经济开发区", "code" => "340828400"}
    ]

  def next(input) when input == "安徽安庆经济开发区" or input == "340871",
    do: [%{"name" => "菱北街道", "code" => "340871001"}, %{"name" => "老峰镇", "code" => "340871100"}]

  def next(input) when input == "桐城市" or input == "340881",
    do: [
      %{"name" => "龙腾街道", "code" => "340881001"},
      %{"name" => "文昌街道", "code" => "340881002"},
      %{"name" => "龙眠街道", "code" => "340881003"},
      %{"name" => "孔城镇", "code" => "340881100"},
      %{"name" => "吕亭镇", "code" => "340881101"},
      %{"name" => "范岗镇", "code" => "340881102"},
      %{"name" => "新渡镇", "code" => "340881103"},
      %{"name" => "双港镇", "code" => "340881104"},
      %{"name" => "大关镇", "code" => "340881105"},
      %{"name" => "青草镇", "code" => "340881106"},
      %{"name" => "金神镇", "code" => "340881107"},
      %{"name" => "嬉子湖镇", "code" => "340881108"},
      %{"name" => "唐湾镇", "code" => "340881109"},
      %{"name" => "黄甲镇", "code" => "340881110"},
      %{"name" => "鲟鱼镇", "code" => "340881111"},
      %{"name" => "桐城经济开发区", "code" => "340881400"},
      %{"name" => "桐城双新经济开发区", "code" => "340881401"}
    ]

  def next(input) when input == "潜山市" or input == "340882",
    do: [
      %{"name" => "梅城镇", "code" => "340882100"},
      %{"name" => "源潭镇", "code" => "340882101"},
      %{"name" => "余井镇", "code" => "340882102"},
      %{"name" => "王河镇", "code" => "340882103"},
      %{"name" => "黄铺镇", "code" => "340882104"},
      %{"name" => "槎水镇", "code" => "340882105"},
      %{"name" => "水吼镇", "code" => "340882106"},
      %{"name" => "官庄镇", "code" => "340882107"},
      %{"name" => "黄泥镇", "code" => "340882108"},
      %{"name" => "黄柏镇", "code" => "340882109"},
      %{"name" => "天柱山镇", "code" => "340882110"},
      %{"name" => "塔畈乡", "code" => "340882200"},
      %{"name" => "油坝乡", "code" => "340882201"},
      %{"name" => "龙潭乡", "code" => "340882202"},
      %{"name" => "痘姆乡", "code" => "340882203"},
      %{"name" => "五庙乡", "code" => "340882204"},
      %{"name" => "安徽潜山经济开发区", "code" => "340882400"},
      %{"name" => "旅游度假区", "code" => "340882401"}
    ]

  def next(input) when input == "铜官区" or input == "340705",
    do: [
      %{"name" => "东郊街道", "code" => "340705005"},
      %{"name" => "新城街道", "code" => "340705006"},
      %{"name" => "西湖镇", "code" => "340705100"},
      %{"name" => "铜陵经济技术开发区", "code" => "340705400"},
      %{"name" => "铜陵狮子山高新技术产业开发区", "code" => "340705401"},
      %{"name" => "天井湖社区街道", "code" => "340705402"},
      %{"name" => "映湖社区街道", "code" => "340705403"},
      %{"name" => "五松社区街道", "code" => "340705404"},
      %{"name" => "人民社区街道", "code" => "340705405"},
      %{"name" => "幸福社区街道", "code" => "340705406"},
      %{"name" => "官塘社区街道", "code" => "340705407"},
      %{"name" => "学苑社区街道", "code" => "340705408"},
      %{"name" => "阳光社区街道", "code" => "340705409"},
      %{"name" => "友好社区街道", "code" => "340705410"},
      %{"name" => "螺蛳山社区街道", "code" => "340705411"},
      %{"name" => "露采社区街道", "code" => "340705412"},
      %{"name" => "金口岭社区街道", "code" => "340705413"},
      %{"name" => "鹞山社区街道", "code" => "340705414"},
      %{"name" => "朝阳社区街道", "code" => "340705415"},
      %{"name" => "滨江社区街道", "code" => "340705416"},
      %{"name" => "金山社区街道", "code" => "340705417"},
      %{"name" => "狮子山社区街道", "code" => "340705418"},
      %{"name" => "立新社区街道", "code" => "340705419"}
    ]

  def next(input) when input == "义安区" or input == "340706",
    do: [
      %{"name" => "新桥街道", "code" => "340706001"},
      %{"name" => "五松镇", "code" => "340706100"},
      %{"name" => "顺安镇", "code" => "340706101"},
      %{"name" => "钟鸣镇", "code" => "340706102"},
      %{"name" => "天门镇", "code" => "340706103"},
      %{"name" => "东联镇", "code" => "340706104"},
      %{"name" => "西联镇", "code" => "340706105"},
      %{"name" => "老洲乡", "code" => "340706200"},
      %{"name" => "胥坝乡", "code" => "340706203"},
      %{"name" => "义安经济开发区", "code" => "340706401"}
    ]

  def next(input) when input == "郊区" or input == "340711",
    do: [
      %{"name" => "桥南街道", "code" => "340711001"},
      %{"name" => "安庆矿区街道", "code" => "340711002"},
      %{"name" => "铜山镇", "code" => "340711100"},
      %{"name" => "大通镇", "code" => "340711101"},
      %{"name" => "老洲镇", "code" => "340711102"},
      %{"name" => "陈瑶湖镇", "code" => "340711103"},
      %{"name" => "周潭镇", "code" => "340711104"},
      %{"name" => "郊区直辖村级区划", "code" => "340711198"},
      %{"name" => "灰河乡", "code" => "340711200"},
      %{"name" => "郊区经济开发区", "code" => "340711401"}
    ]

  def next(input) when input == "枞阳县" or input == "340722",
    do: [
      %{"name" => "横埠镇", "code" => "340722106"},
      %{"name" => "项铺镇", "code" => "340722107"},
      %{"name" => "钱桥镇", "code" => "340722108"},
      %{"name" => "麒麟镇", "code" => "340722109"},
      %{"name" => "义津镇", "code" => "340722110"},
      %{"name" => "浮山镇", "code" => "340722111"},
      %{"name" => "会宫镇", "code" => "340722112"},
      %{"name" => "官埠桥镇", "code" => "340722113"},
      %{"name" => "钱铺镇", "code" => "340722114"},
      %{"name" => "金社镇", "code" => "340722115"},
      %{"name" => "白柳镇", "code" => "340722116"},
      %{"name" => "雨坛镇", "code" => "340722117"},
      %{"name" => "枞阳镇", "code" => "340722118"},
      %{"name" => "欧山镇", "code" => "340722119"},
      %{"name" => "汤沟镇", "code" => "340722120"},
      %{"name" => "白梅乡", "code" => "340722205"},
      %{"name" => "枞阳经济开发区", "code" => "340722400"}
    ]

  def next(input) when input == "杜集区" or input == "340602",
    do: [
      %{"name" => "高岳街道", "code" => "340602001"},
      %{"name" => "矿山集街道", "code" => "340602002"},
      %{"name" => "朔里镇", "code" => "340602100"},
      %{"name" => "石台镇", "code" => "340602101"},
      %{"name" => "段园镇", "code" => "340602102"},
      %{"name" => "淮北杜集经济开发区", "code" => "340602400"}
    ]

  def next(input) when input == "相山区" or input == "340603",
    do: [
      %{"name" => "相南街道", "code" => "340603001"},
      %{"name" => "东街道", "code" => "340603002"},
      %{"name" => "西街道", "code" => "340603003"},
      %{"name" => "东山街道", "code" => "340603005"},
      %{"name" => "任圩街道", "code" => "340603008"},
      %{"name" => "南黎街道", "code" => "340603009"},
      %{"name" => "曲阳街道", "code" => "340603010"},
      %{"name" => "三堤口街道", "code" => "340603011"},
      %{"name" => "渠沟镇", "code" => "340603100"},
      %{"name" => "安徽淮北相山经济开发区管理委员会", "code" => "340603400"}
    ]

  def next(input) when input == "烈山区" or input == "340604",
    do: [
      %{"name" => "杨庄街道", "code" => "340604001"},
      %{"name" => "临海童街道", "code" => "340604002"},
      %{"name" => "百善街道", "code" => "340604003"},
      %{"name" => "任楼街道", "code" => "340604004"},
      %{"name" => "烈山镇", "code" => "340604100"},
      %{"name" => "宋疃镇", "code" => "340604101"},
      %{"name" => "古饶镇", "code" => "340604102"},
      %{"name" => "烈山区工业园", "code" => "340604400"}
    ]

  def next(input) when input == "濉溪县" or input == "340621",
    do: [
      %{"name" => "濉溪镇", "code" => "340621100"},
      %{"name" => "韩村镇", "code" => "340621101"},
      %{"name" => "刘桥镇", "code" => "340621102"},
      %{"name" => "五沟镇", "code" => "340621103"},
      %{"name" => "临涣镇", "code" => "340621104"},
      %{"name" => "双堆集镇", "code" => "340621105"},
      %{"name" => "铁佛镇", "code" => "340621106"},
      %{"name" => "南坪镇", "code" => "340621107"},
      %{"name" => "百善镇", "code" => "340621108"},
      %{"name" => "孙疃镇", "code" => "340621109"},
      %{"name" => "四铺镇", "code" => "340621110"},
      %{"name" => "安徽省濉溪经济开发区", "code" => "340621400"},
      %{"name" => "濉溪芜湖现代产业园区", "code" => "340621401"}
    ]

  def next(input) when input == "花山区" or input == "340503",
    do: [
      %{"name" => "沙塘路街道", "code" => "340503001"},
      %{"name" => "解放路街道", "code" => "340503002"},
      %{"name" => "湖东路街道", "code" => "340503003"},
      %{"name" => "桃源路街道", "code" => "340503004"},
      %{"name" => "霍里街道", "code" => "340503005"},
      %{"name" => "金家庄街道", "code" => "340503006"},
      %{"name" => "塘西街道", "code" => "340503007"},
      %{"name" => "慈湖街道", "code" => "340503008"},
      %{"name" => "江东街道", "code" => "340503009"},
      %{"name" => "濮塘镇", "code" => "340503101"},
      %{"name" => "慈湖高新技术产业开发区", "code" => "340503401"}
    ]

  def next(input) when input == "雨山区" or input == "340504",
    do: [
      %{"name" => "平湖街道", "code" => "340504001"},
      %{"name" => "雨山街道", "code" => "340504002"},
      %{"name" => "安民街道", "code" => "340504003"},
      %{"name" => "采石街道", "code" => "340504004"},
      %{"name" => "向山镇", "code" => "340504100"},
      %{"name" => "银塘镇", "code" => "340504101"},
      %{"name" => "佳山乡", "code" => "340504200"},
      %{"name" => "雨山经济开发区", "code" => "340504401"},
      %{"name" => "市经济技术开发区", "code" => "340504402"}
    ]

  def next(input) when input == "博望区" or input == "340506",
    do: [
      %{"name" => "博望镇", "code" => "340506100"},
      %{"name" => "丹阳镇", "code" => "340506101"},
      %{"name" => "新市镇", "code" => "340506102"},
      %{"name" => "博望高新技术产业开发区", "code" => "340506400"}
    ]

  def next(input) when input == "当涂县" or input == "340521",
    do: [
      %{"name" => "姑孰镇", "code" => "340521100"},
      %{"name" => "黄池镇", "code" => "340521101"},
      %{"name" => "乌溪镇", "code" => "340521102"},
      %{"name" => "石桥镇", "code" => "340521103"},
      %{"name" => "塘南镇", "code" => "340521104"},
      %{"name" => "护河镇", "code" => "340521105"},
      %{"name" => "太白镇", "code" => "340521106"},
      %{"name" => "年陡镇", "code" => "340521110"},
      %{"name" => "湖阳镇", "code" => "340521111"},
      %{"name" => "大陇镇", "code" => "340521112"},
      %{"name" => "江心乡", "code" => "340521202"},
      %{"name" => "当涂经济开发区", "code" => "340521400"},
      %{"name" => "当涂大青山李白文化旅游区", "code" => "340521402"},
      %{"name" => "当涂现代农业示范区", "code" => "340521500"}
    ]

  def next(input) when input == "含山县" or input == "340522",
    do: [
      %{"name" => "环峰镇", "code" => "340522100"},
      %{"name" => "运漕镇", "code" => "340522101"},
      %{"name" => "铜闸镇", "code" => "340522102"},
      %{"name" => "陶厂镇", "code" => "340522103"},
      %{"name" => "林头镇", "code" => "340522104"},
      %{"name" => "清溪镇", "code" => "340522105"},
      %{"name" => "仙踪镇", "code" => "340522106"},
      %{"name" => "昭关镇", "code" => "340522107"},
      %{"name" => "安徽含山经济开发区", "code" => "340522401"}
    ]

  def next(input) when input == "和县" or input == "340523",
    do: [
      %{"name" => "历阳镇", "code" => "340523100"},
      %{"name" => "白桥镇", "code" => "340523102"},
      %{"name" => "姥桥镇", "code" => "340523103"},
      %{"name" => "功桥镇", "code" => "340523104"},
      %{"name" => "西埠镇", "code" => "340523105"},
      %{"name" => "香泉镇", "code" => "340523106"},
      %{"name" => "乌江镇", "code" => "340523107"},
      %{"name" => "善厚镇", "code" => "340523108"},
      %{"name" => "石杨镇", "code" => "340523109"},
      %{"name" => "安徽和县经济开发区", "code" => "340523400"},
      %{"name" => "安徽精细化工产业有机合成基地", "code" => "340523401"},
      %{"name" => "安徽和县台湾农民创业园", "code" => "340523500"}
    ]

  def next(input) when input == "大通区" or input == "340402",
    do: [
      %{"name" => "大通街道", "code" => "340402001"},
      %{"name" => "上窑镇", "code" => "340402100"},
      %{"name" => "洛河镇", "code" => "340402101"},
      %{"name" => "九龙岗镇", "code" => "340402102"},
      %{"name" => "孔店乡", "code" => "340402200"},
      %{"name" => "淮南经济开发区", "code" => "340402400"}
    ]

  def next(input) when input == "田家庵区" or input == "340403",
    do: [
      %{"name" => "田东街道", "code" => "340403001"},
      %{"name" => "新淮街道", "code" => "340403002"},
      %{"name" => "国庆街道", "code" => "340403003"},
      %{"name" => "淮滨街道", "code" => "340403004"},
      %{"name" => "朝阳街道", "code" => "340403005"},
      %{"name" => "公园街道", "code" => "340403006"},
      %{"name" => "洞山街道", "code" => "340403007"},
      %{"name" => "龙泉街道", "code" => "340403008"},
      %{"name" => "泉山街道", "code" => "340403009"},
      %{"name" => "舜耕镇", "code" => "340403100"},
      %{"name" => "安成镇", "code" => "340403101"},
      %{"name" => "曹庵镇", "code" => "340403102"},
      %{"name" => "三和镇", "code" => "340403103"},
      %{"name" => "史院乡", "code" => "340403201"}
    ]

  def next(input) when input == "谢家集区" or input == "340404",
    do: [
      %{"name" => "谢家集街道", "code" => "340404001"},
      %{"name" => "蔡家岗街道", "code" => "340404002"},
      %{"name" => "立新街道", "code" => "340404003"},
      %{"name" => "谢三村街道", "code" => "340404004"},
      %{"name" => "平山街道", "code" => "340404005"},
      %{"name" => "望峰岗镇", "code" => "340404100"},
      %{"name" => "李郢孜镇", "code" => "340404101"},
      %{"name" => "唐山镇", "code" => "340404102"},
      %{"name" => "杨公镇", "code" => "340404103"},
      %{"name" => "孙庙乡", "code" => "340404200"},
      %{"name" => "孤堆回族乡", "code" => "340404201"}
    ]

  def next(input) when input == "八公山区" or input == "340405",
    do: [
      %{"name" => "新庄孜街道", "code" => "340405001"},
      %{"name" => "土坝孜街道", "code" => "340405002"},
      %{"name" => "毕家岗街道", "code" => "340405003"},
      %{"name" => "八公山镇", "code" => "340405100"},
      %{"name" => "山王镇", "code" => "340405121"},
      %{"name" => "妙山林场", "code" => "340405400"}
    ]

  def next(input) when input == "潘集区" or input == "340406",
    do: [
      %{"name" => "田集街道", "code" => "340406001"},
      %{"name" => "高皇镇", "code" => "340406100"},
      %{"name" => "平圩镇", "code" => "340406101"},
      %{"name" => "泥河镇", "code" => "340406102"},
      %{"name" => "潘集镇", "code" => "340406103"},
      %{"name" => "芦集镇", "code" => "340406104"},
      %{"name" => "架河镇", "code" => "340406105"},
      %{"name" => "夹沟镇", "code" => "340406106"},
      %{"name" => "祁集镇", "code" => "340406107"},
      %{"name" => "贺疃镇", "code" => "340406108"},
      %{"name" => "古沟回族乡", "code" => "340406202"}
    ]

  def next(input) when input == "凤台县" or input == "340421",
    do: [
      %{"name" => "城关镇", "code" => "340421100"},
      %{"name" => "新集镇", "code" => "340421102"},
      %{"name" => "朱马店镇", "code" => "340421103"},
      %{"name" => "岳张集镇", "code" => "340421104"},
      %{"name" => "顾桥镇", "code" => "340421105"},
      %{"name" => "毛集镇", "code" => "340421106"},
      %{"name" => "夏集镇", "code" => "340421107"},
      %{"name" => "桂集镇", "code" => "340421108"},
      %{"name" => "焦岗湖镇", "code" => "340421109"},
      %{"name" => "凤凰镇", "code" => "340421110"},
      %{"name" => "杨村镇", "code" => "340421111"},
      %{"name" => "丁集镇", "code" => "340421112"},
      %{"name" => "刘集镇", "code" => "340421113"},
      %{"name" => "大兴镇", "code" => "340421114"},
      %{"name" => "尚塘镇", "code" => "340421115"},
      %{"name" => "古店乡", "code" => "340421204"},
      %{"name" => "钱庙乡", "code" => "340421205"},
      %{"name" => "关店乡", "code" => "340421209"},
      %{"name" => "李冲回族乡", "code" => "340421212"}
    ]

  def next(input) when input == "寿县" or input == "340422",
    do: [
      %{"name" => "寿春镇", "code" => "340422100"},
      %{"name" => "双桥镇", "code" => "340422101"},
      %{"name" => "涧沟镇", "code" => "340422102"},
      %{"name" => "丰庄镇", "code" => "340422103"},
      %{"name" => "正阳关镇", "code" => "340422104"},
      %{"name" => "迎河镇", "code" => "340422105"},
      %{"name" => "板桥镇", "code" => "340422106"},
      %{"name" => "安丰塘镇", "code" => "340422107"},
      %{"name" => "堰口镇", "code" => "340422108"},
      %{"name" => "保义镇", "code" => "340422109"},
      %{"name" => "隐贤镇", "code" => "340422110"},
      %{"name" => "安丰镇", "code" => "340422111"},
      %{"name" => "众兴镇", "code" => "340422112"},
      %{"name" => "茶庵镇", "code" => "340422113"},
      %{"name" => "三觉镇", "code" => "340422114"},
      %{"name" => "炎刘镇", "code" => "340422115"},
      %{"name" => "刘岗镇", "code" => "340422116"},
      %{"name" => "双庙集镇", "code" => "340422117"},
      %{"name" => "小甸镇", "code" => "340422118"},
      %{"name" => "瓦埠镇", "code" => "340422119"},
      %{"name" => "大顺镇", "code" => "340422120"},
      %{"name" => "窑口镇", "code" => "340422121"},
      %{"name" => "八公山乡", "code" => "340422200"},
      %{"name" => "张李乡", "code" => "340422201"},
      %{"name" => "陶店回族乡", "code" => "340422203"},
      %{"name" => "安徽寿县经济开发区", "code" => "340422402"},
      %{"name" => "寿西湖农场", "code" => "340422500"},
      %{"name" => "正阳关农场", "code" => "340422501"}
    ]

  def next(input) when input == "龙子湖区" or input == "340302",
    do: [
      %{"name" => "东风街道", "code" => "340302001"},
      %{"name" => "延安街道", "code" => "340302002"},
      %{"name" => "治淮街道", "code" => "340302003"},
      %{"name" => "东升街道", "code" => "340302004"},
      %{"name" => "解放街道", "code" => "340302005"},
      %{"name" => "曹山街道", "code" => "340302006"},
      %{"name" => "李楼乡", "code" => "340302200"}
    ]

  def next(input) when input == "蚌山区" or input == "340303",
    do: [
      %{"name" => "天桥街道", "code" => "340303001"},
      %{"name" => "青年街道", "code" => "340303002"},
      %{"name" => "纬二路街道", "code" => "340303003"},
      %{"name" => "黄庄街道", "code" => "340303004"},
      %{"name" => "宏业村街道", "code" => "340303005"},
      %{"name" => "胜利街道", "code" => "340303010"},
      %{"name" => "龙湖新村街道", "code" => "340303011"},
      %{"name" => "燕山乡", "code" => "340303200"},
      %{"name" => "雪华乡", "code" => "340303201"},
      %{"name" => "湖滨社区行政事务管理中心", "code" => "340303401"},
      %{"name" => "淮河社区行政事务管理中心", "code" => "340303402"}
    ]

  def next(input) when input == "禹会区" or input == "340304",
    do: [
      %{"name" => "大庆街道", "code" => "340304001"},
      %{"name" => "纬四街道", "code" => "340304002"},
      %{"name" => "钓鱼台街道", "code" => "340304003"},
      %{"name" => "张公山街道", "code" => "340304004"},
      %{"name" => "朝阳街道", "code" => "340304005"},
      %{"name" => "马城镇", "code" => "340304101"},
      %{"name" => "长青乡", "code" => "340304200"}
    ]

  def next(input) when input == "淮上区" or input == "340311",
    do: [
      %{"name" => "淮滨街道", "code" => "340311001"},
      %{"name" => "小蚌埠镇", "code" => "340311100"},
      %{"name" => "吴小街镇", "code" => "340311101"},
      %{"name" => "曹老集镇", "code" => "340311102"},
      %{"name" => "梅桥镇", "code" => "340311103"},
      %{"name" => "沫河口镇", "code" => "340311104"},
      %{"name" => "安徽蚌埠淮上经济开发区", "code" => "340311402"}
    ]

  def next(input) when input == "怀远县" or input == "340321",
    do: [
      %{"name" => "引凤街道", "code" => "340321001"},
      %{"name" => "望淮街道", "code" => "340321002"},
      %{"name" => "白乳泉街道", "code" => "340321003"},
      %{"name" => "榴城镇", "code" => "340321100"},
      %{"name" => "包集镇", "code" => "340321101"},
      %{"name" => "龙亢镇", "code" => "340321102"},
      %{"name" => "河溜镇", "code" => "340321103"},
      %{"name" => "常坟镇", "code" => "340321104"},
      %{"name" => "双桥集镇", "code" => "340321106"},
      %{"name" => "魏庄镇", "code" => "340321107"},
      %{"name" => "万福镇", "code" => "340321108"},
      %{"name" => "唐集镇", "code" => "340321109"},
      %{"name" => "白莲坡镇", "code" => "340321110"},
      %{"name" => "褚集镇", "code" => "340321111"},
      %{"name" => "古城镇", "code" => "340321112"},
      %{"name" => "荆山镇", "code" => "340321113"},
      %{"name" => "淝南镇", "code" => "340321114"},
      %{"name" => "陈集镇", "code" => "340321115"},
      %{"name" => "淝河镇", "code" => "340321116"},
      %{"name" => "兰桥镇", "code" => "340321117"},
      %{"name" => "徐圩乡", "code" => "340321205"},
      %{"name" => "龙亢农场", "code" => "340321400"},
      %{"name" => "安徽怀远经济开发区", "code" => "340321401"}
    ]

  def next(input) when input == "五河县" or input == "340322",
    do: [
      %{"name" => "城关镇", "code" => "340322100"},
      %{"name" => "新集镇", "code" => "340322101"},
      %{"name" => "小溪镇", "code" => "340322103"},
      %{"name" => "双忠庙镇", "code" => "340322104"},
      %{"name" => "小圩镇", "code" => "340322105"},
      %{"name" => "东刘集镇", "code" => "340322106"},
      %{"name" => "头铺镇", "code" => "340322107"},
      %{"name" => "大新镇", "code" => "340322108"},
      %{"name" => "武桥镇", "code" => "340322109"},
      %{"name" => "朱顶镇", "code" => "340322110"},
      %{"name" => "浍南镇", "code" => "340322111"},
      %{"name" => "申集镇", "code" => "340322112"},
      %{"name" => "沱湖乡", "code" => "340322200"},
      %{"name" => "临北回族乡", "code" => "340322201"},
      %{"name" => "安徽五河经济开发区", "code" => "340322400"}
    ]

  def next(input) when input == "固镇县" or input == "340323",
    do: [
      %{"name" => "谷阳镇", "code" => "340323100"},
      %{"name" => "王庄镇", "code" => "340323101"},
      %{"name" => "新马桥镇", "code" => "340323102"},
      %{"name" => "连城镇", "code" => "340323103"},
      %{"name" => "刘集镇", "code" => "340323104"},
      %{"name" => "任桥镇", "code" => "340323105"},
      %{"name" => "湖沟镇", "code" => "340323106"},
      %{"name" => "濠城镇", "code" => "340323107"},
      %{"name" => "杨庙镇", "code" => "340323108"},
      %{"name" => "仲兴镇", "code" => "340323109"},
      %{"name" => "石湖乡", "code" => "340323200"},
      %{"name" => "安徽固镇经济开发区", "code" => "340323402"}
    ]

  def next(input) when input == "蚌埠市高新技术开发区" or input == "340371",
    do: [
      %{"name" => "秦集镇", "code" => "340371100"},
      %{"name" => "高新技术开发区管委会", "code" => "340371400"},
      %{"name" => "安徽怀远马城经济开发区", "code" => "340371401"}
    ]

  def next(input) when input == "蚌埠市经济开发区" or input == "340372",
    do: [
      %{"name" => "长淮卫镇", "code" => "340372100"},
      %{"name" => "经济开发区管委会", "code" => "340372400"}
    ]

  def next(input) when input == "镜湖区" or input == "340202",
    do: [
      %{"name" => "方村街道", "code" => "340202012"},
      %{"name" => "张家山街道", "code" => "340202013"},
      %{"name" => "赭麓街道", "code" => "340202014"},
      %{"name" => "范罗山街道", "code" => "340202015"},
      %{"name" => "赭山街道", "code" => "340202016"},
      %{"name" => "弋矶山街道", "code" => "340202017"},
      %{"name" => "汀棠街道", "code" => "340202018"},
      %{"name" => "天门山街道", "code" => "340202019"},
      %{"name" => "大砻坊街道", "code" => "340202020"},
      %{"name" => "荆山街道", "code" => "340202021"}
    ]

  def next(input) when input == "鸠江区" or input == "340207",
    do: [
      %{"name" => "四褐山街道", "code" => "340207001"},
      %{"name" => "裕溪口街道", "code" => "340207002"},
      %{"name" => "官陡街道", "code" => "340207003"},
      %{"name" => "湾里街道", "code" => "340207004"},
      %{"name" => "清水街道", "code" => "340207005"},
      %{"name" => "沈巷镇", "code" => "340207101"},
      %{"name" => "二坝镇", "code" => "340207102"},
      %{"name" => "汤沟镇", "code" => "340207103"},
      %{"name" => "白茆镇", "code" => "340207104"},
      %{"name" => "安徽省江北产业集中区", "code" => "340207401"},
      %{"name" => "安徽芜湖鸠江经济开发区", "code" => "340207402"},
      %{"name" => "鸠江经济开发区二坝园区", "code" => "340207403"}
    ]

  def next(input) when input == "弋江区" or input == "340209",
    do: [
      %{"name" => "中南街道", "code" => "340209001"},
      %{"name" => "马塘街道", "code" => "340209002"},
      %{"name" => "瀂港街道", "code" => "340209003"},
      %{"name" => "火龙街道", "code" => "340209004"},
      %{"name" => "白马街道", "code" => "340209005"},
      %{"name" => "南瑞街道", "code" => "340209006"},
      %{"name" => "芜湖高新技术产业开发区", "code" => "340209400"}
    ]

  def next(input) when input == "湾沚区" or input == "340210",
    do: [
      %{"name" => "湾沚镇", "code" => "340210100"},
      %{"name" => "陶辛镇", "code" => "340210101"},
      %{"name" => "六郎镇", "code" => "340210102"},
      %{"name" => "花桥镇", "code" => "340210103"},
      %{"name" => "红杨镇", "code" => "340210104"},
      %{"name" => "安徽新芜经济开发区", "code" => "340210400"}
    ]

  def next(input) when input == "繁昌区" or input == "340212",
    do: [
      %{"name" => "繁阳镇", "code" => "340212100"},
      %{"name" => "荻港镇", "code" => "340212101"},
      %{"name" => "孙村镇", "code" => "340212102"},
      %{"name" => "平铺镇", "code" => "340212103"},
      %{"name" => "新港镇", "code" => "340212104"},
      %{"name" => "峨山镇", "code" => "340212105"},
      %{"name" => "安徽繁昌工业园区", "code" => "340212401"}
    ]

  def next(input) when input == "南陵县" or input == "340223",
    do: [
      %{"name" => "籍山镇", "code" => "340223100"},
      %{"name" => "许镇镇", "code" => "340223101"},
      %{"name" => "弋江镇", "code" => "340223102"},
      %{"name" => "三里镇", "code" => "340223103"},
      %{"name" => "何湾镇", "code" => "340223104"},
      %{"name" => "工山镇", "code" => "340223105"},
      %{"name" => "烟墩镇", "code" => "340223106"},
      %{"name" => "家发镇", "code" => "340223107"},
      %{"name" => "安徽南陵工业园区", "code" => "340223400"}
    ]

  def next(input) when input == "芜湖经济技术开发区" or input == "340271",
    do: [%{"name" => "龙山街道", "code" => "340271001"}, %{"name" => "万春街道", "code" => "340271002"}]

  def next(input) when input == "安徽芜湖三山经济开发区" or input == "340272",
    do: [
      %{"name" => "保定街道", "code" => "340272002"},
      %{"name" => "龙湖街道", "code" => "340272003"},
      %{"name" => "高安街道", "code" => "340272004"},
      %{"name" => "三山街道", "code" => "340272005"},
      %{"name" => "峨桥镇", "code" => "340272100"}
    ]

  def next(input) when input == "无为市" or input == "340281",
    do: [
      %{"name" => "无城镇", "code" => "340281100"},
      %{"name" => "襄安镇", "code" => "340281101"},
      %{"name" => "陡沟镇", "code" => "340281104"},
      %{"name" => "石涧镇", "code" => "340281105"},
      %{"name" => "严桥镇", "code" => "340281106"},
      %{"name" => "开城镇", "code" => "340281107"},
      %{"name" => "蜀山镇", "code" => "340281108"},
      %{"name" => "牛埠镇", "code" => "340281109"},
      %{"name" => "刘渡镇", "code" => "340281110"},
      %{"name" => "姚沟镇", "code" => "340281111"},
      %{"name" => "泥汊镇", "code" => "340281112"},
      %{"name" => "福渡镇", "code" => "340281114"},
      %{"name" => "泉塘镇", "code" => "340281115"},
      %{"name" => "赫店镇", "code" => "340281116"},
      %{"name" => "红庙镇", "code" => "340281117"},
      %{"name" => "高沟镇", "code" => "340281118"},
      %{"name" => "鹤毛镇", "code" => "340281119"},
      %{"name" => "十里墩镇", "code" => "340281120"},
      %{"name" => "昆山镇", "code" => "340281121"},
      %{"name" => "洪巷镇", "code" => "340281122"},
      %{"name" => "安徽无为经济开发区", "code" => "340281400"}
    ]

  def next(input) when input == "瑶海区" or input == "340102",
    do: [
      %{"name" => "明光路街道", "code" => "340102001"},
      %{"name" => "胜利路街道", "code" => "340102003"},
      %{"name" => "三里街街道", "code" => "340102004"},
      %{"name" => "铜陵路街道", "code" => "340102005"},
      %{"name" => "七里站街道", "code" => "340102006"},
      %{"name" => "红光街道", "code" => "340102007"},
      %{"name" => "和平路街道", "code" => "340102008"},
      %{"name" => "城东街道", "code" => "340102010"},
      %{"name" => "长淮街道", "code" => "340102011"},
      %{"name" => "方庙街道", "code" => "340102012"},
      %{"name" => "嘉山路街道", "code" => "340102014"},
      %{"name" => "大兴镇", "code" => "340102100"},
      %{"name" => "合肥龙岗综合经济开发区", "code" => "340102401"}
    ]

  def next(input) when input == "庐阳区" or input == "340103",
    do: [
      %{"name" => "亳州路街道", "code" => "340103001"},
      %{"name" => "双岗街道", "code" => "340103002"},
      %{"name" => "杏林街道", "code" => "340103003"},
      %{"name" => "海棠街道", "code" => "340103004"},
      %{"name" => "杏花村街道", "code" => "340103005"},
      %{"name" => "逍遥津街道", "code" => "340103006"},
      %{"name" => "三孝口街道", "code" => "340103009"},
      %{"name" => "四里河街道", "code" => "340103012"},
      %{"name" => "大杨镇", "code" => "340103100"},
      %{"name" => "三十岗乡", "code" => "340103200"},
      %{"name" => "庐阳工业区（林店街道）", "code" => "340103400"}
    ]

  def next(input) when input == "蜀山区" or input == "340104",
    do: [
      %{"name" => "三里庵街道", "code" => "340104001"},
      %{"name" => "稻香村街道", "code" => "340104002"},
      %{"name" => "琥珀街道", "code" => "340104003"},
      %{"name" => "南七街道", "code" => "340104004"},
      %{"name" => "西园街道", "code" => "340104005"},
      %{"name" => "五里墩街道", "code" => "340104006"},
      %{"name" => "荷叶地街道", "code" => "340104007"},
      %{"name" => "笔架山街道", "code" => "340104008"},
      %{"name" => "井岗镇", "code" => "340104100"},
      %{"name" => "南岗镇", "code" => "340104101"},
      %{"name" => "小庙镇", "code" => "340104102"},
      %{"name" => "蜀山新产业园区", "code" => "340104400"}
    ]

  def next(input) when input == "包河区" or input == "340111",
    do: [
      %{"name" => "骆岗街道", "code" => "340111001"},
      %{"name" => "常青街道", "code" => "340111002"},
      %{"name" => "芜湖路街道", "code" => "340111003"},
      %{"name" => "包公街道", "code" => "340111004"},
      %{"name" => "望湖街道", "code" => "340111005"},
      %{"name" => "义城街道", "code" => "340111006"},
      %{"name" => "烟墩街道", "code" => "340111007"},
      %{"name" => "万年埠街道", "code" => "340111010"},
      %{"name" => "同安街道", "code" => "340111011"},
      %{"name" => "淝河镇", "code" => "340111100"},
      %{"name" => "大圩镇", "code" => "340111102"},
      %{"name" => "滨湖世纪社区", "code" => "340111400"},
      %{"name" => "方兴社区", "code" => "340111401"}
    ]

  def next(input) when input == "长丰县" or input == "340121",
    do: [
      %{"name" => "水湖镇", "code" => "340121100"},
      %{"name" => "庄墓镇", "code" => "340121101"},
      %{"name" => "杨庙镇", "code" => "340121102"},
      %{"name" => "吴山镇", "code" => "340121103"},
      %{"name" => "岗集镇", "code" => "340121104"},
      %{"name" => "双墩镇", "code" => "340121105"},
      %{"name" => "下塘镇", "code" => "340121106"},
      %{"name" => "朱巷镇", "code" => "340121107"},
      %{"name" => "陶楼镇", "code" => "340121109"},
      %{"name" => "杜集镇", "code" => "340121110"},
      %{"name" => "义井镇", "code" => "340121111"},
      %{"name" => "左店镇", "code" => "340121112"},
      %{"name" => "罗塘乡", "code" => "340121200"},
      %{"name" => "造甲乡", "code" => "340121203"},
      %{"name" => "双凤开发区", "code" => "340121400"},
      %{"name" => "安徽省水家湖农场", "code" => "340121401"}
    ]

  def next(input) when input == "肥东县" or input == "340122",
    do: [
      %{"name" => "店埠镇", "code" => "340122100"},
      %{"name" => "撮镇镇", "code" => "340122101"},
      %{"name" => "梁园镇", "code" => "340122102"},
      %{"name" => "桥头集镇", "code" => "340122103"},
      %{"name" => "长临河镇", "code" => "340122104"},
      %{"name" => "石塘镇", "code" => "340122105"},
      %{"name" => "古城镇", "code" => "340122106"},
      %{"name" => "八斗镇", "code" => "340122107"},
      %{"name" => "元疃镇", "code" => "340122108"},
      %{"name" => "白龙镇", "code" => "340122109"},
      %{"name" => "包公镇", "code" => "340122110"},
      %{"name" => "陈集镇", "code" => "340122111"},
      %{"name" => "众兴乡", "code" => "340122200"},
      %{"name" => "张集乡", "code" => "340122201"},
      %{"name" => "马湖乡", "code" => "340122202"},
      %{"name" => "响导乡", "code" => "340122204"},
      %{"name" => "杨店乡", "code" => "340122205"},
      %{"name" => "牌坊回族满族乡", "code" => "340122206"},
      %{"name" => "肥东经济开发区管理委员会", "code" => "340122401"},
      %{"name" => "合肥循环经济示范园", "code" => "340122402"}
    ]

  def next(input) when input == "肥西县" or input == "340123",
    do: [
      %{"name" => "上派镇", "code" => "340123100"},
      %{"name" => "三河镇", "code" => "340123101"},
      %{"name" => "官亭镇", "code" => "340123103"},
      %{"name" => "山南镇", "code" => "340123105"},
      %{"name" => "花岗镇", "code" => "340123106"},
      %{"name" => "紫蓬镇", "code" => "340123107"},
      %{"name" => "桃花镇", "code" => "340123108"},
      %{"name" => "丰乐镇", "code" => "340123109"},
      %{"name" => "高店镇", "code" => "340123111"},
      %{"name" => "严店镇", "code" => "340123112"},
      %{"name" => "铭传乡", "code" => "340123201"},
      %{"name" => "柿树岗乡", "code" => "340123202"},
      %{"name" => "安徽肥西经济开发区", "code" => "340123400"},
      %{"name" => "紫蓬山管委会", "code" => "340123401"}
    ]

  def next(input) when input == "庐江县" or input == "340124",
    do: [
      %{"name" => "东顾山街道", "code" => "340124001"},
      %{"name" => "岗湾街道", "code" => "340124002"},
      %{"name" => "移湖街道", "code" => "340124003"},
      %{"name" => "庐城镇", "code" => "340124100"},
      %{"name" => "冶父山镇", "code" => "340124101"},
      %{"name" => "万山镇", "code" => "340124102"},
      %{"name" => "汤池镇", "code" => "340124103"},
      %{"name" => "郭河镇", "code" => "340124104"},
      %{"name" => "金牛镇", "code" => "340124105"},
      %{"name" => "石头镇", "code" => "340124106"},
      %{"name" => "同大镇", "code" => "340124107"},
      %{"name" => "白山镇", "code" => "340124108"},
      %{"name" => "盛桥镇", "code" => "340124109"},
      %{"name" => "白湖镇", "code" => "340124110"},
      %{"name" => "龙桥镇", "code" => "340124111"},
      %{"name" => "矾山镇", "code" => "340124112"},
      %{"name" => "罗河镇", "code" => "340124113"},
      %{"name" => "泥河镇", "code" => "340124114"},
      %{"name" => "乐桥镇", "code" => "340124115"},
      %{"name" => "柯坦镇", "code" => "340124116"},
      %{"name" => "安徽合肥庐江高新技术产业开发区", "code" => "340124400"},
      %{"name" => "白湖监狱生活社区", "code" => "340124401"},
      %{"name" => "台创园管委会", "code" => "340124404"},
      %{"name" => "庐江化工园", "code" => "340124405"}
    ]

  def next(input) when input == "合肥高新技术产业开发区" or input == "340176",
    do: [
      %{"name" => "天乐社区服务中心", "code" => "340176401"},
      %{"name" => "兴园社区服务中心", "code" => "340176402"},
      %{"name" => "蜀麓社区服务中心", "code" => "340176403"},
      %{"name" => "长宁社区服务中心", "code" => "340176404"},
      %{"name" => "小庙托管区", "code" => "340176405"},
      %{"name" => "城西桥社区服务中心", "code" => "340176408"}
    ]

  def next(input) when input == "合肥经济技术开发区" or input == "340177",
    do: [
      %{"name" => "高刘街道", "code" => "340177006"},
      %{"name" => "新港工业园", "code" => "340177400"},
      %{"name" => "合淮合作区", "code" => "340177401"},
      %{"name" => "莲花社区", "code" => "340177402"},
      %{"name" => "芙蓉社区", "code" => "340177403"},
      %{"name" => "锦绣社区", "code" => "340177404"},
      %{"name" => "海恒社区", "code" => "340177405"},
      %{"name" => "临湖社区", "code" => "340177406"}
    ]

  def next(input) when input == "合肥新站高新技术产业开发区" or input == "340178",
    do: [
      %{"name" => "七里塘街道", "code" => "340178001"},
      %{"name" => "磨店街道", "code" => "340178002"},
      %{"name" => "三十头街道", "code" => "340178003"},
      %{"name" => "瑶海社区服务中心", "code" => "340178400"},
      %{"name" => "站北社区服务中心", "code" => "340178401"}
    ]

  def next(input) when input == "巢湖市" or input == "340181",
    do: [
      %{"name" => "中庙街道", "code" => "340181001"},
      %{"name" => "亚父街道", "code" => "340181002"},
      %{"name" => "卧牛山街道", "code" => "340181003"},
      %{"name" => "凤凰山街道", "code" => "340181004"},
      %{"name" => "天河街道", "code" => "340181005"},
      %{"name" => "半汤街道", "code" => "340181006"},
      %{"name" => "栏杆集镇", "code" => "340181100"},
      %{"name" => "苏湾镇", "code" => "340181101"},
      %{"name" => "柘皋镇", "code" => "340181102"},
      %{"name" => "银屏镇", "code" => "340181103"},
      %{"name" => "夏阁镇", "code" => "340181104"},
      %{"name" => "中垾镇", "code" => "340181105"},
      %{"name" => "散兵镇", "code" => "340181106"},
      %{"name" => "烔炀镇", "code" => "340181107"},
      %{"name" => "黄麓镇", "code" => "340181108"},
      %{"name" => "槐林镇", "code" => "340181109"},
      %{"name" => "坝镇镇", "code" => "340181110"},
      %{"name" => "庙岗镇", "code" => "340181111"}
    ]

  def next(_), do: nil
end