defmodule ChinaAdminDivisions.Gen.Lv3x.M34 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "宣州区" or input == "341802",
    do: [
      %{"name" => "西林街道", "code" => "341802001000"},
      %{"name" => "澄江街道", "code" => "341802002000"},
      %{"name" => "鳌峰街道", "code" => "341802003000"},
      %{"name" => "济川街道", "code" => "341802004000"},
      %{"name" => "敬亭山街道", "code" => "341802005000"},
      %{"name" => "双桥街道", "code" => "341802006000"},
      %{"name" => "向阳街道", "code" => "341802009000"},
      %{"name" => "水阳镇", "code" => "341802100000"},
      %{"name" => "狸桥镇", "code" => "341802101000"},
      %{"name" => "沈村镇", "code" => "341802102000"},
      %{"name" => "古泉镇", "code" => "341802103000"},
      %{"name" => "洪林镇", "code" => "341802104000"},
      %{"name" => "寒亭镇", "code" => "341802105000"},
      %{"name" => "文昌镇", "code" => "341802106000"},
      %{"name" => "孙埠镇", "code" => "341802107000"},
      %{"name" => "杨柳镇", "code" => "341802109000"},
      %{"name" => "水东镇", "code" => "341802110000"},
      %{"name" => "新田镇", "code" => "341802111000"},
      %{"name" => "周王镇", "code" => "341802112000"},
      %{"name" => "溪口镇", "code" => "341802113000"},
      %{"name" => "朱桥乡", "code" => "341802200000"},
      %{"name" => "养贤乡", "code" => "341802201000"},
      %{"name" => "五星乡", "code" => "341802202000"},
      %{"name" => "黄渡乡", "code" => "341802204000"}
    ]

  def next(input) when input == "郎溪县" or input == "341821",
    do: [
      %{"name" => "郎步街道", "code" => "341821001000"},
      %{"name" => "郎川街道", "code" => "341821002000"},
      %{"name" => "钟桥街道", "code" => "341821003000"},
      %{"name" => "建平镇", "code" => "341821100000"},
      %{"name" => "十字镇", "code" => "341821101000"},
      %{"name" => "新发镇", "code" => "341821102000"},
      %{"name" => "涛城镇", "code" => "341821103000"},
      %{"name" => "梅渚镇", "code" => "341821105000"},
      %{"name" => "毕桥镇", "code" => "341821107000"},
      %{"name" => "飞鲤镇", "code" => "341821108000"},
      %{"name" => "凌笪镇", "code" => "341821109000"},
      %{"name" => "姚村镇", "code" => "341821110000"},
      %{"name" => "郎溪经济开发区", "code" => "341821400000"},
      %{"name" => "安徽省国营十字铺茶场", "code" => "341821500000"},
      %{"name" => "上海市白茅岭监狱", "code" => "341821501000"}
    ]

  def next(input) when input == "泾县" or input == "341823",
    do: [
      %{"name" => "泾川镇", "code" => "341823100000"},
      %{"name" => "茂林镇", "code" => "341823101000"},
      %{"name" => "榔桥镇", "code" => "341823102000"},
      %{"name" => "桃花潭镇", "code" => "341823103000"},
      %{"name" => "琴溪镇", "code" => "341823104000"},
      %{"name" => "蔡村镇", "code" => "341823105000"},
      %{"name" => "云岭镇", "code" => "341823106000"},
      %{"name" => "黄村镇", "code" => "341823107000"},
      %{"name" => "丁家桥镇", "code" => "341823108000"},
      %{"name" => "汀溪乡", "code" => "341823200000"},
      %{"name" => "昌桥乡", "code" => "341823201000"}
    ]

  def next(input) when input == "绩溪县" or input == "341824",
    do: [
      %{"name" => "华阳镇", "code" => "341824100000"},
      %{"name" => "临溪镇", "code" => "341824101000"},
      %{"name" => "长安镇", "code" => "341824102000"},
      %{"name" => "上庄镇", "code" => "341824103000"},
      %{"name" => "扬溪镇", "code" => "341824104000"},
      %{"name" => "伏岭镇", "code" => "341824105000"},
      %{"name" => "金沙镇", "code" => "341824106000"},
      %{"name" => "瀛洲镇", "code" => "341824107000"},
      %{"name" => "板桥头乡", "code" => "341824201000"},
      %{"name" => "家朋乡", "code" => "341824202000"},
      %{"name" => "荆州乡", "code" => "341824203000"},
      %{"name" => "安徽绩溪经济开发区", "code" => "341824400000"}
    ]

  def next(input) when input == "旌德县" or input == "341825",
    do: [
      %{"name" => "旌阳镇", "code" => "341825100000"},
      %{"name" => "蔡家桥镇", "code" => "341825101000"},
      %{"name" => "三溪镇", "code" => "341825102000"},
      %{"name" => "庙首镇", "code" => "341825103000"},
      %{"name" => "白地镇", "code" => "341825104000"},
      %{"name" => "俞村镇", "code" => "341825105000"},
      %{"name" => "兴隆镇", "code" => "341825106000"},
      %{"name" => "孙村镇", "code" => "341825107000"},
      %{"name" => "版书镇", "code" => "341825108000"},
      %{"name" => "云乐镇", "code" => "341825109000"}
    ]

  def next(input) when input == "宣城市经济开发区" or input == "341871",
    do: [
      %{"name" => "天湖街道", "code" => "341871001000"},
      %{"name" => "飞彩街道", "code" => "341871002000"},
      %{"name" => "金坝街道", "code" => "341871003000"}
    ]

  def next(input) when input == "宁国市" or input == "341881",
    do: [
      %{"name" => "西津街道", "code" => "341881001000"},
      %{"name" => "南山街道", "code" => "341881002000"},
      %{"name" => "河沥溪街道", "code" => "341881003000"},
      %{"name" => "汪溪街道", "code" => "341881004000"},
      %{"name" => "竹峰街道", "code" => "341881005000"},
      %{"name" => "港口镇", "code" => "341881100000"},
      %{"name" => "梅林镇", "code" => "341881101000"},
      %{"name" => "中溪镇", "code" => "341881102000"},
      %{"name" => "宁墩镇", "code" => "341881103000"},
      %{"name" => "仙霞镇", "code" => "341881104000"},
      %{"name" => "甲路镇", "code" => "341881105000"},
      %{"name" => "胡乐镇", "code" => "341881106000"},
      %{"name" => "霞西镇", "code" => "341881107000"},
      %{"name" => "云梯畲族乡", "code" => "341881200000"},
      %{"name" => "南极乡", "code" => "341881201000"},
      %{"name" => "万家乡", "code" => "341881202000"},
      %{"name" => "青龙乡", "code" => "341881203000"},
      %{"name" => "方塘乡", "code" => "341881204000"},
      %{"name" => "经济技术开发区", "code" => "341881400000"}
    ]

  def next(input) when input == "广德市" or input == "341882",
    do: [
      %{"name" => "桐汭街道", "code" => "341882001000"},
      %{"name" => "祠山街道", "code" => "341882002000"},
      %{"name" => "升平街道", "code" => "341882003000"},
      %{"name" => "桃州镇", "code" => "341882100000"},
      %{"name" => "柏垫镇", "code" => "341882101000"},
      %{"name" => "誓节镇", "code" => "341882102000"},
      %{"name" => "邱村镇", "code" => "341882103000"},
      %{"name" => "新杭镇", "code" => "341882104000"},
      %{"name" => "杨滩镇", "code" => "341882105000"},
      %{"name" => "卢村乡", "code" => "341882200000"},
      %{"name" => "东亭乡", "code" => "341882201000"},
      %{"name" => "四合乡", "code" => "341882202000"},
      %{"name" => "广德经济开发区", "code" => "341882400000"}
    ]

  def next(input) when input == "贵池区" or input == "341702",
    do: [
      %{"name" => "池阳街道", "code" => "341702001000"},
      %{"name" => "秋浦街道", "code" => "341702002000"},
      %{"name" => "里山街道", "code" => "341702003000"},
      %{"name" => "江口街道", "code" => "341702004000"},
      %{"name" => "马衙街道", "code" => "341702005000"},
      %{"name" => "墩上街道", "code" => "341702006000"},
      %{"name" => "梅龙街道", "code" => "341702007000"},
      %{"name" => "秋江街道", "code" => "341702008000"},
      %{"name" => "杏花村街道", "code" => "341702009000"},
      %{"name" => "清风街道", "code" => "341702010000"},
      %{"name" => "清溪街道", "code" => "341702011000"},
      %{"name" => "殷汇镇", "code" => "341702100000"},
      %{"name" => "牛头山镇", "code" => "341702101000"},
      %{"name" => "涓桥镇", "code" => "341702102000"},
      %{"name" => "梅街镇", "code" => "341702103000"},
      %{"name" => "梅村镇", "code" => "341702104000"},
      %{"name" => "唐田镇", "code" => "341702105000"},
      %{"name" => "牌楼镇", "code" => "341702106000"},
      %{"name" => "乌沙镇", "code" => "341702107000"},
      %{"name" => "棠溪镇", "code" => "341702108000"},
      %{"name" => "安徽池州高新技术产业开发区", "code" => "341702400000"},
      %{"name" => "池州经济技术开发区", "code" => "341702401000"},
      %{"name" => "平天湖风景区", "code" => "341702402000"},
      %{"name" => "皖江江南新兴产业集中区", "code" => "341702404000"},
      %{"name" => "池州承接产业转移集中示范园区", "code" => "341702405000"},
      %{"name" => "池州市杏花村文化旅游区", "code" => "341702406000"}
    ]

  def next(input) when input == "东至县" or input == "341721",
    do: [
      %{"name" => "尧渡镇", "code" => "341721100000"},
      %{"name" => "东流镇", "code" => "341721101000"},
      %{"name" => "大渡口镇", "code" => "341721102000"},
      %{"name" => "胜利镇", "code" => "341721103000"},
      %{"name" => "张溪镇", "code" => "341721104000"},
      %{"name" => "洋湖镇", "code" => "341721105000"},
      %{"name" => "葛公镇", "code" => "341721106000"},
      %{"name" => "香隅镇", "code" => "341721107000"},
      %{"name" => "官港镇", "code" => "341721108000"},
      %{"name" => "昭潭镇", "code" => "341721109000"},
      %{"name" => "龙泉镇", "code" => "341721110000"},
      %{"name" => "泥溪镇", "code" => "341721111000"},
      %{"name" => "花园乡", "code" => "341721200000"},
      %{"name" => "木塔乡", "code" => "341721201000"},
      %{"name" => "青山乡", "code" => "341721202000"},
      %{"name" => "东至经济开发区", "code" => "341721400000"},
      %{"name" => "大渡口经济开发区", "code" => "341721401000"}
    ]

  def next(input) when input == "石台县" or input == "341722",
    do: [
      %{"name" => "仁里镇", "code" => "341722100000"},
      %{"name" => "七都镇", "code" => "341722101000"},
      %{"name" => "仙寓镇", "code" => "341722102000"},
      %{"name" => "丁香镇", "code" => "341722103000"},
      %{"name" => "小河镇", "code" => "341722104000"},
      %{"name" => "横渡镇", "code" => "341722105000"},
      %{"name" => "大演乡", "code" => "341722200000"},
      %{"name" => "矶滩乡", "code" => "341722201000"},
      %{"name" => "池州经济技术开发区石台工业园区", "code" => "341722401000"}
    ]

  def next(input) when input == "青阳县" or input == "341723",
    do: [
      %{"name" => "蓉城镇", "code" => "341723100000"},
      %{"name" => "木镇镇", "code" => "341723101000"},
      %{"name" => "庙前镇", "code" => "341723102000"},
      %{"name" => "陵阳镇", "code" => "341723103000"},
      %{"name" => "新河镇", "code" => "341723104000"},
      %{"name" => "丁桥镇", "code" => "341723105000"},
      %{"name" => "朱备镇", "code" => "341723106000"},
      %{"name" => "杨田镇", "code" => "341723107000"},
      %{"name" => "九华镇", "code" => "341723108000"},
      %{"name" => "酉华镇", "code" => "341723109000"},
      %{"name" => "乔木乡", "code" => "341723200000"},
      %{"name" => "杜村乡", "code" => "341723202000"},
      %{"name" => "九华乡", "code" => "341723203000"},
      %{"name" => "青阳县开发区", "code" => "341723400000"}
    ]

  def next(input) when input == "谯城区" or input == "341602",
    do: [
      %{"name" => "花戏楼街道", "code" => "341602001000"},
      %{"name" => "薛阁街道", "code" => "341602002000"},
      %{"name" => "汤陵街道", "code" => "341602003000"},
      %{"name" => "古井镇", "code" => "341602100000"},
      %{"name" => "芦庙镇", "code" => "341602101000"},
      %{"name" => "华佗镇", "code" => "341602102000"},
      %{"name" => "魏岗镇", "code" => "341602103000"},
      %{"name" => "牛集镇", "code" => "341602104000"},
      %{"name" => "颜集镇", "code" => "341602105000"},
      %{"name" => "五马镇", "code" => "341602106000"},
      %{"name" => "十八里镇", "code" => "341602107000"},
      %{"name" => "谯东镇", "code" => "341602108000"},
      %{"name" => "十九里镇", "code" => "341602109000"},
      %{"name" => "沙土镇", "code" => "341602110000"},
      %{"name" => "观堂镇", "code" => "341602111000"},
      %{"name" => "大杨镇", "code" => "341602112000"},
      %{"name" => "城父镇", "code" => "341602113000"},
      %{"name" => "十河镇", "code" => "341602114000"},
      %{"name" => "双沟镇", "code" => "341602115000"},
      %{"name" => "淝河镇", "code" => "341602116000"},
      %{"name" => "古城镇", "code" => "341602117000"},
      %{"name" => "龙扬镇", "code" => "341602118000"},
      %{"name" => "立德镇", "code" => "341602119000"},
      %{"name" => "张店乡", "code" => "341602200000"},
      %{"name" => "赵桥乡", "code" => "341602201000"},
      %{"name" => "亳州高新技术产业开发区", "code" => "341602400000"},
      %{"name" => "谯城经济开发区", "code" => "341602401000"},
      %{"name" => "亳州芜湖现代产业园区", "code" => "341602403000"}
    ]

  def next(input) when input == "涡阳县" or input == "341621",
    do: [
      %{"name" => "城关街道", "code" => "341621001000"},
      %{"name" => "星园街道", "code" => "341621003000"},
      %{"name" => "天静宫街道", "code" => "341621004000"},
      %{"name" => "西阳镇", "code" => "341621103000"},
      %{"name" => "涡南镇", "code" => "341621104000"},
      %{"name" => "楚店镇", "code" => "341621105000"},
      %{"name" => "高公镇", "code" => "341621106000"},
      %{"name" => "高炉镇", "code" => "341621108000"},
      %{"name" => "曹市镇", "code" => "341621109000"},
      %{"name" => "青疃镇", "code" => "341621110000"},
      %{"name" => "石弓镇", "code" => "341621111000"},
      %{"name" => "龙山镇", "code" => "341621112000"},
      %{"name" => "义门镇", "code" => "341621113000"},
      %{"name" => "新兴镇", "code" => "341621114000"},
      %{"name" => "临湖镇", "code" => "341621115000"},
      %{"name" => "丹城镇", "code" => "341621116000"},
      %{"name" => "马店集镇", "code" => "341621117000"},
      %{"name" => "花沟镇", "code" => "341621118000"},
      %{"name" => "店集镇", "code" => "341621119000"},
      %{"name" => "陈大镇", "code" => "341621120000"},
      %{"name" => "牌坊镇", "code" => "341621121000"},
      %{"name" => "公吉寺镇", "code" => "341621122000"},
      %{"name" => "标里镇", "code" => "341621123000"},
      %{"name" => "安徽涡阳经济开发区", "code" => "341621402000"}
    ]

  def next(input) when input == "蒙城县" or input == "341622",
    do: [
      %{"name" => "漆园街道", "code" => "341622001000"},
      %{"name" => "庄周街道", "code" => "341622002000"},
      %{"name" => "城关街道", "code" => "341622003000"},
      %{"name" => "双涧镇", "code" => "341622101000"},
      %{"name" => "小涧镇", "code" => "341622102000"},
      %{"name" => "坛城镇", "code" => "341622104000"},
      %{"name" => "许疃镇", "code" => "341622106000"},
      %{"name" => "板桥集镇", "code" => "341622107000"},
      %{"name" => "马集镇", "code" => "341622108000"},
      %{"name" => "岳坊镇", "code" => "341622109000"},
      %{"name" => "立仓镇", "code" => "341622110000"},
      %{"name" => "楚村镇", "code" => "341622111000"},
      %{"name" => "乐土镇", "code" => "341622112000"},
      %{"name" => "三义镇", "code" => "341622113000"},
      %{"name" => "篱笆镇", "code" => "341622114000"},
      %{"name" => "王集乡", "code" => "341622201000"},
      %{"name" => "小辛集乡", "code" => "341622202000"},
      %{"name" => "安徽蒙城经济开发区管理委员会", "code" => "341622400000"},
      %{"name" => "淮北矿业集团有限责任公司许疃煤矿", "code" => "341622401000"}
    ]

  def next(input) when input == "利辛县" or input == "341623",
    do: [
      %{"name" => "城关镇", "code" => "341623100000"},
      %{"name" => "阚疃镇", "code" => "341623101000"},
      %{"name" => "张村镇", "code" => "341623102000"},
      %{"name" => "江集镇", "code" => "341623103000"},
      %{"name" => "旧城镇", "code" => "341623104000"},
      %{"name" => "西潘楼镇", "code" => "341623105000"},
      %{"name" => "孙集镇", "code" => "341623106000"},
      %{"name" => "汝集镇", "code" => "341623107000"},
      %{"name" => "巩店镇", "code" => "341623108000"},
      %{"name" => "王人镇", "code" => "341623109000"},
      %{"name" => "王市镇", "code" => "341623110000"},
      %{"name" => "永兴镇", "code" => "341623111000"},
      %{"name" => "马店孜镇", "code" => "341623112000"},
      %{"name" => "大李集镇", "code" => "341623113000"},
      %{"name" => "胡集镇", "code" => "341623114000"},
      %{"name" => "展沟镇", "code" => "341623115000"},
      %{"name" => "程家集镇", "code" => "341623116000"},
      %{"name" => "中疃镇", "code" => "341623117000"},
      %{"name" => "望疃镇", "code" => "341623118000"},
      %{"name" => "城北镇", "code" => "341623119000"},
      %{"name" => "纪王场乡", "code" => "341623203000"},
      %{"name" => "孙庙乡", "code" => "341623204000"},
      %{"name" => "新张集乡", "code" => "341623205000"},
      %{"name" => "利辛县工业园区", "code" => "341623401000"},
      %{"name" => "利辛县煤电产业园区", "code" => "341623402000"}
    ]

  def next(input) when input == "金安区" or input == "341502",
    do: [
      %{"name" => "中市街道", "code" => "341502001000"},
      %{"name" => "东市街道", "code" => "341502002000"},
      %{"name" => "三里桥街道", "code" => "341502003000"},
      %{"name" => "望城街道", "code" => "341502004000"},
      %{"name" => "清水河街道", "code" => "341502005000"},
      %{"name" => "木厂镇", "code" => "341502100000"},
      %{"name" => "马头镇", "code" => "341502101000"},
      %{"name" => "东桥镇", "code" => "341502102000"},
      %{"name" => "张店镇", "code" => "341502103000"},
      %{"name" => "毛坦厂镇", "code" => "341502104000"},
      %{"name" => "东河口镇", "code" => "341502105000"},
      %{"name" => "双河镇", "code" => "341502106000"},
      %{"name" => "施桥镇", "code" => "341502107000"},
      %{"name" => "孙岗镇", "code" => "341502108000"},
      %{"name" => "三十铺镇", "code" => "341502109000"},
      %{"name" => "椿树镇", "code" => "341502110000"},
      %{"name" => "城北镇", "code" => "341502111000"},
      %{"name" => "中店镇", "code" => "341502112000"},
      %{"name" => "先生店镇", "code" => "341502113000"},
      %{"name" => "翁墩乡", "code" => "341502201000"},
      %{"name" => "淠东乡", "code" => "341502202000"},
      %{"name" => "横塘岗乡", "code" => "341502204000"},
      %{"name" => "六安经济开发区", "code" => "341502400000"}
    ]

  def next(input) when input == "裕安区" or input == "341503",
    do: [
      %{"name" => "鼓楼街道", "code" => "341503001000"},
      %{"name" => "西市街道", "code" => "341503002000"},
      %{"name" => "小华山街道", "code" => "341503003000"},
      %{"name" => "苏埠镇", "code" => "341503100000"},
      %{"name" => "韩摆渡镇", "code" => "341503101000"},
      %{"name" => "新安镇", "code" => "341503102000"},
      %{"name" => "顺河镇", "code" => "341503103000"},
      %{"name" => "独山镇", "code" => "341503104000"},
      %{"name" => "石婆店镇", "code" => "341503105000"},
      %{"name" => "城南镇", "code" => "341503106000"},
      %{"name" => "丁集镇", "code" => "341503107000"},
      %{"name" => "固镇镇", "code" => "341503108000"},
      %{"name" => "徐集镇", "code" => "341503109000"},
      %{"name" => "分路口镇", "code" => "341503110000"},
      %{"name" => "江家店镇", "code" => "341503111000"},
      %{"name" => "单王乡", "code" => "341503200000"},
      %{"name" => "青山乡", "code" => "341503201000"},
      %{"name" => "石板冲乡", "code" => "341503202000"},
      %{"name" => "西河口乡", "code" => "341503203000"},
      %{"name" => "平桥乡", "code" => "341503204000"},
      %{"name" => "罗集乡", "code" => "341503205000"},
      %{"name" => "狮子岗乡", "code" => "341503206000"},
      %{"name" => "六安高新技术产业开发区", "code" => "341503400000"}
    ]

  def next(input) when input == "叶集区" or input == "341504",
    do: [
      %{"name" => "史河街道", "code" => "341504001000"},
      %{"name" => "平岗街道", "code" => "341504002000"},
      %{"name" => "三元镇", "code" => "341504102000"},
      %{"name" => "洪集镇", "code" => "341504103000"},
      %{"name" => "姚李镇", "code" => "341504104000"},
      %{"name" => "孙岗乡", "code" => "341504200000"}
    ]

  def next(input) when input == "霍邱县" or input == "341522",
    do: [
      %{"name" => "城关镇", "code" => "341522100000"},
      %{"name" => "河口镇", "code" => "341522101000"},
      %{"name" => "周集镇", "code" => "341522102000"},
      %{"name" => "临水镇", "code" => "341522103000"},
      %{"name" => "新店镇", "code" => "341522104000"},
      %{"name" => "石店镇", "code" => "341522105000"},
      %{"name" => "马店镇", "code" => "341522106000"},
      %{"name" => "孟集镇", "code" => "341522107000"},
      %{"name" => "花园镇", "code" => "341522108000"},
      %{"name" => "扈胡镇", "code" => "341522109000"},
      %{"name" => "长集镇", "code" => "341522110000"},
      %{"name" => "乌龙镇", "code" => "341522113000"},
      %{"name" => "高塘镇", "code" => "341522114000"},
      %{"name" => "龙潭镇", "code" => "341522115000"},
      %{"name" => "岔路镇", "code" => "341522116000"},
      %{"name" => "冯井镇", "code" => "341522117000"},
      %{"name" => "众兴集镇", "code" => "341522118000"},
      %{"name" => "夏店镇", "code" => "341522119000"},
      %{"name" => "曹庙镇", "code" => "341522120000"},
      %{"name" => "范桥镇", "code" => "341522123000"},
      %{"name" => "潘集镇", "code" => "341522124000"},
      %{"name" => "彭塔镇", "code" => "341522126000"},
      %{"name" => "宋店镇", "code" => "341522127000"},
      %{"name" => "临淮岗镇", "code" => "341522128000"},
      %{"name" => "冯瓴镇", "code" => "341522129000"},
      %{"name" => "王截流乡", "code" => "341522201000"},
      %{"name" => "城西湖乡", "code" => "341522204000"},
      %{"name" => "三流乡", "code" => "341522206000"},
      %{"name" => "邵岗乡", "code" => "341522207000"},
      %{"name" => "白莲乡", "code" => "341522208000"},
      %{"name" => "安徽霍邱经济开发区", "code" => "341522400000"},
      %{"name" => "水产局管辖村", "code" => "341522500000"}
    ]

  def next(input) when input == "舒城县" or input == "341523",
    do: [
      %{"name" => "城关镇", "code" => "341523100000"},
      %{"name" => "晓天镇", "code" => "341523101000"},
      %{"name" => "桃溪镇", "code" => "341523102000"},
      %{"name" => "万佛湖镇", "code" => "341523103000"},
      %{"name" => "千人桥镇", "code" => "341523104000"},
      %{"name" => "百神庙镇", "code" => "341523105000"},
      %{"name" => "杭埠镇", "code" => "341523106000"},
      %{"name" => "舒茶镇", "code" => "341523107000"},
      %{"name" => "南港镇", "code" => "341523108000"},
      %{"name" => "干汊河镇", "code" => "341523109000"},
      %{"name" => "张母桥镇", "code" => "341523110000"},
      %{"name" => "五显镇", "code" => "341523111000"},
      %{"name" => "山七镇", "code" => "341523112000"},
      %{"name" => "河棚镇", "code" => "341523113000"},
      %{"name" => "汤池镇", "code" => "341523114000"},
      %{"name" => "春秋乡", "code" => "341523200000"},
      %{"name" => "柏林乡", "code" => "341523201000"},
      %{"name" => "棠树乡", "code" => "341523202000"},
      %{"name" => "阙店乡", "code" => "341523203000"},
      %{"name" => "高峰乡", "code" => "341523204000"},
      %{"name" => "庐镇乡", "code" => "341523205000"},
      %{"name" => "舒城县经济开发区", "code" => "341523400000"}
    ]

  def next(input) when input == "金寨县" or input == "341524",
    do: [
      %{"name" => "梅山镇", "code" => "341524100000"},
      %{"name" => "麻埠镇", "code" => "341524101000"},
      %{"name" => "青山镇", "code" => "341524102000"},
      %{"name" => "燕子河镇", "code" => "341524103000"},
      %{"name" => "天堂寨镇", "code" => "341524104000"},
      %{"name" => "古碑镇", "code" => "341524105000"},
      %{"name" => "吴家店镇", "code" => "341524106000"},
      %{"name" => "斑竹园镇", "code" => "341524107000"},
      %{"name" => "汤家汇镇", "code" => "341524108000"},
      %{"name" => "南溪镇", "code" => "341524109000"},
      %{"name" => "双河镇", "code" => "341524110000"},
      %{"name" => "白塔畈镇", "code" => "341524111000"},
      %{"name" => "流波䃥镇", "code" => "341524112000"},
      %{"name" => "油坊店乡", "code" => "341524202000"},
      %{"name" => "长岭乡", "code" => "341524203000"},
      %{"name" => "槐树湾乡", "code" => "341524204000"},
      %{"name" => "花石乡", "code" => "341524205000"},
      %{"name" => "沙河乡", "code" => "341524206000"},
      %{"name" => "桃岭乡", "code" => "341524207000"},
      %{"name" => "果子园乡", "code" => "341524208000"},
      %{"name" => "关庙乡", "code" => "341524209000"},
      %{"name" => "全军乡", "code" => "341524211000"},
      %{"name" => "铁冲乡", "code" => "341524214000"}
    ]

  def next(input) when input == "霍山县" or input == "341525",
    do: [
      %{"name" => "衡山镇", "code" => "341525100000"},
      %{"name" => "佛子岭镇", "code" => "341525101000"},
      %{"name" => "下符桥镇", "code" => "341525102000"},
      %{"name" => "但家庙镇", "code" => "341525103000"},
      %{"name" => "与儿街镇", "code" => "341525104000"},
      %{"name" => "黑石渡镇", "code" => "341525105000"},
      %{"name" => "诸佛庵镇", "code" => "341525106000"},
      %{"name" => "落儿岭镇", "code" => "341525107000"},
      %{"name" => "磨子潭镇", "code" => "341525108000"},
      %{"name" => "大化坪镇", "code" => "341525109000"},
      %{"name" => "漫水河镇", "code" => "341525110000"},
      %{"name" => "上土市镇", "code" => "341525111000"},
      %{"name" => "单龙寺镇", "code" => "341525112000"},
      %{"name" => "东西溪乡", "code" => "341525201000"},
      %{"name" => "太平畈乡", "code" => "341525202000"},
      %{"name" => "太阳乡", "code" => "341525203000"},
      %{"name" => "经济开发区", "code" => "341525400000"}
    ]

  def next(input) when input == "埇桥区" or input == "341302",
    do: [
      %{"name" => "埇桥街道", "code" => "341302001000"},
      %{"name" => "沱河街道", "code" => "341302002000"},
      %{"name" => "道东街道", "code" => "341302003000"},
      %{"name" => "东关街道", "code" => "341302004000"},
      %{"name" => "三里湾街道", "code" => "341302005000"},
      %{"name" => "南关街道", "code" => "341302006000"},
      %{"name" => "西关街道", "code" => "341302007000"},
      %{"name" => "北关街道", "code" => "341302008000"},
      %{"name" => "汴河街道", "code" => "341302009000"},
      %{"name" => "三八街道", "code" => "341302010000"},
      %{"name" => "城东街道", "code" => "341302011000"},
      %{"name" => "符离镇", "code" => "341302100000"},
      %{"name" => "芦岭镇", "code" => "341302101000"},
      %{"name" => "朱仙庄镇", "code" => "341302102000"},
      %{"name" => "褚兰镇", "code" => "341302103000"},
      %{"name" => "曹村镇", "code" => "341302104000"},
      %{"name" => "夹沟镇", "code" => "341302105000"},
      %{"name" => "栏杆镇", "code" => "341302106000"},
      %{"name" => "时村镇", "code" => "341302107000"},
      %{"name" => "永安镇", "code" => "341302108000"},
      %{"name" => "灰古镇", "code" => "341302109000"},
      %{"name" => "大店镇", "code" => "341302110000"},
      %{"name" => "大泽乡镇", "code" => "341302111000"},
      %{"name" => "桃园镇", "code" => "341302112000"},
      %{"name" => "蕲县镇", "code" => "341302113000"},
      %{"name" => "大营镇", "code" => "341302114000"},
      %{"name" => "顺河镇", "code" => "341302115000"},
      %{"name" => "蒿沟镇", "code" => "341302116000"},
      %{"name" => "杨庄镇", "code" => "341302117000"},
      %{"name" => "解集镇", "code" => "341302118000"},
      %{"name" => "苗安镇", "code" => "341302119000"},
      %{"name" => "支河镇", "code" => "341302120000"},
      %{"name" => "桃沟镇", "code" => "341302121000"},
      %{"name" => "永镇镇", "code" => "341302122000"},
      %{"name" => "西二铺镇", "code" => "341302123000"},
      %{"name" => "北杨寨乡", "code" => "341302209000"},
      %{"name" => "宿州高新技术产业开发区", "code" => "341302402000"},
      %{"name" => "宿州埇桥经济开发区", "code" => "341302403000"}
    ]

  def next(input) when input == "砀山县" or input == "341321",
    do: [
      %{"name" => "砀城镇", "code" => "341321100000"},
      %{"name" => "赵屯镇", "code" => "341321101000"},
      %{"name" => "李庄镇", "code" => "341321102000"},
      %{"name" => "唐寨镇", "code" => "341321103000"},
      %{"name" => "葛集镇", "code" => "341321104000"},
      %{"name" => "周寨镇", "code" => "341321105000"},
      %{"name" => "玄庙镇", "code" => "341321106000"},
      %{"name" => "官庄坝镇", "code" => "341321107000"},
      %{"name" => "曹庄镇", "code" => "341321108000"},
      %{"name" => "关帝庙镇", "code" => "341321109000"},
      %{"name" => "朱楼镇", "code" => "341321110000"},
      %{"name" => "良梨镇", "code" => "341321111000"},
      %{"name" => "程庄镇", "code" => "341321112000"},
      %{"name" => "经济开发区", "code" => "341321400000"},
      %{"name" => "薛楼板材加工园", "code" => "341321401000"},
      %{"name" => "高铁新区", "code" => "341321402000"}
    ]

  def next(input) when input == "萧县" or input == "341322",
    do: [
      %{"name" => "凤城街道", "code" => "341322001000"},
      %{"name" => "龙河街道", "code" => "341322002000"},
      %{"name" => "锦屏街道", "code" => "341322003000"},
      %{"name" => "龙城镇", "code" => "341322100000"},
      %{"name" => "黄口镇", "code" => "341322101000"},
      %{"name" => "杨楼镇", "code" => "341322102000"},
      %{"name" => "闫集镇", "code" => "341322103000"},
      %{"name" => "新庄镇", "code" => "341322104000"},
      %{"name" => "刘套镇", "code" => "341322105000"},
      %{"name" => "马井镇", "code" => "341322106000"},
      %{"name" => "大屯镇", "code" => "341322107000"},
      %{"name" => "赵庄镇", "code" => "341322108000"},
      %{"name" => "杜楼镇", "code" => "341322109000"},
      %{"name" => "丁里镇", "code" => "341322110000"},
      %{"name" => "王寨镇", "code" => "341322111000"},
      %{"name" => "祖楼镇", "code" => "341322112000"},
      %{"name" => "青龙集镇", "code" => "341322113000"},
      %{"name" => "张庄寨镇", "code" => "341322114000"},
      %{"name" => "永堌镇", "code" => "341322115000"},
      %{"name" => "白土镇", "code" => "341322116000"},
      %{"name" => "官桥镇", "code" => "341322117000"},
      %{"name" => "圣泉镇", "code" => "341322118000"},
      %{"name" => "庄里镇", "code" => "341322119000"},
      %{"name" => "酒店镇", "code" => "341322120000"},
      %{"name" => "孙圩子镇", "code" => "341322121000"},
      %{"name" => "石林乡", "code" => "341322204000"},
      %{"name" => "萧县经济开发区", "code" => "341322400000"}
    ]

  def next(input) when input == "灵璧县" or input == "341323",
    do: [
      %{"name" => "灵城镇", "code" => "341323100000"},
      %{"name" => "韦集镇", "code" => "341323101000"},
      %{"name" => "黄湾镇", "code" => "341323102000"},
      %{"name" => "娄庄镇", "code" => "341323103000"},
      %{"name" => "杨疃镇", "code" => "341323104000"},
      %{"name" => "尹集镇", "code" => "341323105000"},
      %{"name" => "浍沟镇", "code" => "341323106000"},
      %{"name" => "游集镇", "code" => "341323107000"},
      %{"name" => "下楼镇", "code" => "341323108000"},
      %{"name" => "朝阳镇", "code" => "341323109000"},
      %{"name" => "渔沟镇", "code" => "341323110000"},
      %{"name" => "高楼镇", "code" => "341323111000"},
      %{"name" => "冯庙镇", "code" => "341323112000"},
      %{"name" => "禅堂镇", "code" => "341323113000"},
      %{"name" => "虞姬镇", "code" => "341323114000"},
      %{"name" => "向阳镇", "code" => "341323115000"},
      %{"name" => "大庙镇", "code" => "341323116000"},
      %{"name" => "朱集镇", "code" => "341323117000"},
      %{"name" => "大路镇", "code" => "341323118000"},
      %{"name" => "灵璧县经济开发区", "code" => "341323400000"}
    ]

  def next(input) when input == "泗县" or input == "341324",
    do: [
      %{"name" => "运河街道", "code" => "341324001000"},
      %{"name" => "泗水街道", "code" => "341324002000"},
      %{"name" => "虹城街道", "code" => "341324003000"},
      %{"name" => "泗城镇", "code" => "341324100000"},
      %{"name" => "墩集镇", "code" => "341324101000"},
      %{"name" => "丁湖镇", "code" => "341324102000"},
      %{"name" => "草沟镇", "code" => "341324103000"},
      %{"name" => "长沟镇", "code" => "341324104000"},
      %{"name" => "黄圩镇", "code" => "341324105000"},
      %{"name" => "大庄镇", "code" => "341324106000"},
      %{"name" => "山头镇", "code" => "341324107000"},
      %{"name" => "刘圩镇", "code" => "341324108000"},
      %{"name" => "黑塔镇", "code" => "341324109000"},
      %{"name" => "草庙镇", "code" => "341324110000"},
      %{"name" => "屏山镇", "code" => "341324111000"},
      %{"name" => "大路口镇", "code" => "341324112000"},
      %{"name" => "大杨镇", "code" => "341324113000"},
      %{"name" => "瓦坊镇", "code" => "341324114000"},
      %{"name" => "泗县开发区管委会（泗县当涂现代产业园）", "code" => "341324400000"}
    ]

  def next(input) when input == "宿州马鞍山现代产业园区" or input == "341371",
    do: [%{"name" => "宿州东部新城行政管理区", "code" => "341371400000"}]

  def next(input) when input == "宿州经济技术开发区" or input == "341372",
    do: [%{"name" => "金海街道", "code" => "341372001000"}]

  def next(input) when input == "颍州区" or input == "341202",
    do: [
      %{"name" => "鼓楼街道", "code" => "341202001000"},
      %{"name" => "文峰街道", "code" => "341202002000"},
      %{"name" => "清河街道", "code" => "341202003000"},
      %{"name" => "颍西街道", "code" => "341202004000"},
      %{"name" => "王店镇", "code" => "341202100000"},
      %{"name" => "程集镇", "code" => "341202101000"},
      %{"name" => "三合镇", "code" => "341202102000"},
      %{"name" => "西湖镇", "code" => "341202103000"},
      %{"name" => "九龙镇", "code" => "341202104000"},
      %{"name" => "三十里铺镇", "code" => "341202105000"},
      %{"name" => "三塔集镇", "code" => "341202106000"},
      %{"name" => "马寨乡", "code" => "341202200000"},
      %{"name" => "安徽颍州经济开发区", "code" => "341202400000"}
    ]

  def next(input) when input == "颍东区" or input == "341203",
    do: [
      %{"name" => "河东街道", "code" => "341203001000"},
      %{"name" => "新华街道", "code" => "341203002000"},
      %{"name" => "向阳街道", "code" => "341203003000"},
      %{"name" => "口孜镇", "code" => "341203100000"},
      %{"name" => "插花镇", "code" => "341203101000"},
      %{"name" => "袁寨镇", "code" => "341203102000"},
      %{"name" => "枣庄镇", "code" => "341203103000"},
      %{"name" => "老庙镇", "code" => "341203104000"},
      %{"name" => "正午镇", "code" => "341203105000"},
      %{"name" => "杨楼孜镇", "code" => "341203106000"},
      %{"name" => "新乌江镇", "code" => "341203107000"},
      %{"name" => "冉庙乡", "code" => "341203200000"}
    ]

  def next(input) when input == "颍泉区" or input == "341204",
    do: [
      %{"name" => "中市街道", "code" => "341204001000"},
      %{"name" => "周棚街道", "code" => "341204002000"},
      %{"name" => "伍明镇", "code" => "341204100000"},
      %{"name" => "宁老庄镇", "code" => "341204101000"},
      %{"name" => "闻集镇", "code" => "341204102000"},
      %{"name" => "行流镇", "code" => "341204103000"}
    ]

  def next(input) when input == "临泉县" or input == "341221",
    do: [
      %{"name" => "城关街道", "code" => "341221001000"},
      %{"name" => "邢塘街道", "code" => "341221002000"},
      %{"name" => "田桥街道", "code" => "341221003000"},
      %{"name" => "城东街道", "code" => "341221004000"},
      %{"name" => "城南街道", "code" => "341221005000"},
      %{"name" => "杨桥镇", "code" => "341221101000"},
      %{"name" => "鲖城镇", "code" => "341221102000"},
      %{"name" => "谭棚镇", "code" => "341221103000"},
      %{"name" => "老集镇", "code" => "341221104000"},
      %{"name" => "滑集镇", "code" => "341221105000"},
      %{"name" => "吕寨镇", "code" => "341221106000"},
      %{"name" => "单桥镇", "code" => "341221107000"},
      %{"name" => "长官镇", "code" => "341221108000"},
      %{"name" => "宋集镇", "code" => "341221109000"},
      %{"name" => "张新镇", "code" => "341221110000"},
      %{"name" => "艾亭镇", "code" => "341221111000"},
      %{"name" => "陈集镇", "code" => "341221112000"},
      %{"name" => "韦寨镇", "code" => "341221113000"},
      %{"name" => "迎仙镇", "code" => "341221114000"},
      %{"name" => "瓦店镇", "code" => "341221115000"},
      %{"name" => "姜寨镇", "code" => "341221116000"},
      %{"name" => "庙岔镇", "code" => "341221117000"},
      %{"name" => "黄岭镇", "code" => "341221118000"},
      %{"name" => "白庙镇", "code" => "341221119000"},
      %{"name" => "关庙镇", "code" => "341221120000"},
      %{"name" => "高塘镇", "code" => "341221122000"},
      %{"name" => "土陂乡", "code" => "341221203000"},
      %{"name" => "陶老乡", "code" => "341221206000"}
    ]

  def next(input) when input == "太和县" or input == "341222",
    do: [
      %{"name" => "城关镇", "code" => "341222100000"},
      %{"name" => "旧县镇", "code" => "341222101000"},
      %{"name" => "税镇镇", "code" => "341222102000"},
      %{"name" => "皮条孙镇", "code" => "341222103000"},
      %{"name" => "原墙镇", "code" => "341222104000"},
      %{"name" => "倪邱镇", "code" => "341222105000"},
      %{"name" => "李兴镇", "code" => "341222106000"},
      %{"name" => "大新镇", "code" => "341222107000"},
      %{"name" => "肖口镇", "code" => "341222108000"},
      %{"name" => "关集镇", "code" => "341222109000"},
      %{"name" => "三塔镇", "code" => "341222110000"},
      %{"name" => "双浮镇", "code" => "341222111000"},
      %{"name" => "蔡庙镇", "code" => "341222112000"},
      %{"name" => "三堂镇", "code" => "341222113000"},
      %{"name" => "苗老集镇", "code" => "341222114000"},
      %{"name" => "赵庙镇", "code" => "341222115000"},
      %{"name" => "宫集镇", "code" => "341222116000"},
      %{"name" => "坟台镇", "code" => "341222117000"},
      %{"name" => "洪山镇", "code" => "341222118000"},
      %{"name" => "清浅镇", "code" => "341222119000"},
      %{"name" => "五星镇", "code" => "341222120000"},
      %{"name" => "高庙镇", "code" => "341222121000"},
      %{"name" => "桑营镇", "code" => "341222122000"},
      %{"name" => "大庙集镇", "code" => "341222123000"},
      %{"name" => "阮桥镇", "code" => "341222124000"},
      %{"name" => "双庙镇", "code" => "341222125000"},
      %{"name" => "胡总镇", "code" => "341222126000"},
      %{"name" => "郭庙镇", "code" => "341222127000"},
      %{"name" => "二郎镇", "code" => "341222128000"},
      %{"name" => "马集镇", "code" => "341222129000"},
      %{"name" => "赵集乡", "code" => "341222201000"},
      %{"name" => "开发区管理委员会", "code" => "341222400000"}
    ]

  def next(input) when input == "阜南县" or input == "341225",
    do: [
      %{"name" => "方集镇", "code" => "341225101000"},
      %{"name" => "中岗镇", "code" => "341225102000"},
      %{"name" => "柴集镇", "code" => "341225103000"},
      %{"name" => "新村镇", "code" => "341225104000"},
      %{"name" => "朱寨镇", "code" => "341225106000"},
      %{"name" => "柳沟镇", "code" => "341225107000"},
      %{"name" => "赵集镇", "code" => "341225108000"},
      %{"name" => "田集镇", "code" => "341225109000"},
      %{"name" => "苗集镇", "code" => "341225110000"},
      %{"name" => "黄岗镇", "code" => "341225111000"},
      %{"name" => "焦陂镇", "code" => "341225112000"},
      %{"name" => "张寨镇", "code" => "341225113000"},
      %{"name" => "王堰镇", "code" => "341225114000"},
      %{"name" => "地城镇", "code" => "341225115000"},
      %{"name" => "洪河桥镇", "code" => "341225116000"},
      %{"name" => "王家坝镇", "code" => "341225117000"},
      %{"name" => "王化镇", "code" => "341225118000"},
      %{"name" => "曹集镇", "code" => "341225119000"},
      %{"name" => "鹿城镇", "code" => "341225120000"},
      %{"name" => "会龙镇", "code" => "341225121000"},
      %{"name" => "王店孜乡", "code" => "341225200000"},
      %{"name" => "许堂乡", "code" => "341225201000"},
      %{"name" => "段郢乡", "code" => "341225204000"},
      %{"name" => "公桥乡", "code" => "341225205000"},
      %{"name" => "龙王乡", "code" => "341225206000"},
      %{"name" => "于集乡", "code" => "341225207000"},
      %{"name" => "老观乡", "code" => "341225208000"},
      %{"name" => "郜台乡", "code" => "341225209000"},
      %{"name" => "安徽阜南经济开发区", "code" => "341225401000"}
    ]

  def next(input) when input == "颍上县" or input == "341226",
    do: [
      %{"name" => "慎城镇", "code" => "341226100000"},
      %{"name" => "谢桥镇", "code" => "341226101000"},
      %{"name" => "南照镇", "code" => "341226102000"},
      %{"name" => "杨湖镇", "code" => "341226103000"},
      %{"name" => "江口镇", "code" => "341226104000"},
      %{"name" => "润河镇", "code" => "341226105000"},
      %{"name" => "新集镇", "code" => "341226106000"},
      %{"name" => "六十铺镇", "code" => "341226107000"},
      %{"name" => "耿棚镇", "code" => "341226108000"},
      %{"name" => "半岗镇", "code" => "341226109000"},
      %{"name" => "王岗镇", "code" => "341226110000"},
      %{"name" => "夏桥镇", "code" => "341226111000"},
      %{"name" => "江店孜镇", "code" => "341226112000"},
      %{"name" => "陈桥镇", "code" => "341226113000"},
      %{"name" => "黄桥镇", "code" => "341226114000"},
      %{"name" => "八里河镇", "code" => "341226115000"},
      %{"name" => "迪沟镇", "code" => "341226116000"},
      %{"name" => "西三十铺镇", "code" => "341226117000"},
      %{"name" => "红星镇", "code" => "341226118000"},
      %{"name" => "十八里铺镇", "code" => "341226119000"},
      %{"name" => "鲁口镇", "code" => "341226120000"},
      %{"name" => "古城镇", "code" => "341226121000"},
      %{"name" => "建颍乡", "code" => "341226200000"},
      %{"name" => "五十铺乡", "code" => "341226201000"},
      %{"name" => "盛堂乡", "code" => "341226202000"},
      %{"name" => "关屯乡", "code" => "341226203000"},
      %{"name" => "垂岗乡", "code" => "341226204000"},
      %{"name" => "赛涧回族乡", "code" => "341226205000"},
      %{"name" => "刘集乡", "code" => "341226206000"},
      %{"name" => "黄坝乡", "code" => "341226207000"}
    ]

  def next(input) when input == "阜阳合肥现代产业园区" or input == "341271",
    do: [%{"name" => "袁集镇", "code" => "341271100000"}]

  def next(input) when input == "阜阳经济技术开发区" or input == "341272",
    do: [%{"name" => "阜阳开发区京九街道", "code" => "341272001000"}]

  def next(input) when input == "界首市" or input == "341282",
    do: [
      %{"name" => "东城街道", "code" => "341282001000"},
      %{"name" => "西城街道", "code" => "341282002000"},
      %{"name" => "颍南街道", "code" => "341282003000"},
      %{"name" => "光武镇", "code" => "341282100000"},
      %{"name" => "泉阳镇", "code" => "341282101000"},
      %{"name" => "芦村镇", "code" => "341282102000"},
      %{"name" => "新马集镇", "code" => "341282103000"},
      %{"name" => "大黄镇", "code" => "341282104000"},
      %{"name" => "田营镇", "code" => "341282105000"},
      %{"name" => "陶庙镇", "code" => "341282106000"},
      %{"name" => "王集镇", "code" => "341282107000"},
      %{"name" => "砖集镇", "code" => "341282108000"},
      %{"name" => "顾集镇", "code" => "341282109000"},
      %{"name" => "戴桥镇", "code" => "341282110000"},
      %{"name" => "舒庄镇", "code" => "341282111000"},
      %{"name" => "邴集乡", "code" => "341282200000"},
      %{"name" => "靳寨乡", "code" => "341282201000"},
      %{"name" => "任寨乡", "code" => "341282202000"}
    ]

  def next(input) when input == "琅琊区" or input == "341102",
    do: [
      %{"name" => "琅琊街道", "code" => "341102001000"},
      %{"name" => "丰山街道", "code" => "341102004000"},
      %{"name" => "清流街道", "code" => "341102006000"},
      %{"name" => "扬子街道", "code" => "341102007000"},
      %{"name" => "西涧街道", "code" => "341102010000"},
      %{"name" => "遵阳街道", "code" => "341102011000"},
      %{"name" => "滁阳街道", "code" => "341102012000"},
      %{"name" => "三官街道", "code" => "341102013000"},
      %{"name" => "安徽滁州琅琊经济开发区", "code" => "341102400000"}
    ]

  def next(input) when input == "南谯区" or input == "341103",
    do: [
      %{"name" => "龙蟠街道", "code" => "341103003000"},
      %{"name" => "银花街道", "code" => "341103004000"},
      %{"name" => "同乐街道", "code" => "341103005000"},
      %{"name" => "乌衣镇", "code" => "341103100000"},
      %{"name" => "沙河镇", "code" => "341103101000"},
      %{"name" => "章广镇", "code" => "341103102000"},
      %{"name" => "黄泥岗镇", "code" => "341103103000"},
      %{"name" => "珠龙镇", "code" => "341103104000"},
      %{"name" => "大柳镇", "code" => "341103105000"},
      %{"name" => "腰铺镇", "code" => "341103106000"},
      %{"name" => "施集镇", "code" => "341103107000"},
      %{"name" => "南谯工业园区", "code" => "341103400000"},
      %{"name" => "滁州高教科创城管委会", "code" => "341103401000"}
    ]

  def next(input) when input == "来安县" or input == "341122",
    do: [
      %{"name" => "新安镇", "code" => "341122100000"},
      %{"name" => "半塔镇", "code" => "341122101000"},
      %{"name" => "水口镇", "code" => "341122102000"},
      %{"name" => "汊河镇", "code" => "341122103000"},
      %{"name" => "大英镇", "code" => "341122104000"},
      %{"name" => "雷官镇", "code" => "341122105000"},
      %{"name" => "施官镇", "code" => "341122106000"},
      %{"name" => "舜山镇", "code" => "341122107000"},
      %{"name" => "三城镇", "code" => "341122108000"},
      %{"name" => "独山镇", "code" => "341122109000"},
      %{"name" => "张山镇", "code" => "341122110000"},
      %{"name" => "杨郢乡", "code" => "341122203000"}
    ]

  def next(input) when input == "全椒县" or input == "341124",
    do: [
      %{"name" => "襄河镇", "code" => "341124100000"},
      %{"name" => "古河镇", "code" => "341124101000"},
      %{"name" => "大墅镇", "code" => "341124102000"},
      %{"name" => "二郎口镇", "code" => "341124103000"},
      %{"name" => "武岗镇", "code" => "341124104000"},
      %{"name" => "马厂镇", "code" => "341124105000"},
      %{"name" => "石沛镇", "code" => "341124106000"},
      %{"name" => "十字镇", "code" => "341124107000"},
      %{"name" => "西王镇", "code" => "341124108000"},
      %{"name" => "六镇镇", "code" => "341124109000"}
    ]

  def next(input) when input == "定远县" or input == "341125",
    do: [
      %{"name" => "定城镇", "code" => "341125100000"},
      %{"name" => "炉桥镇", "code" => "341125101000"},
      %{"name" => "永康镇", "code" => "341125102000"},
      %{"name" => "吴圩镇", "code" => "341125103000"},
      %{"name" => "朱湾镇", "code" => "341125104000"},
      %{"name" => "张桥镇", "code" => "341125105000"},
      %{"name" => "藕塘镇", "code" => "341125106000"},
      %{"name" => "池河镇", "code" => "341125107000"},
      %{"name" => "连江镇", "code" => "341125108000"},
      %{"name" => "界牌集镇", "code" => "341125109000"},
      %{"name" => "仓镇", "code" => "341125110000"},
      %{"name" => "三和集镇", "code" => "341125111000"},
      %{"name" => "西卅店镇", "code" => "341125112000"},
      %{"name" => "桑涧镇", "code" => "341125113000"},
      %{"name" => "蒋集镇", "code" => "341125114000"},
      %{"name" => "大桥镇", "code" => "341125115000"},
      %{"name" => "严桥乡", "code" => "341125200000"},
      %{"name" => "拂晓乡", "code" => "341125201000"},
      %{"name" => "能仁乡", "code" => "341125202000"},
      %{"name" => "七里塘乡", "code" => "341125203000"},
      %{"name" => "二龙回族乡", "code" => "341125204000"},
      %{"name" => "范岗乡", "code" => "341125205000"},
      %{"name" => "安徽定远经济开发区", "code" => "341125400000"},
      %{"name" => "定远盐化工业园", "code" => "341125401000"},
      %{"name" => "凌家湖农场", "code" => "341125402000"}
    ]

  def next(input) when input == "凤阳县" or input == "341126",
    do: [
      %{"name" => "中都街道", "code" => "341126001000"},
      %{"name" => "玄武街道", "code" => "341126002000"},
      %{"name" => "府城镇", "code" => "341126100000"},
      %{"name" => "临淮关镇", "code" => "341126101000"},
      %{"name" => "武店镇", "code" => "341126102000"},
      %{"name" => "西泉镇", "code" => "341126103000"},
      %{"name" => "官塘镇", "code" => "341126104000"},
      %{"name" => "刘府镇", "code" => "341126105000"},
      %{"name" => "大庙镇", "code" => "341126106000"},
      %{"name" => "殷涧镇", "code" => "341126107000"},
      %{"name" => "总铺镇", "code" => "341126108000"},
      %{"name" => "红心镇", "code" => "341126109000"},
      %{"name" => "板桥镇", "code" => "341126110000"},
      %{"name" => "大溪河镇", "code" => "341126111000"},
      %{"name" => "小溪河镇", "code" => "341126112000"},
      %{"name" => "枣巷镇", "code" => "341126113000"},
      %{"name" => "黄湾乡", "code" => "341126201000"},
      %{"name" => "安徽凤阳经济开发区管理委员会", "code" => "341126401000"}
    ]

  def next(input) when input == "中新苏滁高新技术产业开发区" or input == "341171",
    do: [%{"name" => "大王街道", "code" => "341171001000"}]

  def next(input) when input == "滁州经济技术开发区" or input == "341172",
    do: [
      %{"name" => "凤凰街道", "code" => "341172001000"},
      %{"name" => "紫薇街道", "code" => "341172002000"},
      %{"name" => "滁州市经济技术开发区", "code" => "341172401000"}
    ]

  def next(input) when input == "天长市" or input == "341181",
    do: [
      %{"name" => "广陵街道", "code" => "341181003000"},
      %{"name" => "千秋街道", "code" => "341181004000"},
      %{"name" => "铜城镇", "code" => "341181100000"},
      %{"name" => "汊涧镇", "code" => "341181101000"},
      %{"name" => "秦栏镇", "code" => "341181102000"},
      %{"name" => "大通镇", "code" => "341181103000"},
      %{"name" => "杨村镇", "code" => "341181104000"},
      %{"name" => "石梁镇", "code" => "341181105000"},
      %{"name" => "金集镇", "code" => "341181106000"},
      %{"name" => "永丰镇", "code" => "341181107000"},
      %{"name" => "仁和集镇", "code" => "341181108000"},
      %{"name" => "冶山镇", "code" => "341181109000"},
      %{"name" => "郑集镇", "code" => "341181110000"},
      %{"name" => "张铺镇", "code" => "341181111000"},
      %{"name" => "新街镇", "code" => "341181112000"},
      %{"name" => "万寿镇", "code" => "341181113000"}
    ]

  def next(input) when input == "明光市" or input == "341182",
    do: [
      %{"name" => "明光街道", "code" => "341182001000"},
      %{"name" => "明东街道", "code" => "341182002000"},
      %{"name" => "明南街道", "code" => "341182003000"},
      %{"name" => "明西街道", "code" => "341182004000"},
      %{"name" => "张八岭镇", "code" => "341182100000"},
      %{"name" => "三界镇", "code" => "341182101000"},
      %{"name" => "管店镇", "code" => "341182102000"},
      %{"name" => "自来桥镇", "code" => "341182103000"},
      %{"name" => "涧溪镇", "code" => "341182104000"},
      %{"name" => "石坝镇", "code" => "341182105000"},
      %{"name" => "苏巷镇", "code" => "341182106000"},
      %{"name" => "桥头镇", "code" => "341182107000"},
      %{"name" => "女山湖镇", "code" => "341182108000"},
      %{"name" => "古沛镇", "code" => "341182109000"},
      %{"name" => "潘村镇", "code" => "341182110000"},
      %{"name" => "柳巷镇", "code" => "341182111000"},
      %{"name" => "泊岗乡", "code" => "341182200000"}
    ]

  def next(input) when input == "屯溪区" or input == "341002",
    do: [
      %{"name" => "昱东街道", "code" => "341002001000"},
      %{"name" => "昱中街道", "code" => "341002002000"},
      %{"name" => "昱西街道", "code" => "341002003000"},
      %{"name" => "老街街道", "code" => "341002004000"},
      %{"name" => "屯光镇", "code" => "341002100000"},
      %{"name" => "阳湖镇", "code" => "341002101000"},
      %{"name" => "黎阳镇", "code" => "341002102000"},
      %{"name" => "新潭镇", "code" => "341002103000"},
      %{"name" => "奕棋镇", "code" => "341002104000"}
    ]

  def next(input) when input == "黄山区" or input == "341003",
    do: [
      %{"name" => "甘棠镇", "code" => "341003100000"},
      %{"name" => "仙源镇", "code" => "341003101000"},
      %{"name" => "汤口镇", "code" => "341003102000"},
      %{"name" => "谭家桥镇", "code" => "341003103000"},
      %{"name" => "太平湖镇", "code" => "341003104000"},
      %{"name" => "焦村镇", "code" => "341003105000"},
      %{"name" => "耿城镇", "code" => "341003106000"},
      %{"name" => "三口镇", "code" => "341003107000"},
      %{"name" => "乌石镇", "code" => "341003108000"},
      %{"name" => "新明乡", "code" => "341003200000"},
      %{"name" => "龙门乡", "code" => "341003201000"},
      %{"name" => "新华乡", "code" => "341003203000"},
      %{"name" => "新丰乡", "code" => "341003204000"},
      %{"name" => "永丰乡", "code" => "341003205000"},
      %{"name" => "黄山风景区", "code" => "341003400000"}
    ]

  def next(input) when input == "徽州区" or input == "341004",
    do: [
      %{"name" => "岩寺镇", "code" => "341004100000"},
      %{"name" => "西溪南镇", "code" => "341004101000"},
      %{"name" => "潜口镇", "code" => "341004102000"},
      %{"name" => "呈坎镇", "code" => "341004103000"},
      %{"name" => "徽州区直辖村级区划", "code" => "341004198000"},
      %{"name" => "洽舍乡", "code" => "341004200000"},
      %{"name" => "杨村乡", "code" => "341004201000"},
      %{"name" => "富溪乡", "code" => "341004202000"},
      %{"name" => "安徽徽州经济开发区", "code" => "341004400000"}
    ]

  def next(input) when input == "歙县" or input == "341021",
    do: [
      %{"name" => "徽城镇", "code" => "341021100000"},
      %{"name" => "深渡镇", "code" => "341021101000"},
      %{"name" => "北岸镇", "code" => "341021102000"},
      %{"name" => "富堨镇", "code" => "341021103000"},
      %{"name" => "郑村镇", "code" => "341021104000"},
      %{"name" => "桂林镇", "code" => "341021105000"},
      %{"name" => "许村镇", "code" => "341021106000"},
      %{"name" => "溪头镇", "code" => "341021107000"},
      %{"name" => "杞梓里镇", "code" => "341021108000"},
      %{"name" => "霞坑镇", "code" => "341021109000"},
      %{"name" => "岔口镇", "code" => "341021110000"},
      %{"name" => "街口镇", "code" => "341021111000"},
      %{"name" => "王村镇", "code" => "341021112000"},
      %{"name" => "雄村镇", "code" => "341021113000"},
      %{"name" => "三阳镇", "code" => "341021114000"},
      %{"name" => "坑口乡", "code" => "341021200000"},
      %{"name" => "上丰乡", "code" => "341021202000"},
      %{"name" => "昌溪乡", "code" => "341021203000"},
      %{"name" => "武阳乡", "code" => "341021204000"},
      %{"name" => "金川乡", "code" => "341021206000"},
      %{"name" => "小川乡", "code" => "341021207000"},
      %{"name" => "新溪口乡", "code" => "341021208000"},
      %{"name" => "璜田乡", "code" => "341021209000"},
      %{"name" => "长陔乡", "code" => "341021210000"},
      %{"name" => "森村乡", "code" => "341021211000"},
      %{"name" => "绍濂乡", "code" => "341021212000"},
      %{"name" => "石门乡", "code" => "341021213000"},
      %{"name" => "狮石乡", "code" => "341021214000"},
      %{"name" => "歙县经济开发区", "code" => "341021400000"}
    ]

  def next(input) when input == "休宁县" or input == "341022",
    do: [
      %{"name" => "海阳镇", "code" => "341022100000"},
      %{"name" => "齐云山镇", "code" => "341022101000"},
      %{"name" => "万安镇", "code" => "341022102000"},
      %{"name" => "五城镇", "code" => "341022103000"},
      %{"name" => "东临溪镇", "code" => "341022104000"},
      %{"name" => "蓝田镇", "code" => "341022105000"},
      %{"name" => "溪口镇", "code" => "341022106000"},
      %{"name" => "流口镇", "code" => "341022107000"},
      %{"name" => "汪村镇", "code" => "341022108000"},
      %{"name" => "商山镇", "code" => "341022109000"},
      %{"name" => "月潭湖镇", "code" => "341022110000"},
      %{"name" => "山斗乡", "code" => "341022201000"},
      %{"name" => "岭南乡", "code" => "341022202000"},
      %{"name" => "渭桥乡", "code" => "341022203000"},
      %{"name" => "板桥乡", "code" => "341022204000"},
      %{"name" => "鹤城乡", "code" => "341022206000"},
      %{"name" => "源芳乡", "code" => "341022207000"},
      %{"name" => "榆村乡", "code" => "341022208000"},
      %{"name" => "龙田乡", "code" => "341022209000"},
      %{"name" => "璜尖乡", "code" => "341022210000"},
      %{"name" => "白际乡", "code" => "341022211000"}
    ]

  def next(input) when input == "黟县" or input == "341023",
    do: [
      %{"name" => "碧阳镇", "code" => "341023100000"},
      %{"name" => "宏村镇", "code" => "341023101000"},
      %{"name" => "渔亭镇", "code" => "341023102000"},
      %{"name" => "西递镇", "code" => "341023103000"},
      %{"name" => "柯村镇", "code" => "341023104000"},
      %{"name" => "美溪乡", "code" => "341023201000"},
      %{"name" => "宏潭乡", "code" => "341023202000"},
      %{"name" => "洪星乡", "code" => "341023203000"}
    ]

  def next(input) when input == "祁门县" or input == "341024",
    do: [
      %{"name" => "祁山镇", "code" => "341024100000"},
      %{"name" => "小路口镇", "code" => "341024101000"},
      %{"name" => "金字牌镇", "code" => "341024102000"},
      %{"name" => "平里镇", "code" => "341024103000"},
      %{"name" => "历口镇", "code" => "341024104000"},
      %{"name" => "闪里镇", "code" => "341024105000"},
      %{"name" => "安凌镇", "code" => "341024106000"},
      %{"name" => "凫峰镇", "code" => "341024107000"},
      %{"name" => "塔坊镇", "code" => "341024108000"},
      %{"name" => "新安镇", "code" => "341024109000"},
      %{"name" => "大坦乡", "code" => "341024200000"},
      %{"name" => "柏溪乡", "code" => "341024202000"},
      %{"name" => "祁红乡", "code" => "341024204000"},
      %{"name" => "溶口乡", "code" => "341024205000"},
      %{"name" => "芦溪乡", "code" => "341024206000"},
      %{"name" => "渚口乡", "code" => "341024207000"},
      %{"name" => "古溪乡", "code" => "341024208000"},
      %{"name" => "箬坑乡", "code" => "341024210000"}
    ]

  def next(input) when input == "迎江区" or input == "340802",
    do: [
      %{"name" => "宜城路街道", "code" => "340802001000"},
      %{"name" => "新河路街道", "code" => "340802002000"},
      %{"name" => "华中路街道", "code" => "340802003000"},
      %{"name" => "人民路街道", "code" => "340802004000"},
      %{"name" => "孝肃路街道", "code" => "340802005000"},
      %{"name" => "滨江街道", "code" => "340802006000"},
      %{"name" => "龙狮桥乡", "code" => "340802200000"},
      %{"name" => "长风乡", "code" => "340802201000"},
      %{"name" => "新洲乡", "code" => "340802202000"},
      %{"name" => "迎江经济开发区", "code" => "340802403000"}
    ]

  def next(input) when input == "大观区" or input == "340803",
    do: [
      %{"name" => "德宽路街道", "code" => "340803001000"},
      %{"name" => "玉琳路街道", "code" => "340803002000"},
      %{"name" => "龙山路街道", "code" => "340803003000"},
      %{"name" => "菱湖街道", "code" => "340803004000"},
      %{"name" => "集贤路街道", "code" => "340803005000"},
      %{"name" => "石化路街道", "code" => "340803006000"},
      %{"name" => "花亭路街道", "code" => "340803007000"},
      %{"name" => "海口镇", "code" => "340803100000"},
      %{"name" => "十里铺乡", "code" => "340803200000"},
      %{"name" => "山口乡", "code" => "340803201000"},
      %{"name" => "大观开发区", "code" => "340803400000"},
      %{"name" => "安徽安庆海口经济开发区", "code" => "340803401000"},
      %{"name" => "高新技术产业开发区", "code" => "340803402000"},
      %{"name" => "皖河农场", "code" => "340803500000"}
    ]

  def next(input) when input == "宜秀区" or input == "340811",
    do: [
      %{"name" => "大桥街道", "code" => "340811001000"},
      %{"name" => "大龙山镇", "code" => "340811100000"},
      %{"name" => "杨桥镇", "code" => "340811101000"},
      %{"name" => "罗岭镇", "code" => "340811102000"},
      %{"name" => "白泽湖乡", "code" => "340811200000"},
      %{"name" => "五横乡", "code" => "340811201000"}
    ]

  def next(input) when input == "怀宁县" or input == "340822",
    do: [
      %{"name" => "高河镇", "code" => "340822100000"},
      %{"name" => "石牌镇", "code" => "340822101000"},
      %{"name" => "月山镇", "code" => "340822102000"},
      %{"name" => "马庙镇", "code" => "340822103000"},
      %{"name" => "金拱镇", "code" => "340822104000"},
      %{"name" => "茶岭镇", "code" => "340822105000"},
      %{"name" => "公岭镇", "code" => "340822106000"},
      %{"name" => "黄墩镇", "code" => "340822107000"},
      %{"name" => "三桥镇", "code" => "340822108000"},
      %{"name" => "小市镇", "code" => "340822109000"},
      %{"name" => "黄龙镇", "code" => "340822110000"},
      %{"name" => "平山镇", "code" => "340822111000"},
      %{"name" => "腊树镇", "code" => "340822112000"},
      %{"name" => "洪铺镇", "code" => "340822113000"},
      %{"name" => "江镇镇", "code" => "340822114000"},
      %{"name" => "凉亭乡", "code" => "340822200000"},
      %{"name" => "石镜乡", "code" => "340822201000"},
      %{"name" => "秀山乡", "code" => "340822202000"},
      %{"name" => "清河乡", "code" => "340822203000"},
      %{"name" => "雷埠乡", "code" => "340822204000"}
    ]

  def next(input) when input == "太湖县" or input == "340825",
    do: [
      %{"name" => "晋熙镇", "code" => "340825100000"},
      %{"name" => "徐桥镇", "code" => "340825101000"},
      %{"name" => "新仓镇", "code" => "340825102000"},
      %{"name" => "小池镇", "code" => "340825103000"},
      %{"name" => "寺前镇", "code" => "340825104000"},
      %{"name" => "天华镇", "code" => "340825105000"},
      %{"name" => "牛镇镇", "code" => "340825106000"},
      %{"name" => "弥陀镇", "code" => "340825107000"},
      %{"name" => "北中镇", "code" => "340825108000"},
      %{"name" => "百里镇", "code" => "340825109000"},
      %{"name" => "大石乡", "code" => "340825200000"},
      %{"name" => "城西乡", "code" => "340825201000"},
      %{"name" => "江塘乡", "code" => "340825202000"},
      %{"name" => "汤泉乡", "code" => "340825203000"},
      %{"name" => "刘畈乡", "code" => "340825204000"},
      %{"name" => "经济开发区", "code" => "340825400000"}
    ]

  def next(input) when input == "宿松县" or input == "340826",
    do: [
      %{"name" => "松兹街道", "code" => "340826001000"},
      %{"name" => "龙山街道", "code" => "340826002000"},
      %{"name" => "孚玉镇", "code" => "340826100000"},
      %{"name" => "复兴镇", "code" => "340826101000"},
      %{"name" => "汇口镇", "code" => "340826102000"},
      %{"name" => "许岭镇", "code" => "340826103000"},
      %{"name" => "下仓镇", "code" => "340826104000"},
      %{"name" => "二郎镇", "code" => "340826105000"},
      %{"name" => "华亭镇", "code" => "340826106000"},
      %{"name" => "凉亭镇", "code" => "340826107000"},
      %{"name" => "长铺镇", "code" => "340826108000"},
      %{"name" => "高岭乡", "code" => "340826200000"},
      %{"name" => "程岭乡", "code" => "340826201000"},
      %{"name" => "九姑乡", "code" => "340826202000"},
      %{"name" => "千岭乡", "code" => "340826203000"},
      %{"name" => "洲头乡", "code" => "340826204000"},
      %{"name" => "佐坝乡", "code" => "340826205000"},
      %{"name" => "北浴乡", "code" => "340826206000"},
      %{"name" => "陈汉乡", "code" => "340826207000"},
      %{"name" => "隘口乡", "code" => "340826208000"},
      %{"name" => "柳坪乡", "code" => "340826209000"},
      %{"name" => "趾凤乡", "code" => "340826210000"},
      %{"name" => "河塌乡", "code" => "340826211000"},
      %{"name" => "九成监狱管理分局", "code" => "340826400000"},
      %{"name" => "华阳河农场总场", "code" => "340826401000"},
      %{"name" => "安徽宿松经济开发区", "code" => "340826403000"}
    ]

  def next(input) when input == "望江县" or input == "340827",
    do: [
      %{"name" => "雷阳街道", "code" => "340827001000"},
      %{"name" => "吉水街道", "code" => "340827002000"},
      %{"name" => "回龙街道", "code" => "340827003000"},
      %{"name" => "华阳镇", "code" => "340827100000"},
      %{"name" => "杨湾镇", "code" => "340827101000"},
      %{"name" => "漳湖镇", "code" => "340827102000"},
      %{"name" => "赛口镇", "code" => "340827103000"},
      %{"name" => "高士镇", "code" => "340827104000"},
      %{"name" => "鸦滩镇", "code" => "340827105000"},
      %{"name" => "长岭镇", "code" => "340827106000"},
      %{"name" => "太慈镇", "code" => "340827107000"},
      %{"name" => "雷池镇", "code" => "340827109000"},
      %{"name" => "凉泉乡", "code" => "340827200000"},
      %{"name" => "望江县经济开发区", "code" => "340827400000"}
    ]

  def next(input) when input == "岳西县" or input == "340828",
    do: [
      %{"name" => "天堂镇", "code" => "340828100000"},
      %{"name" => "店前镇", "code" => "340828101000"},
      %{"name" => "来榜镇", "code" => "340828102000"},
      %{"name" => "菖蒲镇", "code" => "340828103000"},
      %{"name" => "头陀镇", "code" => "340828104000"},
      %{"name" => "白帽镇", "code" => "340828105000"},
      %{"name" => "温泉镇", "code" => "340828106000"},
      %{"name" => "响肠镇", "code" => "340828107000"},
      %{"name" => "河图镇", "code" => "340828108000"},
      %{"name" => "五河镇", "code" => "340828109000"},
      %{"name" => "主簿镇", "code" => "340828110000"},
      %{"name" => "冶溪镇", "code" => "340828111000"},
      %{"name" => "黄尾镇", "code" => "340828112000"},
      %{"name" => "中关镇", "code" => "340828113000"},
      %{"name" => "毛尖山乡", "code" => "340828200000"},
      %{"name" => "莲云乡", "code" => "340828201000"},
      %{"name" => "青天乡", "code" => "340828202000"},
      %{"name" => "包家乡", "code" => "340828203000"},
      %{"name" => "古坊乡", "code" => "340828204000"},
      %{"name" => "田头乡", "code" => "340828205000"},
      %{"name" => "石关乡", "code" => "340828207000"},
      %{"name" => "姚河乡", "code" => "340828208000"},
      %{"name" => "和平乡", "code" => "340828209000"},
      %{"name" => "巍岭乡", "code" => "340828210000"},
      %{"name" => "安徽岳西县经济开发区", "code" => "340828400000"}
    ]

  def next(input) when input == "安徽安庆经济开发区" or input == "340871",
    do: [
      %{"name" => "菱北街道", "code" => "340871001000"},
      %{"name" => "老峰镇", "code" => "340871100000"}
    ]

  def next(input) when input == "桐城市" or input == "340881",
    do: [
      %{"name" => "龙腾街道", "code" => "340881001000"},
      %{"name" => "文昌街道", "code" => "340881002000"},
      %{"name" => "龙眠街道", "code" => "340881003000"},
      %{"name" => "孔城镇", "code" => "340881100000"},
      %{"name" => "吕亭镇", "code" => "340881101000"},
      %{"name" => "范岗镇", "code" => "340881102000"},
      %{"name" => "新渡镇", "code" => "340881103000"},
      %{"name" => "双港镇", "code" => "340881104000"},
      %{"name" => "大关镇", "code" => "340881105000"},
      %{"name" => "青草镇", "code" => "340881106000"},
      %{"name" => "金神镇", "code" => "340881107000"},
      %{"name" => "嬉子湖镇", "code" => "340881108000"},
      %{"name" => "唐湾镇", "code" => "340881109000"},
      %{"name" => "黄甲镇", "code" => "340881110000"},
      %{"name" => "鲟鱼镇", "code" => "340881111000"},
      %{"name" => "桐城经济开发区", "code" => "340881400000"},
      %{"name" => "桐城双新经济开发区", "code" => "340881401000"}
    ]

  def next(input) when input == "潜山市" or input == "340882",
    do: [
      %{"name" => "梅城镇", "code" => "340882100000"},
      %{"name" => "源潭镇", "code" => "340882101000"},
      %{"name" => "余井镇", "code" => "340882102000"},
      %{"name" => "王河镇", "code" => "340882103000"},
      %{"name" => "黄铺镇", "code" => "340882104000"},
      %{"name" => "槎水镇", "code" => "340882105000"},
      %{"name" => "水吼镇", "code" => "340882106000"},
      %{"name" => "官庄镇", "code" => "340882107000"},
      %{"name" => "黄泥镇", "code" => "340882108000"},
      %{"name" => "黄柏镇", "code" => "340882109000"},
      %{"name" => "天柱山镇", "code" => "340882110000"},
      %{"name" => "塔畈乡", "code" => "340882200000"},
      %{"name" => "油坝乡", "code" => "340882201000"},
      %{"name" => "龙潭乡", "code" => "340882202000"},
      %{"name" => "痘姆乡", "code" => "340882203000"},
      %{"name" => "五庙乡", "code" => "340882204000"},
      %{"name" => "安徽潜山经济开发区", "code" => "340882400000"},
      %{"name" => "旅游度假区", "code" => "340882401000"}
    ]

  def next(input) when input == "铜官区" or input == "340705",
    do: [
      %{"name" => "东郊街道", "code" => "340705005000"},
      %{"name" => "新城街道", "code" => "340705006000"},
      %{"name" => "西湖镇", "code" => "340705100000"},
      %{"name" => "铜陵经济技术开发区", "code" => "340705400000"},
      %{"name" => "铜陵狮子山高新技术产业开发区", "code" => "340705401000"},
      %{"name" => "天井湖社区街道", "code" => "340705402000"},
      %{"name" => "映湖社区街道", "code" => "340705403000"},
      %{"name" => "五松社区街道", "code" => "340705404000"},
      %{"name" => "人民社区街道", "code" => "340705405000"},
      %{"name" => "幸福社区街道", "code" => "340705406000"},
      %{"name" => "官塘社区街道", "code" => "340705407000"},
      %{"name" => "学苑社区街道", "code" => "340705408000"},
      %{"name" => "阳光社区街道", "code" => "340705409000"},
      %{"name" => "友好社区街道", "code" => "340705410000"},
      %{"name" => "螺蛳山社区街道", "code" => "340705411000"},
      %{"name" => "露采社区街道", "code" => "340705412000"},
      %{"name" => "金口岭社区街道", "code" => "340705413000"},
      %{"name" => "鹞山社区街道", "code" => "340705414000"},
      %{"name" => "朝阳社区街道", "code" => "340705415000"},
      %{"name" => "滨江社区街道", "code" => "340705416000"},
      %{"name" => "金山社区街道", "code" => "340705417000"},
      %{"name" => "狮子山社区街道", "code" => "340705418000"},
      %{"name" => "立新社区街道", "code" => "340705419000"}
    ]

  def next(input) when input == "义安区" or input == "340706",
    do: [
      %{"name" => "新桥街道", "code" => "340706001000"},
      %{"name" => "五松镇", "code" => "340706100000"},
      %{"name" => "顺安镇", "code" => "340706101000"},
      %{"name" => "钟鸣镇", "code" => "340706102000"},
      %{"name" => "天门镇", "code" => "340706103000"},
      %{"name" => "东联镇", "code" => "340706104000"},
      %{"name" => "西联镇", "code" => "340706105000"},
      %{"name" => "老洲乡", "code" => "340706200000"},
      %{"name" => "胥坝乡", "code" => "340706203000"},
      %{"name" => "义安经济开发区", "code" => "340706401000"}
    ]

  def next(input) when input == "郊区" or input == "340711",
    do: [
      %{"name" => "桥南街道", "code" => "340711001000"},
      %{"name" => "安庆矿区街道", "code" => "340711002000"},
      %{"name" => "铜山镇", "code" => "340711100000"},
      %{"name" => "大通镇", "code" => "340711101000"},
      %{"name" => "老洲镇", "code" => "340711102000"},
      %{"name" => "陈瑶湖镇", "code" => "340711103000"},
      %{"name" => "周潭镇", "code" => "340711104000"},
      %{"name" => "郊区直辖村级区划", "code" => "340711198000"},
      %{"name" => "灰河乡", "code" => "340711200000"},
      %{"name" => "郊区经济开发区", "code" => "340711401000"}
    ]

  def next(input) when input == "枞阳县" or input == "340722",
    do: [
      %{"name" => "横埠镇", "code" => "340722106000"},
      %{"name" => "项铺镇", "code" => "340722107000"},
      %{"name" => "钱桥镇", "code" => "340722108000"},
      %{"name" => "麒麟镇", "code" => "340722109000"},
      %{"name" => "义津镇", "code" => "340722110000"},
      %{"name" => "浮山镇", "code" => "340722111000"},
      %{"name" => "会宫镇", "code" => "340722112000"},
      %{"name" => "官埠桥镇", "code" => "340722113000"},
      %{"name" => "钱铺镇", "code" => "340722114000"},
      %{"name" => "金社镇", "code" => "340722115000"},
      %{"name" => "白柳镇", "code" => "340722116000"},
      %{"name" => "雨坛镇", "code" => "340722117000"},
      %{"name" => "枞阳镇", "code" => "340722118000"},
      %{"name" => "欧山镇", "code" => "340722119000"},
      %{"name" => "汤沟镇", "code" => "340722120000"},
      %{"name" => "白梅乡", "code" => "340722205000"},
      %{"name" => "枞阳经济开发区", "code" => "340722400000"}
    ]

  def next(input) when input == "杜集区" or input == "340602",
    do: [
      %{"name" => "高岳街道", "code" => "340602001000"},
      %{"name" => "矿山集街道", "code" => "340602002000"},
      %{"name" => "朔里镇", "code" => "340602100000"},
      %{"name" => "石台镇", "code" => "340602101000"},
      %{"name" => "段园镇", "code" => "340602102000"},
      %{"name" => "淮北杜集经济开发区", "code" => "340602400000"}
    ]

  def next(input) when input == "相山区" or input == "340603",
    do: [
      %{"name" => "相南街道", "code" => "340603001000"},
      %{"name" => "东街道", "code" => "340603002000"},
      %{"name" => "西街道", "code" => "340603003000"},
      %{"name" => "东山街道", "code" => "340603005000"},
      %{"name" => "任圩街道", "code" => "340603008000"},
      %{"name" => "南黎街道", "code" => "340603009000"},
      %{"name" => "曲阳街道", "code" => "340603010000"},
      %{"name" => "三堤口街道", "code" => "340603011000"},
      %{"name" => "渠沟镇", "code" => "340603100000"},
      %{"name" => "安徽淮北相山经济开发区管理委员会", "code" => "340603400000"}
    ]

  def next(input) when input == "烈山区" or input == "340604",
    do: [
      %{"name" => "杨庄街道", "code" => "340604001000"},
      %{"name" => "临海童街道", "code" => "340604002000"},
      %{"name" => "百善街道", "code" => "340604003000"},
      %{"name" => "任楼街道", "code" => "340604004000"},
      %{"name" => "烈山镇", "code" => "340604100000"},
      %{"name" => "宋疃镇", "code" => "340604101000"},
      %{"name" => "古饶镇", "code" => "340604102000"},
      %{"name" => "烈山区工业园", "code" => "340604400000"}
    ]

  def next(input) when input == "濉溪县" or input == "340621",
    do: [
      %{"name" => "濉溪镇", "code" => "340621100000"},
      %{"name" => "韩村镇", "code" => "340621101000"},
      %{"name" => "刘桥镇", "code" => "340621102000"},
      %{"name" => "五沟镇", "code" => "340621103000"},
      %{"name" => "临涣镇", "code" => "340621104000"},
      %{"name" => "双堆集镇", "code" => "340621105000"},
      %{"name" => "铁佛镇", "code" => "340621106000"},
      %{"name" => "南坪镇", "code" => "340621107000"},
      %{"name" => "百善镇", "code" => "340621108000"},
      %{"name" => "孙疃镇", "code" => "340621109000"},
      %{"name" => "四铺镇", "code" => "340621110000"},
      %{"name" => "安徽省濉溪经济开发区", "code" => "340621400000"},
      %{"name" => "濉溪芜湖现代产业园区", "code" => "340621401000"}
    ]

  def next(input) when input == "花山区" or input == "340503",
    do: [
      %{"name" => "沙塘路街道", "code" => "340503001000"},
      %{"name" => "解放路街道", "code" => "340503002000"},
      %{"name" => "湖东路街道", "code" => "340503003000"},
      %{"name" => "桃源路街道", "code" => "340503004000"},
      %{"name" => "霍里街道", "code" => "340503005000"},
      %{"name" => "金家庄街道", "code" => "340503006000"},
      %{"name" => "塘西街道", "code" => "340503007000"},
      %{"name" => "慈湖街道", "code" => "340503008000"},
      %{"name" => "江东街道", "code" => "340503009000"},
      %{"name" => "濮塘镇", "code" => "340503101000"},
      %{"name" => "慈湖高新技术产业开发区", "code" => "340503401000"}
    ]

  def next(input) when input == "雨山区" or input == "340504",
    do: [
      %{"name" => "平湖街道", "code" => "340504001000"},
      %{"name" => "雨山街道", "code" => "340504002000"},
      %{"name" => "安民街道", "code" => "340504003000"},
      %{"name" => "采石街道", "code" => "340504004000"},
      %{"name" => "向山镇", "code" => "340504100000"},
      %{"name" => "银塘镇", "code" => "340504101000"},
      %{"name" => "佳山乡", "code" => "340504200000"},
      %{"name" => "雨山经济开发区", "code" => "340504401000"},
      %{"name" => "市经济技术开发区", "code" => "340504402000"}
    ]

  def next(input) when input == "博望区" or input == "340506",
    do: [
      %{"name" => "博望镇", "code" => "340506100000"},
      %{"name" => "丹阳镇", "code" => "340506101000"},
      %{"name" => "新市镇", "code" => "340506102000"},
      %{"name" => "博望高新技术产业开发区", "code" => "340506400000"}
    ]

  def next(input) when input == "当涂县" or input == "340521",
    do: [
      %{"name" => "姑孰镇", "code" => "340521100000"},
      %{"name" => "黄池镇", "code" => "340521101000"},
      %{"name" => "乌溪镇", "code" => "340521102000"},
      %{"name" => "石桥镇", "code" => "340521103000"},
      %{"name" => "塘南镇", "code" => "340521104000"},
      %{"name" => "护河镇", "code" => "340521105000"},
      %{"name" => "太白镇", "code" => "340521106000"},
      %{"name" => "年陡镇", "code" => "340521110000"},
      %{"name" => "湖阳镇", "code" => "340521111000"},
      %{"name" => "大陇镇", "code" => "340521112000"},
      %{"name" => "江心乡", "code" => "340521202000"},
      %{"name" => "当涂经济开发区", "code" => "340521400000"},
      %{"name" => "当涂大青山李白文化旅游区", "code" => "340521402000"},
      %{"name" => "当涂现代农业示范区", "code" => "340521500000"}
    ]

  def next(input) when input == "含山县" or input == "340522",
    do: [
      %{"name" => "环峰镇", "code" => "340522100000"},
      %{"name" => "运漕镇", "code" => "340522101000"},
      %{"name" => "铜闸镇", "code" => "340522102000"},
      %{"name" => "陶厂镇", "code" => "340522103000"},
      %{"name" => "林头镇", "code" => "340522104000"},
      %{"name" => "清溪镇", "code" => "340522105000"},
      %{"name" => "仙踪镇", "code" => "340522106000"},
      %{"name" => "昭关镇", "code" => "340522107000"},
      %{"name" => "安徽含山经济开发区", "code" => "340522401000"}
    ]

  def next(input) when input == "和县" or input == "340523",
    do: [
      %{"name" => "历阳镇", "code" => "340523100000"},
      %{"name" => "白桥镇", "code" => "340523102000"},
      %{"name" => "姥桥镇", "code" => "340523103000"},
      %{"name" => "功桥镇", "code" => "340523104000"},
      %{"name" => "西埠镇", "code" => "340523105000"},
      %{"name" => "香泉镇", "code" => "340523106000"},
      %{"name" => "乌江镇", "code" => "340523107000"},
      %{"name" => "善厚镇", "code" => "340523108000"},
      %{"name" => "石杨镇", "code" => "340523109000"},
      %{"name" => "安徽和县经济开发区", "code" => "340523400000"},
      %{"name" => "安徽精细化工产业有机合成基地", "code" => "340523401000"},
      %{"name" => "安徽和县台湾农民创业园", "code" => "340523500000"}
    ]

  def next(input) when input == "大通区" or input == "340402",
    do: [
      %{"name" => "大通街道", "code" => "340402001000"},
      %{"name" => "上窑镇", "code" => "340402100000"},
      %{"name" => "洛河镇", "code" => "340402101000"},
      %{"name" => "九龙岗镇", "code" => "340402102000"},
      %{"name" => "孔店乡", "code" => "340402200000"},
      %{"name" => "淮南经济开发区", "code" => "340402400000"}
    ]

  def next(input) when input == "田家庵区" or input == "340403",
    do: [
      %{"name" => "田东街道", "code" => "340403001000"},
      %{"name" => "新淮街道", "code" => "340403002000"},
      %{"name" => "国庆街道", "code" => "340403003000"},
      %{"name" => "淮滨街道", "code" => "340403004000"},
      %{"name" => "朝阳街道", "code" => "340403005000"},
      %{"name" => "公园街道", "code" => "340403006000"},
      %{"name" => "洞山街道", "code" => "340403007000"},
      %{"name" => "龙泉街道", "code" => "340403008000"},
      %{"name" => "泉山街道", "code" => "340403009000"},
      %{"name" => "舜耕镇", "code" => "340403100000"},
      %{"name" => "安成镇", "code" => "340403101000"},
      %{"name" => "曹庵镇", "code" => "340403102000"},
      %{"name" => "三和镇", "code" => "340403103000"},
      %{"name" => "史院乡", "code" => "340403201000"}
    ]

  def next(input) when input == "谢家集区" or input == "340404",
    do: [
      %{"name" => "谢家集街道", "code" => "340404001000"},
      %{"name" => "蔡家岗街道", "code" => "340404002000"},
      %{"name" => "立新街道", "code" => "340404003000"},
      %{"name" => "谢三村街道", "code" => "340404004000"},
      %{"name" => "平山街道", "code" => "340404005000"},
      %{"name" => "望峰岗镇", "code" => "340404100000"},
      %{"name" => "李郢孜镇", "code" => "340404101000"},
      %{"name" => "唐山镇", "code" => "340404102000"},
      %{"name" => "杨公镇", "code" => "340404103000"},
      %{"name" => "孙庙乡", "code" => "340404200000"},
      %{"name" => "孤堆回族乡", "code" => "340404201000"}
    ]

  def next(input) when input == "八公山区" or input == "340405",
    do: [
      %{"name" => "新庄孜街道", "code" => "340405001000"},
      %{"name" => "土坝孜街道", "code" => "340405002000"},
      %{"name" => "毕家岗街道", "code" => "340405003000"},
      %{"name" => "八公山镇", "code" => "340405100000"},
      %{"name" => "山王镇", "code" => "340405121000"},
      %{"name" => "妙山林场", "code" => "340405400000"}
    ]

  def next(input) when input == "潘集区" or input == "340406",
    do: [
      %{"name" => "田集街道", "code" => "340406001000"},
      %{"name" => "高皇镇", "code" => "340406100000"},
      %{"name" => "平圩镇", "code" => "340406101000"},
      %{"name" => "泥河镇", "code" => "340406102000"},
      %{"name" => "潘集镇", "code" => "340406103000"},
      %{"name" => "芦集镇", "code" => "340406104000"},
      %{"name" => "架河镇", "code" => "340406105000"},
      %{"name" => "夹沟镇", "code" => "340406106000"},
      %{"name" => "祁集镇", "code" => "340406107000"},
      %{"name" => "贺疃镇", "code" => "340406108000"},
      %{"name" => "古沟回族乡", "code" => "340406202000"}
    ]

  def next(input) when input == "凤台县" or input == "340421",
    do: [
      %{"name" => "城关镇", "code" => "340421100000"},
      %{"name" => "新集镇", "code" => "340421102000"},
      %{"name" => "朱马店镇", "code" => "340421103000"},
      %{"name" => "岳张集镇", "code" => "340421104000"},
      %{"name" => "顾桥镇", "code" => "340421105000"},
      %{"name" => "毛集镇", "code" => "340421106000"},
      %{"name" => "夏集镇", "code" => "340421107000"},
      %{"name" => "桂集镇", "code" => "340421108000"},
      %{"name" => "焦岗湖镇", "code" => "340421109000"},
      %{"name" => "凤凰镇", "code" => "340421110000"},
      %{"name" => "杨村镇", "code" => "340421111000"},
      %{"name" => "丁集镇", "code" => "340421112000"},
      %{"name" => "刘集镇", "code" => "340421113000"},
      %{"name" => "大兴镇", "code" => "340421114000"},
      %{"name" => "尚塘镇", "code" => "340421115000"},
      %{"name" => "古店乡", "code" => "340421204000"},
      %{"name" => "钱庙乡", "code" => "340421205000"},
      %{"name" => "关店乡", "code" => "340421209000"},
      %{"name" => "李冲回族乡", "code" => "340421212000"}
    ]

  def next(input) when input == "寿县" or input == "340422",
    do: [
      %{"name" => "寿春镇", "code" => "340422100000"},
      %{"name" => "双桥镇", "code" => "340422101000"},
      %{"name" => "涧沟镇", "code" => "340422102000"},
      %{"name" => "丰庄镇", "code" => "340422103000"},
      %{"name" => "正阳关镇", "code" => "340422104000"},
      %{"name" => "迎河镇", "code" => "340422105000"},
      %{"name" => "板桥镇", "code" => "340422106000"},
      %{"name" => "安丰塘镇", "code" => "340422107000"},
      %{"name" => "堰口镇", "code" => "340422108000"},
      %{"name" => "保义镇", "code" => "340422109000"},
      %{"name" => "隐贤镇", "code" => "340422110000"},
      %{"name" => "安丰镇", "code" => "340422111000"},
      %{"name" => "众兴镇", "code" => "340422112000"},
      %{"name" => "茶庵镇", "code" => "340422113000"},
      %{"name" => "三觉镇", "code" => "340422114000"},
      %{"name" => "炎刘镇", "code" => "340422115000"},
      %{"name" => "刘岗镇", "code" => "340422116000"},
      %{"name" => "双庙集镇", "code" => "340422117000"},
      %{"name" => "小甸镇", "code" => "340422118000"},
      %{"name" => "瓦埠镇", "code" => "340422119000"},
      %{"name" => "大顺镇", "code" => "340422120000"},
      %{"name" => "窑口镇", "code" => "340422121000"},
      %{"name" => "八公山乡", "code" => "340422200000"},
      %{"name" => "张李乡", "code" => "340422201000"},
      %{"name" => "陶店回族乡", "code" => "340422203000"},
      %{"name" => "安徽寿县经济开发区", "code" => "340422402000"},
      %{"name" => "寿西湖农场", "code" => "340422500000"},
      %{"name" => "正阳关农场", "code" => "340422501000"}
    ]

  def next(input) when input == "龙子湖区" or input == "340302",
    do: [
      %{"name" => "东风街道", "code" => "340302001000"},
      %{"name" => "延安街道", "code" => "340302002000"},
      %{"name" => "治淮街道", "code" => "340302003000"},
      %{"name" => "东升街道", "code" => "340302004000"},
      %{"name" => "解放街道", "code" => "340302005000"},
      %{"name" => "曹山街道", "code" => "340302006000"},
      %{"name" => "李楼乡", "code" => "340302200000"}
    ]

  def next(input) when input == "蚌山区" or input == "340303",
    do: [
      %{"name" => "天桥街道", "code" => "340303001000"},
      %{"name" => "青年街道", "code" => "340303002000"},
      %{"name" => "纬二路街道", "code" => "340303003000"},
      %{"name" => "黄庄街道", "code" => "340303004000"},
      %{"name" => "宏业村街道", "code" => "340303005000"},
      %{"name" => "胜利街道", "code" => "340303010000"},
      %{"name" => "龙湖新村街道", "code" => "340303011000"},
      %{"name" => "燕山乡", "code" => "340303200000"},
      %{"name" => "雪华乡", "code" => "340303201000"},
      %{"name" => "湖滨社区行政事务管理中心", "code" => "340303401000"},
      %{"name" => "淮河社区行政事务管理中心", "code" => "340303402000"}
    ]

  def next(input) when input == "禹会区" or input == "340304",
    do: [
      %{"name" => "大庆街道", "code" => "340304001000"},
      %{"name" => "纬四街道", "code" => "340304002000"},
      %{"name" => "钓鱼台街道", "code" => "340304003000"},
      %{"name" => "张公山街道", "code" => "340304004000"},
      %{"name" => "朝阳街道", "code" => "340304005000"},
      %{"name" => "马城镇", "code" => "340304101000"},
      %{"name" => "长青乡", "code" => "340304200000"}
    ]

  def next(input) when input == "淮上区" or input == "340311",
    do: [
      %{"name" => "淮滨街道", "code" => "340311001000"},
      %{"name" => "小蚌埠镇", "code" => "340311100000"},
      %{"name" => "吴小街镇", "code" => "340311101000"},
      %{"name" => "曹老集镇", "code" => "340311102000"},
      %{"name" => "梅桥镇", "code" => "340311103000"},
      %{"name" => "沫河口镇", "code" => "340311104000"},
      %{"name" => "安徽蚌埠淮上经济开发区", "code" => "340311402000"}
    ]

  def next(input) when input == "怀远县" or input == "340321",
    do: [
      %{"name" => "引凤街道", "code" => "340321001000"},
      %{"name" => "望淮街道", "code" => "340321002000"},
      %{"name" => "白乳泉街道", "code" => "340321003000"},
      %{"name" => "榴城镇", "code" => "340321100000"},
      %{"name" => "包集镇", "code" => "340321101000"},
      %{"name" => "龙亢镇", "code" => "340321102000"},
      %{"name" => "河溜镇", "code" => "340321103000"},
      %{"name" => "常坟镇", "code" => "340321104000"},
      %{"name" => "双桥集镇", "code" => "340321106000"},
      %{"name" => "魏庄镇", "code" => "340321107000"},
      %{"name" => "万福镇", "code" => "340321108000"},
      %{"name" => "唐集镇", "code" => "340321109000"},
      %{"name" => "白莲坡镇", "code" => "340321110000"},
      %{"name" => "褚集镇", "code" => "340321111000"},
      %{"name" => "古城镇", "code" => "340321112000"},
      %{"name" => "荆山镇", "code" => "340321113000"},
      %{"name" => "淝南镇", "code" => "340321114000"},
      %{"name" => "陈集镇", "code" => "340321115000"},
      %{"name" => "淝河镇", "code" => "340321116000"},
      %{"name" => "兰桥镇", "code" => "340321117000"},
      %{"name" => "徐圩乡", "code" => "340321205000"},
      %{"name" => "龙亢农场", "code" => "340321400000"},
      %{"name" => "安徽怀远经济开发区", "code" => "340321401000"}
    ]

  def next(input) when input == "五河县" or input == "340322",
    do: [
      %{"name" => "城关镇", "code" => "340322100000"},
      %{"name" => "新集镇", "code" => "340322101000"},
      %{"name" => "小溪镇", "code" => "340322103000"},
      %{"name" => "双忠庙镇", "code" => "340322104000"},
      %{"name" => "小圩镇", "code" => "340322105000"},
      %{"name" => "东刘集镇", "code" => "340322106000"},
      %{"name" => "头铺镇", "code" => "340322107000"},
      %{"name" => "大新镇", "code" => "340322108000"},
      %{"name" => "武桥镇", "code" => "340322109000"},
      %{"name" => "朱顶镇", "code" => "340322110000"},
      %{"name" => "浍南镇", "code" => "340322111000"},
      %{"name" => "申集镇", "code" => "340322112000"},
      %{"name" => "沱湖乡", "code" => "340322200000"},
      %{"name" => "临北回族乡", "code" => "340322201000"},
      %{"name" => "安徽五河经济开发区", "code" => "340322400000"}
    ]

  def next(input) when input == "固镇县" or input == "340323",
    do: [
      %{"name" => "谷阳镇", "code" => "340323100000"},
      %{"name" => "王庄镇", "code" => "340323101000"},
      %{"name" => "新马桥镇", "code" => "340323102000"},
      %{"name" => "连城镇", "code" => "340323103000"},
      %{"name" => "刘集镇", "code" => "340323104000"},
      %{"name" => "任桥镇", "code" => "340323105000"},
      %{"name" => "湖沟镇", "code" => "340323106000"},
      %{"name" => "濠城镇", "code" => "340323107000"},
      %{"name" => "杨庙镇", "code" => "340323108000"},
      %{"name" => "仲兴镇", "code" => "340323109000"},
      %{"name" => "石湖乡", "code" => "340323200000"},
      %{"name" => "安徽固镇经济开发区", "code" => "340323402000"}
    ]

  def next(input) when input == "蚌埠市高新技术开发区" or input == "340371",
    do: [
      %{"name" => "秦集镇", "code" => "340371100000"},
      %{"name" => "高新技术开发区管委会", "code" => "340371400000"},
      %{"name" => "安徽怀远马城经济开发区", "code" => "340371401000"}
    ]

  def next(input) when input == "蚌埠市经济开发区" or input == "340372",
    do: [
      %{"name" => "长淮卫镇", "code" => "340372100000"},
      %{"name" => "经济开发区管委会", "code" => "340372400000"}
    ]

  def next(input) when input == "镜湖区" or input == "340202",
    do: [
      %{"name" => "方村街道", "code" => "340202012000"},
      %{"name" => "张家山街道", "code" => "340202013000"},
      %{"name" => "赭麓街道", "code" => "340202014000"},
      %{"name" => "范罗山街道", "code" => "340202015000"},
      %{"name" => "赭山街道", "code" => "340202016000"},
      %{"name" => "弋矶山街道", "code" => "340202017000"},
      %{"name" => "汀棠街道", "code" => "340202018000"},
      %{"name" => "天门山街道", "code" => "340202019000"},
      %{"name" => "大砻坊街道", "code" => "340202020000"},
      %{"name" => "荆山街道", "code" => "340202021000"}
    ]

  def next(input) when input == "鸠江区" or input == "340207",
    do: [
      %{"name" => "四褐山街道", "code" => "340207001000"},
      %{"name" => "裕溪口街道", "code" => "340207002000"},
      %{"name" => "官陡街道", "code" => "340207003000"},
      %{"name" => "湾里街道", "code" => "340207004000"},
      %{"name" => "清水街道", "code" => "340207005000"},
      %{"name" => "沈巷镇", "code" => "340207101000"},
      %{"name" => "二坝镇", "code" => "340207102000"},
      %{"name" => "汤沟镇", "code" => "340207103000"},
      %{"name" => "白茆镇", "code" => "340207104000"},
      %{"name" => "安徽省江北产业集中区", "code" => "340207401000"},
      %{"name" => "安徽芜湖鸠江经济开发区", "code" => "340207402000"},
      %{"name" => "鸠江经济开发区二坝园区", "code" => "340207403000"}
    ]

  def next(input) when input == "弋江区" or input == "340209",
    do: [
      %{"name" => "中南街道", "code" => "340209001000"},
      %{"name" => "马塘街道", "code" => "340209002000"},
      %{"name" => "瀂港街道", "code" => "340209003000"},
      %{"name" => "火龙街道", "code" => "340209004000"},
      %{"name" => "白马街道", "code" => "340209005000"},
      %{"name" => "南瑞街道", "code" => "340209006000"},
      %{"name" => "芜湖高新技术产业开发区", "code" => "340209400000"}
    ]

  def next(input) when input == "湾沚区" or input == "340210",
    do: [
      %{"name" => "湾沚镇", "code" => "340210100000"},
      %{"name" => "陶辛镇", "code" => "340210101000"},
      %{"name" => "六郎镇", "code" => "340210102000"},
      %{"name" => "花桥镇", "code" => "340210103000"},
      %{"name" => "红杨镇", "code" => "340210104000"},
      %{"name" => "安徽新芜经济开发区", "code" => "340210400000"}
    ]

  def next(input) when input == "繁昌区" or input == "340212",
    do: [
      %{"name" => "繁阳镇", "code" => "340212100000"},
      %{"name" => "荻港镇", "code" => "340212101000"},
      %{"name" => "孙村镇", "code" => "340212102000"},
      %{"name" => "平铺镇", "code" => "340212103000"},
      %{"name" => "新港镇", "code" => "340212104000"},
      %{"name" => "峨山镇", "code" => "340212105000"},
      %{"name" => "安徽繁昌工业园区", "code" => "340212401000"}
    ]

  def next(input) when input == "南陵县" or input == "340223",
    do: [
      %{"name" => "籍山镇", "code" => "340223100000"},
      %{"name" => "许镇镇", "code" => "340223101000"},
      %{"name" => "弋江镇", "code" => "340223102000"},
      %{"name" => "三里镇", "code" => "340223103000"},
      %{"name" => "何湾镇", "code" => "340223104000"},
      %{"name" => "工山镇", "code" => "340223105000"},
      %{"name" => "烟墩镇", "code" => "340223106000"},
      %{"name" => "家发镇", "code" => "340223107000"},
      %{"name" => "安徽南陵工业园区", "code" => "340223400000"}
    ]

  def next(input) when input == "芜湖经济技术开发区" or input == "340271",
    do: [
      %{"name" => "龙山街道", "code" => "340271001000"},
      %{"name" => "万春街道", "code" => "340271002000"}
    ]

  def next(input) when input == "安徽芜湖三山经济开发区" or input == "340272",
    do: [
      %{"name" => "保定街道", "code" => "340272002000"},
      %{"name" => "龙湖街道", "code" => "340272003000"},
      %{"name" => "高安街道", "code" => "340272004000"},
      %{"name" => "三山街道", "code" => "340272005000"},
      %{"name" => "峨桥镇", "code" => "340272100000"}
    ]

  def next(input) when input == "无为市" or input == "340281",
    do: [
      %{"name" => "无城镇", "code" => "340281100000"},
      %{"name" => "襄安镇", "code" => "340281101000"},
      %{"name" => "陡沟镇", "code" => "340281104000"},
      %{"name" => "石涧镇", "code" => "340281105000"},
      %{"name" => "严桥镇", "code" => "340281106000"},
      %{"name" => "开城镇", "code" => "340281107000"},
      %{"name" => "蜀山镇", "code" => "340281108000"},
      %{"name" => "牛埠镇", "code" => "340281109000"},
      %{"name" => "刘渡镇", "code" => "340281110000"},
      %{"name" => "姚沟镇", "code" => "340281111000"},
      %{"name" => "泥汊镇", "code" => "340281112000"},
      %{"name" => "福渡镇", "code" => "340281114000"},
      %{"name" => "泉塘镇", "code" => "340281115000"},
      %{"name" => "赫店镇", "code" => "340281116000"},
      %{"name" => "红庙镇", "code" => "340281117000"},
      %{"name" => "高沟镇", "code" => "340281118000"},
      %{"name" => "鹤毛镇", "code" => "340281119000"},
      %{"name" => "十里墩镇", "code" => "340281120000"},
      %{"name" => "昆山镇", "code" => "340281121000"},
      %{"name" => "洪巷镇", "code" => "340281122000"},
      %{"name" => "安徽无为经济开发区", "code" => "340281400000"}
    ]

  def next(input) when input == "瑶海区" or input == "340102",
    do: [
      %{"name" => "明光路街道", "code" => "340102001000"},
      %{"name" => "胜利路街道", "code" => "340102003000"},
      %{"name" => "三里街街道", "code" => "340102004000"},
      %{"name" => "铜陵路街道", "code" => "340102005000"},
      %{"name" => "七里站街道", "code" => "340102006000"},
      %{"name" => "红光街道", "code" => "340102007000"},
      %{"name" => "和平路街道", "code" => "340102008000"},
      %{"name" => "城东街道", "code" => "340102010000"},
      %{"name" => "长淮街道", "code" => "340102011000"},
      %{"name" => "方庙街道", "code" => "340102012000"},
      %{"name" => "嘉山路街道", "code" => "340102014000"},
      %{"name" => "大兴镇", "code" => "340102100000"},
      %{"name" => "合肥龙岗综合经济开发区", "code" => "340102401000"}
    ]

  def next(input) when input == "庐阳区" or input == "340103",
    do: [
      %{"name" => "亳州路街道", "code" => "340103001000"},
      %{"name" => "双岗街道", "code" => "340103002000"},
      %{"name" => "杏林街道", "code" => "340103003000"},
      %{"name" => "海棠街道", "code" => "340103004000"},
      %{"name" => "杏花村街道", "code" => "340103005000"},
      %{"name" => "逍遥津街道", "code" => "340103006000"},
      %{"name" => "三孝口街道", "code" => "340103009000"},
      %{"name" => "四里河街道", "code" => "340103012000"},
      %{"name" => "大杨镇", "code" => "340103100000"},
      %{"name" => "三十岗乡", "code" => "340103200000"},
      %{"name" => "庐阳工业区（林店街道）", "code" => "340103400000"}
    ]

  def next(input) when input == "蜀山区" or input == "340104",
    do: [
      %{"name" => "三里庵街道", "code" => "340104001000"},
      %{"name" => "稻香村街道", "code" => "340104002000"},
      %{"name" => "琥珀街道", "code" => "340104003000"},
      %{"name" => "南七街道", "code" => "340104004000"},
      %{"name" => "西园街道", "code" => "340104005000"},
      %{"name" => "五里墩街道", "code" => "340104006000"},
      %{"name" => "荷叶地街道", "code" => "340104007000"},
      %{"name" => "笔架山街道", "code" => "340104008000"},
      %{"name" => "井岗镇", "code" => "340104100000"},
      %{"name" => "南岗镇", "code" => "340104101000"},
      %{"name" => "小庙镇", "code" => "340104102000"},
      %{"name" => "蜀山新产业园区", "code" => "340104400000"}
    ]

  def next(input) when input == "包河区" or input == "340111",
    do: [
      %{"name" => "骆岗街道", "code" => "340111001000"},
      %{"name" => "常青街道", "code" => "340111002000"},
      %{"name" => "芜湖路街道", "code" => "340111003000"},
      %{"name" => "包公街道", "code" => "340111004000"},
      %{"name" => "望湖街道", "code" => "340111005000"},
      %{"name" => "义城街道", "code" => "340111006000"},
      %{"name" => "烟墩街道", "code" => "340111007000"},
      %{"name" => "万年埠街道", "code" => "340111010000"},
      %{"name" => "同安街道", "code" => "340111011000"},
      %{"name" => "淝河镇", "code" => "340111100000"},
      %{"name" => "大圩镇", "code" => "340111102000"},
      %{"name" => "滨湖世纪社区", "code" => "340111400000"},
      %{"name" => "方兴社区", "code" => "340111401000"}
    ]

  def next(input) when input == "长丰县" or input == "340121",
    do: [
      %{"name" => "水湖镇", "code" => "340121100000"},
      %{"name" => "庄墓镇", "code" => "340121101000"},
      %{"name" => "杨庙镇", "code" => "340121102000"},
      %{"name" => "吴山镇", "code" => "340121103000"},
      %{"name" => "岗集镇", "code" => "340121104000"},
      %{"name" => "双墩镇", "code" => "340121105000"},
      %{"name" => "下塘镇", "code" => "340121106000"},
      %{"name" => "朱巷镇", "code" => "340121107000"},
      %{"name" => "陶楼镇", "code" => "340121109000"},
      %{"name" => "杜集镇", "code" => "340121110000"},
      %{"name" => "义井镇", "code" => "340121111000"},
      %{"name" => "左店镇", "code" => "340121112000"},
      %{"name" => "罗塘乡", "code" => "340121200000"},
      %{"name" => "造甲乡", "code" => "340121203000"},
      %{"name" => "双凤开发区", "code" => "340121400000"},
      %{"name" => "安徽省水家湖农场", "code" => "340121401000"}
    ]

  def next(input) when input == "肥东县" or input == "340122",
    do: [
      %{"name" => "店埠镇", "code" => "340122100000"},
      %{"name" => "撮镇镇", "code" => "340122101000"},
      %{"name" => "梁园镇", "code" => "340122102000"},
      %{"name" => "桥头集镇", "code" => "340122103000"},
      %{"name" => "长临河镇", "code" => "340122104000"},
      %{"name" => "石塘镇", "code" => "340122105000"},
      %{"name" => "古城镇", "code" => "340122106000"},
      %{"name" => "八斗镇", "code" => "340122107000"},
      %{"name" => "元疃镇", "code" => "340122108000"},
      %{"name" => "白龙镇", "code" => "340122109000"},
      %{"name" => "包公镇", "code" => "340122110000"},
      %{"name" => "陈集镇", "code" => "340122111000"},
      %{"name" => "众兴乡", "code" => "340122200000"},
      %{"name" => "张集乡", "code" => "340122201000"},
      %{"name" => "马湖乡", "code" => "340122202000"},
      %{"name" => "响导乡", "code" => "340122204000"},
      %{"name" => "杨店乡", "code" => "340122205000"},
      %{"name" => "牌坊回族满族乡", "code" => "340122206000"},
      %{"name" => "肥东经济开发区管理委员会", "code" => "340122401000"},
      %{"name" => "合肥循环经济示范园", "code" => "340122402000"}
    ]

  def next(input) when input == "肥西县" or input == "340123",
    do: [
      %{"name" => "上派镇", "code" => "340123100000"},
      %{"name" => "三河镇", "code" => "340123101000"},
      %{"name" => "官亭镇", "code" => "340123103000"},
      %{"name" => "山南镇", "code" => "340123105000"},
      %{"name" => "花岗镇", "code" => "340123106000"},
      %{"name" => "紫蓬镇", "code" => "340123107000"},
      %{"name" => "桃花镇", "code" => "340123108000"},
      %{"name" => "丰乐镇", "code" => "340123109000"},
      %{"name" => "高店镇", "code" => "340123111000"},
      %{"name" => "严店镇", "code" => "340123112000"},
      %{"name" => "铭传乡", "code" => "340123201000"},
      %{"name" => "柿树岗乡", "code" => "340123202000"},
      %{"name" => "安徽肥西经济开发区", "code" => "340123400000"},
      %{"name" => "紫蓬山管委会", "code" => "340123401000"}
    ]

  def next(input) when input == "庐江县" or input == "340124",
    do: [
      %{"name" => "东顾山街道", "code" => "340124001000"},
      %{"name" => "岗湾街道", "code" => "340124002000"},
      %{"name" => "移湖街道", "code" => "340124003000"},
      %{"name" => "庐城镇", "code" => "340124100000"},
      %{"name" => "冶父山镇", "code" => "340124101000"},
      %{"name" => "万山镇", "code" => "340124102000"},
      %{"name" => "汤池镇", "code" => "340124103000"},
      %{"name" => "郭河镇", "code" => "340124104000"},
      %{"name" => "金牛镇", "code" => "340124105000"},
      %{"name" => "石头镇", "code" => "340124106000"},
      %{"name" => "同大镇", "code" => "340124107000"},
      %{"name" => "白山镇", "code" => "340124108000"},
      %{"name" => "盛桥镇", "code" => "340124109000"},
      %{"name" => "白湖镇", "code" => "340124110000"},
      %{"name" => "龙桥镇", "code" => "340124111000"},
      %{"name" => "矾山镇", "code" => "340124112000"},
      %{"name" => "罗河镇", "code" => "340124113000"},
      %{"name" => "泥河镇", "code" => "340124114000"},
      %{"name" => "乐桥镇", "code" => "340124115000"},
      %{"name" => "柯坦镇", "code" => "340124116000"},
      %{"name" => "安徽合肥庐江高新技术产业开发区", "code" => "340124400000"},
      %{"name" => "白湖监狱生活社区", "code" => "340124401000"},
      %{"name" => "台创园管委会", "code" => "340124404000"},
      %{"name" => "庐江化工园", "code" => "340124405000"}
    ]

  def next(input) when input == "合肥高新技术产业开发区" or input == "340176",
    do: [
      %{"name" => "天乐社区服务中心", "code" => "340176401000"},
      %{"name" => "兴园社区服务中心", "code" => "340176402000"},
      %{"name" => "蜀麓社区服务中心", "code" => "340176403000"},
      %{"name" => "长宁社区服务中心", "code" => "340176404000"},
      %{"name" => "小庙托管区", "code" => "340176405000"},
      %{"name" => "城西桥社区服务中心", "code" => "340176408000"}
    ]

  def next(input) when input == "合肥经济技术开发区" or input == "340177",
    do: [
      %{"name" => "高刘街道", "code" => "340177006000"},
      %{"name" => "新港工业园", "code" => "340177400000"},
      %{"name" => "合淮合作区", "code" => "340177401000"},
      %{"name" => "莲花社区", "code" => "340177402000"},
      %{"name" => "芙蓉社区", "code" => "340177403000"},
      %{"name" => "锦绣社区", "code" => "340177404000"},
      %{"name" => "海恒社区", "code" => "340177405000"},
      %{"name" => "临湖社区", "code" => "340177406000"}
    ]

  def next(input) when input == "合肥新站高新技术产业开发区" or input == "340178",
    do: [
      %{"name" => "七里塘街道", "code" => "340178001000"},
      %{"name" => "磨店街道", "code" => "340178002000"},
      %{"name" => "三十头街道", "code" => "340178003000"},
      %{"name" => "瑶海社区服务中心", "code" => "340178400000"},
      %{"name" => "站北社区服务中心", "code" => "340178401000"}
    ]

  def next(input) when input == "巢湖市" or input == "340181",
    do: [
      %{"name" => "中庙街道", "code" => "340181001000"},
      %{"name" => "亚父街道", "code" => "340181002000"},
      %{"name" => "卧牛山街道", "code" => "340181003000"},
      %{"name" => "凤凰山街道", "code" => "340181004000"},
      %{"name" => "天河街道", "code" => "340181005000"},
      %{"name" => "半汤街道", "code" => "340181006000"},
      %{"name" => "栏杆集镇", "code" => "340181100000"},
      %{"name" => "苏湾镇", "code" => "340181101000"},
      %{"name" => "柘皋镇", "code" => "340181102000"},
      %{"name" => "银屏镇", "code" => "340181103000"},
      %{"name" => "夏阁镇", "code" => "340181104000"},
      %{"name" => "中垾镇", "code" => "340181105000"},
      %{"name" => "散兵镇", "code" => "340181106000"},
      %{"name" => "烔炀镇", "code" => "340181107000"},
      %{"name" => "黄麓镇", "code" => "340181108000"},
      %{"name" => "槐林镇", "code" => "340181109000"},
      %{"name" => "坝镇镇", "code" => "340181110000"},
      %{"name" => "庙岗镇", "code" => "340181111000"}
    ]

  def next(_), do: nil
end