defmodule ChinaAdminDivisions.Gen.Lv3x.M35 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "蕉城区" or input == "350902",
    do: [
      %{"name" => "蕉南街道", "code" => "350902001000"},
      %{"name" => "蕉北街道", "code" => "350902002000"},
      %{"name" => "城南镇", "code" => "350902100000"},
      %{"name" => "漳湾镇", "code" => "350902101000"},
      %{"name" => "七都镇", "code" => "350902102000"},
      %{"name" => "八都镇", "code" => "350902103000"},
      %{"name" => "九都镇", "code" => "350902104000"},
      %{"name" => "霍童镇", "code" => "350902105000"},
      %{"name" => "赤溪镇", "code" => "350902106000"},
      %{"name" => "洋中镇", "code" => "350902107000"},
      %{"name" => "飞鸾镇", "code" => "350902108000"},
      %{"name" => "三都镇", "code" => "350902109000"},
      %{"name" => "虎贝镇", "code" => "350902110000"},
      %{"name" => "金涵畲族乡", "code" => "350902200000"},
      %{"name" => "洪口乡", "code" => "350902201000"},
      %{"name" => "石后乡", "code" => "350902202000"},
      %{"name" => "东侨开发区", "code" => "350902500000"}
    ]

  def next(input) when input == "霞浦县" or input == "350921",
    do: [
      %{"name" => "松城街道", "code" => "350921001000"},
      %{"name" => "松港街道", "code" => "350921002000"},
      %{"name" => "松山街道", "code" => "350921003000"},
      %{"name" => "长春镇", "code" => "350921101000"},
      %{"name" => "牙城镇", "code" => "350921102000"},
      %{"name" => "溪南镇", "code" => "350921103000"},
      %{"name" => "沙江镇", "code" => "350921104000"},
      %{"name" => "下浒镇", "code" => "350921105000"},
      %{"name" => "三沙镇", "code" => "350921106000"},
      %{"name" => "盐田畲族乡", "code" => "350921200000"},
      %{"name" => "水门畲族乡", "code" => "350921201000"},
      %{"name" => "崇儒畲族乡", "code" => "350921202000"},
      %{"name" => "柏洋乡", "code" => "350921203000"},
      %{"name" => "北壁乡", "code" => "350921204000"},
      %{"name" => "海岛乡", "code" => "350921205000"}
    ]

  def next(input) when input == "古田县" or input == "350922",
    do: [
      %{"name" => "城东街道", "code" => "350922001000"},
      %{"name" => "城西街道", "code" => "350922002000"},
      %{"name" => "平湖镇", "code" => "350922101000"},
      %{"name" => "大桥镇", "code" => "350922102000"},
      %{"name" => "黄田镇", "code" => "350922103000"},
      %{"name" => "鹤塘镇", "code" => "350922104000"},
      %{"name" => "杉洋镇", "code" => "350922105000"},
      %{"name" => "凤都镇", "code" => "350922106000"},
      %{"name" => "水口镇", "code" => "350922107000"},
      %{"name" => "大甲镇", "code" => "350922108000"},
      %{"name" => "吉巷乡", "code" => "350922201000"},
      %{"name" => "泮洋乡", "code" => "350922203000"},
      %{"name" => "凤埔乡", "code" => "350922204000"},
      %{"name" => "卓洋乡", "code" => "350922205000"}
    ]

  def next(input) when input == "屏南县" or input == "350923",
    do: [
      %{"name" => "古峰镇", "code" => "350923100000"},
      %{"name" => "双溪镇", "code" => "350923101000"},
      %{"name" => "代溪镇", "code" => "350923102000"},
      %{"name" => "长桥镇", "code" => "350923103000"},
      %{"name" => "棠口镇", "code" => "350923104000"},
      %{"name" => "屏城乡", "code" => "350923200000"},
      %{"name" => "甘棠乡", "code" => "350923202000"},
      %{"name" => "熙岭乡", "code" => "350923203000"},
      %{"name" => "路下乡", "code" => "350923204000"},
      %{"name" => "寿山乡", "code" => "350923205000"},
      %{"name" => "岭下乡", "code" => "350923206000"}
    ]

  def next(input) when input == "寿宁县" or input == "350924",
    do: [
      %{"name" => "鳌阳镇", "code" => "350924100000"},
      %{"name" => "斜滩镇", "code" => "350924101000"},
      %{"name" => "南阳镇", "code" => "350924102000"},
      %{"name" => "武曲镇", "code" => "350924103000"},
      %{"name" => "犀溪镇", "code" => "350924104000"},
      %{"name" => "平溪镇", "code" => "350924105000"},
      %{"name" => "凤阳镇", "code" => "350924106000"},
      %{"name" => "清源镇", "code" => "350924107000"},
      %{"name" => "大安乡", "code" => "350924200000"},
      %{"name" => "坑底乡", "code" => "350924201000"},
      %{"name" => "竹管垅乡", "code" => "350924203000"},
      %{"name" => "芹洋乡", "code" => "350924205000"},
      %{"name" => "托溪乡", "code" => "350924206000"},
      %{"name" => "下党乡", "code" => "350924209000"}
    ]

  def next(input) when input == "周宁县" or input == "350925",
    do: [
      %{"name" => "狮城镇", "code" => "350925100000"},
      %{"name" => "咸村镇", "code" => "350925101000"},
      %{"name" => "浦源镇", "code" => "350925102000"},
      %{"name" => "七步镇", "code" => "350925103000"},
      %{"name" => "李墩镇", "code" => "350925104000"},
      %{"name" => "纯池镇", "code" => "350925105000"},
      %{"name" => "泗桥乡", "code" => "350925200000"},
      %{"name" => "礼门乡", "code" => "350925201000"},
      %{"name" => "玛坑乡", "code" => "350925202000"}
    ]

  def next(input) when input == "柘荣县" or input == "350926",
    do: [
      %{"name" => "双城镇", "code" => "350926100000"},
      %{"name" => "富溪镇", "code" => "350926101000"},
      %{"name" => "城郊乡", "code" => "350926200000"},
      %{"name" => "乍洋乡", "code" => "350926201000"},
      %{"name" => "东源乡", "code" => "350926202000"},
      %{"name" => "黄柏乡", "code" => "350926203000"},
      %{"name" => "宅中乡", "code" => "350926204000"},
      %{"name" => "楮坪乡", "code" => "350926205000"},
      %{"name" => "英山乡", "code" => "350926206000"}
    ]

  def next(input) when input == "福安市" or input == "350981",
    do: [
      %{"name" => "城南街道", "code" => "350981001000"},
      %{"name" => "城北街道", "code" => "350981002000"},
      %{"name" => "阳头街道", "code" => "350981003000"},
      %{"name" => "罗江街道", "code" => "350981004000"},
      %{"name" => "赛岐镇", "code" => "350981100000"},
      %{"name" => "穆阳镇", "code" => "350981101000"},
      %{"name" => "上白石镇", "code" => "350981102000"},
      %{"name" => "潭头镇", "code" => "350981103000"},
      %{"name" => "社口镇", "code" => "350981104000"},
      %{"name" => "晓阳镇", "code" => "350981105000"},
      %{"name" => "溪潭镇", "code" => "350981106000"},
      %{"name" => "甘棠镇", "code" => "350981107000"},
      %{"name" => "下白石镇", "code" => "350981108000"},
      %{"name" => "溪尾镇", "code" => "350981109000"},
      %{"name" => "溪柄镇", "code" => "350981110000"},
      %{"name" => "湾坞镇", "code" => "350981111000"},
      %{"name" => "城阳镇", "code" => "350981112000"},
      %{"name" => "坂中畲族乡", "code" => "350981201000"},
      %{"name" => "范坑乡", "code" => "350981202000"},
      %{"name" => "穆云畲族乡", "code" => "350981203000"},
      %{"name" => "康厝畲族乡", "code" => "350981204000"},
      %{"name" => "松罗乡", "code" => "350981206000"},
      %{"name" => "福安畲族开发区", "code" => "350981501000"},
      %{"name" => "湾坞工业集中区", "code" => "350981502000"}
    ]

  def next(input) when input == "福鼎市" or input == "350982",
    do: [
      %{"name" => "桐山街道", "code" => "350982001000"},
      %{"name" => "桐城街道", "code" => "350982002000"},
      %{"name" => "山前街道", "code" => "350982003000"},
      %{"name" => "贯岭镇", "code" => "350982100000"},
      %{"name" => "前岐镇", "code" => "350982101000"},
      %{"name" => "沙埕镇", "code" => "350982102000"},
      %{"name" => "店下镇", "code" => "350982103000"},
      %{"name" => "太姥山镇", "code" => "350982104000"},
      %{"name" => "磻溪镇", "code" => "350982105000"},
      %{"name" => "白琳镇", "code" => "350982106000"},
      %{"name" => "点头镇", "code" => "350982107000"},
      %{"name" => "管阳镇", "code" => "350982108000"},
      %{"name" => "嵛山镇", "code" => "350982109000"},
      %{"name" => "硖门畲族乡", "code" => "350982200000"},
      %{"name" => "叠石乡", "code" => "350982201000"},
      %{"name" => "佳阳乡", "code" => "350982202000"},
      %{"name" => "龙安开发区", "code" => "350982500000"}
    ]

  def next(input) when input == "新罗区" or input == "350802",
    do: [
      %{"name" => "东城街道", "code" => "350802001000"},
      %{"name" => "南城街道", "code" => "350802002000"},
      %{"name" => "西城街道", "code" => "350802003000"},
      %{"name" => "中城街道", "code" => "350802004000"},
      %{"name" => "西陂街道", "code" => "350802005000"},
      %{"name" => "曹溪街道", "code" => "350802006000"},
      %{"name" => "东肖街道", "code" => "350802007000"},
      %{"name" => "龙门街道", "code" => "350802008000"},
      %{"name" => "铁山街道", "code" => "350802009000"},
      %{"name" => "北城街道", "code" => "350802010000"},
      %{"name" => "红坊镇", "code" => "350802100000"},
      %{"name" => "适中镇", "code" => "350802101000"},
      %{"name" => "雁石镇", "code" => "350802102000"},
      %{"name" => "白沙镇", "code" => "350802103000"},
      %{"name" => "万安镇", "code" => "350802104000"},
      %{"name" => "大池镇", "code" => "350802105000"},
      %{"name" => "小池镇", "code" => "350802106000"},
      %{"name" => "江山镇", "code" => "350802107000"},
      %{"name" => "岩山镇", "code" => "350802108000"},
      %{"name" => "苏坂镇", "code" => "350802109000"}
    ]

  def next(input) when input == "永定区" or input == "350803",
    do: [
      %{"name" => "凤城街道", "code" => "350803001000"},
      %{"name" => "坎市镇", "code" => "350803101000"},
      %{"name" => "下洋镇", "code" => "350803102000"},
      %{"name" => "湖雷镇", "code" => "350803103000"},
      %{"name" => "高陂镇", "code" => "350803104000"},
      %{"name" => "抚市镇", "code" => "350803105000"},
      %{"name" => "湖坑镇", "code" => "350803106000"},
      %{"name" => "培丰镇", "code" => "350803107000"},
      %{"name" => "龙潭镇", "code" => "350803108000"},
      %{"name" => "峰市镇", "code" => "350803109000"},
      %{"name" => "城郊镇", "code" => "350803110000"},
      %{"name" => "仙师镇", "code" => "350803111000"},
      %{"name" => "虎岗镇", "code" => "350803112000"},
      %{"name" => "堂堡镇", "code" => "350803113000"},
      %{"name" => "岐岭镇", "code" => "350803114000"},
      %{"name" => "金砂镇", "code" => "350803115000"},
      %{"name" => "洪山镇", "code" => "350803116000"},
      %{"name" => "高头镇", "code" => "350803117000"},
      %{"name" => "西溪乡", "code" => "350803201000"},
      %{"name" => "湖山乡", "code" => "350803205000"},
      %{"name" => "古竹乡", "code" => "350803207000"},
      %{"name" => "合溪乡", "code" => "350803209000"},
      %{"name" => "大溪乡", "code" => "350803211000"},
      %{"name" => "陈东乡", "code" => "350803212000"}
    ]

  def next(input) when input == "长汀县" or input == "350821",
    do: [
      %{"name" => "汀州镇", "code" => "350821100000"},
      %{"name" => "大同镇", "code" => "350821101000"},
      %{"name" => "古城镇", "code" => "350821102000"},
      %{"name" => "新桥镇", "code" => "350821103000"},
      %{"name" => "馆前镇", "code" => "350821104000"},
      %{"name" => "童坊镇", "code" => "350821105000"},
      %{"name" => "河田镇", "code" => "350821106000"},
      %{"name" => "南山镇", "code" => "350821107000"},
      %{"name" => "濯田镇", "code" => "350821108000"},
      %{"name" => "四都镇", "code" => "350821109000"},
      %{"name" => "涂坊镇", "code" => "350821110000"},
      %{"name" => "策武镇", "code" => "350821111000"},
      %{"name" => "三洲镇", "code" => "350821112000"},
      %{"name" => "铁长乡", "code" => "350821201000"},
      %{"name" => "庵杰乡", "code" => "350821202000"},
      %{"name" => "宣成乡", "code" => "350821204000"},
      %{"name" => "红山乡", "code" => "350821205000"},
      %{"name" => "羊牯乡", "code" => "350821206000"}
    ]

  def next(input) when input == "上杭县" or input == "350823",
    do: [
      %{"name" => "临江镇", "code" => "350823100000"},
      %{"name" => "临城镇", "code" => "350823101000"},
      %{"name" => "中都镇", "code" => "350823102000"},
      %{"name" => "蓝溪镇", "code" => "350823103000"},
      %{"name" => "稔田镇", "code" => "350823104000"},
      %{"name" => "白砂镇", "code" => "350823105000"},
      %{"name" => "古田镇", "code" => "350823106000"},
      %{"name" => "才溪镇", "code" => "350823107000"},
      %{"name" => "南阳镇", "code" => "350823108000"},
      %{"name" => "蛟洋镇", "code" => "350823109000"},
      %{"name" => "旧县镇", "code" => "350823110000"},
      %{"name" => "湖洋镇", "code" => "350823111000"},
      %{"name" => "溪口镇", "code" => "350823112000"},
      %{"name" => "太拔镇", "code" => "350823113000"},
      %{"name" => "通贤镇", "code" => "350823114000"},
      %{"name" => "下都镇", "code" => "350823115000"},
      %{"name" => "茶地镇", "code" => "350823116000"},
      %{"name" => "庐丰畲族乡", "code" => "350823202000"},
      %{"name" => "泮境乡", "code" => "350823206000"},
      %{"name" => "官庄畲族乡", "code" => "350823211000"},
      %{"name" => "珊瑚乡", "code" => "350823212000"}
    ]

  def next(input) when input == "武平县" or input == "350824",
    do: [
      %{"name" => "平川街道", "code" => "350824001000"},
      %{"name" => "中山镇", "code" => "350824101000"},
      %{"name" => "岩前镇", "code" => "350824102000"},
      %{"name" => "十方镇", "code" => "350824103000"},
      %{"name" => "中堡镇", "code" => "350824104000"},
      %{"name" => "桃溪镇", "code" => "350824105000"},
      %{"name" => "城厢镇", "code" => "350824106000"},
      %{"name" => "东留镇", "code" => "350824107000"},
      %{"name" => "武东镇", "code" => "350824108000"},
      %{"name" => "万安镇", "code" => "350824109000"},
      %{"name" => "永平镇", "code" => "350824110000"},
      %{"name" => "象洞镇", "code" => "350824111000"},
      %{"name" => "中赤镇", "code" => "350824112000"},
      %{"name" => "湘店镇", "code" => "350824113000"},
      %{"name" => "大禾镇", "code" => "350824114000"},
      %{"name" => "民主乡", "code" => "350824203000"},
      %{"name" => "下坝乡", "code" => "350824204000"}
    ]

  def next(input) when input == "连城县" or input == "350825",
    do: [
      %{"name" => "莲峰镇", "code" => "350825100000"},
      %{"name" => "北团镇", "code" => "350825101000"},
      %{"name" => "姑田镇", "code" => "350825102000"},
      %{"name" => "朋口镇", "code" => "350825103000"},
      %{"name" => "莒溪镇", "code" => "350825104000"},
      %{"name" => "新泉镇", "code" => "350825105000"},
      %{"name" => "庙前镇", "code" => "350825106000"},
      %{"name" => "文亨镇", "code" => "350825107000"},
      %{"name" => "四堡镇", "code" => "350825108000"},
      %{"name" => "林坊镇", "code" => "350825109000"},
      %{"name" => "隔川镇", "code" => "350825110000"},
      %{"name" => "宣和镇", "code" => "350825111000"},
      %{"name" => "揭乐乡", "code" => "350825200000"},
      %{"name" => "塘前乡", "code" => "350825201000"},
      %{"name" => "罗坊乡", "code" => "350825204000"},
      %{"name" => "曲溪乡", "code" => "350825208000"},
      %{"name" => "赖源乡", "code" => "350825209000"}
    ]

  def next(input) when input == "漳平市" or input == "350881",
    do: [
      %{"name" => "菁城街道", "code" => "350881001000"},
      %{"name" => "桂林街道", "code" => "350881002000"},
      %{"name" => "新桥镇", "code" => "350881100000"},
      %{"name" => "双洋镇", "code" => "350881101000"},
      %{"name" => "永福镇", "code" => "350881102000"},
      %{"name" => "溪南镇", "code" => "350881103000"},
      %{"name" => "和平镇", "code" => "350881104000"},
      %{"name" => "拱桥镇", "code" => "350881105000"},
      %{"name" => "象湖镇", "code" => "350881106000"},
      %{"name" => "赤水镇", "code" => "350881107000"},
      %{"name" => "西园镇", "code" => "350881108000"},
      %{"name" => "南洋镇", "code" => "350881109000"},
      %{"name" => "芦芝镇", "code" => "350881110000"},
      %{"name" => "官田乡", "code" => "350881203000"},
      %{"name" => "吾祠乡", "code" => "350881204000"},
      %{"name" => "灵地乡", "code" => "350881205000"}
    ]

  def next(input) when input == "延平区" or input == "350702",
    do: [
      %{"name" => "梅山街道", "code" => "350702001000"},
      %{"name" => "黄墩街道", "code" => "350702002000"},
      %{"name" => "紫云街道", "code" => "350702003000"},
      %{"name" => "四鹤街道", "code" => "350702004000"},
      %{"name" => "水南街道", "code" => "350702005000"},
      %{"name" => "水东街道", "code" => "350702006000"},
      %{"name" => "来舟镇", "code" => "350702100000"},
      %{"name" => "樟湖镇", "code" => "350702101000"},
      %{"name" => "夏道镇", "code" => "350702102000"},
      %{"name" => "西芹镇", "code" => "350702103000"},
      %{"name" => "峡阳镇", "code" => "350702104000"},
      %{"name" => "南山镇", "code" => "350702105000"},
      %{"name" => "大横镇", "code" => "350702106000"},
      %{"name" => "王台镇", "code" => "350702107000"},
      %{"name" => "太平镇", "code" => "350702108000"},
      %{"name" => "塔前镇", "code" => "350702109000"},
      %{"name" => "茫荡镇", "code" => "350702110000"},
      %{"name" => "洋后镇", "code" => "350702111000"},
      %{"name" => "炉下镇", "code" => "350702112000"},
      %{"name" => "巨口乡", "code" => "350702200000"},
      %{"name" => "赤门乡", "code" => "350702202000"}
    ]

  def next(input) when input == "建阳区" or input == "350703",
    do: [
      %{"name" => "潭城街道", "code" => "350703001000"},
      %{"name" => "童游街道", "code" => "350703002000"},
      %{"name" => "宝山街道", "code" => "350703003000"},
      %{"name" => "崇阳街道", "code" => "350703004000"},
      %{"name" => "崇泰街道", "code" => "350703005000"},
      %{"name" => "将口镇", "code" => "350703102000"},
      %{"name" => "徐市镇", "code" => "350703103000"},
      %{"name" => "莒口镇", "code" => "350703104000"},
      %{"name" => "麻沙镇", "code" => "350703105000"},
      %{"name" => "黄坑镇", "code" => "350703106000"},
      %{"name" => "水吉镇", "code" => "350703107000"},
      %{"name" => "漳墩镇", "code" => "350703108000"},
      %{"name" => "小湖镇", "code" => "350703109000"},
      %{"name" => "崇雒乡", "code" => "350703200000"},
      %{"name" => "书坊乡", "code" => "350703201000"},
      %{"name" => "回龙乡", "code" => "350703202000"}
    ]

  def next(input) when input == "顺昌县" or input == "350721",
    do: [
      %{"name" => "双溪街道", "code" => "350721001000"},
      %{"name" => "建西镇", "code" => "350721100000"},
      %{"name" => "洋口镇", "code" => "350721101000"},
      %{"name" => "元坑镇", "code" => "350721102000"},
      %{"name" => "埔上镇", "code" => "350721103000"},
      %{"name" => "大历镇", "code" => "350721104000"},
      %{"name" => "大干镇", "code" => "350721105000"},
      %{"name" => "仁寿镇", "code" => "350721106000"},
      %{"name" => "郑坊镇", "code" => "350721107000"},
      %{"name" => "洋墩乡", "code" => "350721200000"},
      %{"name" => "岚下乡", "code" => "350721202000"},
      %{"name" => "高阳乡", "code" => "350721203000"}
    ]

  def next(input) when input == "浦城县" or input == "350722",
    do: [
      %{"name" => "南浦街道", "code" => "350722001000"},
      %{"name" => "河滨街道", "code" => "350722002000"},
      %{"name" => "富岭镇", "code" => "350722101000"},
      %{"name" => "石陂镇", "code" => "350722102000"},
      %{"name" => "临江镇", "code" => "350722103000"},
      %{"name" => "仙阳镇", "code" => "350722104000"},
      %{"name" => "水北街镇", "code" => "350722105000"},
      %{"name" => "永兴镇", "code" => "350722106000"},
      %{"name" => "忠信镇", "code" => "350722107000"},
      %{"name" => "莲塘镇", "code" => "350722108000"},
      %{"name" => "九牧镇", "code" => "350722109000"},
      %{"name" => "万安乡", "code" => "350722200000"},
      %{"name" => "古楼乡", "code" => "350722201000"},
      %{"name" => "山下乡", "code" => "350722202000"},
      %{"name" => "枫溪乡", "code" => "350722203000"},
      %{"name" => "濠村乡", "code" => "350722204000"},
      %{"name" => "管厝乡", "code" => "350722205000"},
      %{"name" => "盘亭乡", "code" => "350722206000"},
      %{"name" => "官路乡", "code" => "350722207000"}
    ]

  def next(input) when input == "光泽县" or input == "350723",
    do: [
      %{"name" => "杭川镇", "code" => "350723100000"},
      %{"name" => "寨里镇", "code" => "350723101000"},
      %{"name" => "止马镇", "code" => "350723102000"},
      %{"name" => "鸾凤乡", "code" => "350723200000"},
      %{"name" => "崇仁乡", "code" => "350723201000"},
      %{"name" => "李坊乡", "code" => "350723202000"},
      %{"name" => "华桥乡", "code" => "350723203000"},
      %{"name" => "司前乡", "code" => "350723204000"}
    ]

  def next(input) when input == "松溪县" or input == "350724",
    do: [
      %{"name" => "松源街道", "code" => "350724001000"},
      %{"name" => "郑墩镇", "code" => "350724101000"},
      %{"name" => "渭田镇", "code" => "350724102000"},
      %{"name" => "河东乡", "code" => "350724200000"},
      %{"name" => "茶平乡", "code" => "350724201000"},
      %{"name" => "旧县乡", "code" => "350724202000"},
      %{"name" => "溪东乡", "code" => "350724203000"},
      %{"name" => "花桥乡", "code" => "350724204000"},
      %{"name" => "祖墩乡", "code" => "350724205000"}
    ]

  def next(input) when input == "政和县" or input == "350725",
    do: [
      %{"name" => "熊山街道", "code" => "350725001000"},
      %{"name" => "东平镇", "code" => "350725101000"},
      %{"name" => "石屯镇", "code" => "350725102000"},
      %{"name" => "铁山镇", "code" => "350725103000"},
      %{"name" => "镇前镇", "code" => "350725104000"},
      %{"name" => "星溪乡", "code" => "350725200000"},
      %{"name" => "外屯乡", "code" => "350725201000"},
      %{"name" => "杨源乡", "code" => "350725202000"},
      %{"name" => "澄源乡", "code" => "350725203000"},
      %{"name" => "岭腰乡", "code" => "350725204000"}
    ]

  def next(input) when input == "邵武市" or input == "350781",
    do: [
      %{"name" => "昭阳街道", "code" => "350781001000"},
      %{"name" => "通泰街道", "code" => "350781002000"},
      %{"name" => "水北街道", "code" => "350781003000"},
      %{"name" => "晒口街道", "code" => "350781004000"},
      %{"name" => "城郊镇", "code" => "350781100000"},
      %{"name" => "水北镇", "code" => "350781101000"},
      %{"name" => "下沙镇", "code" => "350781102000"},
      %{"name" => "卫闽镇", "code" => "350781103000"},
      %{"name" => "沿山镇", "code" => "350781104000"},
      %{"name" => "拿口镇", "code" => "350781105000"},
      %{"name" => "洪墩镇", "code" => "350781106000"},
      %{"name" => "大埠岗镇", "code" => "350781107000"},
      %{"name" => "和平镇", "code" => "350781108000"},
      %{"name" => "肖家坊镇", "code" => "350781109000"},
      %{"name" => "大竹镇", "code" => "350781110000"},
      %{"name" => "吴家塘镇", "code" => "350781111000"},
      %{"name" => "桂林乡", "code" => "350781200000"},
      %{"name" => "张厝乡", "code" => "350781201000"},
      %{"name" => "金坑乡", "code" => "350781202000"}
    ]

  def next(input) when input == "武夷山市" or input == "350782",
    do: [
      %{"name" => "崇安街道", "code" => "350782001000"},
      %{"name" => "新丰街道", "code" => "350782002000"},
      %{"name" => "武夷街道", "code" => "350782003000"},
      %{"name" => "星村镇", "code" => "350782100000"},
      %{"name" => "兴田镇", "code" => "350782101000"},
      %{"name" => "五夫镇", "code" => "350782102000"},
      %{"name" => "上梅乡", "code" => "350782200000"},
      %{"name" => "吴屯乡", "code" => "350782201000"},
      %{"name" => "岚谷乡", "code" => "350782202000"},
      %{"name" => "洋庄乡", "code" => "350782203000"}
    ]

  def next(input) when input == "建瓯市" or input == "350783",
    do: [
      %{"name" => "建安街道", "code" => "350783001000"},
      %{"name" => "通济街道", "code" => "350783002000"},
      %{"name" => "瓯宁街道", "code" => "350783003000"},
      %{"name" => "芝山街道", "code" => "350783004000"},
      %{"name" => "徐墩镇", "code" => "350783100000"},
      %{"name" => "吉阳镇", "code" => "350783101000"},
      %{"name" => "房道镇", "code" => "350783102000"},
      %{"name" => "南雅镇", "code" => "350783103000"},
      %{"name" => "迪口镇", "code" => "350783104000"},
      %{"name" => "小桥镇", "code" => "350783105000"},
      %{"name" => "玉山镇", "code" => "350783106000"},
      %{"name" => "东游镇", "code" => "350783107000"},
      %{"name" => "东峰镇", "code" => "350783108000"},
      %{"name" => "小松镇", "code" => "350783109000"},
      %{"name" => "顺阳乡", "code" => "350783200000"},
      %{"name" => "水源乡", "code" => "350783201000"},
      %{"name" => "川石乡", "code" => "350783202000"},
      %{"name" => "龙村乡", "code" => "350783203000"}
    ]

  def next(input) when input == "芗城区" or input == "350602",
    do: [
      %{"name" => "东铺头街道", "code" => "350602001000"},
      %{"name" => "西桥街道", "code" => "350602002000"},
      %{"name" => "新桥街道", "code" => "350602003000"},
      %{"name" => "巷口街道", "code" => "350602004000"},
      %{"name" => "南坑街道", "code" => "350602005000"},
      %{"name" => "通北街道", "code" => "350602006000"},
      %{"name" => "芝山街道", "code" => "350602007000"},
      %{"name" => "石亭街道", "code" => "350602008000"},
      %{"name" => "浦南镇", "code" => "350602100000"},
      %{"name" => "天宝镇", "code" => "350602101000"},
      %{"name" => "芗城区奶牛场", "code" => "350602400000"},
      %{"name" => "天宝林场", "code" => "350602402000"}
    ]

  def next(input) when input == "龙文区" or input == "350603",
    do: [
      %{"name" => "步文街道", "code" => "350603001000"},
      %{"name" => "碧湖街道", "code" => "350603002000"},
      %{"name" => "蓝田街道", "code" => "350603003000"},
      %{"name" => "朝阳街道", "code" => "350603004000"},
      %{"name" => "景山街道", "code" => "350603005000"},
      %{"name" => "郭坑镇", "code" => "350603103000"},
      %{"name" => "蓝田开发区", "code" => "350603500000"}
    ]

  def next(input) when input == "龙海区" or input == "350604",
    do: [
      %{"name" => "石码街道", "code" => "350604001000"},
      %{"name" => "海澄镇", "code" => "350604100000"},
      %{"name" => "角美镇", "code" => "350604101000"},
      %{"name" => "白水镇", "code" => "350604102000"},
      %{"name" => "浮宫镇", "code" => "350604103000"},
      %{"name" => "程溪镇", "code" => "350604104000"},
      %{"name" => "港尾镇", "code" => "350604105000"},
      %{"name" => "九湖镇", "code" => "350604106000"},
      %{"name" => "颜厝镇", "code" => "350604107000"},
      %{"name" => "榜山镇", "code" => "350604108000"},
      %{"name" => "紫泥镇", "code" => "350604109000"},
      %{"name" => "东园镇", "code" => "350604110000"},
      %{"name" => "东泗乡", "code" => "350604200000"},
      %{"name" => "隆教畲族乡", "code" => "350604201000"},
      %{"name" => "双第华侨农场", "code" => "350604400000"},
      %{"name" => "九龙岭林场", "code" => "350604401000"},
      %{"name" => "良种场", "code" => "350604403000"},
      %{"name" => "林下林场", "code" => "350604405000"},
      %{"name" => "招商局漳州开发区", "code" => "350604501000"}
    ]

  def next(input) when input == "长泰区" or input == "350605",
    do: [
      %{"name" => "武安镇", "code" => "350605100000"},
      %{"name" => "岩溪镇", "code" => "350605101000"},
      %{"name" => "陈巷镇", "code" => "350605102000"},
      %{"name" => "枋洋镇", "code" => "350605103000"},
      %{"name" => "坂里乡", "code" => "350605200000"},
      %{"name" => "国营古农农场", "code" => "350605400000"},
      %{"name" => "长泰经济开发区", "code" => "350605500000"},
      %{"name" => "马洋溪生态旅游区", "code" => "350605501000"},
      %{"name" => "林墩工业区", "code" => "350605502000"}
    ]

  def next(input) when input == "云霄县" or input == "350622",
    do: [
      %{"name" => "云陵镇", "code" => "350622100000"},
      %{"name" => "陈岱镇", "code" => "350622101000"},
      %{"name" => "东厦镇", "code" => "350622102000"},
      %{"name" => "莆美镇", "code" => "350622103000"},
      %{"name" => "列屿镇", "code" => "350622104000"},
      %{"name" => "火田镇", "code" => "350622105000"},
      %{"name" => "下河乡", "code" => "350622200000"},
      %{"name" => "马铺乡", "code" => "350622201000"},
      %{"name" => "和平乡", "code" => "350622202000"},
      %{"name" => "常山华侨经济开发区", "code" => "350622500000"},
      %{"name" => "云陵工业开发区", "code" => "350622501000"}
    ]

  def next(input) when input == "漳浦县" or input == "350623",
    do: [
      %{"name" => "绥安镇", "code" => "350623100000"},
      %{"name" => "旧镇镇", "code" => "350623101000"},
      %{"name" => "佛昙镇", "code" => "350623102000"},
      %{"name" => "赤湖镇", "code" => "350623103000"},
      %{"name" => "杜浔镇", "code" => "350623104000"},
      %{"name" => "霞美镇", "code" => "350623105000"},
      %{"name" => "官浔镇", "code" => "350623106000"},
      %{"name" => "石榴镇", "code" => "350623107000"},
      %{"name" => "盘陀镇", "code" => "350623108000"},
      %{"name" => "长桥镇", "code" => "350623109000"},
      %{"name" => "前亭镇", "code" => "350623110000"},
      %{"name" => "马坪镇", "code" => "350623111000"},
      %{"name" => "深土镇", "code" => "350623112000"},
      %{"name" => "六鳌镇", "code" => "350623113000"},
      %{"name" => "沙西镇", "code" => "350623114000"},
      %{"name" => "古雷镇", "code" => "350623115000"},
      %{"name" => "大南坂镇", "code" => "350623116000"},
      %{"name" => "南浦乡", "code" => "350623200000"},
      %{"name" => "赤岭畲族乡", "code" => "350623201000"},
      %{"name" => "湖西畲族乡", "code" => "350623202000"},
      %{"name" => "赤土乡", "code" => "350623203000"},
      %{"name" => "漳浦盐场", "code" => "350623400000"},
      %{"name" => "南山华侨茶果场", "code" => "350623405000"},
      %{"name" => "中西林场", "code" => "350623406000"},
      %{"name" => "下蔡林场", "code" => "350623408000"}
    ]

  def next(input) when input == "诏安县" or input == "350624",
    do: [
      %{"name" => "南诏镇", "code" => "350624100000"},
      %{"name" => "四都镇", "code" => "350624101000"},
      %{"name" => "梅岭镇", "code" => "350624102000"},
      %{"name" => "桥东镇", "code" => "350624103000"},
      %{"name" => "深桥镇", "code" => "350624104000"},
      %{"name" => "太平镇", "code" => "350624105000"},
      %{"name" => "霞葛镇", "code" => "350624106000"},
      %{"name" => "官陂镇", "code" => "350624107000"},
      %{"name" => "秀篆镇", "code" => "350624108000"},
      %{"name" => "西潭镇", "code" => "350624109000"},
      %{"name" => "金星乡", "code" => "350624200000"},
      %{"name" => "白洋乡", "code" => "350624202000"},
      %{"name" => "建设乡", "code" => "350624203000"},
      %{"name" => "红星乡", "code" => "350624204000"},
      %{"name" => "梅洲乡", "code" => "350624205000"},
      %{"name" => "国营湖内林场", "code" => "350624402000"},
      %{"name" => "岭下溪国有防护林场", "code" => "350624403000"},
      %{"name" => "诏安工业园区", "code" => "350624501000"},
      %{"name" => "诏安金都工业集中区", "code" => "350624502000"}
    ]

  def next(input) when input == "东山县" or input == "350626",
    do: [
      %{"name" => "西埔镇", "code" => "350626100000"},
      %{"name" => "樟塘镇", "code" => "350626101000"},
      %{"name" => "康美镇", "code" => "350626102000"},
      %{"name" => "杏陈镇", "code" => "350626103000"},
      %{"name" => "陈城镇", "code" => "350626104000"},
      %{"name" => "前楼镇", "code" => "350626105000"},
      %{"name" => "铜陵镇", "code" => "350626106000"}
    ]

  def next(input) when input == "南靖县" or input == "350627",
    do: [
      %{"name" => "山城镇", "code" => "350627100000"},
      %{"name" => "丰田镇", "code" => "350627101000"},
      %{"name" => "靖城镇", "code" => "350627102000"},
      %{"name" => "龙山镇", "code" => "350627103000"},
      %{"name" => "金山镇", "code" => "350627104000"},
      %{"name" => "和溪镇", "code" => "350627105000"},
      %{"name" => "奎洋镇", "code" => "350627106000"},
      %{"name" => "梅林镇", "code" => "350627107000"},
      %{"name" => "书洋镇", "code" => "350627108000"},
      %{"name" => "船场镇", "code" => "350627109000"},
      %{"name" => "南坑镇", "code" => "350627110000"}
    ]

  def next(input) when input == "平和县" or input == "350628",
    do: [
      %{"name" => "小溪镇", "code" => "350628100000"},
      %{"name" => "山格镇", "code" => "350628101000"},
      %{"name" => "文峰镇", "code" => "350628102000"},
      %{"name" => "南胜镇", "code" => "350628103000"},
      %{"name" => "坂仔镇", "code" => "350628104000"},
      %{"name" => "安厚镇", "code" => "350628105000"},
      %{"name" => "大溪镇", "code" => "350628106000"},
      %{"name" => "霞寨镇", "code" => "350628107000"},
      %{"name" => "九峰镇", "code" => "350628108000"},
      %{"name" => "芦溪镇", "code" => "350628109000"},
      %{"name" => "五寨乡", "code" => "350628200000"},
      %{"name" => "国强乡", "code" => "350628201000"},
      %{"name" => "崎岭乡", "code" => "350628202000"},
      %{"name" => "长乐乡", "code" => "350628203000"},
      %{"name" => "秀峰乡", "code" => "350628204000"},
      %{"name" => "福建平和工业园区", "code" => "350628401000"}
    ]

  def next(input) when input == "华安县" or input == "350629",
    do: [
      %{"name" => "华丰镇", "code" => "350629100000"},
      %{"name" => "丰山镇", "code" => "350629101000"},
      %{"name" => "沙建镇", "code" => "350629102000"},
      %{"name" => "新圩镇", "code" => "350629103000"},
      %{"name" => "高安镇", "code" => "350629104000"},
      %{"name" => "仙都镇", "code" => "350629105000"},
      %{"name" => "高车乡", "code" => "350629200000"},
      %{"name" => "马坑乡", "code" => "350629201000"},
      %{"name" => "湖林乡", "code" => "350629203000"},
      %{"name" => "福建土楼（华安）旅游区", "code" => "350629400000"}
    ]

  def next(input) when input == "鲤城区" or input == "350502",
    do: [
      %{"name" => "海滨街道", "code" => "350502001000"},
      %{"name" => "临江街道", "code" => "350502002000"},
      %{"name" => "鲤中街道", "code" => "350502003000"},
      %{"name" => "开元街道", "code" => "350502004000"},
      %{"name" => "浮桥街道", "code" => "350502005000"},
      %{"name" => "江南街道", "code" => "350502006000"},
      %{"name" => "金龙街道", "code" => "350502007000"},
      %{"name" => "常泰街道", "code" => "350502008000"},
      %{"name" => "清濛经济开发区", "code" => "350502400000"}
    ]

  def next(input) when input == "丰泽区" or input == "350503",
    do: [
      %{"name" => "东湖街道", "code" => "350503001000"},
      %{"name" => "丰泽街道", "code" => "350503002000"},
      %{"name" => "泉秀街道", "code" => "350503003000"},
      %{"name" => "清源街道", "code" => "350503004000"},
      %{"name" => "华大街道", "code" => "350503005000"},
      %{"name" => "城东街道", "code" => "350503006000"},
      %{"name" => "东海街道", "code" => "350503007000"},
      %{"name" => "北峰街道", "code" => "350503008000"}
    ]

  def next(input) when input == "洛江区" or input == "350504",
    do: [
      %{"name" => "万安街道", "code" => "350504001000"},
      %{"name" => "双阳街道", "code" => "350504002000"},
      %{"name" => "罗溪镇", "code" => "350504100000"},
      %{"name" => "马甲镇", "code" => "350504101000"},
      %{"name" => "河市镇", "code" => "350504102000"},
      %{"name" => "虹山乡", "code" => "350504200000"}
    ]

  def next(input) when input == "泉港区" or input == "350505",
    do: [
      %{"name" => "山腰街道", "code" => "350505001000"},
      %{"name" => "南埔镇", "code" => "350505100000"},
      %{"name" => "界山镇", "code" => "350505101000"},
      %{"name" => "后龙镇", "code" => "350505102000"},
      %{"name" => "峰尾镇", "code" => "350505103000"},
      %{"name" => "前黄镇", "code" => "350505105000"},
      %{"name" => "涂岭镇", "code" => "350505106000"},
      %{"name" => "石化工业园区", "code" => "350505400000"}
    ]

  def next(input) when input == "惠安县" or input == "350521",
    do: [
      %{"name" => "螺城镇", "code" => "350521100000"},
      %{"name" => "螺阳镇", "code" => "350521101000"},
      %{"name" => "黄塘镇", "code" => "350521102000"},
      %{"name" => "紫山镇", "code" => "350521103000"},
      %{"name" => "洛阳镇", "code" => "350521104000"},
      %{"name" => "东园镇", "code" => "350521105000"},
      %{"name" => "张坂镇", "code" => "350521106000"},
      %{"name" => "崇武镇", "code" => "350521107000"},
      %{"name" => "山霞镇", "code" => "350521108000"},
      %{"name" => "涂寨镇", "code" => "350521109000"},
      %{"name" => "东岭镇", "code" => "350521110000"},
      %{"name" => "东桥镇", "code" => "350521111000"},
      %{"name" => "净峰镇", "code" => "350521112000"},
      %{"name" => "小岞镇", "code" => "350521113000"},
      %{"name" => "辋川镇", "code" => "350521114000"},
      %{"name" => "百崎回族乡", "code" => "350521200000"},
      %{"name" => "城南工业区", "code" => "350521400000"},
      %{"name" => "惠南工业区", "code" => "350521401000"},
      %{"name" => "泉惠石化工业园区", "code" => "350521402000"},
      %{"name" => "惠东工业园区", "code" => "350521403000"}
    ]

  def next(input) when input == "安溪县" or input == "350524",
    do: [
      %{"name" => "凤城镇", "code" => "350524100000"},
      %{"name" => "蓬莱镇", "code" => "350524101000"},
      %{"name" => "湖头镇", "code" => "350524102000"},
      %{"name" => "官桥镇", "code" => "350524103000"},
      %{"name" => "剑斗镇", "code" => "350524104000"},
      %{"name" => "城厢镇", "code" => "350524105000"},
      %{"name" => "金谷镇", "code" => "350524106000"},
      %{"name" => "龙门镇", "code" => "350524107000"},
      %{"name" => "虎邱镇", "code" => "350524108000"},
      %{"name" => "芦田镇", "code" => "350524109000"},
      %{"name" => "感德镇", "code" => "350524110000"},
      %{"name" => "魁斗镇", "code" => "350524111000"},
      %{"name" => "西坪镇", "code" => "350524112000"},
      %{"name" => "参内镇", "code" => "350524113000"},
      %{"name" => "长卿镇", "code" => "350524114000"},
      %{"name" => "白濑乡", "code" => "350524201000"},
      %{"name" => "湖上乡", "code" => "350524202000"},
      %{"name" => "尚卿乡", "code" => "350524203000"},
      %{"name" => "大坪乡", "code" => "350524204000"},
      %{"name" => "龙涓乡", "code" => "350524205000"},
      %{"name" => "蓝田乡", "code" => "350524207000"},
      %{"name" => "祥华乡", "code" => "350524208000"},
      %{"name" => "桃舟乡", "code" => "350524209000"},
      %{"name" => "福田乡", "code" => "350524210000"}
    ]

  def next(input) when input == "永春县" or input == "350525",
    do: [
      %{"name" => "桃城镇", "code" => "350525100000"},
      %{"name" => "五里街镇", "code" => "350525101000"},
      %{"name" => "一都镇", "code" => "350525102000"},
      %{"name" => "下洋镇", "code" => "350525103000"},
      %{"name" => "蓬壶镇", "code" => "350525104000"},
      %{"name" => "达埔镇", "code" => "350525105000"},
      %{"name" => "吾峰镇", "code" => "350525106000"},
      %{"name" => "石鼓镇", "code" => "350525107000"},
      %{"name" => "岵山镇", "code" => "350525108000"},
      %{"name" => "东平镇", "code" => "350525109000"},
      %{"name" => "湖洋镇", "code" => "350525110000"},
      %{"name" => "坑仔口镇", "code" => "350525111000"},
      %{"name" => "玉斗镇", "code" => "350525112000"},
      %{"name" => "锦斗镇", "code" => "350525113000"},
      %{"name" => "东关镇", "code" => "350525114000"},
      %{"name" => "桂洋镇", "code" => "350525115000"},
      %{"name" => "苏坑镇", "code" => "350525116000"},
      %{"name" => "仙夹镇", "code" => "350525117000"},
      %{"name" => "横口乡", "code" => "350525200000"},
      %{"name" => "呈祥乡", "code" => "350525201000"},
      %{"name" => "介福乡", "code" => "350525202000"},
      %{"name" => "外山乡", "code" => "350525204000"}
    ]

  def next(input) when input == "德化县" or input == "350526",
    do: [
      %{"name" => "浔中镇", "code" => "350526100000"},
      %{"name" => "龙浔镇", "code" => "350526101000"},
      %{"name" => "三班镇", "code" => "350526102000"},
      %{"name" => "龙门滩镇", "code" => "350526103000"},
      %{"name" => "雷峰镇", "code" => "350526104000"},
      %{"name" => "南埕镇", "code" => "350526105000"},
      %{"name" => "水口镇", "code" => "350526106000"},
      %{"name" => "赤水镇", "code" => "350526107000"},
      %{"name" => "上涌镇", "code" => "350526108000"},
      %{"name" => "葛坑镇", "code" => "350526109000"},
      %{"name" => "盖德镇", "code" => "350526110000"},
      %{"name" => "美湖镇", "code" => "350526111000"},
      %{"name" => "杨梅乡", "code" => "350526200000"},
      %{"name" => "汤头乡", "code" => "350526202000"},
      %{"name" => "桂阳乡", "code" => "350526204000"},
      %{"name" => "国宝乡", "code" => "350526206000"},
      %{"name" => "大铭乡", "code" => "350526208000"},
      %{"name" => "春美乡", "code" => "350526209000"}
    ]

  def next(input) when input == "金门县" or input == "350527",
    do: [%{"name" => "金门县", "code" => "350527000000"}]

  def next(input) when input == "石狮市" or input == "350581",
    do: [
      %{"name" => "湖滨街道", "code" => "350581001000"},
      %{"name" => "凤里街道", "code" => "350581002000"},
      %{"name" => "灵秀镇", "code" => "350581100000"},
      %{"name" => "宝盖镇", "code" => "350581101000"},
      %{"name" => "蚶江镇", "code" => "350581102000"},
      %{"name" => "祥芝镇", "code" => "350581103000"},
      %{"name" => "鸿山镇", "code" => "350581104000"},
      %{"name" => "锦尚镇", "code" => "350581105000"},
      %{"name" => "永宁镇", "code" => "350581106000"},
      %{"name" => "石狮高新技术产业开发区", "code" => "350581400000"}
    ]

  def next(input) when input == "晋江市" or input == "350582",
    do: [
      %{"name" => "青阳街道", "code" => "350582001000"},
      %{"name" => "梅岭街道", "code" => "350582002000"},
      %{"name" => "西园街道", "code" => "350582003000"},
      %{"name" => "罗山街道", "code" => "350582004000"},
      %{"name" => "新塘街道", "code" => "350582005000"},
      %{"name" => "灵源街道", "code" => "350582006000"},
      %{"name" => "安海镇", "code" => "350582101000"},
      %{"name" => "磁灶镇", "code" => "350582102000"},
      %{"name" => "陈埭镇", "code" => "350582103000"},
      %{"name" => "东石镇", "code" => "350582104000"},
      %{"name" => "深沪镇", "code" => "350582105000"},
      %{"name" => "金井镇", "code" => "350582106000"},
      %{"name" => "池店镇", "code" => "350582107000"},
      %{"name" => "内坑镇", "code" => "350582109000"},
      %{"name" => "龙湖镇", "code" => "350582110000"},
      %{"name" => "永和镇", "code" => "350582111000"},
      %{"name" => "英林镇", "code" => "350582112000"},
      %{"name" => "紫帽镇", "code" => "350582113000"},
      %{"name" => "西滨镇", "code" => "350582114000"},
      %{"name" => "安平开发区", "code" => "350582400000"},
      %{"name" => "晋江市经济开发区", "code" => "350582401000"},
      %{"name" => "泉州综合保税区", "code" => "350582402000"}
    ]

  def next(input) when input == "南安市" or input == "350583",
    do: [
      %{"name" => "溪美街道", "code" => "350583001000"},
      %{"name" => "柳城街道", "code" => "350583002000"},
      %{"name" => "美林街道", "code" => "350583003000"},
      %{"name" => "省新镇", "code" => "350583100000"},
      %{"name" => "仑苍镇", "code" => "350583101000"},
      %{"name" => "东田镇", "code" => "350583102000"},
      %{"name" => "英都镇", "code" => "350583103000"},
      %{"name" => "翔云镇", "code" => "350583104000"},
      %{"name" => "金淘镇", "code" => "350583105000"},
      %{"name" => "诗山镇", "code" => "350583106000"},
      %{"name" => "蓬华镇", "code" => "350583107000"},
      %{"name" => "码头镇", "code" => "350583108000"},
      %{"name" => "九都镇", "code" => "350583109000"},
      %{"name" => "乐峰镇", "code" => "350583110000"},
      %{"name" => "罗东镇", "code" => "350583111000"},
      %{"name" => "梅山镇", "code" => "350583112000"},
      %{"name" => "洪濑镇", "code" => "350583113000"},
      %{"name" => "洪梅镇", "code" => "350583114000"},
      %{"name" => "康美镇", "code" => "350583115000"},
      %{"name" => "丰州镇", "code" => "350583116000"},
      %{"name" => "霞美镇", "code" => "350583117000"},
      %{"name" => "官桥镇", "code" => "350583118000"},
      %{"name" => "水头镇", "code" => "350583119000"},
      %{"name" => "石井镇", "code" => "350583120000"},
      %{"name" => "眉山乡", "code" => "350583200000"},
      %{"name" => "向阳乡", "code" => "350583201000"},
      %{"name" => "雪峰华侨经济开发区", "code" => "350583400000"}
    ]

  def next(input) when input == "三元区" or input == "350404",
    do: [
      %{"name" => "列东街道", "code" => "350404001000"},
      %{"name" => "列西街道", "code" => "350404002000"},
      %{"name" => "徐碧街道", "code" => "350404003000"},
      %{"name" => "城关街道", "code" => "350404004000"},
      %{"name" => "白沙街道", "code" => "350404005000"},
      %{"name" => "富兴堡街道", "code" => "350404006000"},
      %{"name" => "荆西街道", "code" => "350404007000"},
      %{"name" => "陈大镇", "code" => "350404100000"},
      %{"name" => "洋溪镇", "code" => "350404101000"},
      %{"name" => "莘口镇", "code" => "350404102000"},
      %{"name" => "岩前镇", "code" => "350404103000"},
      %{"name" => "中村乡", "code" => "350404200000"},
      %{"name" => "福建三元经济开发区", "code" => "350404500000"}
    ]

  def next(input) when input == "沙县区" or input == "350405",
    do: [
      %{"name" => "凤岗街道", "code" => "350405001000"},
      %{"name" => "虬江街道", "code" => "350405002000"},
      %{"name" => "青州镇", "code" => "350405100000"},
      %{"name" => "夏茂镇", "code" => "350405101000"},
      %{"name" => "高砂镇", "code" => "350405102000"},
      %{"name" => "高桥镇", "code" => "350405103000"},
      %{"name" => "富口镇", "code" => "350405104000"},
      %{"name" => "大洛镇", "code" => "350405105000"},
      %{"name" => "南霞乡", "code" => "350405200000"},
      %{"name" => "南阳乡", "code" => "350405201000"},
      %{"name" => "郑湖乡", "code" => "350405202000"},
      %{"name" => "湖源乡", "code" => "350405203000"},
      %{"name" => "三明高新技术产业开发区", "code" => "350405400000"},
      %{"name" => "青山纸业工业区", "code" => "350405402000"},
      %{"name" => "海西三明生态工贸区", "code" => "350405403000"}
    ]

  def next(input) when input == "明溪县" or input == "350421",
    do: [
      %{"name" => "雪峰镇", "code" => "350421100000"},
      %{"name" => "盖洋镇", "code" => "350421101000"},
      %{"name" => "胡坊镇", "code" => "350421102000"},
      %{"name" => "瀚仙镇", "code" => "350421103000"},
      %{"name" => "城关乡", "code" => "350421200000"},
      %{"name" => "沙溪乡", "code" => "350421201000"},
      %{"name" => "夏阳乡", "code" => "350421202000"},
      %{"name" => "枫溪乡", "code" => "350421203000"},
      %{"name" => "夏坊乡", "code" => "350421204000"}
    ]

  def next(input) when input == "清流县" or input == "350423",
    do: [
      %{"name" => "龙津镇", "code" => "350423100000"},
      %{"name" => "嵩溪镇", "code" => "350423101000"},
      %{"name" => "嵩口镇", "code" => "350423102000"},
      %{"name" => "灵地镇", "code" => "350423103000"},
      %{"name" => "长校镇", "code" => "350423104000"},
      %{"name" => "赖坊镇", "code" => "350423105000"},
      %{"name" => "林畲镇", "code" => "350423106000"},
      %{"name" => "温郊乡", "code" => "350423201000"},
      %{"name" => "田源乡", "code" => "350423203000"},
      %{"name" => "沙芜乡", "code" => "350423204000"},
      %{"name" => "余朋乡", "code" => "350423206000"},
      %{"name" => "李家乡", "code" => "350423208000"},
      %{"name" => "里田乡", "code" => "350423209000"}
    ]

  def next(input) when input == "宁化县" or input == "350424",
    do: [
      %{"name" => "翠江镇", "code" => "350424100000"},
      %{"name" => "泉上镇", "code" => "350424101000"},
      %{"name" => "湖村镇", "code" => "350424102000"},
      %{"name" => "石壁镇", "code" => "350424103000"},
      %{"name" => "曹坊镇", "code" => "350424104000"},
      %{"name" => "安远镇", "code" => "350424105000"},
      %{"name" => "淮土镇", "code" => "350424106000"},
      %{"name" => "安乐镇", "code" => "350424107000"},
      %{"name" => "水茜镇", "code" => "350424108000"},
      %{"name" => "城郊镇", "code" => "350424109000"},
      %{"name" => "城南镇", "code" => "350424110000"},
      %{"name" => "济村乡", "code" => "350424202000"},
      %{"name" => "方田乡", "code" => "350424204000"},
      %{"name" => "治平畲族乡", "code" => "350424207000"},
      %{"name" => "中沙乡", "code" => "350424208000"},
      %{"name" => "河龙乡", "code" => "350424209000"}
    ]

  def next(input) when input == "大田县" or input == "350425",
    do: [
      %{"name" => "均溪镇", "code" => "350425100000"},
      %{"name" => "石牌镇", "code" => "350425101000"},
      %{"name" => "上京镇", "code" => "350425102000"},
      %{"name" => "广平镇", "code" => "350425103000"},
      %{"name" => "桃源镇", "code" => "350425104000"},
      %{"name" => "太华镇", "code" => "350425105000"},
      %{"name" => "建设镇", "code" => "350425106000"},
      %{"name" => "奇韬镇", "code" => "350425107000"},
      %{"name" => "华兴镇", "code" => "350425108000"},
      %{"name" => "吴山镇", "code" => "350425109000"},
      %{"name" => "文江镇", "code" => "350425110000"},
      %{"name" => "梅山镇", "code" => "350425111000"},
      %{"name" => "屏山乡", "code" => "350425201000"},
      %{"name" => "济阳乡", "code" => "350425203000"},
      %{"name" => "武陵乡", "code" => "350425204000"},
      %{"name" => "谢洋乡", "code" => "350425205000"},
      %{"name" => "湖美乡", "code" => "350425208000"},
      %{"name" => "前坪乡", "code" => "350425209000"},
      %{"name" => "东风农场生活区", "code" => "350425400000"}
    ]

  def next(input) when input == "尤溪县" or input == "350426",
    do: [
      %{"name" => "城关镇", "code" => "350426100000"},
      %{"name" => "梅仙镇", "code" => "350426101000"},
      %{"name" => "西滨镇", "code" => "350426102000"},
      %{"name" => "洋中镇", "code" => "350426103000"},
      %{"name" => "新阳镇", "code" => "350426104000"},
      %{"name" => "管前镇", "code" => "350426105000"},
      %{"name" => "西城镇", "code" => "350426106000"},
      %{"name" => "尤溪口镇", "code" => "350426107000"},
      %{"name" => "坂面镇", "code" => "350426108000"},
      %{"name" => "联合镇", "code" => "350426109000"},
      %{"name" => "中仙镇", "code" => "350426110000"},
      %{"name" => "汤川乡", "code" => "350426201000"},
      %{"name" => "溪尾乡", "code" => "350426202000"},
      %{"name" => "台溪乡", "code" => "350426204000"},
      %{"name" => "八字桥乡", "code" => "350426206000"}
    ]

  def next(input) when input == "将乐县" or input == "350428",
    do: [
      %{"name" => "古镛镇", "code" => "350428100000"},
      %{"name" => "万安镇", "code" => "350428101000"},
      %{"name" => "高唐镇", "code" => "350428102000"},
      %{"name" => "白莲镇", "code" => "350428103000"},
      %{"name" => "黄潭镇", "code" => "350428104000"},
      %{"name" => "水南镇", "code" => "350428105000"},
      %{"name" => "光明镇", "code" => "350428106000"},
      %{"name" => "南口镇", "code" => "350428107000"},
      %{"name" => "漠源乡", "code" => "350428201000"},
      %{"name" => "万全乡", "code" => "350428203000"},
      %{"name" => "安仁乡", "code" => "350428204000"},
      %{"name" => "大源乡", "code" => "350428205000"},
      %{"name" => "余坊乡", "code" => "350428206000"}
    ]

  def next(input) when input == "泰宁县" or input == "350429",
    do: [
      %{"name" => "杉城镇", "code" => "350429100000"},
      %{"name" => "朱口镇", "code" => "350429101000"},
      %{"name" => "下渠镇", "code" => "350429103000"},
      %{"name" => "新桥乡", "code" => "350429200000"},
      %{"name" => "上青乡", "code" => "350429201000"},
      %{"name" => "大田乡", "code" => "350429202000"},
      %{"name" => "梅口乡", "code" => "350429203000"},
      %{"name" => "开善乡", "code" => "350429205000"},
      %{"name" => "大龙乡", "code" => "350429208000"}
    ]

  def next(input) when input == "建宁县" or input == "350430",
    do: [
      %{"name" => "濉溪镇", "code" => "350430100000"},
      %{"name" => "里心镇", "code" => "350430101000"},
      %{"name" => "溪口镇", "code" => "350430102000"},
      %{"name" => "均口镇", "code" => "350430103000"},
      %{"name" => "伊家乡", "code" => "350430201000"},
      %{"name" => "黄坊乡", "code" => "350430202000"},
      %{"name" => "溪源乡", "code" => "350430203000"},
      %{"name" => "客坊乡", "code" => "350430204000"},
      %{"name" => "黄埠乡", "code" => "350430205000"},
      %{"name" => "福建建宁经济开发区", "code" => "350430400000"}
    ]

  def next(input) when input == "永安市" or input == "350481",
    do: [
      %{"name" => "燕东街道", "code" => "350481001000"},
      %{"name" => "燕西街道", "code" => "350481002000"},
      %{"name" => "燕南街道", "code" => "350481003000"},
      %{"name" => "燕北街道", "code" => "350481004000"},
      %{"name" => "西洋镇", "code" => "350481100000"},
      %{"name" => "贡川镇", "code" => "350481101000"},
      %{"name" => "安砂镇", "code" => "350481102000"},
      %{"name" => "小陶镇", "code" => "350481103000"},
      %{"name" => "大湖镇", "code" => "350481104000"},
      %{"name" => "曹远镇", "code" => "350481105000"},
      %{"name" => "洪田镇", "code" => "350481106000"},
      %{"name" => "槐南镇", "code" => "350481107000"},
      %{"name" => "上坪乡", "code" => "350481202000"},
      %{"name" => "罗坊乡", "code" => "350481203000"},
      %{"name" => "青水畲族乡", "code" => "350481204000"}
    ]

  def next(input) when input == "城厢区" or input == "350302",
    do: [
      %{"name" => "龙桥街道", "code" => "350302001000"},
      %{"name" => "凤凰山街道", "code" => "350302002000"},
      %{"name" => "霞林街道", "code" => "350302003000"},
      %{"name" => "常太镇", "code" => "350302100000"},
      %{"name" => "华亭镇", "code" => "350302101000"},
      %{"name" => "灵川镇", "code" => "350302102000"},
      %{"name" => "东海镇", "code" => "350302103000"}
    ]

  def next(input) when input == "涵江区" or input == "350303",
    do: [
      %{"name" => "涵东街道", "code" => "350303001000"},
      %{"name" => "涵西街道", "code" => "350303002000"},
      %{"name" => "三江口镇", "code" => "350303100000"},
      %{"name" => "白塘镇", "code" => "350303101000"},
      %{"name" => "国欢镇", "code" => "350303102000"},
      %{"name" => "梧塘镇", "code" => "350303103000"},
      %{"name" => "江口镇", "code" => "350303104000"},
      %{"name" => "萩芦镇", "code" => "350303105000"},
      %{"name" => "白沙镇", "code" => "350303106000"},
      %{"name" => "庄边镇", "code" => "350303107000"},
      %{"name" => "新县镇", "code" => "350303108000"},
      %{"name" => "大洋乡", "code" => "350303200000"},
      %{"name" => "赤港开发区", "code" => "350303500000"}
    ]

  def next(input) when input == "荔城区" or input == "350304",
    do: [
      %{"name" => "镇海街道", "code" => "350304001000"},
      %{"name" => "拱辰街道", "code" => "350304002000"},
      %{"name" => "西天尾镇", "code" => "350304100000"},
      %{"name" => "黄石镇", "code" => "350304101000"},
      %{"name" => "新度镇", "code" => "350304102000"},
      %{"name" => "北高镇", "code" => "350304103000"}
    ]

  def next(input) when input == "秀屿区" or input == "350305",
    do: [
      %{"name" => "笏石镇", "code" => "350305100000"},
      %{"name" => "东庄镇", "code" => "350305101000"},
      %{"name" => "忠门镇", "code" => "350305102000"},
      %{"name" => "东埔镇", "code" => "350305103000"},
      %{"name" => "东峤镇", "code" => "350305104000"},
      %{"name" => "埭头镇", "code" => "350305105000"},
      %{"name" => "平海镇", "code" => "350305106000"},
      %{"name" => "南日镇", "code" => "350305107000"},
      %{"name" => "湄洲镇", "code" => "350305108000"},
      %{"name" => "山亭镇", "code" => "350305109000"},
      %{"name" => "月塘镇", "code" => "350305110000"},
      %{"name" => "前沁农场", "code" => "350305400000"},
      %{"name" => "后海管理局", "code" => "350305401000"}
    ]

  def next(input) when input == "仙游县" or input == "350322",
    do: [
      %{"name" => "鲤城街道", "code" => "350322001000"},
      %{"name" => "枫亭镇", "code" => "350322100000"},
      %{"name" => "榜头镇", "code" => "350322101000"},
      %{"name" => "郊尾镇", "code" => "350322102000"},
      %{"name" => "度尾镇", "code" => "350322103000"},
      %{"name" => "鲤南镇", "code" => "350322104000"},
      %{"name" => "赖店镇", "code" => "350322105000"},
      %{"name" => "盖尾镇", "code" => "350322106000"},
      %{"name" => "园庄镇", "code" => "350322107000"},
      %{"name" => "大济镇", "code" => "350322108000"},
      %{"name" => "龙华镇", "code" => "350322109000"},
      %{"name" => "钟山镇", "code" => "350322110000"},
      %{"name" => "游洋镇", "code" => "350322111000"},
      %{"name" => "西苑乡", "code" => "350322200000"},
      %{"name" => "石苍乡", "code" => "350322201000"},
      %{"name" => "社硎乡", "code" => "350322202000"},
      %{"name" => "书峰乡", "code" => "350322203000"},
      %{"name" => "菜溪乡", "code" => "350322204000"}
    ]

  def next(input) when input == "思明区" or input == "350203",
    do: [
      %{"name" => "厦港街道", "code" => "350203001000"},
      %{"name" => "中华街道", "code" => "350203003000"},
      %{"name" => "滨海街道", "code" => "350203005000"},
      %{"name" => "鹭江街道", "code" => "350203006000"},
      %{"name" => "开元街道", "code" => "350203007000"},
      %{"name" => "梧村街道", "code" => "350203008000"},
      %{"name" => "筼筜街道", "code" => "350203009000"},
      %{"name" => "莲前街道", "code" => "350203010000"},
      %{"name" => "嘉莲街道", "code" => "350203011000"},
      %{"name" => "鼓浪屿街道", "code" => "350203012000"}
    ]

  def next(input) when input == "海沧区" or input == "350205",
    do: [
      %{"name" => "海沧街道", "code" => "350205001000"},
      %{"name" => "新阳街道", "code" => "350205002000"},
      %{"name" => "嵩屿街道", "code" => "350205003000"},
      %{"name" => "东孚街道", "code" => "350205004000"},
      %{"name" => "天竺山林场", "code" => "350205403000"},
      %{"name" => "厦门海沧保税港区", "code" => "350205407000"}
    ]

  def next(input) when input == "湖里区" or input == "350206",
    do: [
      %{"name" => "湖里街道", "code" => "350206001000"},
      %{"name" => "殿前街道", "code" => "350206002000"},
      %{"name" => "禾山街道", "code" => "350206003000"},
      %{"name" => "江头街道", "code" => "350206004000"},
      %{"name" => "金山街道", "code" => "350206005000"},
      %{"name" => "火炬高技术开发区", "code" => "350206405000"},
      %{"name" => "象屿保税区", "code" => "350206406000"}
    ]

  def next(input) when input == "集美区" or input == "350211",
    do: [
      %{"name" => "集美街道", "code" => "350211001000"},
      %{"name" => "侨英街道", "code" => "350211002000"},
      %{"name" => "杏林街道", "code" => "350211003000"},
      %{"name" => "杏滨街道", "code" => "350211004000"},
      %{"name" => "灌口镇", "code" => "350211102000"},
      %{"name" => "后溪镇", "code" => "350211103000"},
      %{"name" => "第二农场", "code" => "350211401000"},
      %{"name" => "省天马种猪场", "code" => "350211402000"},
      %{"name" => "天马华侨农场", "code" => "350211403000"},
      %{"name" => "坂头防护林场", "code" => "350211404000"}
    ]

  def next(input) when input == "同安区" or input == "350212",
    do: [
      %{"name" => "大同街道", "code" => "350212001000"},
      %{"name" => "祥平街道", "code" => "350212002000"},
      %{"name" => "新民街道", "code" => "350212003000"},
      %{"name" => "西柯街道", "code" => "350212004000"},
      %{"name" => "祥和街道", "code" => "350212005000"},
      %{"name" => "新美街道", "code" => "350212006000"},
      %{"name" => "美林街道", "code" => "350212007000"},
      %{"name" => "莲花镇", "code" => "350212105000"},
      %{"name" => "洪塘镇", "code" => "350212107000"},
      %{"name" => "汀溪镇", "code" => "350212109000"},
      %{"name" => "五显镇", "code" => "350212110000"}
    ]

  def next(input) when input == "翔安区" or input == "350213",
    do: [
      %{"name" => "大嶝街道", "code" => "350213001000"},
      %{"name" => "马巷街道", "code" => "350213002000"},
      %{"name" => "新店街道", "code" => "350213003000"},
      %{"name" => "凤翔街道", "code" => "350213004000"},
      %{"name" => "民安街道", "code" => "350213005000"},
      %{"name" => "香山街道", "code" => "350213006000"},
      %{"name" => "金海街道", "code" => "350213007000"},
      %{"name" => "新圩镇", "code" => "350213103000"},
      %{"name" => "内厝镇", "code" => "350213111000"},
      %{"name" => "大帽山农场", "code" => "350213404000"}
    ]

  def next(input) when input == "鼓楼区" or input == "350102",
    do: [
      %{"name" => "鼓东街道", "code" => "350102001000"},
      %{"name" => "鼓西街道", "code" => "350102002000"},
      %{"name" => "温泉街道", "code" => "350102003000"},
      %{"name" => "东街街道", "code" => "350102004000"},
      %{"name" => "南街街道", "code" => "350102005000"},
      %{"name" => "安泰街道", "code" => "350102006000"},
      %{"name" => "华大街道", "code" => "350102007000"},
      %{"name" => "水部街道", "code" => "350102008000"},
      %{"name" => "五凤街道", "code" => "350102009000"},
      %{"name" => "洪山镇", "code" => "350102100000"}
    ]

  def next(input) when input == "台江区" or input == "350103",
    do: [
      %{"name" => "瀛洲街道", "code" => "350103001000"},
      %{"name" => "后洲街道", "code" => "350103002000"},
      %{"name" => "义洲街道", "code" => "350103003000"},
      %{"name" => "新港街道", "code" => "350103004000"},
      %{"name" => "上海街道", "code" => "350103005000"},
      %{"name" => "苍霞街道", "code" => "350103007000"},
      %{"name" => "茶亭街道", "code" => "350103009000"},
      %{"name" => "洋中街道", "code" => "350103010000"},
      %{"name" => "鳌峰街道", "code" => "350103011000"},
      %{"name" => "宁化街道", "code" => "350103012000"}
    ]

  def next(input) when input == "仓山区" or input == "350104",
    do: [
      %{"name" => "仓前街道", "code" => "350104001000"},
      %{"name" => "东升街道", "code" => "350104002000"},
      %{"name" => "对湖街道", "code" => "350104003000"},
      %{"name" => "临江街道", "code" => "350104004000"},
      %{"name" => "三叉街街道", "code" => "350104005000"},
      %{"name" => "上渡街道", "code" => "350104006000"},
      %{"name" => "下渡街道", "code" => "350104007000"},
      %{"name" => "金山街道", "code" => "350104008000"},
      %{"name" => "仓山镇", "code" => "350104100000"},
      %{"name" => "城门镇", "code" => "350104101000"},
      %{"name" => "盖山镇", "code" => "350104102000"},
      %{"name" => "建新镇", "code" => "350104103000"},
      %{"name" => "螺洲镇", "code" => "350104104000"},
      %{"name" => "红星农场", "code" => "350104400000"}
    ]

  def next(input) when input == "马尾区" or input == "350105",
    do: [
      %{"name" => "罗星街道", "code" => "350105001000"},
      %{"name" => "马尾镇", "code" => "350105100000"},
      %{"name" => "亭江镇", "code" => "350105101000"},
      %{"name" => "琅岐镇", "code" => "350105102000"}
    ]

  def next(input) when input == "晋安区" or input == "350111",
    do: [
      %{"name" => "茶园街道", "code" => "350111001000"},
      %{"name" => "王庄街道", "code" => "350111002000"},
      %{"name" => "象园街道", "code" => "350111003000"},
      %{"name" => "鼓山镇", "code" => "350111100000"},
      %{"name" => "新店镇", "code" => "350111101000"},
      %{"name" => "岳峰镇", "code" => "350111102000"},
      %{"name" => "宦溪镇", "code" => "350111103000"},
      %{"name" => "寿山乡", "code" => "350111201000"},
      %{"name" => "日溪乡", "code" => "350111202000"}
    ]

  def next(input) when input == "长乐区" or input == "350112",
    do: [
      %{"name" => "吴航街道", "code" => "350112001000"},
      %{"name" => "航城街道", "code" => "350112002000"},
      %{"name" => "营前街道", "code" => "350112003000"},
      %{"name" => "漳港街道", "code" => "350112004000"},
      %{"name" => "文武砂街道", "code" => "350112005000"},
      %{"name" => "首占镇", "code" => "350112102000"},
      %{"name" => "玉田镇", "code" => "350112103000"},
      %{"name" => "松下镇", "code" => "350112104000"},
      %{"name" => "江田镇", "code" => "350112105000"},
      %{"name" => "古槐镇", "code" => "350112106000"},
      %{"name" => "鹤上镇", "code" => "350112108000"},
      %{"name" => "湖南镇", "code" => "350112110000"},
      %{"name" => "金峰镇", "code" => "350112111000"},
      %{"name" => "文岭镇", "code" => "350112112000"},
      %{"name" => "梅花镇", "code" => "350112113000"},
      %{"name" => "潭头镇", "code" => "350112114000"},
      %{"name" => "罗联乡", "code" => "350112200000"},
      %{"name" => "猴屿乡", "code" => "350112201000"}
    ]

  def next(input) when input == "闽侯县" or input == "350121",
    do: [
      %{"name" => "甘蔗街道", "code" => "350121001000"},
      %{"name" => "白沙镇", "code" => "350121101000"},
      %{"name" => "南屿镇", "code" => "350121102000"},
      %{"name" => "尚干镇", "code" => "350121103000"},
      %{"name" => "祥谦镇", "code" => "350121104000"},
      %{"name" => "青口镇", "code" => "350121105000"},
      %{"name" => "南通镇", "code" => "350121106000"},
      %{"name" => "上街镇", "code" => "350121107000"},
      %{"name" => "荆溪镇", "code" => "350121108000"},
      %{"name" => "竹岐乡", "code" => "350121200000"},
      %{"name" => "鸿尾乡", "code" => "350121201000"},
      %{"name" => "洋里乡", "code" => "350121202000"},
      %{"name" => "大湖乡", "code" => "350121203000"},
      %{"name" => "廷坪乡", "code" => "350121204000"},
      %{"name" => "小箬乡", "code" => "350121206000"},
      %{"name" => "江洋农场", "code" => "350121400000"}
    ]

  def next(input) when input == "连江县" or input == "350122",
    do: [
      %{"name" => "凤城镇", "code" => "350122100000"},
      %{"name" => "敖江镇", "code" => "350122101000"},
      %{"name" => "东岱镇", "code" => "350122102000"},
      %{"name" => "琯头镇", "code" => "350122103000"},
      %{"name" => "晓澳镇", "code" => "350122104000"},
      %{"name" => "东湖镇", "code" => "350122105000"},
      %{"name" => "丹阳镇", "code" => "350122106000"},
      %{"name" => "长龙镇", "code" => "350122107000"},
      %{"name" => "透堡镇", "code" => "350122108000"},
      %{"name" => "马鼻镇", "code" => "350122109000"},
      %{"name" => "官坂镇", "code" => "350122110000"},
      %{"name" => "筱埕镇", "code" => "350122111000"},
      %{"name" => "黄岐镇", "code" => "350122112000"},
      %{"name" => "苔菉镇", "code" => "350122113000"},
      %{"name" => "浦口镇", "code" => "350122114000"},
      %{"name" => "坑园镇", "code" => "350122115000"},
      %{"name" => "潘渡镇", "code" => "350122116000"},
      %{"name" => "江南镇", "code" => "350122117000"},
      %{"name" => "下宫镇", "code" => "350122118000"},
      %{"name" => "蓼沿乡", "code" => "350122202000"},
      %{"name" => "安凯乡", "code" => "350122203000"},
      %{"name" => "小沧畲族乡", "code" => "350122205000"},
      %{"name" => "马祖乡", "code" => "350122400000"}
    ]

  def next(input) when input == "罗源县" or input == "350123",
    do: [
      %{"name" => "凤山镇", "code" => "350123100000"},
      %{"name" => "松山镇", "code" => "350123101000"},
      %{"name" => "起步镇", "code" => "350123102000"},
      %{"name" => "中房镇", "code" => "350123103000"},
      %{"name" => "飞竹镇", "code" => "350123104000"},
      %{"name" => "鉴江镇", "code" => "350123105000"},
      %{"name" => "白塔乡", "code" => "350123200000"},
      %{"name" => "洪洋乡", "code" => "350123201000"},
      %{"name" => "西兰乡", "code" => "350123202000"},
      %{"name" => "霍口畲族乡", "code" => "350123203000"},
      %{"name" => "碧里乡", "code" => "350123204000"},
      %{"name" => "罗源湾", "code" => "350123500000"}
    ]

  def next(input) when input == "闽清县" or input == "350124",
    do: [
      %{"name" => "梅城镇", "code" => "350124100000"},
      %{"name" => "梅溪镇", "code" => "350124101000"},
      %{"name" => "白樟镇", "code" => "350124102000"},
      %{"name" => "金沙镇", "code" => "350124103000"},
      %{"name" => "白中镇", "code" => "350124104000"},
      %{"name" => "池园镇", "code" => "350124105000"},
      %{"name" => "坂东镇", "code" => "350124106000"},
      %{"name" => "塔庄镇", "code" => "350124107000"},
      %{"name" => "省璜镇", "code" => "350124108000"},
      %{"name" => "雄江镇", "code" => "350124109000"},
      %{"name" => "东桥镇", "code" => "350124110000"},
      %{"name" => "云龙乡", "code" => "350124200000"},
      %{"name" => "上莲乡", "code" => "350124201000"},
      %{"name" => "三溪乡", "code" => "350124204000"},
      %{"name" => "桔林乡", "code" => "350124205000"},
      %{"name" => "下祝乡", "code" => "350124206000"}
    ]

  def next(input) when input == "永泰县" or input == "350125",
    do: [
      %{"name" => "樟城镇", "code" => "350125100000"},
      %{"name" => "嵩口镇", "code" => "350125101000"},
      %{"name" => "梧桐镇", "code" => "350125102000"},
      %{"name" => "葛岭镇", "code" => "350125103000"},
      %{"name" => "城峰镇", "code" => "350125104000"},
      %{"name" => "清凉镇", "code" => "350125105000"},
      %{"name" => "长庆镇", "code" => "350125106000"},
      %{"name" => "同安镇", "code" => "350125107000"},
      %{"name" => "大洋镇", "code" => "350125108000"},
      %{"name" => "塘前乡", "code" => "350125200000"},
      %{"name" => "富泉乡", "code" => "350125201000"},
      %{"name" => "岭路乡", "code" => "350125202000"},
      %{"name" => "赤锡乡", "code" => "350125203000"},
      %{"name" => "洑口乡", "code" => "350125204000"},
      %{"name" => "盖洋乡", "code" => "350125205000"},
      %{"name" => "东洋乡", "code" => "350125206000"},
      %{"name" => "霞拔乡", "code" => "350125207000"},
      %{"name" => "盘谷乡", "code" => "350125208000"},
      %{"name" => "红星乡", "code" => "350125209000"},
      %{"name" => "白云乡", "code" => "350125210000"},
      %{"name" => "丹云乡", "code" => "350125211000"}
    ]

  def next(input) when input == "平潭县" or input == "350128",
    do: [
      %{"name" => "海坛街道", "code" => "350128001000"},
      %{"name" => "金井镇", "code" => "350128107000"},
      %{"name" => "君山镇", "code" => "350128108000"},
      %{"name" => "苏平镇", "code" => "350128109000"},
      %{"name" => "屿头乡", "code" => "350128201000"},
      %{"name" => "东庠乡", "code" => "350128205000"},
      %{"name" => "南海乡", "code" => "350128207000"}
    ]

  def next(input) when input == "福清市" or input == "350181",
    do: [
      %{"name" => "玉屏街道", "code" => "350181002000"},
      %{"name" => "龙山街道", "code" => "350181003000"},
      %{"name" => "龙江街道", "code" => "350181004000"},
      %{"name" => "宏路街道", "code" => "350181005000"},
      %{"name" => "石竹街道", "code" => "350181006000"},
      %{"name" => "音西街道", "code" => "350181007000"},
      %{"name" => "阳下街道", "code" => "350181008000"},
      %{"name" => "海口镇", "code" => "350181103000"},
      %{"name" => "城头镇", "code" => "350181104000"},
      %{"name" => "南岭镇", "code" => "350181105000"},
      %{"name" => "龙田镇", "code" => "350181106000"},
      %{"name" => "江镜镇", "code" => "350181107000"},
      %{"name" => "港头镇", "code" => "350181108000"},
      %{"name" => "高山镇", "code" => "350181109000"},
      %{"name" => "沙埔镇", "code" => "350181110000"},
      %{"name" => "三山镇", "code" => "350181111000"},
      %{"name" => "东瀚镇", "code" => "350181112000"},
      %{"name" => "渔溪镇", "code" => "350181113000"},
      %{"name" => "上迳镇", "code" => "350181114000"},
      %{"name" => "新厝镇", "code" => "350181115000"},
      %{"name" => "江阴镇", "code" => "350181116000"},
      %{"name" => "东张镇", "code" => "350181117000"},
      %{"name" => "镜洋镇", "code" => "350181118000"},
      %{"name" => "一都镇", "code" => "350181119000"},
      %{"name" => "江镜华侨", "code" => "350181400000"},
      %{"name" => "东阁华侨", "code" => "350181401000"}
    ]

  def next(_), do: nil
end