defmodule ChinaAdminDivisions.Gen.Lv3x.M37 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "菏泽高新技术开发区" or input == "371772",
    do: [
      %{"name" => "万福街道", "code" => "371772001000"},
      %{"name" => "吕陵镇", "code" => "371772100000"},
      %{"name" => "马岭岗镇", "code" => "371772108000"}
    ]

  def next(input) when input == "菏泽经济技术开发区" or input == "371771",
    do: [
      %{"name" => "丹阳街道", "code" => "371771001000"},
      %{"name" => "岳程街道", "code" => "371771002000"},
      %{"name" => "佃户屯街道", "code" => "371771003000"},
      %{"name" => "陈集镇", "code" => "371771101000"}
    ]

  def next(input) when input == "东明县" or input == "371728",
    do: [
      %{"name" => "城关街道", "code" => "371728001000"},
      %{"name" => "渔沃街道", "code" => "371728002000"},
      %{"name" => "东明集镇", "code" => "371728101000"},
      %{"name" => "刘楼镇", "code" => "371728102000"},
      %{"name" => "陆圈镇", "code" => "371728103000"},
      %{"name" => "马头镇", "code" => "371728104000"},
      %{"name" => "三春集镇", "code" => "371728105000"},
      %{"name" => "大屯镇", "code" => "371728106000"},
      %{"name" => "武胜桥镇", "code" => "371728107000"},
      %{"name" => "菜园集镇", "code" => "371728108000"},
      %{"name" => "沙窝镇", "code" => "371728109000"},
      %{"name" => "小井镇", "code" => "371728110000"},
      %{"name" => "长兴集乡", "code" => "371728204000"},
      %{"name" => "焦园乡", "code" => "371728205000"}
    ]

  def next(input) when input == "鄄城县" or input == "371726",
    do: [
      %{"name" => "陈王街道", "code" => "371726001000"},
      %{"name" => "古泉街道", "code" => "371726002000"},
      %{"name" => "什集镇", "code" => "371726101000"},
      %{"name" => "红船镇", "code" => "371726102000"},
      %{"name" => "旧城镇", "code" => "371726103000"},
      %{"name" => "闫什镇", "code" => "371726104000"},
      %{"name" => "箕山镇", "code" => "371726105000"},
      %{"name" => "李进士堂镇", "code" => "371726106000"},
      %{"name" => "董口镇", "code" => "371726107000"},
      %{"name" => "临濮镇", "code" => "371726108000"},
      %{"name" => "彭楼镇", "code" => "371726109000"},
      %{"name" => "凤凰镇", "code" => "371726110000"},
      %{"name" => "郑营镇", "code" => "371726111000"},
      %{"name" => "大埝镇", "code" => "371726112000"},
      %{"name" => "引马镇", "code" => "371726113000"},
      %{"name" => "左营镇", "code" => "371726114000"},
      %{"name" => "富春镇", "code" => "371726115000"}
    ]

  def next(input) when input == "郓城县" or input == "371725",
    do: [
      %{"name" => "郓州街道", "code" => "371725001000"},
      %{"name" => "唐塔街道", "code" => "371725002000"},
      %{"name" => "丁里长街道", "code" => "371725003000"},
      %{"name" => "张营街道", "code" => "371725004000"},
      %{"name" => "黄安镇", "code" => "371725101000"},
      %{"name" => "杨庄集镇", "code" => "371725102000"},
      %{"name" => "侯咽集镇", "code" => "371725103000"},
      %{"name" => "武安镇", "code" => "371725104000"},
      %{"name" => "郭屯镇", "code" => "371725105000"},
      %{"name" => "玉皇庙镇", "code" => "371725107000"},
      %{"name" => "程屯镇", "code" => "371725108000"},
      %{"name" => "随官屯镇", "code" => "371725109000"},
      %{"name" => "潘渡镇", "code" => "371725111000"},
      %{"name" => "双桥镇", "code" => "371725112000"},
      %{"name" => "南赵楼镇", "code" => "371725113000"},
      %{"name" => "黄泥冈镇", "code" => "371725114000"},
      %{"name" => "唐庙镇", "code" => "371725115000"},
      %{"name" => "李集镇", "code" => "371725116000"},
      %{"name" => "黄集镇", "code" => "371725117000"},
      %{"name" => "张鲁集镇", "code" => "371725118000"},
      %{"name" => "水堡乡", "code" => "371725208000"},
      %{"name" => "陈坡乡", "code" => "371725209000"}
    ]

  def next(input) when input == "巨野县" or input == "371724",
    do: [
      %{"name" => "凤凰街道", "code" => "371724001000"},
      %{"name" => "永丰街道", "code" => "371724002000"},
      %{"name" => "龙固镇", "code" => "371724101000"},
      %{"name" => "大义镇", "code" => "371724102000"},
      %{"name" => "柳林镇", "code" => "371724103000"},
      %{"name" => "章缝镇", "code" => "371724104000"},
      %{"name" => "大谢集镇", "code" => "371724105000"},
      %{"name" => "独山镇", "code" => "371724106000"},
      %{"name" => "麒麟镇", "code" => "371724107000"},
      %{"name" => "核桃园镇", "code" => "371724108000"},
      %{"name" => "田庄镇", "code" => "371724109000"},
      %{"name" => "太平镇", "code" => "371724110000"},
      %{"name" => "万丰镇", "code" => "371724111000"},
      %{"name" => "陶庙镇", "code" => "371724112000"},
      %{"name" => "董官屯镇", "code" => "371724113000"},
      %{"name" => "田桥镇", "code" => "371724114000"},
      %{"name" => "营里镇", "code" => "371724115000"}
    ]

  def next(input) when input == "成武县" or input == "371723",
    do: [
      %{"name" => "文亭街道", "code" => "371723001000"},
      %{"name" => "永昌街道", "code" => "371723002000"},
      %{"name" => "大田集镇", "code" => "371723101000"},
      %{"name" => "天宫庙镇", "code" => "371723102000"},
      %{"name" => "汶上集镇", "code" => "371723103000"},
      %{"name" => "南鲁集镇", "code" => "371723104000"},
      %{"name" => "伯乐集镇", "code" => "371723105000"},
      %{"name" => "苟村集镇", "code" => "371723106000"},
      %{"name" => "白浮图镇", "code" => "371723107000"},
      %{"name" => "成武县孙寺镇", "code" => "371723108000"},
      %{"name" => "成武县九女集镇", "code" => "371723109000"},
      %{"name" => "成武县党集镇", "code" => "371723110000"},
      %{"name" => "成武县张楼镇", "code" => "371723111000"}
    ]

  def next(input) when input == "单县" or input == "371722",
    do: [
      %{"name" => "北城街道", "code" => "371722001000"},
      %{"name" => "南城街道", "code" => "371722002000"},
      %{"name" => "园艺街道", "code" => "371722003000"},
      %{"name" => "东城街道", "code" => "371722004000"},
      %{"name" => "郭村镇", "code" => "371722101000"},
      %{"name" => "黄岗镇", "code" => "371722102000"},
      %{"name" => "终兴镇", "code" => "371722103000"},
      %{"name" => "高韦庄镇", "code" => "371722105000"},
      %{"name" => "徐寨镇", "code" => "371722106000"},
      %{"name" => "蔡堂镇", "code" => "371722107000"},
      %{"name" => "朱集镇", "code" => "371722108000"},
      %{"name" => "李新庄镇", "code" => "371722109000"},
      %{"name" => "浮岗镇", "code" => "371722110000"},
      %{"name" => "莱河镇", "code" => "371722111000"},
      %{"name" => "时楼镇", "code" => "371722112000"},
      %{"name" => "杨楼镇", "code" => "371722113000"},
      %{"name" => "张集镇", "code" => "371722114000"},
      %{"name" => "龙王庙镇", "code" => "371722115000"},
      %{"name" => "谢集镇", "code" => "371722116000"},
      %{"name" => "李田楼镇", "code" => "371722117000"},
      %{"name" => "高老家乡", "code" => "371722201000"},
      %{"name" => "曹庄乡", "code" => "371722202000"}
    ]

  def next(input) when input == "曹县" or input == "371721",
    do: [
      %{"name" => "曹城街道", "code" => "371721001000"},
      %{"name" => "磐石街道", "code" => "371721002000"},
      %{"name" => "青菏街道", "code" => "371721003000"},
      %{"name" => "郑庄街道", "code" => "371721004000"},
      %{"name" => "倪集街道", "code" => "371721005000"},
      %{"name" => "庄寨镇", "code" => "371721101000"},
      %{"name" => "普连集镇", "code" => "371721102000"},
      %{"name" => "青堌集镇", "code" => "371721103000"},
      %{"name" => "韩集镇", "code" => "371721105000"},
      %{"name" => "砖庙镇", "code" => "371721106000"},
      %{"name" => "古营集镇", "code" => "371721107000"},
      %{"name" => "魏湾镇", "code" => "371721108000"},
      %{"name" => "侯集镇", "code" => "371721109000"},
      %{"name" => "苏集镇", "code" => "371721110000"},
      %{"name" => "孙老家镇", "code" => "371721111000"},
      %{"name" => "阎店楼镇", "code" => "371721112000"},
      %{"name" => "梁堤头镇", "code" => "371721113000"},
      %{"name" => "安蔡楼镇", "code" => "371721114000"},
      %{"name" => "邵庄镇", "code" => "371721115000"},
      %{"name" => "王集镇", "code" => "371721116000"},
      %{"name" => "青岗集镇", "code" => "371721117000"},
      %{"name" => "常乐集镇", "code" => "371721120000"},
      %{"name" => "大集镇", "code" => "371721121000"},
      %{"name" => "仵楼镇", "code" => "371721122000"},
      %{"name" => "楼庄镇", "code" => "371721123000"},
      %{"name" => "朱洪庙镇", "code" => "371721124000"}
    ]

  def next(input) when input == "定陶区" or input == "371703",
    do: [
      %{"name" => "天中街道", "code" => "371703001000"},
      %{"name" => "滨河街道", "code" => "371703002000"},
      %{"name" => "冉固镇", "code" => "371703102000"},
      %{"name" => "张湾镇", "code" => "371703103000"},
      %{"name" => "黄店镇", "code" => "371703104000"},
      %{"name" => "孟海镇", "code" => "371703105000"},
      %{"name" => "马集镇", "code" => "371703106000"},
      %{"name" => "仿山镇", "code" => "371703107000"},
      %{"name" => "半堤镇", "code" => "371703108000"},
      %{"name" => "杜堂镇", "code" => "371703109000"},
      %{"name" => "南王店镇", "code" => "371703110000"}
    ]

  def next(input) when input == "牡丹区" or input == "371702",
    do: [
      %{"name" => "东城街道", "code" => "371702001000"},
      %{"name" => "西城街道", "code" => "371702002000"},
      %{"name" => "南城街道", "code" => "371702003000"},
      %{"name" => "北城街道", "code" => "371702004000"},
      %{"name" => "牡丹街道", "code" => "371702005000"},
      %{"name" => "何楼街道", "code" => "371702009000"},
      %{"name" => "皇镇街道", "code" => "371702011000"},
      %{"name" => "沙土镇", "code" => "371702100000"},
      %{"name" => "吴店镇", "code" => "371702101000"},
      %{"name" => "王浩屯镇", "code" => "371702102000"},
      %{"name" => "黄堽镇", "code" => "371702103000"},
      %{"name" => "都司镇", "code" => "371702104000"},
      %{"name" => "高庄镇", "code" => "371702105000"},
      %{"name" => "小留镇", "code" => "371702106000"},
      %{"name" => "李村镇", "code" => "371702107000"},
      %{"name" => "安兴镇", "code" => "371702109000"},
      %{"name" => "大黄集镇", "code" => "371702110000"},
      %{"name" => "胡集镇", "code" => "371702112000"}
    ]

  def next(input) when input == "邹平市" or input == "371681",
    do: [
      %{"name" => "黛溪街道", "code" => "371681001000"},
      %{"name" => "黄山街道", "code" => "371681002000"},
      %{"name" => "高新街道", "code" => "371681003000"},
      %{"name" => "好生街道", "code" => "371681004000"},
      %{"name" => "西董街道", "code" => "371681005000"},
      %{"name" => "长山镇", "code" => "371681101000"},
      %{"name" => "魏桥镇", "code" => "371681102000"},
      %{"name" => "临池镇", "code" => "371681105000"},
      %{"name" => "焦桥镇", "code" => "371681108000"},
      %{"name" => "韩店镇", "code" => "371681109000"},
      %{"name" => "孙镇镇", "code" => "371681110000"},
      %{"name" => "九户镇", "code" => "371681111000"},
      %{"name" => "青阳镇", "code" => "371681112000"},
      %{"name" => "明集镇", "code" => "371681113000"},
      %{"name" => "台子镇", "code" => "371681114000"},
      %{"name" => "码头镇", "code" => "371681115000"}
    ]

  def next(input) when input == "博兴县" or input == "371625",
    do: [
      %{"name" => "城东街道", "code" => "371625001000"},
      %{"name" => "锦秋街道", "code" => "371625002000"},
      %{"name" => "博昌街道", "code" => "371625003000"},
      %{"name" => "曹王镇", "code" => "371625101000"},
      %{"name" => "兴福镇", "code" => "371625102000"},
      %{"name" => "陈户镇", "code" => "371625103000"},
      %{"name" => "湖滨镇", "code" => "371625104000"},
      %{"name" => "店子镇", "code" => "371625106000"},
      %{"name" => "吕艺镇", "code" => "371625107000"},
      %{"name" => "纯化镇", "code" => "371625108000"},
      %{"name" => "庞家镇", "code" => "371625109000"},
      %{"name" => "乔庄镇", "code" => "371625110000"}
    ]

  def next(input) when input == "无棣县" or input == "371623",
    do: [
      %{"name" => "棣丰街道", "code" => "371623001000"},
      %{"name" => "海丰街道", "code" => "371623002000"},
      %{"name" => "水湾镇", "code" => "371623101000"},
      %{"name" => "碣石山镇", "code" => "371623102000"},
      %{"name" => "小泊头镇", "code" => "371623103000"},
      %{"name" => "埕口镇", "code" => "371623104000"},
      %{"name" => "马山子镇", "code" => "371623105000"},
      %{"name" => "车王镇", "code" => "371623106000"},
      %{"name" => "柳堡镇", "code" => "371623107000"},
      %{"name" => "佘家镇", "code" => "371623108000"},
      %{"name" => "信阳镇", "code" => "371623109000"},
      %{"name" => "西小王镇", "code" => "371623110000"}
    ]

  def next(input) when input == "阳信县" or input == "371622",
    do: [
      %{"name" => "信城街道", "code" => "371622001000"},
      %{"name" => "金阳街道", "code" => "371622002000"},
      %{"name" => "商店镇", "code" => "371622101000"},
      %{"name" => "温店镇", "code" => "371622102000"},
      %{"name" => "河流镇", "code" => "371622103000"},
      %{"name" => "翟王镇", "code" => "371622104000"},
      %{"name" => "流坡坞镇", "code" => "371622105000"},
      %{"name" => "水落坡镇", "code" => "371622106000"},
      %{"name" => "劳店镇", "code" => "371622107000"},
      %{"name" => "洋湖乡", "code" => "371622204000"}
    ]

  def next(input) when input == "惠民县" or input == "371621",
    do: [
      %{"name" => "孙武街道", "code" => "371621001000"},
      %{"name" => "何坊街道", "code" => "371621003000"},
      %{"name" => "武定府街道", "code" => "371621004000"},
      %{"name" => "石庙镇", "code" => "371621101000"},
      %{"name" => "桑落墅镇", "code" => "371621102000"},
      %{"name" => "淄角镇", "code" => "371621103000"},
      %{"name" => "胡集镇", "code" => "371621104000"},
      %{"name" => "李庄镇", "code" => "371621105000"},
      %{"name" => "麻店镇", "code" => "371621107000"},
      %{"name" => "魏集镇", "code" => "371621108000"},
      %{"name" => "清河镇", "code" => "371621109000"},
      %{"name" => "姜楼镇", "code" => "371621111000"},
      %{"name" => "辛店镇", "code" => "371621113000"},
      %{"name" => "大年陈镇", "code" => "371621114000"},
      %{"name" => "皂户李镇", "code" => "371621115000"}
    ]

  def next(input) when input == "沾化区" or input == "371603",
    do: [
      %{"name" => "富国街道", "code" => "371603001000"},
      %{"name" => "富源街道", "code" => "371603002000"},
      %{"name" => "下洼镇", "code" => "371603101000"},
      %{"name" => "古城镇", "code" => "371603102000"},
      %{"name" => "冯家镇", "code" => "371603103000"},
      %{"name" => "泊头镇", "code" => "371603104000"},
      %{"name" => "大高镇", "code" => "371603105000"},
      %{"name" => "黄升镇", "code" => "371603106000"},
      %{"name" => "滨海镇", "code" => "371603107000"},
      %{"name" => "下河乡", "code" => "371603203000"},
      %{"name" => "利国乡", "code" => "371603204000"},
      %{"name" => "海防乡", "code" => "371603400000"}
    ]

  def next(input) when input == "滨城区" or input == "371602",
    do: [
      %{"name" => "市中街道", "code" => "371602001000"},
      %{"name" => "市西街道", "code" => "371602002000"},
      %{"name" => "北镇街道", "code" => "371602003000"},
      %{"name" => "市东街道", "code" => "371602004000"},
      %{"name" => "彭李街道", "code" => "371602005000"},
      %{"name" => "小营街道", "code" => "371602007000"},
      %{"name" => "滨北街道", "code" => "371602008000"},
      %{"name" => "梁才街道", "code" => "371602009000"},
      %{"name" => "杜店街道", "code" => "371602010000"},
      %{"name" => "沙河街道", "code" => "371602011000"},
      %{"name" => "里则街道", "code" => "371602012000"},
      %{"name" => "青田街道", "code" => "371602013000"},
      %{"name" => "三河湖镇", "code" => "371602105000"},
      %{"name" => "杨柳雪镇", "code" => "371602106000"},
      %{"name" => "秦皇台乡", "code" => "371602203000"}
    ]

  def next(input) when input == "临清市" or input == "371581",
    do: [
      %{"name" => "青年路街道", "code" => "371581001000"},
      %{"name" => "新华路街道", "code" => "371581002000"},
      %{"name" => "先锋路街道", "code" => "371581003000"},
      %{"name" => "大辛庄街道", "code" => "371581004000"},
      %{"name" => "松林镇", "code" => "371581101000"},
      %{"name" => "老赵庄镇", "code" => "371581102000"},
      %{"name" => "康庄镇", "code" => "371581103000"},
      %{"name" => "魏湾镇", "code" => "371581104000"},
      %{"name" => "刘垓子镇", "code" => "371581105000"},
      %{"name" => "八岔路镇", "code" => "371581107000"},
      %{"name" => "潘庄镇", "code" => "371581108000"},
      %{"name" => "烟店镇", "code" => "371581109000"},
      %{"name" => "唐园镇", "code" => "371581110000"},
      %{"name" => "金郝庄镇", "code" => "371581111000"},
      %{"name" => "戴湾镇", "code" => "371581112000"},
      %{"name" => "尚店镇", "code" => "371581113000"}
    ]

  def next(input) when input == "高唐县" or input == "371526",
    do: [
      %{"name" => "鱼邱湖街道", "code" => "371526001000"},
      %{"name" => "汇鑫街道", "code" => "371526002000"},
      %{"name" => "人和街道", "code" => "371526003000"},
      %{"name" => "梁村镇", "code" => "371526101000"},
      %{"name" => "尹集镇", "code" => "371526102000"},
      %{"name" => "清平镇", "code" => "371526103000"},
      %{"name" => "固河镇", "code" => "371526104000"},
      %{"name" => "三十里铺镇", "code" => "371526105000"},
      %{"name" => "琉璃寺镇", "code" => "371526106000"},
      %{"name" => "赵寨子镇", "code" => "371526107000"},
      %{"name" => "姜店镇", "code" => "371526108000"},
      %{"name" => "杨屯镇", "code" => "371526109000"}
    ]

  def next(input) when input == "冠县" or input == "371525",
    do: [
      %{"name" => "清泉街道", "code" => "371525001000"},
      %{"name" => "崇文街道", "code" => "371525002000"},
      %{"name" => "烟庄街道", "code" => "371525003000"},
      %{"name" => "贾镇", "code" => "371525101000"},
      %{"name" => "桑阿镇", "code" => "371525102000"},
      %{"name" => "柳林镇", "code" => "371525103000"},
      %{"name" => "清水镇", "code" => "371525104000"},
      %{"name" => "东古城镇", "code" => "371525105000"},
      %{"name" => "北馆陶镇", "code" => "371525106000"},
      %{"name" => "店子镇", "code" => "371525107000"},
      %{"name" => "定远寨镇", "code" => "371525108000"},
      %{"name" => "辛集镇", "code" => "371525109000"},
      %{"name" => "梁堂镇", "code" => "371525110000"},
      %{"name" => "范寨镇", "code" => "371525111000"},
      %{"name" => "甘官屯镇", "code" => "371525112000"},
      %{"name" => "斜店乡", "code" => "371525200000"},
      %{"name" => "兰沃乡", "code" => "371525206000"},
      %{"name" => "万善乡", "code" => "371525209000"}
    ]

  def next(input) when input == "东阿县" or input == "371524",
    do: [
      %{"name" => "铜城街道", "code" => "371524001000"},
      %{"name" => "新城街道", "code" => "371524002000"},
      %{"name" => "刘集镇", "code" => "371524101000"},
      %{"name" => "牛角店镇", "code" => "371524102000"},
      %{"name" => "大桥镇", "code" => "371524103000"},
      %{"name" => "高集镇", "code" => "371524104000"},
      %{"name" => "姜楼镇", "code" => "371524105000"},
      %{"name" => "姚寨镇", "code" => "371524107000"},
      %{"name" => "鱼山镇", "code" => "371524108000"},
      %{"name" => "陈集镇", "code" => "371524109000"}
    ]

  def next(input) when input == "莘县" or input == "371522",
    do: [
      %{"name" => "燕塔街道", "code" => "371522001000"},
      %{"name" => "莘亭街道", "code" => "371522002000"},
      %{"name" => "莘州街道", "code" => "371522003000"},
      %{"name" => "东鲁街道", "code" => "371522004000"},
      %{"name" => "张鲁镇", "code" => "371522101000"},
      %{"name" => "朝城镇", "code" => "371522102000"},
      %{"name" => "观城镇", "code" => "371522103000"},
      %{"name" => "古城镇", "code" => "371522104000"},
      %{"name" => "大张家镇", "code" => "371522105000"},
      %{"name" => "古云镇", "code" => "371522106000"},
      %{"name" => "十八里铺镇", "code" => "371522107000"},
      %{"name" => "燕店镇", "code" => "371522109000"},
      %{"name" => "董杜庄镇", "code" => "371522110000"},
      %{"name" => "王奉镇", "code" => "371522111000"},
      %{"name" => "樱桃园镇", "code" => "371522112000"},
      %{"name" => "河店镇", "code" => "371522113000"},
      %{"name" => "妹冢镇", "code" => "371522114000"},
      %{"name" => "魏庄镇", "code" => "371522115000"},
      %{"name" => "张寨镇", "code" => "371522116000"},
      %{"name" => "大王寨镇", "code" => "371522117000"},
      %{"name" => "徐庄镇", "code" => "371522118000"},
      %{"name" => "王庄集镇", "code" => "371522119000"},
      %{"name" => "柿子园镇", "code" => "371522120000"},
      %{"name" => "俎店镇", "code" => "371522121000"}
    ]

  def next(input) when input == "阳谷县" or input == "371521",
    do: [
      %{"name" => "博济桥街道", "code" => "371521001000"},
      %{"name" => "侨润街道", "code" => "371521002000"},
      %{"name" => "狮子楼街道", "code" => "371521003000"},
      %{"name" => "阎楼镇", "code" => "371521101000"},
      %{"name" => "阿城镇", "code" => "371521103000"},
      %{"name" => "七级镇", "code" => "371521104000"},
      %{"name" => "安乐镇", "code" => "371521105000"},
      %{"name" => "定水镇", "code" => "371521106000"},
      %{"name" => "石佛镇", "code" => "371521107000"},
      %{"name" => "李台镇", "code" => "371521108000"},
      %{"name" => "寿张镇", "code" => "371521109000"},
      %{"name" => "十五里园镇", "code" => "371521111000"},
      %{"name" => "张秋镇", "code" => "371521112000"},
      %{"name" => "郭店屯镇", "code" => "371521113000"},
      %{"name" => "西湖镇", "code" => "371521114000"},
      %{"name" => "高庙王镇", "code" => "371521115000"},
      %{"name" => "金斗营镇", "code" => "371521116000"},
      %{"name" => "大布乡", "code" => "371521203000"}
    ]

  def next(input) when input == "茌平区" or input == "371503",
    do: [
      %{"name" => "振兴街道", "code" => "371503001000"},
      %{"name" => "信发街道", "code" => "371503002000"},
      %{"name" => "温陈街道", "code" => "371503003000"},
      %{"name" => "乐平铺镇", "code" => "371503101000"},
      %{"name" => "冯官屯镇", "code" => "371503102000"},
      %{"name" => "菜屯镇", "code" => "371503103000"},
      %{"name" => "博平镇", "code" => "371503104000"},
      %{"name" => "杜郎口镇", "code" => "371503105000"},
      %{"name" => "韩屯镇", "code" => "371503106000"},
      %{"name" => "胡屯镇", "code" => "371503107000"},
      %{"name" => "肖家庄镇", "code" => "371503108000"},
      %{"name" => "贾寨镇", "code" => "371503109000"},
      %{"name" => "洪官屯镇", "code" => "371503110000"},
      %{"name" => "杨官屯乡", "code" => "371503208000"}
    ]

  def next(input) when input == "东昌府区" or input == "371502",
    do: [
      %{"name" => "古楼街道", "code" => "371502001000"},
      %{"name" => "柳园街道", "code" => "371502002000"},
      %{"name" => "新区街道", "code" => "371502003000"},
      %{"name" => "湖西街道", "code" => "371502004000"},
      %{"name" => "道口铺街道", "code" => "371502005000"},
      %{"name" => "闫寺街道", "code" => "371502006000"},
      %{"name" => "北城街道", "code" => "371502008000"},
      %{"name" => "东城街道", "code" => "371502009000"},
      %{"name" => "蒋官屯街道", "code" => "371502010000"},
      %{"name" => "李海务街道", "code" => "371502011000"},
      %{"name" => "侯营镇", "code" => "371502100000"},
      %{"name" => "沙镇镇", "code" => "371502101000"},
      %{"name" => "堂邑镇", "code" => "371502102000"},
      %{"name" => "梁水镇", "code" => "371502103000"},
      %{"name" => "斗虎屯镇", "code" => "371502104000"},
      %{"name" => "郑家镇", "code" => "371502105000"},
      %{"name" => "张炉集镇", "code" => "371502106000"},
      %{"name" => "于集镇", "code" => "371502107000"},
      %{"name" => "许营镇", "code" => "371502108000"},
      %{"name" => "朱老庄镇", "code" => "371502109000"},
      %{"name" => "顾官屯镇", "code" => "371502110000"},
      %{"name" => "韩集镇", "code" => "371502115000"},
      %{"name" => "广平镇", "code" => "371502116000"},
      %{"name" => "香江光彩大市场服务中心", "code" => "371502400000"}
    ]

  def next(input) when input == "禹城市" or input == "371482",
    do: [
      %{"name" => "市中街道", "code" => "371482001000"},
      %{"name" => "禹兴街道", "code" => "371482002000"},
      %{"name" => "伦镇", "code" => "371482100000"},
      %{"name" => "房寺镇", "code" => "371482101000"},
      %{"name" => "张庄镇", "code" => "371482102000"},
      %{"name" => "辛店镇", "code" => "371482103000"},
      %{"name" => "安仁镇", "code" => "371482104000"},
      %{"name" => "辛寨镇", "code" => "371482105000"},
      %{"name" => "梁家镇", "code" => "371482106000"},
      %{"name" => "十里望回族镇", "code" => "371482107000"},
      %{"name" => "莒镇", "code" => "371482108000"}
    ]

  def next(input) when input == "乐陵市" or input == "371481",
    do: [
      %{"name" => "市中街道", "code" => "371481001000"},
      %{"name" => "胡家街道", "code" => "371481002000"},
      %{"name" => "云红街道", "code" => "371481003000"},
      %{"name" => "郭家街道", "code" => "371481004000"},
      %{"name" => "杨安镇", "code" => "371481100000"},
      %{"name" => "朱集镇", "code" => "371481101000"},
      %{"name" => "黄夹镇", "code" => "371481102000"},
      %{"name" => "丁坞镇", "code" => "371481103000"},
      %{"name" => "花园镇", "code" => "371481104000"},
      %{"name" => "郑店镇", "code" => "371481105000"},
      %{"name" => "化楼镇", "code" => "371481106000"},
      %{"name" => "孔镇", "code" => "371481107000"},
      %{"name" => "铁营镇", "code" => "371481108000"},
      %{"name" => "西段乡", "code" => "371481200000"},
      %{"name" => "大孙乡", "code" => "371481201000"},
      %{"name" => "寨头堡乡", "code" => "371481203000"}
    ]

  def next(input) when input == "德州天衢新区" or input == "371471",
    do: [
      %{"name" => "长河街道", "code" => "371471007000"},
      %{"name" => "宋官屯街道", "code" => "371471008000"},
      %{"name" => "赵虎镇", "code" => "371471100000"},
      %{"name" => "抬头寺镇", "code" => "371471101000"},
      %{"name" => "袁桥镇", "code" => "371471108000"},
      %{"name" => "新区服务管理办公室", "code" => "371471400000"}
    ]

  def next(input) when input == "武城县" or input == "371428",
    do: [
      %{"name" => "广运街道", "code" => "371428001000"},
      %{"name" => "武城镇", "code" => "371428100000"},
      %{"name" => "老城镇", "code" => "371428101000"},
      %{"name" => "鲁权屯镇", "code" => "371428103000"},
      %{"name" => "郝王庄镇", "code" => "371428104000"},
      %{"name" => "甲马营镇", "code" => "371428106000"},
      %{"name" => "四女寺镇", "code" => "371428107000"},
      %{"name" => "李家户镇", "code" => "371428108000"}
    ]

  def next(input) when input == "夏津县" or input == "371427",
    do: [
      %{"name" => "银城街道", "code" => "371427001000"},
      %{"name" => "北城街道", "code" => "371427002000"},
      %{"name" => "南城镇", "code" => "371427100000"},
      %{"name" => "苏留庄镇", "code" => "371427101000"},
      %{"name" => "新盛店镇", "code" => "371427102000"},
      %{"name" => "雷集镇", "code" => "371427103000"},
      %{"name" => "郑保屯镇", "code" => "371427104000"},
      %{"name" => "白马湖镇", "code" => "371427105000"},
      %{"name" => "东李官屯镇", "code" => "371427106000"},
      %{"name" => "宋楼镇", "code" => "371427107000"},
      %{"name" => "香赵庄镇", "code" => "371427108000"},
      %{"name" => "双庙镇", "code" => "371427109000"},
      %{"name" => "渡口驿乡", "code" => "371427200000"},
      %{"name" => "田庄乡", "code" => "371427204000"}
    ]

  def next(input) when input == "平原县" or input == "371426",
    do: [
      %{"name" => "龙门街道", "code" => "371426001000"},
      %{"name" => "桃园街道", "code" => "371426002000"},
      %{"name" => "德原街道", "code" => "371426003000"},
      %{"name" => "王凤楼镇", "code" => "371426101000"},
      %{"name" => "前曹镇", "code" => "371426102000"},
      %{"name" => "恩城镇", "code" => "371426103000"},
      %{"name" => "王庙镇", "code" => "371426104000"},
      %{"name" => "王杲铺镇", "code" => "371426105000"},
      %{"name" => "张华镇", "code" => "371426106000"},
      %{"name" => "腰站镇", "code" => "371426107000"},
      %{"name" => "王打卦镇", "code" => "371426108000"},
      %{"name" => "三唐乡", "code" => "371426202000"}
    ]

  def next(input) when input == "齐河县" or input == "371425",
    do: [
      %{"name" => "晏城街道", "code" => "371425001000"},
      %{"name" => "晏北街道", "code" => "371425002000"},
      %{"name" => "表白寺镇", "code" => "371425101000"},
      %{"name" => "焦庙镇", "code" => "371425102000"},
      %{"name" => "赵官镇", "code" => "371425103000"},
      %{"name" => "祝阿镇", "code" => "371425104000"},
      %{"name" => "仁里集镇", "code" => "371425105000"},
      %{"name" => "潘店镇", "code" => "371425106000"},
      %{"name" => "胡官屯镇", "code" => "371425107000"},
      %{"name" => "宣章屯镇", "code" => "371425108000"},
      %{"name" => "马集镇", "code" => "371425109000"},
      %{"name" => "华店镇", "code" => "371425110000"},
      %{"name" => "刘桥镇", "code" => "371425111000"},
      %{"name" => "安头乡", "code" => "371425201000"},
      %{"name" => "大黄乡", "code" => "371425204000"}
    ]

  def next(input) when input == "临邑县" or input == "371424",
    do: [
      %{"name" => "邢侗街道", "code" => "371424001000"},
      %{"name" => "恒源街道", "code" => "371424002000"},
      %{"name" => "临盘街道", "code" => "371424003000"},
      %{"name" => "临邑镇", "code" => "371424100000"},
      %{"name" => "临南镇", "code" => "371424102000"},
      %{"name" => "德平镇", "code" => "371424103000"},
      %{"name" => "林子镇", "code" => "371424104000"},
      %{"name" => "兴隆镇", "code" => "371424105000"},
      %{"name" => "孟寺镇", "code" => "371424106000"},
      %{"name" => "翟家镇", "code" => "371424107000"},
      %{"name" => "理合务镇", "code" => "371424108000"},
      %{"name" => "宿安乡", "code" => "371424202000"}
    ]

  def next(input) when input == "庆云县" or input == "371423",
    do: [
      %{"name" => "渤海路街道", "code" => "371423001000"},
      %{"name" => "庆云镇", "code" => "371423100000"},
      %{"name" => "常家镇", "code" => "371423101000"},
      %{"name" => "尚堂镇", "code" => "371423102000"},
      %{"name" => "崔口镇", "code" => "371423103000"},
      %{"name" => "东辛店镇", "code" => "371423104000"},
      %{"name" => "严务乡", "code" => "371423200000"},
      %{"name" => "中丁乡", "code" => "371423202000"},
      %{"name" => "徐园子乡", "code" => "371423203000"}
    ]

  def next(input) when input == "宁津县" or input == "371422",
    do: [
      %{"name" => "宁城街道", "code" => "371422001000"},
      %{"name" => "津城街道", "code" => "371422002000"},
      %{"name" => "柴胡店镇", "code" => "371422101000"},
      %{"name" => "长官镇", "code" => "371422102000"},
      %{"name" => "杜集镇", "code" => "371422103000"},
      %{"name" => "保店镇", "code" => "371422104000"},
      %{"name" => "大柳镇", "code" => "371422105000"},
      %{"name" => "大曹镇", "code" => "371422106000"},
      %{"name" => "相衙镇", "code" => "371422107000"},
      %{"name" => "时集镇", "code" => "371422108000"},
      %{"name" => "张大庄镇", "code" => "371422109000"},
      %{"name" => "刘营伍乡", "code" => "371422201000"}
    ]

  def next(input) when input == "陵城区" or input == "371403",
    do: [
      %{"name" => "安德街道", "code" => "371403001000"},
      %{"name" => "临齐街道", "code" => "371403002000"},
      %{"name" => "郑家寨镇", "code" => "371403101000"},
      %{"name" => "糜镇", "code" => "371403102000"},
      %{"name" => "宋家镇", "code" => "371403103000"},
      %{"name" => "徽王庄镇", "code" => "371403104000"},
      %{"name" => "神头镇", "code" => "371403105000"},
      %{"name" => "滋镇", "code" => "371403106000"},
      %{"name" => "前孙镇", "code" => "371403107000"},
      %{"name" => "边临镇", "code" => "371403108000"},
      %{"name" => "义渡口镇", "code" => "371403109000"},
      %{"name" => "丁庄镇", "code" => "371403110000"},
      %{"name" => "于集乡", "code" => "371403202000"}
    ]

  def next(input) when input == "德城区" or input == "371402",
    do: [
      %{"name" => "新湖街道", "code" => "371402001000"},
      %{"name" => "新华街道", "code" => "371402002000"},
      %{"name" => "天衢街道", "code" => "371402003000"},
      %{"name" => "广川街道", "code" => "371402006000"},
      %{"name" => "运河街道", "code" => "371402009000"},
      %{"name" => "二屯镇", "code" => "371402100000"},
      %{"name" => "黄河涯镇", "code" => "371402101000"}
    ]

  def next(input) when input == "临沂高新技术产业开发区" or input == "371371",
    do: [
      %{"name" => "罗西街道", "code" => "371371001000"},
      %{"name" => "马厂湖镇", "code" => "371371100000"}
    ]

  def next(input) when input == "临沭县" or input == "371329",
    do: [
      %{"name" => "临沭街道", "code" => "371329001000"},
      %{"name" => "郑山街道", "code" => "371329002000"},
      %{"name" => "蛟龙镇", "code" => "371329101000"},
      %{"name" => "大兴镇", "code" => "371329102000"},
      %{"name" => "石门镇", "code" => "371329103000"},
      %{"name" => "曹庄镇", "code" => "371329104000"},
      %{"name" => "青云镇", "code" => "371329108000"},
      %{"name" => "玉山镇", "code" => "371329109000"},
      %{"name" => "店头镇", "code" => "371329110000"}
    ]

  def next(input) when input == "蒙阴县" or input == "371328",
    do: [
      %{"name" => "蒙阴街道", "code" => "371328001000"},
      %{"name" => "常路镇", "code" => "371328101000"},
      %{"name" => "岱崮镇", "code" => "371328102000"},
      %{"name" => "坦埠镇", "code" => "371328103000"},
      %{"name" => "垛庄镇", "code" => "371328104000"},
      %{"name" => "高都镇", "code" => "371328105000"},
      %{"name" => "野店镇", "code" => "371328106000"},
      %{"name" => "桃墟镇", "code" => "371328107000"},
      %{"name" => "联城镇", "code" => "371328109000"},
      %{"name" => "旧寨乡", "code" => "371328201000"}
    ]

  def next(input) when input == "莒南县" or input == "371327",
    do: [
      %{"name" => "十字路街道", "code" => "371327001000"},
      %{"name" => "大店镇", "code" => "371327102000"},
      %{"name" => "坊前镇", "code" => "371327103000"},
      %{"name" => "板泉镇", "code" => "371327106000"},
      %{"name" => "洙边镇", "code" => "371327107000"},
      %{"name" => "文疃镇", "code" => "371327108000"},
      %{"name" => "石莲子镇", "code" => "371327111000"},
      %{"name" => "岭泉镇", "code" => "371327112000"},
      %{"name" => "筵宾镇", "code" => "371327113000"},
      %{"name" => "涝坡镇", "code" => "371327114000"},
      %{"name" => "道口镇", "code" => "371327116000"},
      %{"name" => "相沟镇", "code" => "371327117000"},
      %{"name" => "团林镇", "code" => "371327118000"},
      %{"name" => "坪上镇", "code" => "371327119000"},
      %{"name" => "壮岗镇", "code" => "371327120000"},
      %{"name" => "朱芦镇", "code" => "371327121000"}
    ]

  def next(input) when input == "平邑县" or input == "371326",
    do: [
      %{"name" => "平邑街道", "code" => "371326001000"},
      %{"name" => "仲村镇", "code" => "371326101000"},
      %{"name" => "武台镇", "code" => "371326102000"},
      %{"name" => "保太镇", "code" => "371326103000"},
      %{"name" => "柏林镇", "code" => "371326104000"},
      %{"name" => "卞桥镇", "code" => "371326105000"},
      %{"name" => "地方镇", "code" => "371326106000"},
      %{"name" => "铜石镇", "code" => "371326107000"},
      %{"name" => "温水镇", "code" => "371326108000"},
      %{"name" => "流峪镇", "code" => "371326109000"},
      %{"name" => "郑城镇", "code" => "371326110000"},
      %{"name" => "白彦镇", "code" => "371326111000"},
      %{"name" => "临涧镇", "code" => "371326112000"},
      %{"name" => "丰阳镇", "code" => "371326113000"}
    ]

  def next(input) when input == "费县" or input == "371325",
    do: [
      %{"name" => "费城街道", "code" => "371325001000"},
      %{"name" => "上冶镇", "code" => "371325101000"},
      %{"name" => "薛庄镇", "code" => "371325102000"},
      %{"name" => "探沂镇", "code" => "371325105000"},
      %{"name" => "朱田镇", "code" => "371325106000"},
      %{"name" => "梁邱镇", "code" => "371325107000"},
      %{"name" => "新庄镇", "code" => "371325108000"},
      %{"name" => "马庄镇", "code" => "371325109000"},
      %{"name" => "胡阳镇", "code" => "371325112000"},
      %{"name" => "石井镇", "code" => "371325113000"},
      %{"name" => "东蒙镇", "code" => "371325115000"},
      %{"name" => "大田庄乡", "code" => "371325200000"}
    ]

  def next(input) when input == "兰陵县" or input == "371324",
    do: [
      %{"name" => "卞庄街道", "code" => "371324001000"},
      %{"name" => "苍山街道", "code" => "371324002000"},
      %{"name" => "大仲村镇", "code" => "371324101000"},
      %{"name" => "兰陵镇", "code" => "371324102000"},
      %{"name" => "长城镇", "code" => "371324103000"},
      %{"name" => "磨山镇", "code" => "371324104000"},
      %{"name" => "神山镇", "code" => "371324105000"},
      %{"name" => "车辋镇", "code" => "371324106000"},
      %{"name" => "尚岩镇", "code" => "371324107000"},
      %{"name" => "向城镇", "code" => "371324108000"},
      %{"name" => "新兴镇", "code" => "371324109000"},
      %{"name" => "南桥镇", "code" => "371324110000"},
      %{"name" => "庄坞镇", "code" => "371324112000"},
      %{"name" => "鲁城镇", "code" => "371324114000"},
      %{"name" => "矿坑镇", "code" => "371324115000"},
      %{"name" => "芦柞镇", "code" => "371324117000"},
      %{"name" => "下村乡", "code" => "371324202000"}
    ]

  def next(input) when input == "沂水县" or input == "371323",
    do: [
      %{"name" => "沂城街道", "code" => "371323001000"},
      %{"name" => "龙家圈街道", "code" => "371323002000"},
      %{"name" => "马站镇", "code" => "371323101000"},
      %{"name" => "高桥镇", "code" => "371323102000"},
      %{"name" => "许家湖镇", "code" => "371323103000"},
      %{"name" => "黄山铺镇", "code" => "371323104000"},
      %{"name" => "诸葛镇", "code" => "371323106000"},
      %{"name" => "崔家峪镇", "code" => "371323107000"},
      %{"name" => "四十里堡镇", "code" => "371323108000"},
      %{"name" => "杨庄镇", "code" => "371323109000"},
      %{"name" => "夏蔚镇", "code" => "371323110000"},
      %{"name" => "沙沟镇", "code" => "371323111000"},
      %{"name" => "高庄镇", "code" => "371323112000"},
      %{"name" => "院东头镇", "code" => "371323113000"},
      %{"name" => "富官庄镇", "code" => "371323115000"},
      %{"name" => "道托镇", "code" => "371323116000"},
      %{"name" => "泉庄镇", "code" => "371323117000"},
      %{"name" => "圈里乡", "code" => "371323201000"}
    ]

  def next(input) when input == "郯城县" or input == "371322",
    do: [
      %{"name" => "郯城街道", "code" => "371322001000"},
      %{"name" => "马头镇", "code" => "371322101000"},
      %{"name" => "重坊镇", "code" => "371322102000"},
      %{"name" => "李庄镇", "code" => "371322103000"},
      %{"name" => "杨集镇", "code" => "371322105000"},
      %{"name" => "港上镇", "code" => "371322107000"},
      %{"name" => "高峰头镇", "code" => "371322108000"},
      %{"name" => "庙山镇", "code" => "371322109000"},
      %{"name" => "红花镇", "code" => "371322111000"},
      %{"name" => "胜利镇", "code" => "371322112000"},
      %{"name" => "花园镇", "code" => "371322113000"},
      %{"name" => "泉源镇", "code" => "371322114000"},
      %{"name" => "归昌乡", "code" => "371322203000"}
    ]

  def next(input) when input == "沂南县" or input == "371321",
    do: [
      %{"name" => "界湖街道", "code" => "371321001000"},
      %{"name" => "岸堤镇", "code" => "371321101000"},
      %{"name" => "孙祖镇", "code" => "371321102000"},
      %{"name" => "双堠镇", "code" => "371321103000"},
      %{"name" => "青驼镇", "code" => "371321104000"},
      %{"name" => "张庄镇", "code" => "371321105000"},
      %{"name" => "砖埠镇", "code" => "371321106000"},
      %{"name" => "大庄镇", "code" => "371321109000"},
      %{"name" => "辛集镇", "code" => "371321110000"},
      %{"name" => "蒲汪镇", "code" => "371321111000"},
      %{"name" => "湖头镇", "code" => "371321112000"},
      %{"name" => "苏村镇", "code" => "371321113000"},
      %{"name" => "铜井镇", "code" => "371321114000"},
      %{"name" => "依汶镇", "code" => "371321115000"},
      %{"name" => "马牧池乡", "code" => "371321201000"}
    ]

  def next(input) when input == "河东区" or input == "371312",
    do: [
      %{"name" => "九曲街道", "code" => "371312001000"},
      %{"name" => "相公街道", "code" => "371312004000"},
      %{"name" => "太平街道", "code" => "371312005000"},
      %{"name" => "汤头街道", "code" => "371312006000"},
      %{"name" => "凤凰岭街道", "code" => "371312007000"},
      %{"name" => "芝麻墩街道", "code" => "371312009000"},
      %{"name" => "梅家埠街道", "code" => "371312010000"},
      %{"name" => "朝阳街道", "code" => "371312011000"},
      %{"name" => "汤河镇", "code" => "371312104000"},
      %{"name" => "八湖镇", "code" => "371312107000"},
      %{"name" => "郑旺镇", "code" => "371312108000"}
    ]

  def next(input) when input == "罗庄区" or input == "371311",
    do: [
      %{"name" => "罗庄街道", "code" => "371311001000"},
      %{"name" => "傅庄街道", "code" => "371311002000"},
      %{"name" => "盛庄街道", "code" => "371311003000"},
      %{"name" => "册山街道", "code" => "371311006000"},
      %{"name" => "高都街道", "code" => "371311007000"},
      %{"name" => "沂堂镇", "code" => "371311100000"},
      %{"name" => "褚墩镇", "code" => "371311101000"},
      %{"name" => "黄山镇", "code" => "371311102000"}
    ]

  def next(input) when input == "兰山区" or input == "371302",
    do: [
      %{"name" => "兰山街道", "code" => "371302001000"},
      %{"name" => "银雀山街道", "code" => "371302002000"},
      %{"name" => "金雀山街道", "code" => "371302003000"},
      %{"name" => "柳青街道", "code" => "371302004000"},
      %{"name" => "白沙埠镇", "code" => "371302101000"},
      %{"name" => "枣园镇", "code" => "371302102000"},
      %{"name" => "半程镇", "code" => "371302103000"},
      %{"name" => "义堂镇", "code" => "371302105000"},
      %{"name" => "李官镇", "code" => "371302107000"},
      %{"name" => "方城镇", "code" => "371302109000"},
      %{"name" => "汪沟镇", "code" => "371302110000"}
    ]

  def next(input) when input == "日照经济技术开发区" or input == "371171",
    do: [
      %{"name" => "奎山街道", "code" => "371171003000"},
      %{"name" => "北京路街道", "code" => "371171007000"}
    ]

  def next(input) when input == "莒县" or input == "371122",
    do: [
      %{"name" => "城阳街道", "code" => "371122001000"},
      %{"name" => "店子集街道", "code" => "371122002000"},
      %{"name" => "陵阳街道", "code" => "371122003000"},
      %{"name" => "浮来山街道", "code" => "371122004000"},
      %{"name" => "阎庄街道", "code" => "371122005000"},
      %{"name" => "招贤镇", "code" => "371122102000"},
      %{"name" => "夏庄镇", "code" => "371122104000"},
      %{"name" => "刘官庄镇", "code" => "371122105000"},
      %{"name" => "峤山镇", "code" => "371122106000"},
      %{"name" => "小店镇", "code" => "371122107000"},
      %{"name" => "龙山镇", "code" => "371122109000"},
      %{"name" => "东莞镇", "code" => "371122110000"},
      %{"name" => "长岭镇", "code" => "371122114000"},
      %{"name" => "安庄镇", "code" => "371122115000"},
      %{"name" => "棋山镇", "code" => "371122116000"},
      %{"name" => "洛河镇", "code" => "371122117000"},
      %{"name" => "寨里河镇", "code" => "371122118000"},
      %{"name" => "桑园镇", "code" => "371122119000"},
      %{"name" => "果庄镇", "code" => "371122120000"},
      %{"name" => "库山乡", "code" => "371122206000"},
      %{"name" => "莒县经济开发区", "code" => "371122400000"}
    ]

  def next(input) when input == "五莲县" or input == "371121",
    do: [
      %{"name" => "洪凝街道", "code" => "371121001000"},
      %{"name" => "高泽街道", "code" => "371121002000"},
      %{"name" => "街头镇", "code" => "371121102000"},
      %{"name" => "潮河镇", "code" => "371121103000"},
      %{"name" => "许孟镇", "code" => "371121104000"},
      %{"name" => "于里镇", "code" => "371121105000"},
      %{"name" => "汪湖镇", "code" => "371121106000"},
      %{"name" => "叩官镇", "code" => "371121107000"},
      %{"name" => "中至镇", "code" => "371121108000"},
      %{"name" => "松柏镇", "code" => "371121110000"},
      %{"name" => "石场乡", "code" => "371121201000"},
      %{"name" => "户部乡", "code" => "371121202000"}
    ]

  def next(input) when input == "岚山区" or input == "371103",
    do: [
      %{"name" => "岚山头街道", "code" => "371103001000"},
      %{"name" => "安东卫街道", "code" => "371103002000"},
      %{"name" => "碑廓镇", "code" => "371103100000"},
      %{"name" => "虎山镇", "code" => "371103101000"},
      %{"name" => "巨峰镇", "code" => "371103102000"},
      %{"name" => "高兴镇", "code" => "371103103000"},
      %{"name" => "黄墩镇", "code" => "371103105000"},
      %{"name" => "中楼镇", "code" => "371103108000"},
      %{"name" => "前三岛乡", "code" => "371103200000"}
    ]

  def next(input) when input == "东港区" or input == "371102",
    do: [
      %{"name" => "日照街道", "code" => "371102001000"},
      %{"name" => "石臼街道", "code" => "371102002000"},
      %{"name" => "秦楼街道", "code" => "371102004000"},
      %{"name" => "卧龙山街道", "code" => "371102008000"},
      %{"name" => "两城街道", "code" => "371102009000"},
      %{"name" => "河山镇", "code" => "371102100000"},
      %{"name" => "后村镇", "code" => "371102104000"},
      %{"name" => "西湖镇", "code" => "371102106000"},
      %{"name" => "陈疃镇", "code" => "371102107000"},
      %{"name" => "南湖镇", "code" => "371102108000"},
      %{"name" => "三庄镇", "code" => "371102109000"},
      %{"name" => "涛雒镇", "code" => "371102110000"}
    ]

  def next(input) when input == "乳山市" or input == "371083",
    do: [
      %{"name" => "城区街道", "code" => "371083001000"},
      %{"name" => "夏村镇", "code" => "371083100000"},
      %{"name" => "乳山口镇", "code" => "371083101000"},
      %{"name" => "海阳所镇", "code" => "371083102000"},
      %{"name" => "白沙滩镇", "code" => "371083103000"},
      %{"name" => "大孤山镇", "code" => "371083104000"},
      %{"name" => "南黄镇", "code" => "371083105000"},
      %{"name" => "冯家镇", "code" => "371083106000"},
      %{"name" => "下初镇", "code" => "371083107000"},
      %{"name" => "午极镇", "code" => "371083108000"},
      %{"name" => "育黎镇", "code" => "371083109000"},
      %{"name" => "崖子镇", "code" => "371083110000"},
      %{"name" => "诸往镇", "code" => "371083111000"},
      %{"name" => "乳山寨镇", "code" => "371083112000"},
      %{"name" => "徐家镇", "code" => "371083114000"}
    ]

  def next(input) when input == "荣成市" or input == "371082",
    do: [
      %{"name" => "宁津街道", "code" => "371082001000"},
      %{"name" => "港湾街道", "code" => "371082002000"},
      %{"name" => "桃园街道", "code" => "371082003000"},
      %{"name" => "王连街道", "code" => "371082004000"},
      %{"name" => "东山街道", "code" => "371082005000"},
      %{"name" => "斥山街道", "code" => "371082006000"},
      %{"name" => "崖头街道", "code" => "371082007000"},
      %{"name" => "城西街道", "code" => "371082008000"},
      %{"name" => "寻山街道", "code" => "371082009000"},
      %{"name" => "崂山街道", "code" => "371082010000"},
      %{"name" => "俚岛镇", "code" => "371082101000"},
      %{"name" => "成山镇", "code" => "371082102000"},
      %{"name" => "埠柳镇", "code" => "371082103000"},
      %{"name" => "港西镇", "code" => "371082104000"},
      %{"name" => "夏庄镇", "code" => "371082105000"},
      %{"name" => "崖西镇", "code" => "371082106000"},
      %{"name" => "荫子镇", "code" => "371082107000"},
      %{"name" => "滕家镇", "code" => "371082108000"},
      %{"name" => "大疃镇", "code" => "371082109000"},
      %{"name" => "上庄镇", "code" => "371082110000"},
      %{"name" => "虎山镇", "code" => "371082111000"},
      %{"name" => "人和镇", "code" => "371082112000"}
    ]

  def next(input) when input == "威海临港经济技术开发区" or input == "371073",
    do: [
      %{"name" => "草庙子镇", "code" => "371073107000"},
      %{"name" => "汪疃镇", "code" => "371073112000"},
      %{"name" => "苘山镇", "code" => "371073113000"}
    ]

  def next(input) when input == "威海经济技术开发区" or input == "371072",
    do: [
      %{"name" => "皇冠街道", "code" => "371072008000"},
      %{"name" => "凤林街道", "code" => "371072009000"},
      %{"name" => "西苑街道", "code" => "371072010000"},
      %{"name" => "崮山镇", "code" => "371072103000"},
      %{"name" => "泊于镇", "code" => "371072105000"}
    ]

  def next(input) when input == "威海火炬高技术产业开发区" or input == "371071",
    do: [
      %{"name" => "怡园街道", "code" => "371071004000"},
      %{"name" => "田和街道", "code" => "371071007000"},
      %{"name" => "初村镇", "code" => "371071108000"}
    ]

  def next(input) when input == "文登区" or input == "371003",
    do: [
      %{"name" => "龙山路街道", "code" => "371003001000"},
      %{"name" => "天福路街道", "code" => "371003002000"},
      %{"name" => "环山路街道", "code" => "371003003000"},
      %{"name" => "文登营镇", "code" => "371003100000"},
      %{"name" => "大水泊镇", "code" => "371003101000"},
      %{"name" => "张家产镇", "code" => "371003102000"},
      %{"name" => "高村镇", "code" => "371003103000"},
      %{"name" => "泽库镇", "code" => "371003104000"},
      %{"name" => "侯家镇", "code" => "371003105000"},
      %{"name" => "宋村镇", "code" => "371003106000"},
      %{"name" => "泽头镇", "code" => "371003107000"},
      %{"name" => "小观镇", "code" => "371003108000"},
      %{"name" => "葛家镇", "code" => "371003109000"},
      %{"name" => "米山镇", "code" => "371003110000"},
      %{"name" => "界石镇", "code" => "371003111000"},
      %{"name" => "开发区", "code" => "371003400000"}
    ]

  def next(input) when input == "环翠区" or input == "371002",
    do: [
      %{"name" => "环翠楼街道", "code" => "371002001000"},
      %{"name" => "鲸园街道", "code" => "371002002000"},
      %{"name" => "竹岛街道", "code" => "371002003000"},
      %{"name" => "孙家疃街道", "code" => "371002011000"},
      %{"name" => "嵩山街道", "code" => "371002012000"},
      %{"name" => "张村镇", "code" => "371002100000"},
      %{"name" => "羊亭镇", "code" => "371002101000"},
      %{"name" => "温泉镇", "code" => "371002102000"},
      %{"name" => "桥头镇", "code" => "371002109000"}
    ]

  def next(input) when input == "肥城市" or input == "370983",
    do: [
      %{"name" => "新城街道", "code" => "370983001000"},
      %{"name" => "老城街道", "code" => "370983002000"},
      %{"name" => "王瓜店街道", "code" => "370983003000"},
      %{"name" => "仪阳街道", "code" => "370983004000"},
      %{"name" => "潮泉镇", "code" => "370983101000"},
      %{"name" => "桃园镇", "code" => "370983103000"},
      %{"name" => "王庄镇", "code" => "370983104000"},
      %{"name" => "湖屯镇", "code" => "370983105000"},
      %{"name" => "石横镇", "code" => "370983106000"},
      %{"name" => "安临站镇", "code" => "370983107000"},
      %{"name" => "孙伯镇", "code" => "370983108000"},
      %{"name" => "安驾庄镇", "code" => "370983109000"},
      %{"name" => "边院镇", "code" => "370983111000"},
      %{"name" => "汶阳镇", "code" => "370983113000"}
    ]

  def next(input) when input == "新泰市" or input == "370982",
    do: [
      %{"name" => "青云街道", "code" => "370982001000"},
      %{"name" => "新汶街道", "code" => "370982002000"},
      %{"name" => "新甫街道", "code" => "370982003000"},
      %{"name" => "东都镇", "code" => "370982101000"},
      %{"name" => "小协镇", "code" => "370982102000"},
      %{"name" => "翟镇", "code" => "370982103000"},
      %{"name" => "泉沟镇", "code" => "370982104000"},
      %{"name" => "羊流镇", "code" => "370982105000"},
      %{"name" => "果都镇", "code" => "370982106000"},
      %{"name" => "西张庄镇", "code" => "370982107000"},
      %{"name" => "天宝镇", "code" => "370982108000"},
      %{"name" => "楼德镇", "code" => "370982110000"},
      %{"name" => "禹村镇", "code" => "370982111000"},
      %{"name" => "宫里镇", "code" => "370982112000"},
      %{"name" => "谷里镇", "code" => "370982113000"},
      %{"name" => "石莱镇", "code" => "370982114000"},
      %{"name" => "放城镇", "code" => "370982115000"},
      %{"name" => "刘杜镇", "code" => "370982116000"},
      %{"name" => "汶南镇", "code" => "370982117000"},
      %{"name" => "龙廷镇", "code" => "370982119000"},
      %{"name" => "岳家庄乡", "code" => "370982203000"}
    ]

  def next(input) when input == "东平县" or input == "370923",
    do: [
      %{"name" => "东平街道", "code" => "370923001000"},
      %{"name" => "州城街道", "code" => "370923002000"},
      %{"name" => "彭集街道", "code" => "370923003000"},
      %{"name" => "沙河站镇", "code" => "370923101000"},
      %{"name" => "老湖镇", "code" => "370923106000"},
      %{"name" => "银山镇", "code" => "370923107000"},
      %{"name" => "斑鸠店镇", "code" => "370923108000"},
      %{"name" => "接山镇", "code" => "370923109000"},
      %{"name" => "大羊镇", "code" => "370923110000"},
      %{"name" => "梯门镇", "code" => "370923111000"},
      %{"name" => "新湖镇", "code" => "370923112000"},
      %{"name" => "戴庙镇", "code" => "370923113000"},
      %{"name" => "商老庄乡", "code" => "370923206000"},
      %{"name" => "旧县乡", "code" => "370923208000"}
    ]

  def next(input) when input == "宁阳县" or input == "370921",
    do: [
      %{"name" => "文庙街道", "code" => "370921001000"},
      %{"name" => "八仙桥街道", "code" => "370921002000"},
      %{"name" => "泗店镇", "code" => "370921101000"},
      %{"name" => "东疏镇", "code" => "370921102000"},
      %{"name" => "伏山镇", "code" => "370921103000"},
      %{"name" => "堽城镇", "code" => "370921105000"},
      %{"name" => "蒋集镇", "code" => "370921107000"},
      %{"name" => "磁窑镇", "code" => "370921109000"},
      %{"name" => "华丰镇", "code" => "370921110000"},
      %{"name" => "葛石镇", "code" => "370921111000"},
      %{"name" => "东庄镇", "code" => "370921112000"},
      %{"name" => "鹤山镇", "code" => "370921113000"},
      %{"name" => "乡饮乡", "code" => "370921206000"}
    ]

  def next(input) when input == "岱岳区" or input == "370911",
    do: [
      %{"name" => "粥店街道", "code" => "370911001000"},
      %{"name" => "天平街道", "code" => "370911002000"},
      %{"name" => "北集坡街道", "code" => "370911003000"},
      %{"name" => "山口镇", "code" => "370911100000"},
      %{"name" => "祝阳镇", "code" => "370911101000"},
      %{"name" => "范镇", "code" => "370911102000"},
      %{"name" => "角峪镇", "code" => "370911103000"},
      %{"name" => "徂徕镇", "code" => "370911104000"},
      %{"name" => "满庄镇", "code" => "370911106000"},
      %{"name" => "夏张镇", "code" => "370911107000"},
      %{"name" => "道朗镇", "code" => "370911108000"},
      %{"name" => "黄前镇", "code" => "370911109000"},
      %{"name" => "大汶口镇", "code" => "370911110000"},
      %{"name" => "马庄镇", "code" => "370911111000"},
      %{"name" => "房村镇", "code" => "370911112000"},
      %{"name" => "良庄镇", "code" => "370911113000"},
      %{"name" => "下港镇", "code" => "370911114000"},
      %{"name" => "化马湾乡", "code" => "370911201000"}
    ]

  def next(input) when input == "泰山区" or input == "370902",
    do: [
      %{"name" => "岱庙街道", "code" => "370902001000"},
      %{"name" => "财源街道", "code" => "370902002000"},
      %{"name" => "泰前街道", "code" => "370902003000"},
      %{"name" => "上高街道", "code" => "370902004000"},
      %{"name" => "徐家楼街道", "code" => "370902005000"},
      %{"name" => "省庄镇", "code" => "370902100000"},
      %{"name" => "邱家店镇", "code" => "370902101000"},
      %{"name" => "大津口乡", "code" => "370902202000"}
    ]

  def next(input) when input == "邹城市" or input == "370883",
    do: [
      %{"name" => "钢山街道", "code" => "370883001000"},
      %{"name" => "千泉街道", "code" => "370883002000"},
      %{"name" => "凫山街道", "code" => "370883003000"},
      %{"name" => "香城镇", "code" => "370883101000"},
      %{"name" => "城前镇", "code" => "370883102000"},
      %{"name" => "大束镇", "code" => "370883103000"},
      %{"name" => "北宿镇", "code" => "370883104000"},
      %{"name" => "中心店镇", "code" => "370883105000"},
      %{"name" => "唐村镇", "code" => "370883106000"},
      %{"name" => "太平镇", "code" => "370883107000"},
      %{"name" => "石墙镇", "code" => "370883109000"},
      %{"name" => "峄山镇", "code" => "370883110000"},
      %{"name" => "看庄镇", "code" => "370883111000"},
      %{"name" => "张庄镇", "code" => "370883112000"},
      %{"name" => "田黄镇", "code" => "370883113000"},
      %{"name" => "郭里镇", "code" => "370883114000"}
    ]

  def next(input) when input == "曲阜市" or input == "370881",
    do: [
      %{"name" => "鲁城街道", "code" => "370881001000"},
      %{"name" => "书院街道", "code" => "370881002000"},
      %{"name" => "时庄街道", "code" => "370881003000"},
      %{"name" => "小雪街道", "code" => "370881004000"},
      %{"name" => "吴村镇", "code" => "370881101000"},
      %{"name" => "姚村镇", "code" => "370881102000"},
      %{"name" => "陵城镇", "code" => "370881103000"},
      %{"name" => "尼山镇", "code" => "370881105000"},
      %{"name" => "王庄镇", "code" => "370881108000"},
      %{"name" => "息陬镇", "code" => "370881109000"},
      %{"name" => "石门山镇", "code" => "370881110000"},
      %{"name" => "防山镇", "code" => "370881111000"}
    ]

  def next(input) when input == "济宁高新技术产业开发区" or input == "370871",
    do: [
      %{"name" => "洸河街道", "code" => "370871001000"},
      %{"name" => "柳行街道", "code" => "370871002000"},
      %{"name" => "接庄街道", "code" => "370871003000"},
      %{"name" => "王因街道", "code" => "370871004000"},
      %{"name" => "黄屯街道", "code" => "370871005000"}
    ]

  def next(input) when input == "梁山县" or input == "370832",
    do: [
      %{"name" => "水泊街道", "code" => "370832001000"},
      %{"name" => "梁山街道", "code" => "370832002000"},
      %{"name" => "小路口镇", "code" => "370832101000"},
      %{"name" => "韩岗镇", "code" => "370832102000"},
      %{"name" => "拳铺镇", "code" => "370832104000"},
      %{"name" => "杨营镇", "code" => "370832105000"},
      %{"name" => "韩垓镇", "code" => "370832106000"},
      %{"name" => "馆驿镇", "code" => "370832107000"},
      %{"name" => "小安山镇", "code" => "370832108000"},
      %{"name" => "寿张集镇", "code" => "370832109000"},
      %{"name" => "黑虎庙镇", "code" => "370832110000"},
      %{"name" => "马营镇", "code" => "370832111000"},
      %{"name" => "赵堌堆乡", "code" => "370832215000"},
      %{"name" => "大路口乡", "code" => "370832217000"}
    ]

  def next(input) when input == "泗水县" or input == "370831",
    do: [
      %{"name" => "泗河街道", "code" => "370831001000"},
      %{"name" => "济河街道", "code" => "370831002000"},
      %{"name" => "泉林镇", "code" => "370831101000"},
      %{"name" => "星村镇", "code" => "370831102000"},
      %{"name" => "柘沟镇", "code" => "370831103000"},
      %{"name" => "金庄镇", "code" => "370831104000"},
      %{"name" => "苗馆镇", "code" => "370831105000"},
      %{"name" => "中册镇", "code" => "370831106000"},
      %{"name" => "杨柳镇", "code" => "370831107000"},
      %{"name" => "泗张镇", "code" => "370831108000"},
      %{"name" => "圣水峪镇", "code" => "370831109000"},
      %{"name" => "高峪镇", "code" => "370831110000"},
      %{"name" => "华村镇", "code" => "370831111000"}
    ]

  def next(input) when input == "汶上县" or input == "370830",
    do: [
      %{"name" => "中都街道", "code" => "370830001000"},
      %{"name" => "汶上街道", "code" => "370830002000"},
      %{"name" => "南站街道", "code" => "370830003000"},
      %{"name" => "南旺镇", "code" => "370830102000"},
      %{"name" => "次邱镇", "code" => "370830103000"},
      %{"name" => "寅寺镇", "code" => "370830104000"},
      %{"name" => "郭楼镇", "code" => "370830105000"},
      %{"name" => "康驿镇", "code" => "370830106000"},
      %{"name" => "苑庄镇", "code" => "370830107000"},
      %{"name" => "义桥镇", "code" => "370830108000"},
      %{"name" => "郭仓镇", "code" => "370830109000"},
      %{"name" => "白石镇", "code" => "370830110000"},
      %{"name" => "杨店镇", "code" => "370830111000"},
      %{"name" => "刘楼镇", "code" => "370830112000"},
      %{"name" => "军屯乡", "code" => "370830205000"}
    ]

  def next(input) when input == "嘉祥县" or input == "370829",
    do: [
      %{"name" => "嘉祥街道", "code" => "370829001000"},
      %{"name" => "卧龙山街道", "code" => "370829002000"},
      %{"name" => "万张街道", "code" => "370829003000"},
      %{"name" => "纸坊镇", "code" => "370829101000"},
      %{"name" => "梁宝寺镇", "code" => "370829102000"},
      %{"name" => "疃里镇", "code" => "370829104000"},
      %{"name" => "马村镇", "code" => "370829105000"},
      %{"name" => "金屯镇", "code" => "370829106000"},
      %{"name" => "大张楼镇", "code" => "370829107000"},
      %{"name" => "马集镇", "code" => "370829108000"},
      %{"name" => "孟姑集镇", "code" => "370829110000"},
      %{"name" => "老僧堂镇", "code" => "370829111000"},
      %{"name" => "仲山镇", "code" => "370829112000"},
      %{"name" => "满硐镇", "code" => "370829113000"},
      %{"name" => "黄垓镇", "code" => "370829114000"},
      %{"name" => "嘉祥经济开发区管理委员会", "code" => "370829400000"}
    ]

  def next(input) when input == "金乡县" or input == "370828",
    do: [
      %{"name" => "金乡街道", "code" => "370828001000"},
      %{"name" => "高河街道", "code" => "370828002000"},
      %{"name" => "鱼山街道", "code" => "370828003000"},
      %{"name" => "王丕街道", "code" => "370828004000"},
      %{"name" => "羊山镇", "code" => "370828101000"},
      %{"name" => "胡集镇", "code" => "370828102000"},
      %{"name" => "霄云镇", "code" => "370828103000"},
      %{"name" => "鸡黍镇", "code" => "370828104000"},
      %{"name" => "司马镇", "code" => "370828107000"},
      %{"name" => "马庙镇", "code" => "370828109000"},
      %{"name" => "化雨镇", "code" => "370828110000"},
      %{"name" => "卜集镇", "code" => "370828111000"},
      %{"name" => "兴隆镇", "code" => "370828112000"}
    ]

  def next(input) when input == "鱼台县" or input == "370827",
    do: [
      %{"name" => "谷亭街道", "code" => "370827001000"},
      %{"name" => "滨湖街道", "code" => "370827002000"},
      %{"name" => "清河镇", "code" => "370827101000"},
      %{"name" => "鱼城镇", "code" => "370827102000"},
      %{"name" => "王鲁镇", "code" => "370827103000"},
      %{"name" => "张黄镇", "code" => "370827104000"},
      %{"name" => "王庙镇", "code" => "370827105000"},
      %{"name" => "李阁镇", "code" => "370827106000"},
      %{"name" => "唐马镇", "code" => "370827107000"},
      %{"name" => "老砦镇", "code" => "370827108000"},
      %{"name" => "罗屯镇", "code" => "370827109000"}
    ]

  def next(input) when input == "微山县" or input == "370826",
    do: [
      %{"name" => "夏镇街道", "code" => "370826001000"},
      %{"name" => "昭阳街道", "code" => "370826002000"},
      %{"name" => "傅村街道", "code" => "370826003000"},
      %{"name" => "韩庄镇", "code" => "370826101000"},
      %{"name" => "欢城镇", "code" => "370826102000"},
      %{"name" => "南阳镇", "code" => "370826103000"},
      %{"name" => "鲁桥镇", "code" => "370826104000"},
      %{"name" => "留庄镇", "code" => "370826106000"},
      %{"name" => "两城镇", "code" => "370826107000"},
      %{"name" => "马坡镇", "code" => "370826108000"},
      %{"name" => "赵庙镇", "code" => "370826109000"},
      %{"name" => "张楼镇", "code" => "370826110000"},
      %{"name" => "微山岛镇", "code" => "370826111000"},
      %{"name" => "西平镇", "code" => "370826112000"},
      %{"name" => "高楼乡", "code" => "370826206000"}
    ]

  def next(input) when input == "兖州区" or input == "370812",
    do: [
      %{"name" => "鼓楼街道", "code" => "370812001000"},
      %{"name" => "龙桥街道", "code" => "370812003000"},
      %{"name" => "酒仙桥街道", "code" => "370812006000"},
      %{"name" => "兴隆庄街道", "code" => "370812007000"},
      %{"name" => "大安镇", "code" => "370812101000"},
      %{"name" => "新驿镇", "code" => "370812102000"},
      %{"name" => "颜店镇", "code" => "370812103000"},
      %{"name" => "新兖镇", "code" => "370812105000"},
      %{"name" => "漕河镇", "code" => "370812107000"},
      %{"name" => "小孟镇", "code" => "370812111000"}
    ]

  def next(input) when input == "任城区" or input == "370811",
    do: [
      %{"name" => "许庄街道", "code" => "370811002000"},
      %{"name" => "李营街道", "code" => "370811005000"},
      %{"name" => "南张街道", "code" => "370811006000"},
      %{"name" => "仙营街道", "code" => "370811007000"},
      %{"name" => "金城街道", "code" => "370811008000"},
      %{"name" => "廿里铺街道", "code" => "370811009000"},
      %{"name" => "古槐街道", "code" => "370811011000"},
      %{"name" => "济阳街道", "code" => "370811012000"},
      %{"name" => "阜桥街道", "code" => "370811013000"},
      %{"name" => "越河街道", "code" => "370811014000"},
      %{"name" => "观音阁街道", "code" => "370811015000"},
      %{"name" => "南苑街道", "code" => "370811016000"},
      %{"name" => "安居街道", "code" => "370811017000"},
      %{"name" => "唐口街道", "code" => "370811018000"},
      %{"name" => "长沟镇", "code" => "370811102000"},
      %{"name" => "石桥镇", "code" => "370811109000"},
      %{"name" => "喻屯镇", "code" => "370811111000"},
      %{"name" => "济东物业服务中心", "code" => "370811401000"}
    ]

  def next(input) when input == "昌邑市" or input == "370786",
    do: [
      %{"name" => "奎聚街道", "code" => "370786001000"},
      %{"name" => "都昌街道", "code" => "370786002000"},
      %{"name" => "围子街道", "code" => "370786003000"},
      %{"name" => "柳疃镇", "code" => "370786101000"},
      %{"name" => "龙池镇", "code" => "370786102000"},
      %{"name" => "卜庄镇", "code" => "370786104000"},
      %{"name" => "饮马镇", "code" => "370786108000"},
      %{"name" => "北孟镇", "code" => "370786109000"},
      %{"name" => "下营镇", "code" => "370786112000"}
    ]

  def next(input) when input == "高密市" or input == "370785",
    do: [
      %{"name" => "高密市朝阳街道", "code" => "370785001000"},
      %{"name" => "高密市醴泉街道", "code" => "370785002000"},
      %{"name" => "高密市密水街道", "code" => "370785003000"},
      %{"name" => "柏城镇", "code" => "370785100000"},
      %{"name" => "夏庄镇", "code" => "370785103000"},
      %{"name" => "姜庄镇", "code" => "370785104000"},
      %{"name" => "大牟家镇", "code" => "370785106000"},
      %{"name" => "阚家镇", "code" => "370785109000"},
      %{"name" => "井沟镇", "code" => "370785111000"},
      %{"name" => "柴沟镇", "code" => "370785114000"}
    ]

  def next(input) when input == "安丘市" or input == "370784",
    do: [
      %{"name" => "兴安街道", "code" => "370784001000"},
      %{"name" => "新安街道", "code" => "370784003000"},
      %{"name" => "凌河街道", "code" => "370784004000"},
      %{"name" => "景芝镇", "code" => "370784100000"},
      %{"name" => "官庄镇", "code" => "370784104000"},
      %{"name" => "大盛镇", "code" => "370784107000"},
      %{"name" => "石埠子镇", "code" => "370784111000"},
      %{"name" => "石堆镇", "code" => "370784112000"},
      %{"name" => "柘山镇", "code" => "370784118000"},
      %{"name" => "辉渠镇", "code" => "370784119000"},
      %{"name" => "吾山镇", "code" => "370784120000"},
      %{"name" => "金冢子镇", "code" => "370784121000"}
    ]

  def next(input) when input == "寿光市" or input == "370783",
    do: [
      %{"name" => "圣城街道", "code" => "370783001000"},
      %{"name" => "文家街道", "code" => "370783003000"},
      %{"name" => "古城街道", "code" => "370783004000"},
      %{"name" => "洛城街道", "code" => "370783005000"},
      %{"name" => "孙家集街道", "code" => "370783006000"},
      %{"name" => "化龙镇", "code" => "370783100000"},
      %{"name" => "营里镇", "code" => "370783103000"},
      %{"name" => "台头镇", "code" => "370783104000"},
      %{"name" => "田柳镇", "code" => "370783106000"},
      %{"name" => "上口镇", "code" => "370783108000"},
      %{"name" => "侯镇", "code" => "370783109000"},
      %{"name" => "纪台镇", "code" => "370783111000"},
      %{"name" => "稻田镇", "code" => "370783112000"},
      %{"name" => "羊口镇", "code" => "370783115000"},
      %{"name" => "双王城生态经济园区管委会", "code" => "370783400000"}
    ]

  def next(input) when input == "诸城市" or input == "370782",
    do: [
      %{"name" => "密州街道", "code" => "370782001000"},
      %{"name" => "龙都街道", "code" => "370782002000"},
      %{"name" => "舜王街道", "code" => "370782003000"},
      %{"name" => "枳沟镇", "code" => "370782101000"},
      %{"name" => "贾悦镇", "code" => "370782102000"},
      %{"name" => "石桥子镇", "code" => "370782105000"},
      %{"name" => "相州镇", "code" => "370782108000"},
      %{"name" => "昌城镇", "code" => "370782110000"},
      %{"name" => "百尺河镇", "code" => "370782111000"},
      %{"name" => "辛兴镇", "code" => "370782112000"},
      %{"name" => "林家村镇", "code" => "370782114000"},
      %{"name" => "皇华镇", "code" => "370782117000"},
      %{"name" => "桃林镇", "code" => "370782118000"},
      %{"name" => "诸城经济开发区管理委员会", "code" => "370782400000"}
    ]

  def next(input) when input == "青州市" or input == "370781",
    do: [
      %{"name" => "王府街道", "code" => "370781001000"},
      %{"name" => "益都街道", "code" => "370781002000"},
      %{"name" => "云门山街道", "code" => "370781006000"},
      %{"name" => "黄楼街道", "code" => "370781007000"},
      %{"name" => "弥河镇", "code" => "370781100000"},
      %{"name" => "王坟镇", "code" => "370781101000"},
      %{"name" => "庙子镇", "code" => "370781103000"},
      %{"name" => "邵庄镇", "code" => "370781105000"},
      %{"name" => "高柳镇", "code" => "370781109000"},
      %{"name" => "何官镇", "code" => "370781111000"},
      %{"name" => "东夏镇", "code" => "370781113000"},
      %{"name" => "谭坊镇", "code" => "370781115000"},
      %{"name" => "王母宫经济发展区", "code" => "370781400000"}
    ]

  def next(input) when input == "潍坊滨海经济技术开发区" or input == "370772",
    do: [
      %{"name" => "央子街道", "code" => "370772004000"},
      %{"name" => "大家洼街道", "code" => "370772005000"}
    ]

  def next(input) when input == "昌乐县" or input == "370725",
    do: [
      %{"name" => "宝都街道", "code" => "370725001000"},
      %{"name" => "宝城街道", "code" => "370725002000"},
      %{"name" => "朱刘街道", "code" => "370725003000"},
      %{"name" => "五图街道", "code" => "370725005000"},
      %{"name" => "乔官镇", "code" => "370725107000"},
      %{"name" => "鄌郚镇", "code" => "370725108000"},
      %{"name" => "红河镇", "code" => "370725110000"},
      %{"name" => "营丘镇", "code" => "370725116000"}
    ]

  def next(input) when input == "临朐县" or input == "370724",
    do: [
      %{"name" => "城关街道", "code" => "370724001000"},
      %{"name" => "东城街道", "code" => "370724002000"},
      %{"name" => "冶源街道", "code" => "370724003000"},
      %{"name" => "辛寨街道", "code" => "370724004000"},
      %{"name" => "五井镇", "code" => "370724101000"},
      %{"name" => "寺头镇", "code" => "370724104000"},
      %{"name" => "九山镇", "code" => "370724105000"},
      %{"name" => "山旺镇", "code" => "370724112000"},
      %{"name" => "柳山镇", "code" => "370724113000"},
      %{"name" => "蒋峪镇", "code" => "370724116000"}
    ]

  def next(input) when input == "奎文区" or input == "370705",
    do: [
      %{"name" => "东关街道", "code" => "370705001000"},
      %{"name" => "大虞街道", "code" => "370705002000"},
      %{"name" => "梨园街道", "code" => "370705003000"},
      %{"name" => "廿里堡街道", "code" => "370705004000"},
      %{"name" => "潍州路街道", "code" => "370705005000"},
      %{"name" => "北苑街道", "code" => "370705006000"},
      %{"name" => "广文街道", "code" => "370705007000"},
      %{"name" => "新城街道", "code" => "370705009000"},
      %{"name" => "清池街道", "code" => "370705010000"},
      %{"name" => "北海路街道", "code" => "370705012000"}
    ]

  def next(input) when input == "坊子区" or input == "370704",
    do: [
      %{"name" => "凤凰街道", "code" => "370704003000"},
      %{"name" => "坊安街道", "code" => "370704004000"},
      %{"name" => "坊城街道", "code" => "370704005000"},
      %{"name" => "九龙街道", "code" => "370704006000"},
      %{"name" => "黄旗堡街道", "code" => "370704007000"},
      %{"name" => "太保庄街道", "code" => "370704008000"},
      %{"name" => "王家庄街道", "code" => "370704009000"}
    ]

  def next(input) when input == "寒亭区" or input == "370703",
    do: [
      %{"name" => "寒亭街道", "code" => "370703001000"},
      %{"name" => "开元街道", "code" => "370703002000"},
      %{"name" => "固堤街道", "code" => "370703003000"},
      %{"name" => "高里街道", "code" => "370703006000"},
      %{"name" => "朱里街道", "code" => "370703007000"}
    ]

  def next(input) when input == "潍城区" or input == "370702",
    do: [
      %{"name" => "城关街道", "code" => "370702001000"},
      %{"name" => "南关街道", "code" => "370702002000"},
      %{"name" => "西关街道", "code" => "370702003000"},
      %{"name" => "北关街道", "code" => "370702004000"},
      %{"name" => "于河街道", "code" => "370702005000"},
      %{"name" => "望留街道", "code" => "370702006000"},
      %{"name" => "潍城经济开发区", "code" => "370702400000"}
    ]

  def next(input) when input == "海阳市" or input == "370687",
    do: [
      %{"name" => "方圆街道", "code" => "370687001000"},
      %{"name" => "东村街道", "code" => "370687002000"},
      %{"name" => "凤城街道", "code" => "370687003000"},
      %{"name" => "龙山街道", "code" => "370687004000"},
      %{"name" => "留格庄镇", "code" => "370687102000"},
      %{"name" => "盘石店镇", "code" => "370687103000"},
      %{"name" => "郭城镇", "code" => "370687104000"},
      %{"name" => "徐家店镇", "code" => "370687105000"},
      %{"name" => "发城镇", "code" => "370687106000"},
      %{"name" => "小纪镇", "code" => "370687107000"},
      %{"name" => "行村镇", "code" => "370687108000"},
      %{"name" => "辛安镇", "code" => "370687109000"},
      %{"name" => "二十里店镇", "code" => "370687110000"},
      %{"name" => "朱吴镇", "code" => "370687112000"},
      %{"name" => "外向型工业加工区", "code" => "370687401000"},
      %{"name" => "碧城工业区", "code" => "370687402000"},
      %{"name" => "旅游度假区", "code" => "370687403000"},
      %{"name" => "核电装备制造工业园区", "code" => "370687404000"}
    ]

  def next(input) when input == "栖霞市" or input == "370686",
    do: [
      %{"name" => "翠屏街道", "code" => "370686001000"},
      %{"name" => "庄园街道", "code" => "370686002000"},
      %{"name" => "松山街道", "code" => "370686003000"},
      %{"name" => "观里镇", "code" => "370686101000"},
      %{"name" => "蛇窝泊镇", "code" => "370686102000"},
      %{"name" => "唐家泊镇", "code" => "370686103000"},
      %{"name" => "桃村镇", "code" => "370686104000"},
      %{"name" => "亭口镇", "code" => "370686105000"},
      %{"name" => "寺口镇", "code" => "370686107000"},
      %{"name" => "苏家店镇", "code" => "370686108000"},
      %{"name" => "杨础镇", "code" => "370686109000"},
      %{"name" => "西城镇", "code" => "370686110000"},
      %{"name" => "官道镇", "code" => "370686111000"},
      %{"name" => "庙后镇", "code" => "370686113000"}
    ]

  def next(input) when input == "招远市" or input == "370685",
    do: [
      %{"name" => "罗峰街道", "code" => "370685001000"},
      %{"name" => "泉山街道", "code" => "370685002000"},
      %{"name" => "梦芝街道", "code" => "370685003000"},
      %{"name" => "温泉街道", "code" => "370685004000"},
      %{"name" => "大秦家街道", "code" => "370685005000"},
      %{"name" => "辛庄镇", "code" => "370685101000"},
      %{"name" => "蚕庄镇", "code" => "370685102000"},
      %{"name" => "金岭镇", "code" => "370685103000"},
      %{"name" => "毕郭镇", "code" => "370685104000"},
      %{"name" => "玲珑镇", "code" => "370685105000"},
      %{"name" => "张星镇", "code" => "370685106000"},
      %{"name" => "夏甸镇", "code" => "370685108000"},
      %{"name" => "阜山镇", "code" => "370685109000"},
      %{"name" => "齐山镇", "code" => "370685110000"}
    ]

  def next(input) when input == "莱州市" or input == "370683",
    do: [
      %{"name" => "文昌路街道", "code" => "370683001000"},
      %{"name" => "永安路街道", "code" => "370683002000"},
      %{"name" => "三山岛街道", "code" => "370683003000"},
      %{"name" => "城港路街道", "code" => "370683004000"},
      %{"name" => "文峰路街道", "code" => "370683005000"},
      %{"name" => "金仓街道", "code" => "370683006000"},
      %{"name" => "沙河镇", "code" => "370683101000"},
      %{"name" => "朱桥镇", "code" => "370683102000"},
      %{"name" => "郭家店镇", "code" => "370683103000"},
      %{"name" => "金城镇", "code" => "370683104000"},
      %{"name" => "平里店镇", "code" => "370683105000"},
      %{"name" => "驿道镇", "code" => "370683106000"},
      %{"name" => "程郭镇", "code" => "370683107000"},
      %{"name" => "虎头崖镇", "code" => "370683108000"},
      %{"name" => "柞村镇", "code" => "370683109000"},
      %{"name" => "夏邱镇", "code" => "370683110000"},
      %{"name" => "土山镇", "code" => "370683111000"}
    ]

  def next(input) when input == "莱阳市" or input == "370682",
    do: [
      %{"name" => "城厢街道", "code" => "370682001000"},
      %{"name" => "古柳街道", "code" => "370682002000"},
      %{"name" => "龙旺庄街道", "code" => "370682003000"},
      %{"name" => "冯格庄街道", "code" => "370682004000"},
      %{"name" => "柏林庄街道", "code" => "370682005000"},
      %{"name" => "沐浴店镇", "code" => "370682101000"},
      %{"name" => "团旺镇", "code" => "370682102000"},
      %{"name" => "穴坊镇", "code" => "370682103000"},
      %{"name" => "羊郡镇", "code" => "370682104000"},
      %{"name" => "姜疃镇", "code" => "370682105000"},
      %{"name" => "万第镇", "code" => "370682106000"},
      %{"name" => "照旺庄镇", "code" => "370682107000"},
      %{"name" => "谭格庄镇", "code" => "370682108000"},
      %{"name" => "河洛镇", "code" => "370682110000"},
      %{"name" => "吕格庄镇", "code" => "370682111000"},
      %{"name" => "高格庄镇", "code" => "370682112000"},
      %{"name" => "大夼镇", "code" => "370682113000"},
      %{"name" => "山前店镇", "code" => "370682114000"}
    ]

  def next(input) when input == "龙口市" or input == "370681",
    do: [
      %{"name" => "东莱街道", "code" => "370681001000"},
      %{"name" => "龙港街道", "code" => "370681002000"},
      %{"name" => "新嘉街道", "code" => "370681003000"},
      %{"name" => "徐福街道", "code" => "370681004000"},
      %{"name" => "东江街道", "code" => "370681005000"},
      %{"name" => "黄山馆镇", "code" => "370681102000"},
      %{"name" => "北马镇", "code" => "370681103000"},
      %{"name" => "芦头镇", "code" => "370681104000"},
      %{"name" => "下丁家镇", "code" => "370681106000"},
      %{"name" => "七甲镇", "code" => "370681107000"},
      %{"name" => "石良镇", "code" => "370681108000"},
      %{"name" => "兰高镇", "code" => "370681109000"},
      %{"name" => "诸由观镇", "code" => "370681110000"},
      %{"name" => "山东龙口高新技术产业园区", "code" => "370681401000"}
    ]

  def next(input) when input == "烟台经济技术开发区" or input == "370676",
    do: [
      %{"name" => "福莱山街道", "code" => "370676001000"},
      %{"name" => "古现街道", "code" => "370676002000"},
      %{"name" => "大季家街道", "code" => "370676003000"}
    ]

  def next(input) when input == "烟台高新技术产业开发区" or input == "370671",
    do: [%{"name" => "马山街道", "code" => "370671007000"}]

  def next(input) when input == "蓬莱区" or input == "370614",
    do: [
      %{"name" => "登州街道", "code" => "370614001000"},
      %{"name" => "紫荆山街道", "code" => "370614002000"},
      %{"name" => "新港街道", "code" => "370614003000"},
      %{"name" => "蓬莱阁街道", "code" => "370614004000"},
      %{"name" => "南王街道", "code" => "370614005000"},
      %{"name" => "南长山街道", "code" => "370614006000"},
      %{"name" => "刘家沟镇", "code" => "370614102000"},
      %{"name" => "潮水镇", "code" => "370614103000"},
      %{"name" => "大柳行镇", "code" => "370614105000"},
      %{"name" => "小门家镇", "code" => "370614106000"},
      %{"name" => "大辛店镇", "code" => "370614107000"},
      %{"name" => "村里集镇", "code" => "370614108000"},
      %{"name" => "北沟镇", "code" => "370614109000"},
      %{"name" => "砣矶镇", "code" => "370614110000"},
      %{"name" => "北长山乡", "code" => "370614201000"},
      %{"name" => "黑山乡", "code" => "370614202000"},
      %{"name" => "大钦岛乡", "code" => "370614203000"},
      %{"name" => "小钦岛乡", "code" => "370614204000"},
      %{"name" => "南隍城乡", "code" => "370614205000"},
      %{"name" => "北隍城乡", "code" => "370614206000"}
    ]

  def next(input) when input == "莱山区" or input == "370613",
    do: [
      %{"name" => "黄海路街道", "code" => "370613001000"},
      %{"name" => "初家街道", "code" => "370613002000"},
      %{"name" => "滨海路街道", "code" => "370613003000"},
      %{"name" => "解甲庄街道", "code" => "370613004000"},
      %{"name" => "莱山街道", "code" => "370613005000"},
      %{"name" => "院格庄街道", "code" => "370613006000"}
    ]

  def next(input) when input == "牟平区" or input == "370612",
    do: [
      %{"name" => "宁海街道", "code" => "370612001000"},
      %{"name" => "文化街道", "code" => "370612002000"},
      %{"name" => "武宁街道", "code" => "370612004000"},
      %{"name" => "大窑街道", "code" => "370612005000"},
      %{"name" => "姜格庄街道", "code" => "370612006000"},
      %{"name" => "观水镇", "code" => "370612101000"},
      %{"name" => "龙泉镇", "code" => "370612105000"},
      %{"name" => "玉林店镇", "code" => "370612106000"},
      %{"name" => "水道镇", "code" => "370612107000"},
      %{"name" => "高陵镇", "code" => "370612109000"},
      %{"name" => "王格庄镇", "code" => "370612110000"},
      %{"name" => "昆嵛镇", "code" => "370612111000"},
      %{"name" => "莒格庄镇", "code" => "370612112000"}
    ]

  def next(input) when input == "福山区" or input == "370611",
    do: [
      %{"name" => "清洋街道", "code" => "370611001000"},
      %{"name" => "福新街道", "code" => "370611002000"},
      %{"name" => "东厅街道", "code" => "370611006000"},
      %{"name" => "门楼街道", "code" => "370611007000"},
      %{"name" => "高疃镇", "code" => "370611102000"},
      %{"name" => "张格庄镇", "code" => "370611103000"},
      %{"name" => "回里镇", "code" => "370611104000"},
      %{"name" => "臧家庄镇", "code" => "370611105000"},
      %{"name" => "山东烟台福山经济开发区", "code" => "370611401000"}
    ]

  def next(input) when input == "芝罘区" or input == "370602",
    do: [
      %{"name" => "向阳街道", "code" => "370602001000"},
      %{"name" => "东山街道", "code" => "370602002000"},
      %{"name" => "毓璜顶街道", "code" => "370602003000"},
      %{"name" => "通伸街道", "code" => "370602004000"},
      %{"name" => "凤凰台街道", "code" => "370602005000"},
      %{"name" => "奇山街道", "code" => "370602006000"},
      %{"name" => "白石街道", "code" => "370602007000"},
      %{"name" => "芝罘岛街道", "code" => "370602008000"},
      %{"name" => "黄务街道", "code" => "370602009000"},
      %{"name" => "只楚街道", "code" => "370602010000"},
      %{"name" => "世回尧街道", "code" => "370602011000"},
      %{"name" => "幸福街道", "code" => "370602012000"}
    ]

  def next(input) when input == "东营港经济开发区" or input == "370572",
    do: [%{"name" => "经济开发区直属乡镇", "code" => "370572402000"}]

  def next(input) when input == "东营经济技术开发区" or input == "370571",
    do: [%{"name" => "经济开发区直属乡镇", "code" => "370571400000"}]

  def next(input) when input == "广饶县" or input == "370523",
    do: [
      %{"name" => "广饶街道", "code" => "370523001000"},
      %{"name" => "乐安街道", "code" => "370523002000"},
      %{"name" => "丁庄街道", "code" => "370523003000"},
      %{"name" => "大王镇", "code" => "370523101000"},
      %{"name" => "稻庄镇", "code" => "370523102000"},
      %{"name" => "李鹊镇", "code" => "370523106000"},
      %{"name" => "大码头镇", "code" => "370523107000"},
      %{"name" => "花官镇", "code" => "370523108000"},
      %{"name" => "陈官镇", "code" => "370523109000"},
      %{"name" => "东营农业高新技术产业示范区", "code" => "370523400000"},
      %{"name" => "滨海新动能产业园", "code" => "370523401000"}
    ]

  def next(input) when input == "利津县" or input == "370522",
    do: [
      %{"name" => "利津街道", "code" => "370522001000"},
      %{"name" => "凤凰城街道", "code" => "370522002000"},
      %{"name" => "北宋镇", "code" => "370522101000"},
      %{"name" => "盐窝镇", "code" => "370522102000"},
      %{"name" => "陈庄镇", "code" => "370522103000"},
      %{"name" => "汀罗镇", "code" => "370522104000"},
      %{"name" => "明集乡", "code" => "370522201000"},
      %{"name" => "刁口乡", "code" => "370522206000"},
      %{"name" => "利津县经济开发区", "code" => "370522400000"}
    ]

  def next(input) when input == "垦利区" or input == "370505",
    do: [
      %{"name" => "垦利街道", "code" => "370505001000"},
      %{"name" => "兴隆街道", "code" => "370505002000"},
      %{"name" => "胜坨镇", "code" => "370505101000"},
      %{"name" => "郝家镇", "code" => "370505102000"},
      %{"name" => "永安镇", "code" => "370505104000"},
      %{"name" => "黄河口镇", "code" => "370505105000"},
      %{"name" => "董集镇", "code" => "370505106000"},
      %{"name" => "开发区类似乡级单位", "code" => "370505400000"},
      %{"name" => "红光类似乡级单位", "code" => "370505402000"},
      %{"name" => "垦东类似乡级单位", "code" => "370505403000"},
      %{"name" => "东营市现代畜牧业示范区类似乡级单位", "code" => "370505404000"}
    ]

  def next(input) when input == "河口区" or input == "370503",
    do: [
      %{"name" => "河口街道", "code" => "370503001000"},
      %{"name" => "六合街道", "code" => "370503002000"},
      %{"name" => "义和镇", "code" => "370503100000"},
      %{"name" => "仙河镇", "code" => "370503101000"},
      %{"name" => "孤岛镇", "code" => "370503102000"},
      %{"name" => "新户镇", "code" => "370503103000"},
      %{"name" => "河口经济开发区", "code" => "370503400000"},
      %{"name" => "河口蓝色经济开发区", "code" => "370503401000"}
    ]

  def next(input) when input == "东营区" or input == "370502",
    do: [
      %{"name" => "文汇街道", "code" => "370502001000"},
      %{"name" => "黄河路街道", "code" => "370502002000"},
      %{"name" => "东城街道", "code" => "370502003000"},
      %{"name" => "辛店街道", "code" => "370502004000"},
      %{"name" => "胜利街道", "code" => "370502005000"},
      %{"name" => "胜园街道", "code" => "370502006000"},
      %{"name" => "牛庄镇", "code" => "370502102000"},
      %{"name" => "六户镇", "code" => "370502103000"},
      %{"name" => "史口镇", "code" => "370502104000"},
      %{"name" => "龙居镇", "code" => "370502105000"},
      %{"name" => "东营商贸园", "code" => "370502400000"}
    ]

  def next(input) when input == "滕州市" or input == "370481",
    do: [
      %{"name" => "荆河街道", "code" => "370481001000"},
      %{"name" => "龙泉街道", "code" => "370481002000"},
      %{"name" => "北辛街道", "code" => "370481003000"},
      %{"name" => "善南街道", "code" => "370481004000"},
      %{"name" => "东沙河街道", "code" => "370481005000"},
      %{"name" => "洪绪镇", "code" => "370481101000"},
      %{"name" => "南沙河镇", "code" => "370481102000"},
      %{"name" => "大坞镇", "code" => "370481103000"},
      %{"name" => "滨湖镇", "code" => "370481104000"},
      %{"name" => "级索镇", "code" => "370481105000"},
      %{"name" => "西岗镇", "code" => "370481106000"},
      %{"name" => "姜屯镇", "code" => "370481107000"},
      %{"name" => "鲍沟镇", "code" => "370481108000"},
      %{"name" => "张汪镇", "code" => "370481109000"},
      %{"name" => "官桥镇", "code" => "370481110000"},
      %{"name" => "柴胡店镇", "code" => "370481111000"},
      %{"name" => "羊庄镇", "code" => "370481112000"},
      %{"name" => "木石镇", "code" => "370481113000"},
      %{"name" => "界河镇", "code" => "370481114000"},
      %{"name" => "龙阳镇", "code" => "370481115000"},
      %{"name" => "东郭镇", "code" => "370481116000"}
    ]

  def next(input) when input == "山亭区" or input == "370406",
    do: [
      %{"name" => "山城街道", "code" => "370406001000"},
      %{"name" => "店子镇", "code" => "370406101000"},
      %{"name" => "西集镇", "code" => "370406102000"},
      %{"name" => "桑村镇", "code" => "370406103000"},
      %{"name" => "北庄镇", "code" => "370406104000"},
      %{"name" => "城头镇", "code" => "370406105000"},
      %{"name" => "徐庄镇", "code" => "370406106000"},
      %{"name" => "水泉镇", "code" => "370406107000"},
      %{"name" => "冯卯镇", "code" => "370406108000"},
      %{"name" => "凫城镇", "code" => "370406109000"},
      %{"name" => "山亭经济开发区", "code" => "370406405000"}
    ]

  def next(input) when input == "台儿庄区" or input == "370405",
    do: [
      %{"name" => "运河街道", "code" => "370405001000"},
      %{"name" => "邳庄镇", "code" => "370405100000"},
      %{"name" => "张山子镇", "code" => "370405101000"},
      %{"name" => "泥沟镇", "code" => "370405102000"},
      %{"name" => "涧头集镇", "code" => "370405103000"},
      %{"name" => "马兰屯镇", "code" => "370405104000"}
    ]

  def next(input) when input == "峄城区" or input == "370404",
    do: [
      %{"name" => "坛山街道", "code" => "370404001000"},
      %{"name" => "吴林街道", "code" => "370404002000"},
      %{"name" => "古邵镇", "code" => "370404100000"},
      %{"name" => "阴平镇", "code" => "370404101000"},
      %{"name" => "底阁镇", "code" => "370404102000"},
      %{"name" => "榴园镇", "code" => "370404103000"},
      %{"name" => "峨山镇", "code" => "370404104000"}
    ]

  def next(input) when input == "薛城区" or input == "370403",
    do: [
      %{"name" => "临城街道", "code" => "370403001000"},
      %{"name" => "兴仁街道", "code" => "370403002000"},
      %{"name" => "兴城街道", "code" => "370403003000"},
      %{"name" => "张范街道", "code" => "370403004000"},
      %{"name" => "常庄街道", "code" => "370403005000"},
      %{"name" => "新城街道", "code" => "370403006000"},
      %{"name" => "沙沟镇", "code" => "370403101000"},
      %{"name" => "周营镇", "code" => "370403102000"},
      %{"name" => "邹坞镇", "code" => "370403103000"},
      %{"name" => "陶庄镇", "code" => "370403104000"}
    ]

  def next(input) when input == "市中区" or input == "370402",
    do: [
      %{"name" => "中心街街道", "code" => "370402001000"},
      %{"name" => "各塔埠街道", "code" => "370402002000"},
      %{"name" => "矿区街道", "code" => "370402003000"},
      %{"name" => "文化路街道", "code" => "370402004000"},
      %{"name" => "龙山路街道", "code" => "370402005000"},
      %{"name" => "光明路街道", "code" => "370402006000"},
      %{"name" => "税郭镇", "code" => "370402101000"},
      %{"name" => "孟庄镇", "code" => "370402102000"},
      %{"name" => "齐村镇", "code" => "370402103000"},
      %{"name" => "永安镇", "code" => "370402104000"},
      %{"name" => "西王庄镇", "code" => "370402105000"}
    ]

  def next(input) when input == "沂源县" or input == "370323",
    do: [
      %{"name" => "历山街道", "code" => "370323001000"},
      %{"name" => "南麻街道", "code" => "370323002000"},
      %{"name" => "鲁村镇", "code" => "370323102000"},
      %{"name" => "东里镇", "code" => "370323103000"},
      %{"name" => "悦庄镇", "code" => "370323104000"},
      %{"name" => "西里镇", "code" => "370323105000"},
      %{"name" => "大张庄镇", "code" => "370323106000"},
      %{"name" => "中庄镇", "code" => "370323107000"},
      %{"name" => "张家坡镇", "code" => "370323108000"},
      %{"name" => "燕崖镇", "code" => "370323109000"},
      %{"name" => "石桥镇", "code" => "370323110000"},
      %{"name" => "南鲁山镇", "code" => "370323111000"}
    ]

  def next(input) when input == "高青县" or input == "370322",
    do: [
      %{"name" => "田镇街道", "code" => "370322001000"},
      %{"name" => "芦湖街道", "code" => "370322002000"},
      %{"name" => "青城镇", "code" => "370322101000"},
      %{"name" => "高城镇", "code" => "370322102000"},
      %{"name" => "黑里寨镇", "code" => "370322103000"},
      %{"name" => "唐坊镇", "code" => "370322104000"},
      %{"name" => "常家镇", "code" => "370322105000"},
      %{"name" => "花沟镇", "code" => "370322106000"},
      %{"name" => "木李镇", "code" => "370322108000"}
    ]

  def next(input) when input == "桓台县" or input == "370321",
    do: [
      %{"name" => "索镇街道", "code" => "370321001000"},
      %{"name" => "少海街道", "code" => "370321002000"},
      %{"name" => "起凤镇", "code" => "370321101000"},
      %{"name" => "田庄镇", "code" => "370321103000"},
      %{"name" => "荆家镇", "code" => "370321104000"},
      %{"name" => "马桥镇", "code" => "370321105000"},
      %{"name" => "新城镇", "code" => "370321107000"},
      %{"name" => "唐山镇", "code" => "370321109000"},
      %{"name" => "果里镇", "code" => "370321110000"}
    ]

  def next(input) when input == "周村区" or input == "370306",
    do: [
      %{"name" => "丝绸路街道", "code" => "370306001000"},
      %{"name" => "大街街道", "code" => "370306002000"},
      %{"name" => "青年路街道", "code" => "370306003000"},
      %{"name" => "永安街道", "code" => "370306004000"},
      %{"name" => "城北路街道", "code" => "370306005000"},
      %{"name" => "北郊镇", "code" => "370306100000"},
      %{"name" => "南郊镇", "code" => "370306101000"},
      %{"name" => "王村镇", "code" => "370306102000"},
      %{"name" => "萌水镇", "code" => "370306103000"},
      %{"name" => "商家镇", "code" => "370306104000"}
    ]

  def next(input) when input == "临淄区" or input == "370305",
    do: [
      %{"name" => "闻韶街道", "code" => "370305001000"},
      %{"name" => "雪宫街道", "code" => "370305002000"},
      %{"name" => "辛店街道", "code" => "370305003000"},
      %{"name" => "稷下街道", "code" => "370305004000"},
      %{"name" => "齐陵街道", "code" => "370305005000"},
      %{"name" => "齐都镇", "code" => "370305100000"},
      %{"name" => "皇城镇", "code" => "370305102000"},
      %{"name" => "敬仲镇", "code" => "370305103000"},
      %{"name" => "朱台镇", "code" => "370305104000"},
      %{"name" => "金岭镇", "code" => "370305107000"},
      %{"name" => "凤凰镇", "code" => "370305109000"},
      %{"name" => "金山镇", "code" => "370305111000"}
    ]

  def next(input) when input == "博山区" or input == "370304",
    do: [
      %{"name" => "城东街道", "code" => "370304001000"},
      %{"name" => "城西街道", "code" => "370304002000"},
      %{"name" => "山头街道", "code" => "370304004000"},
      %{"name" => "域城镇", "code" => "370304102000"},
      %{"name" => "白塔镇", "code" => "370304103000"},
      %{"name" => "八陡镇", "code" => "370304106000"},
      %{"name" => "石马镇", "code" => "370304108000"},
      %{"name" => "源泉镇", "code" => "370304111000"},
      %{"name" => "池上镇", "code" => "370304112000"},
      %{"name" => "博山镇", "code" => "370304113000"}
    ]

  def next(input) when input == "张店区" or input == "370303",
    do: [
      %{"name" => "车站街道", "code" => "370303001000"},
      %{"name" => "公园街道", "code" => "370303002000"},
      %{"name" => "湖田街道", "code" => "370303003000"},
      %{"name" => "和平街道", "code" => "370303004000"},
      %{"name" => "科苑街道", "code" => "370303005000"},
      %{"name" => "体育场街道", "code" => "370303006000"},
      %{"name" => "四宝山街道", "code" => "370303008000"},
      %{"name" => "马尚街道", "code" => "370303009000"},
      %{"name" => "南定镇", "code" => "370303101000"},
      %{"name" => "沣水镇", "code" => "370303102000"},
      %{"name" => "傅家镇", "code" => "370303104000"},
      %{"name" => "中埠镇", "code" => "370303105000"},
      %{"name" => "房镇镇", "code" => "370303107000"}
    ]

  def next(input) when input == "淄川区" or input == "370302",
    do: [
      %{"name" => "般阳路街道", "code" => "370302001000"},
      %{"name" => "松龄路街道", "code" => "370302002000"},
      %{"name" => "钟楼街道", "code" => "370302004000"},
      %{"name" => "将军路街道", "code" => "370302005000"},
      %{"name" => "昆仑镇", "code" => "370302102000"},
      %{"name" => "岭子镇", "code" => "370302104000"},
      %{"name" => "西河镇", "code" => "370302111000"},
      %{"name" => "龙泉镇", "code" => "370302112000"},
      %{"name" => "寨里镇", "code" => "370302113000"},
      %{"name" => "罗村镇", "code" => "370302114000"},
      %{"name" => "洪山镇", "code" => "370302115000"},
      %{"name" => "双杨镇", "code" => "370302116000"},
      %{"name" => "太河镇", "code" => "370302117000"}
    ]

  def next(input) when input == "莱西市" or input == "370285",
    do: [
      %{"name" => "水集街道", "code" => "370285001000"},
      %{"name" => "望城街道", "code" => "370285002000"},
      %{"name" => "沽河街道", "code" => "370285007000"},
      %{"name" => "姜山镇", "code" => "370285101000"},
      %{"name" => "夏格庄镇", "code" => "370285102000"},
      %{"name" => "院上镇", "code" => "370285104000"},
      %{"name" => "日庄镇", "code" => "370285105000"},
      %{"name" => "南墅镇", "code" => "370285106000"},
      %{"name" => "河头店镇", "code" => "370285107000"},
      %{"name" => "店埠镇", "code" => "370285108000"},
      %{"name" => "马连庄镇", "code" => "370285116000"}
    ]

  def next(input) when input == "平度市" or input == "370283",
    do: [
      %{"name" => "东阁街道", "code" => "370283001000"},
      %{"name" => "李园街道", "code" => "370283002000"},
      %{"name" => "同和街道", "code" => "370283003000"},
      %{"name" => "凤台街道", "code" => "370283004000"},
      %{"name" => "白沙河街道", "code" => "370283005000"},
      %{"name" => "古岘镇", "code" => "370283101000"},
      %{"name" => "仁兆镇", "code" => "370283102000"},
      %{"name" => "南村镇", "code" => "370283105000"},
      %{"name" => "蓼兰镇", "code" => "370283108000"},
      %{"name" => "崔家集镇", "code" => "370283109000"},
      %{"name" => "明村镇", "code" => "370283110000"},
      %{"name" => "田庄镇", "code" => "370283113000"},
      %{"name" => "新河镇", "code" => "370283116000"},
      %{"name" => "店子镇", "code" => "370283119000"},
      %{"name" => "大泽山镇", "code" => "370283120000"},
      %{"name" => "旧店镇", "code" => "370283122000"},
      %{"name" => "云山镇", "code" => "370283124000"},
      %{"name" => "平度经济开发区", "code" => "370283400000"}
    ]

  def next(input) when input == "胶州市" or input == "370281",
    do: [
      %{"name" => "阜安街道", "code" => "370281001000"},
      %{"name" => "中云街道", "code" => "370281002000"},
      %{"name" => "三里河街道", "code" => "370281004000"},
      %{"name" => "九龙街道", "code" => "370281006000"},
      %{"name" => "胶东街道", "code" => "370281007000"},
      %{"name" => "胶北街道", "code" => "370281008000"},
      %{"name" => "胶西街道", "code" => "370281009000"},
      %{"name" => "胶莱街道", "code" => "370281010000"},
      %{"name" => "李哥庄镇", "code" => "370281102000"},
      %{"name" => "铺集镇", "code" => "370281105000"},
      %{"name" => "里岔镇", "code" => "370281108000"},
      %{"name" => "洋河镇", "code" => "370281111000"},
      %{"name" => "胶州经济技术开发区", "code" => "370281400000"},
      %{"name" => "大沽河省级生态旅游度假区", "code" => "370281401000"}
    ]

  def next(input) when input == "即墨区" or input == "370215",
    do: [
      %{"name" => "环秀街道", "code" => "370215001000"},
      %{"name" => "潮海街道", "code" => "370215002000"},
      %{"name" => "通济街道", "code" => "370215003000"},
      %{"name" => "北安街道", "code" => "370215004000"},
      %{"name" => "龙山街道", "code" => "370215005000"},
      %{"name" => "龙泉街道", "code" => "370215006000"},
      %{"name" => "鳌山卫街道", "code" => "370215007000"},
      %{"name" => "温泉街道", "code" => "370215008000"},
      %{"name" => "灵山街道", "code" => "370215009000"},
      %{"name" => "蓝村街道", "code" => "370215010000"},
      %{"name" => "大信街道", "code" => "370215011000"},
      %{"name" => "田横镇", "code" => "370215100000"},
      %{"name" => "金口镇", "code" => "370215101000"},
      %{"name" => "段泊岚镇", "code" => "370215103000"},
      %{"name" => "移风店镇", "code" => "370215104000"},
      %{"name" => "通济新经济区", "code" => "370215400000"},
      %{"name" => "田横岛省级旅游度假区", "code" => "370215402000"}
    ]

  def next(input) when input == "城阳区" or input == "370214",
    do: [
      %{"name" => "城阳街道", "code" => "370214001000"},
      %{"name" => "夏庄街道", "code" => "370214002000"},
      %{"name" => "流亭街道", "code" => "370214003000"},
      %{"name" => "棘洪滩街道", "code" => "370214004000"},
      %{"name" => "上马街道", "code" => "370214005000"},
      %{"name" => "惜福镇街道", "code" => "370214008000"},
      %{"name" => "红岛街道", "code" => "370214009000"},
      %{"name" => "河套街道", "code" => "370214010000"},
      %{"name" => "青岛高新技术产业开发区", "code" => "370214400000"}
    ]

  def next(input) when input == "李沧区" or input == "370213",
    do: [
      %{"name" => "振华路街道", "code" => "370213001000"},
      %{"name" => "沧口街道", "code" => "370213003000"},
      %{"name" => "兴华路街道", "code" => "370213004000"},
      %{"name" => "兴城路街道", "code" => "370213005000"},
      %{"name" => "李村街道", "code" => "370213006000"},
      %{"name" => "虎山路街道", "code" => "370213007000"},
      %{"name" => "浮山路街道", "code" => "370213008000"},
      %{"name" => "湘潭路街道", "code" => "370213010000"},
      %{"name" => "楼山街道", "code" => "370213011000"},
      %{"name" => "九水街道", "code" => "370213012000"},
      %{"name" => "世园街道", "code" => "370213013000"}
    ]

  def next(input) when input == "崂山区" or input == "370212",
    do: [
      %{"name" => "中韩街道", "code" => "370212001000"},
      %{"name" => "沙子口街道", "code" => "370212002000"},
      %{"name" => "王哥庄街道", "code" => "370212003000"},
      %{"name" => "北宅街道", "code" => "370212004000"},
      %{"name" => "金家岭街道", "code" => "370212005000"}
    ]

  def next(input) when input == "黄岛区" or input == "370211",
    do: [
      %{"name" => "黄岛街道", "code" => "370211001000"},
      %{"name" => "辛安街道", "code" => "370211002000"},
      %{"name" => "薛家岛街道", "code" => "370211003000"},
      %{"name" => "灵珠山街道", "code" => "370211004000"},
      %{"name" => "长江路街道", "code" => "370211005000"},
      %{"name" => "红石崖街道", "code" => "370211006000"},
      %{"name" => "灵山卫街道", "code" => "370211007000"},
      %{"name" => "珠海街道", "code" => "370211009000"},
      %{"name" => "隐珠街道", "code" => "370211010000"},
      %{"name" => "铁山街道", "code" => "370211011000"},
      %{"name" => "滨海街道", "code" => "370211012000"},
      %{"name" => "胶南街道", "code" => "370211013000"},
      %{"name" => "王台街道", "code" => "370211014000"},
      %{"name" => "张家楼街道", "code" => "370211015000"},
      %{"name" => "琅琊镇", "code" => "370211102000"},
      %{"name" => "泊里镇", "code" => "370211103000"},
      %{"name" => "大场镇", "code" => "370211104000"},
      %{"name" => "大村镇", "code" => "370211105000"},
      %{"name" => "六汪镇", "code" => "370211106000"},
      %{"name" => "海青镇", "code" => "370211107000"},
      %{"name" => "宝山镇", "code" => "370211108000"},
      %{"name" => "藏马镇", "code" => "370211109000"},
      %{"name" => "灵山岛省级自然保护区", "code" => "370211401000"}
    ]

  def next(input) when input == "市北区" or input == "370203",
    do: [
      %{"name" => "辽宁路街道", "code" => "370203005000"},
      %{"name" => "延安路街道", "code" => "370203008000"},
      %{"name" => "登州路街道", "code" => "370203011000"},
      %{"name" => "宁夏路街道", "code" => "370203013000"},
      %{"name" => "敦化路街道", "code" => "370203014000"},
      %{"name" => "辽源路街道", "code" => "370203015000"},
      %{"name" => "合肥路街道", "code" => "370203016000"},
      %{"name" => "大港街道", "code" => "370203019000"},
      %{"name" => "即墨路街道", "code" => "370203020000"},
      %{"name" => "台东街道", "code" => "370203021000"},
      %{"name" => "镇江路街道", "code" => "370203022000"},
      %{"name" => "浮山新区街道", "code" => "370203025000"},
      %{"name" => "阜新路街道", "code" => "370203026000"},
      %{"name" => "海伦路街道", "code" => "370203027000"},
      %{"name" => "四方街道", "code" => "370203028000"},
      %{"name" => "兴隆路街道", "code" => "370203029000"},
      %{"name" => "水清沟街道", "code" => "370203030000"},
      %{"name" => "洛阳路街道", "code" => "370203031000"},
      %{"name" => "河西街道", "code" => "370203032000"},
      %{"name" => "湖岛街道", "code" => "370203033000"},
      %{"name" => "开平路街道", "code" => "370203034000"},
      %{"name" => "双山街道", "code" => "370203035000"}
    ]

  def next(input) when input == "市南区" or input == "370202",
    do: [
      %{"name" => "香港中路街道", "code" => "370202001000"},
      %{"name" => "八大峡街道", "code" => "370202002000"},
      %{"name" => "云南路街道", "code" => "370202004000"},
      %{"name" => "中山路街道", "code" => "370202005000"},
      %{"name" => "江苏路街道", "code" => "370202007000"},
      %{"name" => "八大关街道", "code" => "370202009000"},
      %{"name" => "湛山街道", "code" => "370202010000"},
      %{"name" => "金湖路街道", "code" => "370202011000"},
      %{"name" => "八大湖街道", "code" => "370202012000"},
      %{"name" => "金门路街道", "code" => "370202013000"},
      %{"name" => "珠海路街道", "code" => "370202014000"}
    ]

  def next(input) when input == "济南高新技术产业开发区" or input == "370176",
    do: [
      %{"name" => "舜华路街道", "code" => "370176001000"},
      %{"name" => "孙村街道", "code" => "370176002000"},
      %{"name" => "巨野河街道", "code" => "370176003000"},
      %{"name" => "遥墙街道", "code" => "370176004000"},
      %{"name" => "临港街道", "code" => "370176005000"}
    ]

  def next(input) when input == "商河县" or input == "370126",
    do: [
      %{"name" => "许商街道", "code" => "370126001000"},
      %{"name" => "殷巷镇", "code" => "370126101000"},
      %{"name" => "怀仁镇", "code" => "370126102000"},
      %{"name" => "龙桑寺镇", "code" => "370126104000"},
      %{"name" => "郑路镇", "code" => "370126105000"},
      %{"name" => "贾庄镇", "code" => "370126106000"},
      %{"name" => "玉皇庙镇", "code" => "370126107000"},
      %{"name" => "白桥镇", "code" => "370126108000"},
      %{"name" => "孙集镇", "code" => "370126109000"},
      %{"name" => "韩庙镇", "code" => "370126110000"},
      %{"name" => "沙河镇", "code" => "370126111000"},
      %{"name" => "张坊镇", "code" => "370126112000"},
      %{"name" => "商河经济开发区", "code" => "370126400000"}
    ]

  def next(input) when input == "平阴县" or input == "370124",
    do: [
      %{"name" => "榆山街道", "code" => "370124001000"},
      %{"name" => "锦水街道", "code" => "370124002000"},
      %{"name" => "东阿镇", "code" => "370124102000"},
      %{"name" => "孝直镇", "code" => "370124103000"},
      %{"name" => "孔村镇", "code" => "370124104000"},
      %{"name" => "洪范池镇", "code" => "370124105000"},
      %{"name" => "玫瑰镇", "code" => "370124106000"},
      %{"name" => "安城镇", "code" => "370124107000"}
    ]

  def next(input) when input == "钢城区" or input == "370117",
    do: [
      %{"name" => "艾山街道", "code" => "370117001000"},
      %{"name" => "里辛街道", "code" => "370117002000"},
      %{"name" => "汶源街道", "code" => "370117003000"},
      %{"name" => "颜庄街道", "code" => "370117004000"},
      %{"name" => "辛庄街道", "code" => "370117005000"},
      %{"name" => "棋山国家森林公园", "code" => "370117400000"},
      %{"name" => "南部新城建设服务中心", "code" => "370117401000"}
    ]

  def next(input) when input == "莱芜区" or input == "370116",
    do: [
      %{"name" => "凤城街道", "code" => "370116001000"},
      %{"name" => "张家洼街道", "code" => "370116002000"},
      %{"name" => "高庄街道", "code" => "370116003000"},
      %{"name" => "鹏泉街道", "code" => "370116004000"},
      %{"name" => "口镇街道", "code" => "370116005000"},
      %{"name" => "羊里街道", "code" => "370116006000"},
      %{"name" => "方下街道", "code" => "370116007000"},
      %{"name" => "雪野街道", "code" => "370116008000"},
      %{"name" => "牛泉镇", "code" => "370116103000"},
      %{"name" => "苗山镇", "code" => "370116104000"},
      %{"name" => "大王庄镇", "code" => "370116106000"},
      %{"name" => "寨里镇", "code" => "370116107000"},
      %{"name" => "杨庄镇", "code" => "370116108000"},
      %{"name" => "茶业口镇", "code" => "370116109000"},
      %{"name" => "和庄镇", "code" => "370116110000"}
    ]

  def next(input) when input == "济阳区" or input == "370115",
    do: [
      %{"name" => "济阳街道", "code" => "370115001000"},
      %{"name" => "济北街道", "code" => "370115002000"},
      %{"name" => "崔寨街道", "code" => "370115003000"},
      %{"name" => "孙耿街道", "code" => "370115004000"},
      %{"name" => "回河街道", "code" => "370115005000"},
      %{"name" => "太平街道", "code" => "370115006000"},
      %{"name" => "垛石街道", "code" => "370115007000"},
      %{"name" => "曲堤街道", "code" => "370115008000"},
      %{"name" => "仁风镇", "code" => "370115104000"},
      %{"name" => "新市镇", "code" => "370115110000"}
    ]

  def next(input) when input == "章丘区" or input == "370114",
    do: [
      %{"name" => "明水街道", "code" => "370114001000"},
      %{"name" => "双山街道", "code" => "370114002000"},
      %{"name" => "枣园街道", "code" => "370114003000"},
      %{"name" => "龙山街道", "code" => "370114004000"},
      %{"name" => "埠村街道", "code" => "370114005000"},
      %{"name" => "圣井街道", "code" => "370114006000"},
      %{"name" => "普集街道", "code" => "370114007000"},
      %{"name" => "绣惠街道", "code" => "370114008000"},
      %{"name" => "相公庄街道", "code" => "370114009000"},
      %{"name" => "文祖街道", "code" => "370114010000"},
      %{"name" => "官庄街道", "code" => "370114011000"},
      %{"name" => "高官寨街道", "code" => "370114012000"},
      %{"name" => "白云湖街道", "code" => "370114013000"},
      %{"name" => "宁家埠街道", "code" => "370114014000"},
      %{"name" => "曹范街道", "code" => "370114015000"},
      %{"name" => "刁镇街道", "code" => "370114016000"},
      %{"name" => "黄河街道", "code" => "370114017000"},
      %{"name" => "垛庄镇", "code" => "370114101000"}
    ]

  def next(input) when input == "长清区" or input == "370113",
    do: [
      %{"name" => "文昌街道", "code" => "370113001000"},
      %{"name" => "崮云湖街道", "code" => "370113002000"},
      %{"name" => "平安街道", "code" => "370113003000"},
      %{"name" => "五峰山街道", "code" => "370113004000"},
      %{"name" => "归德街道", "code" => "370113005000"},
      %{"name" => "张夏街道", "code" => "370113006000"},
      %{"name" => "万德街道", "code" => "370113007000"},
      %{"name" => "孝里街道", "code" => "370113008000"},
      %{"name" => "马山镇", "code" => "370113107000"},
      %{"name" => "双泉镇", "code" => "370113108000"}
    ]

  def next(input) when input == "历城区" or input == "370112",
    do: [
      %{"name" => "山大路街道", "code" => "370112001000"},
      %{"name" => "洪家楼街道", "code" => "370112002000"},
      %{"name" => "东风街道", "code" => "370112003000"},
      %{"name" => "全福街道", "code" => "370112004000"},
      %{"name" => "华山街道", "code" => "370112007000"},
      %{"name" => "荷花路街道", "code" => "370112008000"},
      %{"name" => "王舍人街道", "code" => "370112009000"},
      %{"name" => "鲍山街道", "code" => "370112010000"},
      %{"name" => "郭店街道", "code" => "370112011000"},
      %{"name" => "唐冶街道", "code" => "370112012000"},
      %{"name" => "港沟街道", "code" => "370112013000"},
      %{"name" => "董家街道", "code" => "370112016000"},
      %{"name" => "彩石街道", "code" => "370112017000"},
      %{"name" => "仲宫街道", "code" => "370112018000"},
      %{"name" => "柳埠街道", "code" => "370112019000"},
      %{"name" => "唐王街道", "code" => "370112020000"},
      %{"name" => "西营街道", "code" => "370112021000"}
    ]

  def next(input) when input == "天桥区" or input == "370105",
    do: [
      %{"name" => "无影山街道", "code" => "370105001000"},
      %{"name" => "天桥东街街道", "code" => "370105003000"},
      %{"name" => "北村街道", "code" => "370105004000"},
      %{"name" => "南村街道", "code" => "370105005000"},
      %{"name" => "堤口路街道", "code" => "370105006000"},
      %{"name" => "北坦街道", "code" => "370105007000"},
      %{"name" => "制锦市街道", "code" => "370105009000"},
      %{"name" => "宝华街道", "code" => "370105010000"},
      %{"name" => "官扎营街道", "code" => "370105011000"},
      %{"name" => "纬北路街道", "code" => "370105012000"},
      %{"name" => "药山街道", "code" => "370105013000"},
      %{"name" => "北园街道", "code" => "370105014000"},
      %{"name" => "泺口街道", "code" => "370105015000"},
      %{"name" => "桑梓店街道", "code" => "370105016000"},
      %{"name" => "大桥街道", "code" => "370105017000"}
    ]

  def next(input) when input == "槐荫区" or input == "370104",
    do: [
      %{"name" => "振兴街街道", "code" => "370104001000"},
      %{"name" => "中大槐树街道", "code" => "370104002000"},
      %{"name" => "道德街街道", "code" => "370104003000"},
      %{"name" => "西市场街道", "code" => "370104004000"},
      %{"name" => "五里沟街道", "code" => "370104005000"},
      %{"name" => "营市街街道", "code" => "370104006000"},
      %{"name" => "青年公园街道", "code" => "370104007000"},
      %{"name" => "南辛庄街道", "code" => "370104008000"},
      %{"name" => "段店北路街道", "code" => "370104009000"},
      %{"name" => "张庄路街道", "code" => "370104010000"},
      %{"name" => "匡山街道", "code" => "370104011000"},
      %{"name" => "美里湖街道", "code" => "370104012000"},
      %{"name" => "腊山街道", "code" => "370104013000"},
      %{"name" => "兴福街道", "code" => "370104014000"},
      %{"name" => "玉清湖街道", "code" => "370104015000"},
      %{"name" => "吴家堡街道", "code" => "370104016000"}
    ]

  def next(input) when input == "市中区" or input == "370103",
    do: [
      %{"name" => "大观园街道", "code" => "370103002000"},
      %{"name" => "杆石桥街道", "code" => "370103003000"},
      %{"name" => "四里村街道", "code" => "370103004000"},
      %{"name" => "魏家庄街道", "code" => "370103006000"},
      %{"name" => "二七街道", "code" => "370103008000"},
      %{"name" => "七里山街道", "code" => "370103009000"},
      %{"name" => "六里山街道", "code" => "370103010000"},
      %{"name" => "舜玉路街道", "code" => "370103012000"},
      %{"name" => "泺源街道", "code" => "370103014000"},
      %{"name" => "王官庄街道", "code" => "370103015000"},
      %{"name" => "舜耕街道", "code" => "370103016000"},
      %{"name" => "白马山街道", "code" => "370103017000"},
      %{"name" => "七贤街道", "code" => "370103018000"},
      %{"name" => "十六里河街道", "code" => "370103019000"},
      %{"name" => "兴隆街道", "code" => "370103020000"},
      %{"name" => "党家街道", "code" => "370103021000"},
      %{"name" => "陡沟街道", "code" => "370103022000"}
    ]

  def next(input) when input == "历下区" or input == "370102",
    do: [
      %{"name" => "解放路街道", "code" => "370102001000"},
      %{"name" => "千佛山街道", "code" => "370102002000"},
      %{"name" => "趵突泉街道", "code" => "370102003000"},
      %{"name" => "泉城路街道", "code" => "370102004000"},
      %{"name" => "大明湖街道", "code" => "370102005000"},
      %{"name" => "东关街道", "code" => "370102006000"},
      %{"name" => "文东街道", "code" => "370102007000"},
      %{"name" => "建新街道", "code" => "370102008000"},
      %{"name" => "甸柳街道", "code" => "370102009000"},
      %{"name" => "燕山街道", "code" => "370102010000"},
      %{"name" => "姚家街道", "code" => "370102011000"},
      %{"name" => "龙洞街道", "code" => "370102012000"},
      %{"name" => "智远街道", "code" => "370102013000"}
    ]

  def next(_), do: nil
end