defmodule ChinaAdminDivisions.Gen.Lv3x.M41 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "济源市" or input == "419001",
    do: [
      %{"name" => "济源市沁园街道", "code" => "419001001000"},
      %{"name" => "济源市济水街道", "code" => "419001002000"},
      %{"name" => "济源市北海街道", "code" => "419001003000"},
      %{"name" => "济源市天坛街道", "code" => "419001004000"},
      %{"name" => "济源市玉泉街道", "code" => "419001005000"},
      %{"name" => "济源市克井镇", "code" => "419001100000"},
      %{"name" => "济源市五龙口镇", "code" => "419001101000"},
      %{"name" => "济源市轵城镇", "code" => "419001102000"},
      %{"name" => "济源市承留镇", "code" => "419001103000"},
      %{"name" => "济源市邵原镇", "code" => "419001104000"},
      %{"name" => "济源市坡头镇", "code" => "419001105000"},
      %{"name" => "济源市梨林镇", "code" => "419001106000"},
      %{"name" => "济源市大峪镇", "code" => "419001107000"},
      %{"name" => "济源市思礼镇", "code" => "419001108000"},
      %{"name" => "济源市王屋镇", "code" => "419001109000"},
      %{"name" => "济源市下冶镇", "code" => "419001110000"}
    ]

  def next(input) when input == "河南驻马店经济开发区" or input == "411771",
    do: [
      %{"name" => "关王庙乡", "code" => "411771360000"},
      %{"name" => "驻马店市职教园区", "code" => "411771400000"},
      %{"name" => "金河街道", "code" => "411771560000"},
      %{"name" => "金山街道", "code" => "411771562000"},
      %{"name" => "开源街道", "code" => "411771563000"}
    ]

  def next(input) when input == "新蔡县" or input == "411729",
    do: [
      %{"name" => "古吕街道", "code" => "411729001000"},
      %{"name" => "今是街道", "code" => "411729002000"},
      %{"name" => "月亮湾街道", "code" => "411729003000"},
      %{"name" => "砖店镇", "code" => "411729101000"},
      %{"name" => "陈店镇", "code" => "411729102000"},
      %{"name" => "佛阁寺镇", "code" => "411729103000"},
      %{"name" => "练村镇", "code" => "411729104000"},
      %{"name" => "棠村镇", "code" => "411729105000"},
      %{"name" => "韩集镇", "code" => "411729106000"},
      %{"name" => "龙口镇", "code" => "411729107000"},
      %{"name" => "李桥回族镇", "code" => "411729108000"},
      %{"name" => "黄楼镇", "code" => "411729109000"},
      %{"name" => "孙召镇", "code" => "411729110000"},
      %{"name" => "余店镇", "code" => "411729111000"},
      %{"name" => "河坞乡", "code" => "411729204000"},
      %{"name" => "关津乡", "code" => "411729205000"},
      %{"name" => "宋岗乡", "code" => "411729206000"},
      %{"name" => "顿岗乡", "code" => "411729207000"},
      %{"name" => "涧头乡", "code" => "411729208000"},
      %{"name" => "杨庄户乡", "code" => "411729209000"},
      %{"name" => "化庄乡", "code" => "411729210000"},
      %{"name" => "栎城乡", "code" => "411729211000"},
      %{"name" => "弥陀寺乡", "code" => "411729213000"},
      %{"name" => "南湖街道", "code" => "411729400000"}
    ]

  def next(input) when input == "遂平县" or input == "411728",
    do: [
      %{"name" => "瞿阳街道", "code" => "411728001000"},
      %{"name" => "车站街道", "code" => "411728002000"},
      %{"name" => "莲花湖街道", "code" => "411728003000"},
      %{"name" => "褚堂街道", "code" => "411728004000"},
      %{"name" => "吴房街道", "code" => "411728005000"},
      %{"name" => "玉山镇", "code" => "411728102000"},
      %{"name" => "查岈山镇", "code" => "411728103000"},
      %{"name" => "石寨铺镇", "code" => "411728104000"},
      %{"name" => "和兴镇", "code" => "411728105000"},
      %{"name" => "沈寨镇", "code" => "411728106000"},
      %{"name" => "阳丰镇", "code" => "411728107000"},
      %{"name" => "常庄镇", "code" => "411728108000"},
      %{"name" => "花庄镇", "code" => "411728109000"},
      %{"name" => "槐树乡", "code" => "411728204000"},
      %{"name" => "文城乡", "code" => "411728209000"},
      %{"name" => "先进制造业开发区", "code" => "411728400000"},
      %{"name" => "嵖岈山风景区", "code" => "411728500000"},
      %{"name" => "凤鸣谷风景区", "code" => "411728501000"}
    ]

  def next(input) when input == "汝南县" or input == "411727",
    do: [
      %{"name" => "汝宁街道", "code" => "411727001000"},
      %{"name" => "三门闸街道", "code" => "411727002000"},
      %{"name" => "古塔街道", "code" => "411727003000"},
      %{"name" => "宿鸭湖街道", "code" => "411727004000"},
      %{"name" => "王岗镇", "code" => "411727101000"},
      %{"name" => "梁祝镇", "code" => "411727102000"},
      %{"name" => "和孝镇", "code" => "411727103000"},
      %{"name" => "老君庙镇", "code" => "411727104000"},
      %{"name" => "留盆镇", "code" => "411727105000"},
      %{"name" => "金铺镇", "code" => "411727106000"},
      %{"name" => "东官庄镇", "code" => "411727107000"},
      %{"name" => "常兴镇", "code" => "411727108000"},
      %{"name" => "罗店镇", "code" => "411727109000"},
      %{"name" => "韩庄镇", "code" => "411727110000"},
      %{"name" => "三桥镇", "code" => "411727111000"},
      %{"name" => "张楼镇", "code" => "411727112000"},
      %{"name" => "南余店乡", "code" => "411727204000"},
      %{"name" => "板店乡", "code" => "411727212000"}
    ]

  def next(input) when input == "泌阳县" or input == "411726",
    do: [
      %{"name" => "花园街道", "code" => "411726001000"},
      %{"name" => "泌水街道", "code" => "411726002000"},
      %{"name" => "古城街道", "code" => "411726003000"},
      %{"name" => "羊册镇", "code" => "411726102000"},
      %{"name" => "马谷田镇", "code" => "411726103000"},
      %{"name" => "春水镇", "code" => "411726105000"},
      %{"name" => "官庄镇", "code" => "411726106000"},
      %{"name" => "赊湾镇", "code" => "411726107000"},
      %{"name" => "郭集镇", "code" => "411726108000"},
      %{"name" => "泰山庙镇", "code" => "411726109000"},
      %{"name" => "王店镇", "code" => "411726110000"},
      %{"name" => "杨家集镇", "code" => "411726111000"},
      %{"name" => "高店镇", "code" => "411726112000"},
      %{"name" => "高邑镇", "code" => "411726113000"},
      %{"name" => "盘古乡", "code" => "411726201000"},
      %{"name" => "铜山乡", "code" => "411726204000"},
      %{"name" => "下碑寺乡", "code" => "411726206000"},
      %{"name" => "象河乡", "code" => "411726207000"},
      %{"name" => "付庄乡", "code" => "411726208000"},
      %{"name" => "贾楼乡", "code" => "411726209000"},
      %{"name" => "黄山口乡", "code" => "411726210000"},
      %{"name" => "双庙街乡", "code" => "411726215000"},
      %{"name" => "工业园区", "code" => "411726400000"},
      %{"name" => "石材开发区", "code" => "411726401000"}
    ]

  def next(input) when input == "确山县" or input == "411725",
    do: [
      %{"name" => "盘龙街道", "code" => "411725001000"},
      %{"name" => "三里河街道", "code" => "411725002000"},
      %{"name" => "朗陵街道", "code" => "411725003000"},
      %{"name" => "竹沟镇", "code" => "411725101000"},
      %{"name" => "任店镇", "code" => "411725102000"},
      %{"name" => "新安店镇", "code" => "411725103000"},
      %{"name" => "留庄镇", "code" => "411725104000"},
      %{"name" => "刘店镇", "code" => "411725105000"},
      %{"name" => "瓦岗镇", "code" => "411725107000"},
      %{"name" => "双河镇", "code" => "411725108000"},
      %{"name" => "石滚河镇", "code" => "411725109000"},
      %{"name" => "李新店镇", "code" => "411725110000"},
      %{"name" => "普会寺镇", "code" => "411725111000"}
    ]

  def next(input) when input == "正阳县" or input == "411724",
    do: [
      %{"name" => "真阳街道", "code" => "411724001000"},
      %{"name" => "清源街道", "code" => "411724002000"},
      %{"name" => "寒冻镇", "code" => "411724101000"},
      %{"name" => "汝南埠镇", "code" => "411724102000"},
      %{"name" => "铜钟镇", "code" => "411724103000"},
      %{"name" => "陡沟镇", "code" => "411724104000"},
      %{"name" => "熊寨镇", "code" => "411724105000"},
      %{"name" => "大林镇", "code" => "411724106000"},
      %{"name" => "永兴镇", "code" => "411724107000"},
      %{"name" => "袁寨镇", "code" => "411724108000"},
      %{"name" => "慎水乡", "code" => "411724200000"},
      %{"name" => "傅寨乡", "code" => "411724201000"},
      %{"name" => "新阮店乡", "code" => "411724203000"},
      %{"name" => "油坊店乡", "code" => "411724204000"},
      %{"name" => "雷寨乡", "code" => "411724207000"},
      %{"name" => "王勿桥乡", "code" => "411724208000"},
      %{"name" => "闾河乡", "code" => "411724210000"},
      %{"name" => "皮店乡", "code" => "411724212000"},
      %{"name" => "彭桥乡", "code" => "411724213000"},
      %{"name" => "兰青乡", "code" => "411724214000"}
    ]

  def next(input) when input == "平舆县" or input == "411723",
    do: [
      %{"name" => "古槐街道", "code" => "411723001000"},
      %{"name" => "清河街道", "code" => "411723002000"},
      %{"name" => "东皇街道", "code" => "411723003000"},
      %{"name" => "郭楼街道", "code" => "411723004000"},
      %{"name" => "杨埠镇", "code" => "411723101000"},
      %{"name" => "东和店镇", "code" => "411723102000"},
      %{"name" => "庙湾镇", "code" => "411723103000"},
      %{"name" => "射桥镇", "code" => "411723104000"},
      %{"name" => "西洋店镇", "code" => "411723105000"},
      %{"name" => "阳城镇", "code" => "411723106000"},
      %{"name" => "李屯镇", "code" => "411723108000"},
      %{"name" => "万金店镇", "code" => "411723109000"},
      %{"name" => "高杨店镇", "code" => "411723110000"},
      %{"name" => "万冢镇", "code" => "411723111000"},
      %{"name" => "十字路乡", "code" => "411723202000"},
      %{"name" => "玉皇庙乡", "code" => "411723205000"},
      %{"name" => "老王岗乡", "code" => "411723208000"},
      %{"name" => "辛店乡", "code" => "411723209000"},
      %{"name" => "双庙乡", "code" => "411723211000"}
    ]

  def next(input) when input == "上蔡县" or input == "411722",
    do: [
      %{"name" => "蔡都街道", "code" => "411722001000"},
      %{"name" => "芦岗街道", "code" => "411722002000"},
      %{"name" => "重阳街道", "code" => "411722003000"},
      %{"name" => "卧龙街道", "code" => "411722004000"},
      %{"name" => "黄埠镇", "code" => "411722101000"},
      %{"name" => "杨集镇", "code" => "411722102000"},
      %{"name" => "洙湖镇", "code" => "411722103000"},
      %{"name" => "党店镇", "code" => "411722104000"},
      %{"name" => "朱里镇", "code" => "411722105000"},
      %{"name" => "华陂镇", "code" => "411722106000"},
      %{"name" => "塔桥镇", "code" => "411722107000"},
      %{"name" => "东洪镇", "code" => "411722108000"},
      %{"name" => "邵店镇", "code" => "411722109000"},
      %{"name" => "五龙镇", "code" => "411722110000"},
      %{"name" => "和店镇", "code" => "411722111000"},
      %{"name" => "韩寨镇", "code" => "411722112000"},
      %{"name" => "蔡沟镇", "code" => "411722113000"},
      %{"name" => "大路李乡", "code" => "411722201000"},
      %{"name" => "无量寺乡", "code" => "411722202000"},
      %{"name" => "杨屯乡", "code" => "411722205000"},
      %{"name" => "齐海乡", "code" => "411722209000"},
      %{"name" => "崇礼乡", "code" => "411722210000"},
      %{"name" => "东岸乡", "code" => "411722212000"},
      %{"name" => "小岳寺乡", "code" => "411722215000"},
      %{"name" => "西洪乡", "code" => "411722216000"},
      %{"name" => "百尺乡", "code" => "411722217000"}
    ]

  def next(input) when input == "西平县" or input == "411721",
    do: [
      %{"name" => "柏城街道", "code" => "411721001000"},
      %{"name" => "柏亭街道", "code" => "411721002000"},
      %{"name" => "柏苑街道", "code" => "411721003000"},
      %{"name" => "五沟营镇", "code" => "411721101000"},
      %{"name" => "权寨镇", "code" => "411721102000"},
      %{"name" => "师灵镇", "code" => "411721103000"},
      %{"name" => "出山镇", "code" => "411721104000"},
      %{"name" => "盆尧镇", "code" => "411721105000"},
      %{"name" => "嫘祖镇", "code" => "411721106000"},
      %{"name" => "宋集镇", "code" => "411721107000"},
      %{"name" => "二郎镇", "code" => "411721108000"},
      %{"name" => "重渠乡", "code" => "411721201000"},
      %{"name" => "人和乡", "code" => "411721203000"},
      %{"name" => "谭店乡", "code" => "411721205000"},
      %{"name" => "芦庙乡", "code" => "411721208000"},
      %{"name" => "杨庄乡", "code" => "411721209000"},
      %{"name" => "专探乡", "code" => "411721210000"},
      %{"name" => "蔡寨回族乡", "code" => "411721212000"},
      %{"name" => "焦庄乡", "code" => "411721213000"},
      %{"name" => "老王坡农场", "code" => "411721500000"}
    ]

  def next(input) when input == "驿城区" or input == "411702",
    do: [
      %{"name" => "人民街街道", "code" => "411702001000"},
      %{"name" => "东风路街道", "code" => "411702002000"},
      %{"name" => "西园街街道", "code" => "411702003000"},
      %{"name" => "新华街街道", "code" => "411702004000"},
      %{"name" => "南海街道", "code" => "411702005000"},
      %{"name" => "老街街道", "code" => "411702006000"},
      %{"name" => "橡林街道", "code" => "411702007000"},
      %{"name" => "雪松街道", "code" => "411702008000"},
      %{"name" => "顺河街道", "code" => "411702009000"},
      %{"name" => "刘阁街道", "code" => "411702010000"},
      %{"name" => "香山街道", "code" => "411702011000"},
      %{"name" => "古城街道", "code" => "411702012000"},
      %{"name" => "水屯镇", "code" => "411702100000"},
      %{"name" => "沙河店镇", "code" => "411702101000"},
      %{"name" => "板桥镇", "code" => "411702102000"},
      %{"name" => "诸市镇", "code" => "411702103000"},
      %{"name" => "蚁蜂镇", "code" => "411702104000"},
      %{"name" => "老河乡", "code" => "411702201000"},
      %{"name" => "朱古洞乡", "code" => "411702204000"},
      %{"name" => "胡庙乡", "code" => "411702205000"},
      %{"name" => "金桥街道", "code" => "411702561000"}
    ]

  def next(input) when input == "项城市" or input == "411681",
    do: [
      %{"name" => "花园街道", "code" => "411681001000"},
      %{"name" => "水寨街道", "code" => "411681002000"},
      %{"name" => "东方街道", "code" => "411681003000"},
      %{"name" => "莲花街道", "code" => "411681004000"},
      %{"name" => "千佛阁街道", "code" => "411681005000"},
      %{"name" => "光武街道", "code" => "411681006000"},
      %{"name" => "南顿镇", "code" => "411681100000"},
      %{"name" => "孙店镇", "code" => "411681101000"},
      %{"name" => "李寨镇", "code" => "411681102000"},
      %{"name" => "贾岭镇", "code" => "411681103000"},
      %{"name" => "高寺镇", "code" => "411681104000"},
      %{"name" => "新桥镇", "code" => "411681105000"},
      %{"name" => "付集镇", "code" => "411681106000"},
      %{"name" => "官会镇", "code" => "411681107000"},
      %{"name" => "丁集镇", "code" => "411681108000"},
      %{"name" => "郑郭镇", "code" => "411681109000"},
      %{"name" => "秣陵镇", "code" => "411681110000"},
      %{"name" => "王明口镇", "code" => "411681111000"},
      %{"name" => "范集镇", "code" => "411681112000"},
      %{"name" => "三店镇", "code" => "411681113000"},
      %{"name" => "永丰镇", "code" => "411681114000"}
    ]

  def next(input) when input == "周口临港开发区" or input == "411671",
    do: [
      %{"name" => "太昊路街道", "code" => "411671011000"},
      %{"name" => "淮河路街道", "code" => "411671012000"},
      %{"name" => "李埠口街道", "code" => "411671013000"}
    ]

  def next(input) when input == "鹿邑县" or input == "411628",
    do: [
      %{"name" => "真源街道", "code" => "411628001000"},
      %{"name" => "谷阳街道", "code" => "411628002000"},
      %{"name" => "卫真街道", "code" => "411628003000"},
      %{"name" => "鸣鹿街道", "code" => "411628004000"},
      %{"name" => "涡北镇", "code" => "411628100000"},
      %{"name" => "玄武镇", "code" => "411628101000"},
      %{"name" => "宋河镇", "code" => "411628102000"},
      %{"name" => "太清宫镇", "code" => "411628103000"},
      %{"name" => "王皮溜镇", "code" => "411628104000"},
      %{"name" => "试量镇", "code" => "411628105000"},
      %{"name" => "辛集镇", "code" => "411628106000"},
      %{"name" => "马铺镇", "code" => "411628107000"},
      %{"name" => "贾滩镇", "code" => "411628108000"},
      %{"name" => "杨湖口镇", "code" => "411628109000"},
      %{"name" => "张店镇", "code" => "411628110000"},
      %{"name" => "观堂镇", "code" => "411628111000"},
      %{"name" => "生铁冢镇", "code" => "411628112000"},
      %{"name" => "郑家集乡", "code" => "411628200000"},
      %{"name" => "赵村乡", "code" => "411628204000"},
      %{"name" => "任集乡", "code" => "411628205000"},
      %{"name" => "唐集乡", "code" => "411628206000"},
      %{"name" => "高集乡", "code" => "411628207000"},
      %{"name" => "邱集乡", "code" => "411628208000"},
      %{"name" => "穆店乡", "code" => "411628209000"}
    ]

  def next(input) when input == "太康县" or input == "411627",
    do: [
      %{"name" => "城关回族镇", "code" => "411627100000"},
      %{"name" => "常营镇", "code" => "411627101000"},
      %{"name" => "逊母口镇", "code" => "411627102000"},
      %{"name" => "老冢镇", "code" => "411627103000"},
      %{"name" => "朱口镇", "code" => "411627104000"},
      %{"name" => "马头镇", "code" => "411627105000"},
      %{"name" => "龙曲镇", "code" => "411627106000"},
      %{"name" => "板桥镇", "code" => "411627107000"},
      %{"name" => "符草楼镇", "code" => "411627108000"},
      %{"name" => "马厂镇", "code" => "411627109000"},
      %{"name" => "毛庄镇", "code" => "411627110000"},
      %{"name" => "张集镇", "code" => "411627111000"},
      %{"name" => "清集镇", "code" => "411627112000"},
      %{"name" => "大许寨镇", "code" => "411627113000"},
      %{"name" => "转楼镇", "code" => "411627114000"},
      %{"name" => "城郊乡", "code" => "411627200000"},
      %{"name" => "杨庙乡", "code" => "411627201000"},
      %{"name" => "王集乡", "code" => "411627202000"},
      %{"name" => "高贤乡", "code" => "411627203000"},
      %{"name" => "芝麻洼乡", "code" => "411627204000"},
      %{"name" => "独塘乡", "code" => "411627206000"},
      %{"name" => "五里口乡", "code" => "411627208000"},
      %{"name" => "高朗乡", "code" => "411627210000"}
    ]

  def next(input) when input == "郸城县" or input == "411625",
    do: [
      %{"name" => "洺南街道", "code" => "411625001000"},
      %{"name" => "洺北街道", "code" => "411625002000"},
      %{"name" => "新城街道", "code" => "411625003000"},
      %{"name" => "吴台镇", "code" => "411625101000"},
      %{"name" => "南丰镇", "code" => "411625102000"},
      %{"name" => "白马镇", "code" => "411625103000"},
      %{"name" => "宁平镇", "code" => "411625104000"},
      %{"name" => "宜路镇", "code" => "411625105000"},
      %{"name" => "钱店镇", "code" => "411625106000"},
      %{"name" => "汲冢镇", "code" => "411625107000"},
      %{"name" => "石槽镇", "code" => "411625108000"},
      %{"name" => "汲水镇", "code" => "411625109000"},
      %{"name" => "城郊乡", "code" => "411625200000"},
      %{"name" => "虎岗乡", "code" => "411625201000"},
      %{"name" => "张完集乡", "code" => "411625203000"},
      %{"name" => "丁村乡", "code" => "411625204000"},
      %{"name" => "双楼乡", "code" => "411625205000"},
      %{"name" => "秋渠乡", "code" => "411625206000"},
      %{"name" => "东风乡", "code" => "411625207000"},
      %{"name" => "巴集乡", "code" => "411625208000"},
      %{"name" => "李楼乡", "code" => "411625209000"},
      %{"name" => "胡集乡", "code" => "411625210000"}
    ]

  def next(input) when input == "沈丘县" or input == "411624",
    do: [
      %{"name" => "东城街道", "code" => "411624001000"},
      %{"name" => "北城街道", "code" => "411624002000"},
      %{"name" => "槐店回族镇", "code" => "411624100000"},
      %{"name" => "刘庄店镇", "code" => "411624101000"},
      %{"name" => "留福镇", "code" => "411624102000"},
      %{"name" => "老城镇", "code" => "411624103000"},
      %{"name" => "赵德营镇", "code" => "411624104000"},
      %{"name" => "付井镇", "code" => "411624105000"},
      %{"name" => "纸店镇", "code" => "411624106000"},
      %{"name" => "新安集镇", "code" => "411624107000"},
      %{"name" => "白集镇", "code" => "411624108000"},
      %{"name" => "刘湾镇", "code" => "411624109000"},
      %{"name" => "莲池镇", "code" => "411624110000"},
      %{"name" => "洪山镇", "code" => "411624111000"},
      %{"name" => "北杨集镇", "code" => "411624112000"},
      %{"name" => "邢庄镇", "code" => "411624113000"},
      %{"name" => "周营镇", "code" => "411624114000"},
      %{"name" => "冯营镇", "code" => "411624115000"},
      %{"name" => "石槽集乡", "code" => "411624201000"},
      %{"name" => "范营乡", "code" => "411624202000"},
      %{"name" => "李老庄乡", "code" => "411624203000"},
      %{"name" => "卞路口乡", "code" => "411624209000"}
    ]

  def next(input) when input == "商水县" or input == "411623",
    do: [
      %{"name" => "新城街道", "code" => "411623001000"},
      %{"name" => "东城街道", "code" => "411623002000"},
      %{"name" => "老城街道", "code" => "411623003000"},
      %{"name" => "阳城街道", "code" => "411623004000"},
      %{"name" => "黄寨镇", "code" => "411623101000"},
      %{"name" => "练集镇", "code" => "411623102000"},
      %{"name" => "魏集镇", "code" => "411623103000"},
      %{"name" => "固墙镇", "code" => "411623104000"},
      %{"name" => "白寺镇", "code" => "411623105000"},
      %{"name" => "巴村镇", "code" => "411623106000"},
      %{"name" => "谭庄镇", "code" => "411623107000"},
      %{"name" => "邓城镇", "code" => "411623108000"},
      %{"name" => "胡吉镇", "code" => "411623109000"},
      %{"name" => "郝岗镇", "code" => "411623110000"},
      %{"name" => "姚集镇", "code" => "411623111000"},
      %{"name" => "张庄镇", "code" => "411623112000"},
      %{"name" => "平店乡", "code" => "411623202000"},
      %{"name" => "袁老乡", "code" => "411623203000"},
      %{"name" => "化河乡", "code" => "411623204000"},
      %{"name" => "舒庄乡", "code" => "411623206000"},
      %{"name" => "大武乡", "code" => "411623207000"},
      %{"name" => "张明乡", "code" => "411623208000"},
      %{"name" => "汤庄乡", "code" => "411623211000"}
    ]

  def next(input) when input == "西华县" or input == "411622",
    do: [
      %{"name" => "娲城街道", "code" => "411622001000"},
      %{"name" => "箕子台街道", "code" => "411622002000"},
      %{"name" => "昆山街道", "code" => "411622003000"},
      %{"name" => "皮营街道", "code" => "411622004000"},
      %{"name" => "华泰街道", "code" => "411622005000"},
      %{"name" => "西夏亭镇", "code" => "411622101000"},
      %{"name" => "逍遥镇", "code" => "411622102000"},
      %{"name" => "奉母镇", "code" => "411622103000"},
      %{"name" => "红花集镇", "code" => "411622104000"},
      %{"name" => "聂堆镇", "code" => "411622105000"},
      %{"name" => "东夏亭镇", "code" => "411622106000"},
      %{"name" => "西华营镇", "code" => "411622107000"},
      %{"name" => "址坊镇", "code" => "411622108000"},
      %{"name" => "迟营镇", "code" => "411622109000"},
      %{"name" => "田口乡", "code" => "411622200000"},
      %{"name" => "清河驿乡", "code" => "411622201000"},
      %{"name" => "东王营乡", "code" => "411622203000"},
      %{"name" => "大王庄乡", "code" => "411622204000"},
      %{"name" => "李大庄乡", "code" => "411622205000"},
      %{"name" => "叶埠口乡", "code" => "411622206000"},
      %{"name" => "黄桥乡", "code" => "411622208000"},
      %{"name" => "艾岗乡", "code" => "411622209000"},
      %{"name" => "黄泛区农场", "code" => "411622405000"},
      %{"name" => "五二农场", "code" => "411622406000"}
    ]

  def next(input) when input == "扶沟县" or input == "411621",
    do: [
      %{"name" => "桐丘街道", "code" => "411621001000"},
      %{"name" => "扶亭街道", "code" => "411621003000"},
      %{"name" => "崔桥镇", "code" => "411621101000"},
      %{"name" => "江村镇", "code" => "411621102000"},
      %{"name" => "白潭镇", "code" => "411621103000"},
      %{"name" => "韭园镇", "code" => "411621104000"},
      %{"name" => "练寺镇", "code" => "411621105000"},
      %{"name" => "大新镇", "code" => "411621106000"},
      %{"name" => "包屯镇", "code" => "411621107000"},
      %{"name" => "汴岗镇", "code" => "411621108000"},
      %{"name" => "曹里乡", "code" => "411621200000"},
      %{"name" => "柴岗乡", "code" => "411621201000"},
      %{"name" => "固城乡", "code" => "411621202000"},
      %{"name" => "吕潭乡", "code" => "411621203000"},
      %{"name" => "大李庄乡", "code" => "411621204000"},
      %{"name" => "城郊乡", "code" => "411621205000"}
    ]

  def next(input) when input == "淮阳区" or input == "411603",
    do: [
      %{"name" => "柳湖街道", "code" => "411603001000"},
      %{"name" => "王店街道", "code" => "411603002000"},
      %{"name" => "城关回族镇", "code" => "411603100000"},
      %{"name" => "新站镇", "code" => "411603101000"},
      %{"name" => "鲁台镇", "code" => "411603102000"},
      %{"name" => "四通镇", "code" => "411603103000"},
      %{"name" => "临蔡镇", "code" => "411603104000"},
      %{"name" => "安岭镇", "code" => "411603105000"},
      %{"name" => "白楼镇", "code" => "411603106000"},
      %{"name" => "刘振屯镇", "code" => "411603107000"},
      %{"name" => "朱集乡", "code" => "411603200000"},
      %{"name" => "豆门乡", "code" => "411603201000"},
      %{"name" => "冯塘乡", "code" => "411603202000"},
      %{"name" => "大连乡", "code" => "411603205000"},
      %{"name" => "葛店乡", "code" => "411603206000"},
      %{"name" => "黄集乡", "code" => "411603207000"},
      %{"name" => "齐老乡", "code" => "411603209000"},
      %{"name" => "郑集乡", "code" => "411603210000"},
      %{"name" => "曹河乡", "code" => "411603211000"}
    ]

  def next(input) when input == "川汇区" or input == "411602",
    do: [
      %{"name" => "陈州街回族街道", "code" => "411602001000"},
      %{"name" => "七一路街道", "code" => "411602002000"},
      %{"name" => "荷花路街道", "code" => "411602003000"},
      %{"name" => "人和街街道", "code" => "411602004000"},
      %{"name" => "小桥街街道", "code" => "411602005000"},
      %{"name" => "城南街道", "code" => "411602006000"},
      %{"name" => "城北街道", "code" => "411602007000"},
      %{"name" => "文昌街道", "code" => "411602008000"},
      %{"name" => "搬口街道", "code" => "411602009000"},
      %{"name" => "金海路街道", "code" => "411602010000"},
      %{"name" => "许湾街道", "code" => "411602014000"},
      %{"name" => "华耀城街道", "code" => "411602015000"}
    ]

  def next(input) when input == "信阳高新技术产业开发区" or input == "411571",
    do: [
      %{"name" => "城东街道", "code" => "411571001000"},
      %{"name" => "珍珠路街道", "code" => "411571002000"}
    ]

  def next(input) when input == "息县" or input == "411528",
    do: [
      %{"name" => "谯楼街道", "code" => "411528001000"},
      %{"name" => "龙湖街道", "code" => "411528002000"},
      %{"name" => "淮河街道", "code" => "411528003000"},
      %{"name" => "包信镇", "code" => "411528101000"},
      %{"name" => "夏庄镇", "code" => "411528102000"},
      %{"name" => "东岳镇", "code" => "411528103000"},
      %{"name" => "项店镇", "code" => "411528104000"},
      %{"name" => "小茴店镇", "code" => "411528105000"},
      %{"name" => "曹黄林镇", "code" => "411528106000"},
      %{"name" => "孙庙乡", "code" => "411528201000"},
      %{"name" => "路口乡", "code" => "411528202000"},
      %{"name" => "彭店乡", "code" => "411528203000"},
      %{"name" => "杨店乡", "code" => "411528204000"},
      %{"name" => "张陶乡", "code" => "411528205000"},
      %{"name" => "白土店乡", "code" => "411528206000"},
      %{"name" => "岗李店乡", "code" => "411528207000"},
      %{"name" => "长陵乡", "code" => "411528208000"},
      %{"name" => "陈棚乡", "code" => "411528209000"},
      %{"name" => "临河乡", "code" => "411528210000"},
      %{"name" => "关店乡", "code" => "411528211000"},
      %{"name" => "八里岔乡", "code" => "411528214000"},
      %{"name" => "濮公山管理区", "code" => "411528400000"}
    ]

  def next(input) when input == "淮滨县" or input == "411527",
    do: [
      %{"name" => "顺河街道", "code" => "411527001000"},
      %{"name" => "滨湖街道", "code" => "411527002000"},
      %{"name" => "栏杆街道", "code" => "411527003000"},
      %{"name" => "桂花街道", "code" => "411527004000"},
      %{"name" => "马集镇", "code" => "411527101000"},
      %{"name" => "防胡镇", "code" => "411527103000"},
      %{"name" => "新里镇", "code" => "411527104000"},
      %{"name" => "期思镇", "code" => "411527105000"},
      %{"name" => "赵集镇", "code" => "411527106000"},
      %{"name" => "台头乡", "code" => "411527200000"},
      %{"name" => "王家岗乡", "code" => "411527201000"},
      %{"name" => "固城乡", "code" => "411527202000"},
      %{"name" => "三空桥乡", "code" => "411527203000"},
      %{"name" => "张里乡", "code" => "411527204000"},
      %{"name" => "邓湾乡", "code" => "411527206000"},
      %{"name" => "张庄乡", "code" => "411527207000"},
      %{"name" => "王店乡", "code" => "411527208000"},
      %{"name" => "谷堆乡", "code" => "411527209000"},
      %{"name" => "芦集乡", "code" => "411527212000"}
    ]

  def next(input) when input == "潢川县" or input == "411526",
    do: [
      %{"name" => "春申街道", "code" => "411526001000"},
      %{"name" => "定城街道", "code" => "411526002000"},
      %{"name" => "弋阳街道", "code" => "411526003000"},
      %{"name" => "老城街道", "code" => "411526004000"},
      %{"name" => "双柳树镇", "code" => "411526101000"},
      %{"name" => "伞陂镇", "code" => "411526102000"},
      %{"name" => "卜塔集镇", "code" => "411526103000"},
      %{"name" => "仁和镇", "code" => "411526105000"},
      %{"name" => "付店镇", "code" => "411526106000"},
      %{"name" => "踅孜镇", "code" => "411526107000"},
      %{"name" => "桃林铺镇", "code" => "411526108000"},
      %{"name" => "黄寺岗镇", "code" => "411526109000"},
      %{"name" => "江家集镇", "code" => "411526110000"},
      %{"name" => "魏岗镇", "code" => "411526111000"},
      %{"name" => "传流店乡", "code" => "411526201000"},
      %{"name" => "张集乡", "code" => "411526203000"},
      %{"name" => "来龙乡", "code" => "411526204000"},
      %{"name" => "隆古乡", "code" => "411526205000"},
      %{"name" => "谈店乡", "code" => "411526206000"},
      %{"name" => "上油岗乡", "code" => "411526207000"},
      %{"name" => "白店乡", "code" => "411526209000"},
      %{"name" => "黄湖农场", "code" => "411526400000"},
      %{"name" => "河南省潢川经济技术开发区", "code" => "411526560000"}
    ]

  def next(input) when input == "固始县" or input == "411525",
    do: [
      %{"name" => "蓼城街道", "code" => "411525001000"},
      %{"name" => "番城街道", "code" => "411525002000"},
      %{"name" => "秀水街道", "code" => "411525003000"},
      %{"name" => "陈淋子镇", "code" => "411525101000"},
      %{"name" => "黎集镇", "code" => "411525102000"},
      %{"name" => "蒋集镇", "code" => "411525103000"},
      %{"name" => "往流镇", "code" => "411525104000"},
      %{"name" => "郭陆滩镇", "code" => "411525105000"},
      %{"name" => "胡族铺镇", "code" => "411525106000"},
      %{"name" => "方集镇", "code" => "411525107000"},
      %{"name" => "三河尖镇", "code" => "411525108000"},
      %{"name" => "段集镇", "code" => "411525109000"},
      %{"name" => "汪棚镇", "code" => "411525110000"},
      %{"name" => "张广庙镇", "code" => "411525111000"},
      %{"name" => "陈集镇", "code" => "411525112000"},
      %{"name" => "武庙集镇", "code" => "411525113000"},
      %{"name" => "分水亭镇", "code" => "411525114000"},
      %{"name" => "石佛店镇", "code" => "411525115000"},
      %{"name" => "泉河铺镇", "code" => "411525116000"},
      %{"name" => "祖师庙镇", "code" => "411525117000"},
      %{"name" => "李店镇", "code" => "411525118000"},
      %{"name" => "沙河铺镇", "code" => "411525119000"},
      %{"name" => "徐集镇", "code" => "411525120000"},
      %{"name" => "洪埠乡", "code" => "411525201000"},
      %{"name" => "杨集乡", "code" => "411525202000"},
      %{"name" => "马堽集乡", "code" => "411525203000"},
      %{"name" => "草庙集乡", "code" => "411525204000"},
      %{"name" => "南大桥乡", "code" => "411525206000"},
      %{"name" => "赵岗乡", "code" => "411525208000"},
      %{"name" => "张老埠乡", "code" => "411525211000"},
      %{"name" => "丰港乡", "code" => "411525222000"},
      %{"name" => "柳树店乡", "code" => "411525223000"},
      %{"name" => "观堂乡", "code" => "411525224000"}
    ]

  def next(input) when input == "商城县" or input == "411524",
    do: [
      %{"name" => "赤城街道", "code" => "411524001000"},
      %{"name" => "鲇鱼山街道", "code" => "411524002000"},
      %{"name" => "上石桥镇", "code" => "411524101000"},
      %{"name" => "鄢岗镇", "code" => "411524102000"},
      %{"name" => "双椿铺镇", "code" => "411524103000"},
      %{"name" => "汪桥镇", "code" => "411524104000"},
      %{"name" => "余集镇", "code" => "411524105000"},
      %{"name" => "达权店镇", "code" => "411524106000"},
      %{"name" => "丰集镇", "code" => "411524107000"},
      %{"name" => "汪岗镇", "code" => "411524108000"},
      %{"name" => "观庙镇", "code" => "411524109000"},
      %{"name" => "金刚台镇", "code" => "411524110000"},
      %{"name" => "河凤桥乡", "code" => "411524203000"},
      %{"name" => "李集乡", "code" => "411524204000"},
      %{"name" => "苏仙石乡", "code" => "411524207000"},
      %{"name" => "伏山乡", "code" => "411524209000"},
      %{"name" => "吴河乡", "code" => "411524212000"},
      %{"name" => "冯店乡", "code" => "411524213000"},
      %{"name" => "长竹园乡", "code" => "411524215000"},
      %{"name" => "汤泉池管理处", "code" => "411524400000"}
    ]

  def next(input) when input == "新县" or input == "411523",
    do: [
      %{"name" => "金兰山街道", "code" => "411523001000"},
      %{"name" => "新集镇", "code" => "411523100000"},
      %{"name" => "沙窝镇", "code" => "411523101000"},
      %{"name" => "吴陈河镇", "code" => "411523103000"},
      %{"name" => "苏河镇", "code" => "411523104000"},
      %{"name" => "八里畈镇", "code" => "411523105000"},
      %{"name" => "周河乡", "code" => "411523201000"},
      %{"name" => "陡山河乡", "code" => "411523202000"},
      %{"name" => "浒湾乡", "code" => "411523203000"},
      %{"name" => "千斤乡", "code" => "411523204000"},
      %{"name" => "卡房乡", "code" => "411523205000"},
      %{"name" => "郭家河乡", "code" => "411523206000"},
      %{"name" => "陈店乡", "code" => "411523207000"},
      %{"name" => "箭厂河乡", "code" => "411523208000"},
      %{"name" => "泗店乡", "code" => "411523209000"},
      %{"name" => "田铺乡", "code" => "411523210000"}
    ]

  def next(input) when input == "光山县" or input == "411522",
    do: [
      %{"name" => "弦山街道", "code" => "411522001000"},
      %{"name" => "紫水街道", "code" => "411522002000"},
      %{"name" => "十里镇", "code" => "411522101000"},
      %{"name" => "寨河镇", "code" => "411522102000"},
      %{"name" => "孙铁铺镇", "code" => "411522103000"},
      %{"name" => "马畈镇", "code" => "411522104000"},
      %{"name" => "泼陂河镇", "code" => "411522105000"},
      %{"name" => "白雀园镇", "code" => "411522106000"},
      %{"name" => "砖桥镇", "code" => "411522107000"},
      %{"name" => "仙居乡", "code" => "411522201000"},
      %{"name" => "北向店乡", "code" => "411522203000"},
      %{"name" => "罗陈乡", "code" => "411522204000"},
      %{"name" => "殷棚乡", "code" => "411522206000"},
      %{"name" => "南向店乡", "code" => "411522207000"},
      %{"name" => "晏河乡", "code" => "411522208000"},
      %{"name" => "凉亭乡", "code" => "411522210000"},
      %{"name" => "斛山乡", "code" => "411522212000"},
      %{"name" => "槐店乡", "code" => "411522213000"},
      %{"name" => "文殊乡", "code" => "411522215000"}
    ]

  def next(input) when input == "罗山县" or input == "411521",
    do: [
      %{"name" => "丽水街道", "code" => "411521001000"},
      %{"name" => "宝城街道", "code" => "411521002000"},
      %{"name" => "龙山街道", "code" => "411521003000"},
      %{"name" => "周党镇", "code" => "411521101000"},
      %{"name" => "竹竿镇", "code" => "411521102000"},
      %{"name" => "灵山镇", "code" => "411521103000"},
      %{"name" => "子路镇", "code" => "411521104000"},
      %{"name" => "楠杆镇", "code" => "411521105000"},
      %{"name" => "青山镇", "code" => "411521106000"},
      %{"name" => "潘新镇", "code" => "411521107000"},
      %{"name" => "彭新镇", "code" => "411521108000"},
      %{"name" => "莽张镇", "code" => "411521109000"},
      %{"name" => "东卜镇", "code" => "411521110000"},
      %{"name" => "铁铺镇", "code" => "411521111000"},
      %{"name" => "庙仙乡", "code" => "411521202000"},
      %{"name" => "定远乡", "code" => "411521204000"},
      %{"name" => "山店乡", "code" => "411521205000"},
      %{"name" => "朱堂乡", "code" => "411521207000"},
      %{"name" => "尤店乡", "code" => "411521208000"},
      %{"name" => "高店乡", "code" => "411521209000"},
      %{"name" => "河南省五一农场", "code" => "411521400000"}
    ]

  def next(input) when input == "平桥区" or input == "411503",
    do: [
      %{"name" => "羊山街道", "code" => "411503001000"},
      %{"name" => "前进街道", "code" => "411503002000"},
      %{"name" => "南京路街道", "code" => "411503003000"},
      %{"name" => "平桥街道", "code" => "411503004000"},
      %{"name" => "甘岸街道", "code" => "411503005000"},
      %{"name" => "五里店街道", "code" => "411503006000"},
      %{"name" => "平西街道", "code" => "411503007000"},
      %{"name" => "平东街道", "code" => "411503008000"},
      %{"name" => "震雷山街道", "code" => "411503009000"},
      %{"name" => "明港镇", "code" => "411503101000"},
      %{"name" => "五里镇", "code" => "411503102000"},
      %{"name" => "邢集镇", "code" => "411503103000"},
      %{"name" => "平昌镇", "code" => "411503105000"},
      %{"name" => "洋河镇", "code" => "411503106000"},
      %{"name" => "肖王镇", "code" => "411503107000"},
      %{"name" => "龙井乡", "code" => "411503202000"},
      %{"name" => "胡店乡", "code" => "411503203000"},
      %{"name" => "彭家湾乡", "code" => "411503205000"},
      %{"name" => "长台乡", "code" => "411503206000"},
      %{"name" => "肖店乡", "code" => "411503207000"},
      %{"name" => "王岗乡", "code" => "411503209000"},
      %{"name" => "高粱店乡", "code" => "411503210000"},
      %{"name" => "查山乡", "code" => "411503211000"},
      %{"name" => "土城街道", "code" => "411503400000"},
      %{"name" => "明港工业管理区", "code" => "411503401000"},
      %{"name" => "城阳城址保护区", "code" => "411503404000"},
      %{"name" => "龙飞山街道", "code" => "411503405000"},
      %{"name" => "北湖风景管理区", "code" => "411503406000"},
      %{"name" => "农村改革发展综合试验核心区", "code" => "411503408000"},
      %{"name" => "信阳国际家居产业小镇", "code" => "411503410000"}
    ]

  def next(input) when input == "浉河区" or input == "411502",
    do: [
      %{"name" => "老城街道", "code" => "411502001000"},
      %{"name" => "民权街道", "code" => "411502002000"},
      %{"name" => "车站街道", "code" => "411502003000"},
      %{"name" => "五里墩街道", "code" => "411502004000"},
      %{"name" => "五星街道", "code" => "411502005000"},
      %{"name" => "湖东街道", "code" => "411502006000"},
      %{"name" => "南湾街道", "code" => "411502007000"},
      %{"name" => "金牛山街道", "code" => "411502008000"},
      %{"name" => "双井街道", "code" => "411502009000"},
      %{"name" => "贤山街道", "code" => "411502010000"},
      %{"name" => "李家寨镇", "code" => "411502100000"},
      %{"name" => "吴家店镇", "code" => "411502101000"},
      %{"name" => "东双河镇", "code" => "411502102000"},
      %{"name" => "董家河镇", "code" => "411502103000"},
      %{"name" => "浉河港镇", "code" => "411502104000"},
      %{"name" => "游河乡", "code" => "411502203000"},
      %{"name" => "谭家河乡", "code" => "411502206000"},
      %{"name" => "柳林乡", "code" => "411502207000"},
      %{"name" => "十三里桥乡", "code" => "411502208000"}
    ]

  def next(input) when input == "永城市" or input == "411481",
    do: [
      %{"name" => "演集街道", "code" => "411481001000"},
      %{"name" => "崇法寺街道", "code" => "411481002000"},
      %{"name" => "侯岭街道", "code" => "411481003000"},
      %{"name" => "沱滨街道", "code" => "411481004000"},
      %{"name" => "日月湖街道", "code" => "411481005000"},
      %{"name" => "雪枫街道", "code" => "411481006000"},
      %{"name" => "芒山镇", "code" => "411481102000"},
      %{"name" => "高庄镇", "code" => "411481103000"},
      %{"name" => "酂城镇", "code" => "411481104000"},
      %{"name" => "裴桥镇", "code" => "411481105000"},
      %{"name" => "马桥镇", "code" => "411481106000"},
      %{"name" => "薛湖镇", "code" => "411481107000"},
      %{"name" => "蒋口镇", "code" => "411481108000"},
      %{"name" => "陈集镇", "code" => "411481109000"},
      %{"name" => "十八里镇", "code" => "411481110000"},
      %{"name" => "太丘镇", "code" => "411481111000"},
      %{"name" => "李寨镇", "code" => "411481112000"},
      %{"name" => "苗桥镇", "code" => "411481113000"},
      %{"name" => "顺和镇", "code" => "411481114000"},
      %{"name" => "茴村镇", "code" => "411481115000"},
      %{"name" => "酂阳镇", "code" => "411481116000"},
      %{"name" => "龙岗镇", "code" => "411481117000"},
      %{"name" => "马牧镇", "code" => "411481118000"},
      %{"name" => "大王集镇", "code" => "411481119000"},
      %{"name" => "刘河镇", "code" => "411481120000"},
      %{"name" => "双桥镇", "code" => "411481121000"},
      %{"name" => "卧龙镇", "code" => "411481122000"},
      %{"name" => "黄口镇", "code" => "411481123000"},
      %{"name" => "新桥镇", "code" => "411481124000"},
      %{"name" => "条河镇", "code" => "411481125000"},
      %{"name" => "陈官庄乡", "code" => "411481219000"}
    ]

  def next(input) when input == "河南商丘经济开发区" or input == "411472",
    do: [
      %{"name" => "平台街道", "code" => "411472009000"},
      %{"name" => "平安街道", "code" => "411472010000"},
      %{"name" => "周集乡", "code" => "411472200000"}
    ]

  def next(input) when input == "豫东综合物流产业聚集区" or input == "411471",
    do: [
      %{"name" => "中州街道", "code" => "411471001000"},
      %{"name" => "张阁镇", "code" => "411471100000"},
      %{"name" => "贾寨镇", "code" => "411471101000"}
    ]

  def next(input) when input == "夏邑县" or input == "411426",
    do: [
      %{"name" => "城关镇", "code" => "411426100000"},
      %{"name" => "会亭镇", "code" => "411426101000"},
      %{"name" => "马头镇", "code" => "411426102000"},
      %{"name" => "济阳镇", "code" => "411426103000"},
      %{"name" => "李集镇", "code" => "411426104000"},
      %{"name" => "车站镇", "code" => "411426105000"},
      %{"name" => "杨集镇", "code" => "411426106000"},
      %{"name" => "韩道口镇", "code" => "411426107000"},
      %{"name" => "太平镇", "code" => "411426108000"},
      %{"name" => "罗庄镇", "code" => "411426109000"},
      %{"name" => "火店镇", "code" => "411426110000"},
      %{"name" => "北岭镇", "code" => "411426111000"},
      %{"name" => "郭店镇", "code" => "411426112000"},
      %{"name" => "曹集乡", "code" => "411426200000"},
      %{"name" => "胡桥乡", "code" => "411426201000"},
      %{"name" => "歧河乡", "code" => "411426202000"},
      %{"name" => "业庙乡", "code" => "411426204000"},
      %{"name" => "中峰乡", "code" => "411426205000"},
      %{"name" => "桑堌乡", "code" => "411426207000"},
      %{"name" => "何营乡", "code" => "411426208000"},
      %{"name" => "王集乡", "code" => "411426210000"},
      %{"name" => "刘店集乡", "code" => "411426211000"},
      %{"name" => "骆集乡", "code" => "411426212000"},
      %{"name" => "孔庄乡", "code" => "411426214000"}
    ]

  def next(input) when input == "虞城县" or input == "411425",
    do: [
      %{"name" => "城关镇", "code" => "411425100000"},
      %{"name" => "界沟镇", "code" => "411425101000"},
      %{"name" => "木兰镇", "code" => "411425102000"},
      %{"name" => "杜集镇", "code" => "411425103000"},
      %{"name" => "谷熟镇", "code" => "411425104000"},
      %{"name" => "大杨集镇", "code" => "411425105000"},
      %{"name" => "利民镇", "code" => "411425107000"},
      %{"name" => "张集镇", "code" => "411425108000"},
      %{"name" => "站集镇", "code" => "411425109000"},
      %{"name" => "稍岗镇", "code" => "411425110000"},
      %{"name" => "乔集镇", "code" => "411425111000"},
      %{"name" => "大候镇", "code" => "411425112000"},
      %{"name" => "黄冢乡", "code" => "411425200000"},
      %{"name" => "沙集乡", "code" => "411425201000"},
      %{"name" => "店集乡", "code" => "411425202000"},
      %{"name" => "闻集乡", "code" => "411425204000"},
      %{"name" => "芒种桥乡", "code" => "411425205000"},
      %{"name" => "刘店乡", "code" => "411425207000"},
      %{"name" => "城郊乡", "code" => "411425210000"},
      %{"name" => "郑集乡", "code" => "411425211000"},
      %{"name" => "李老家乡", "code" => "411425212000"},
      %{"name" => "镇里堌乡", "code" => "411425214000"},
      %{"name" => "古王集乡", "code" => "411425215000"},
      %{"name" => "刘集乡", "code" => "411425219000"},
      %{"name" => "田庙乡", "code" => "411425221000"}
    ]

  def next(input) when input == "柘城县" or input == "411424",
    do: [
      %{"name" => "凤凰街道", "code" => "411424001000"},
      %{"name" => "浦东街道", "code" => "411424002000"},
      %{"name" => "春水街道", "code" => "411424003000"},
      %{"name" => "双河街道", "code" => "411424004000"},
      %{"name" => "陈青集镇", "code" => "411424101000"},
      %{"name" => "起台镇", "code" => "411424102000"},
      %{"name" => "胡襄镇", "code" => "411424103000"},
      %{"name" => "慈圣镇", "code" => "411424104000"},
      %{"name" => "安平镇", "code" => "411424105000"},
      %{"name" => "远襄镇", "code" => "411424106000"},
      %{"name" => "岗王镇", "code" => "411424107000"},
      %{"name" => "伯岗镇", "code" => "411424108000"},
      %{"name" => "张桥镇", "code" => "411424109000"},
      %{"name" => "老王集镇", "code" => "411424110000"},
      %{"name" => "朱襄镇", "code" => "411424111000"},
      %{"name" => "洪恩乡", "code" => "411424203000"},
      %{"name" => "马集乡", "code" => "411424206000"},
      %{"name" => "牛城乡", "code" => "411424207000"},
      %{"name" => "惠济乡", "code" => "411424208000"},
      %{"name" => "申桥乡", "code" => "411424212000"},
      %{"name" => "李原乡", "code" => "411424213000"},
      %{"name" => "皇集乡", "code" => "411424214000"}
    ]

  def next(input) when input == "宁陵县" or input == "411423",
    do: [
      %{"name" => "城关回族镇", "code" => "411423100000"},
      %{"name" => "张弓镇", "code" => "411423101000"},
      %{"name" => "柳河镇", "code" => "411423102000"},
      %{"name" => "逻岗镇", "code" => "411423103000"},
      %{"name" => "石桥镇", "code" => "411423104000"},
      %{"name" => "黄岗镇", "code" => "411423105000"},
      %{"name" => "华堡镇", "code" => "411423106000"},
      %{"name" => "刘楼乡", "code" => "411423203000"},
      %{"name" => "程楼乡", "code" => "411423204000"},
      %{"name" => "乔楼乡", "code" => "411423205000"},
      %{"name" => "城郊乡", "code" => "411423206000"},
      %{"name" => "阳驿乡", "code" => "411423207000"},
      %{"name" => "孔集乡", "code" => "411423209000"},
      %{"name" => "赵村乡", "code" => "411423210000"}
    ]

  def next(input) when input == "睢县" or input == "411422",
    do: [
      %{"name" => "凤城街道", "code" => "411422001000"},
      %{"name" => "董店街道", "code" => "411422002000"},
      %{"name" => "长岗镇", "code" => "411422100000"},
      %{"name" => "平岗镇", "code" => "411422101000"},
      %{"name" => "周堂镇", "code" => "411422102000"},
      %{"name" => "蓼堤镇", "code" => "411422103000"},
      %{"name" => "西陵寺镇", "code" => "411422104000"},
      %{"name" => "城关镇", "code" => "411422105000"},
      %{"name" => "潮庄镇", "code" => "411422106000"},
      %{"name" => "尚屯镇", "code" => "411422107000"},
      %{"name" => "后台乡", "code" => "411422200000"},
      %{"name" => "河集乡", "code" => "411422202000"},
      %{"name" => "孙聚寨乡", "code" => "411422203000"},
      %{"name" => "白楼乡", "code" => "411422204000"},
      %{"name" => "河堤乡", "code" => "411422205000"},
      %{"name" => "白庙乡", "code" => "411422206000"},
      %{"name" => "胡堂乡", "code" => "411422207000"},
      %{"name" => "尤吉屯乡", "code" => "411422208000"},
      %{"name" => "涧岗乡", "code" => "411422211000"},
      %{"name" => "匡城乡", "code" => "411422213000"}
    ]

  def next(input) when input == "民权县" or input == "411421",
    do: [
      %{"name" => "绿洲街道", "code" => "411421001000"},
      %{"name" => "南华街道", "code" => "411421002000"},
      %{"name" => "人和镇", "code" => "411421101000"},
      %{"name" => "龙塘镇", "code" => "411421102000"},
      %{"name" => "北关镇", "code" => "411421103000"},
      %{"name" => "程庄镇", "code" => "411421104000"},
      %{"name" => "王庄寨镇", "code" => "411421105000"},
      %{"name" => "孙六镇", "code" => "411421106000"},
      %{"name" => "白云寺镇", "code" => "411421107000"},
      %{"name" => "王桥镇", "code" => "411421108000"},
      %{"name" => "庄子镇", "code" => "411421109000"},
      %{"name" => "双塔镇", "code" => "411421110000"},
      %{"name" => "野岗镇", "code" => "411421111000"},
      %{"name" => "伯党乡", "code" => "411421200000"},
      %{"name" => "花园乡", "code" => "411421201000"},
      %{"name" => "林七乡", "code" => "411421206000"},
      %{"name" => "胡集乡", "code" => "411421207000"},
      %{"name" => "禇庙乡", "code" => "411421208000"},
      %{"name" => "老颜集乡", "code" => "411421210000"},
      %{"name" => "商丘市农场", "code" => "411421400000"},
      %{"name" => "商丘市林场", "code" => "411421401000"}
    ]

  def next(input) when input == "睢阳区" or input == "411403",
    do: [
      %{"name" => "古城街道", "code" => "411403001000"},
      %{"name" => "文化街道", "code" => "411403002000"},
      %{"name" => "东方街道", "code" => "411403003000"},
      %{"name" => "新城街道", "code" => "411403004000"},
      %{"name" => "宋城街道", "code" => "411403006000"},
      %{"name" => "古宋街道", "code" => "411403007000"},
      %{"name" => "宋集镇", "code" => "411403100000"},
      %{"name" => "郭村镇", "code" => "411403101000"},
      %{"name" => "李口镇", "code" => "411403102000"},
      %{"name" => "高辛镇", "code" => "411403103000"},
      %{"name" => "坞墙镇", "code" => "411403104000"},
      %{"name" => "冯桥镇", "code" => "411403105000"},
      %{"name" => "路河镇", "code" => "411403106000"},
      %{"name" => "闫集镇", "code" => "411403107000"},
      %{"name" => "毛固堆镇", "code" => "411403108000"},
      %{"name" => "包公庙镇", "code" => "411403110000"},
      %{"name" => "临河店镇", "code" => "411403111000"},
      %{"name" => "娄店乡", "code" => "411403205000"},
      %{"name" => "勒马乡", "code" => "411403208000"}
    ]

  def next(input) when input == "梁园区" or input == "411402",
    do: [
      %{"name" => "平原街道", "code" => "411402001000"},
      %{"name" => "长征街道", "code" => "411402002000"},
      %{"name" => "前进街道", "code" => "411402003000"},
      %{"name" => "白云街道", "code" => "411402004000"},
      %{"name" => "东风街道", "code" => "411402005000"},
      %{"name" => "八八街道", "code" => "411402006000"},
      %{"name" => "建设街道", "code" => "411402007000"},
      %{"name" => "解放街道", "code" => "411402011000"},
      %{"name" => "陇海街道", "code" => "411402012000"},
      %{"name" => "谢集镇", "code" => "411402100000"},
      %{"name" => "双八镇", "code" => "411402101000"},
      %{"name" => "观堂镇", "code" => "411402103000"},
      %{"name" => "刘口镇", "code" => "411402104000"},
      %{"name" => "水池铺镇", "code" => "411402105000"},
      %{"name" => "李庄镇", "code" => "411402106000"},
      %{"name" => "王楼乡", "code" => "411402203000"},
      %{"name" => "孙福集乡", "code" => "411402205000"}
    ]

  def next(input) when input == "邓州市" or input == "411381",
    do: [
      %{"name" => "古城街道", "code" => "411381001000"},
      %{"name" => "花洲街道", "code" => "411381002000"},
      %{"name" => "湍河街道", "code" => "411381003000"},
      %{"name" => "罗庄镇", "code" => "411381102000"},
      %{"name" => "汲滩镇", "code" => "411381103000"},
      %{"name" => "穰东镇", "code" => "411381104000"},
      %{"name" => "孟楼镇", "code" => "411381105000"},
      %{"name" => "林扒镇", "code" => "411381106000"},
      %{"name" => "构林镇", "code" => "411381107000"},
      %{"name" => "十林镇", "code" => "411381108000"},
      %{"name" => "张村镇", "code" => "411381109000"},
      %{"name" => "都司镇", "code" => "411381110000"},
      %{"name" => "赵集镇", "code" => "411381111000"},
      %{"name" => "刘集镇", "code" => "411381112000"},
      %{"name" => "桑庄镇", "code" => "411381113000"},
      %{"name" => "彭桥镇", "code" => "411381114000"},
      %{"name" => "白牛镇", "code" => "411381115000"},
      %{"name" => "腰店镇", "code" => "411381116000"},
      %{"name" => "九龙镇", "code" => "411381117000"},
      %{"name" => "文渠镇", "code" => "411381118000"},
      %{"name" => "高集镇", "code" => "411381119000"},
      %{"name" => "夏集镇", "code" => "411381120000"},
      %{"name" => "陶营镇", "code" => "411381121000"},
      %{"name" => "小杨营镇", "code" => "411381122000"},
      %{"name" => "张楼乡", "code" => "411381301000"},
      %{"name" => "裴营乡", "code" => "411381305000"},
      %{"name" => "龙堰乡", "code" => "411381319000"},
      %{"name" => "南阳市黄牛良种繁育场", "code" => "411381400000"},
      %{"name" => "杏山旅游管理区", "code" => "411381560000"}
    ]

  def next(input) when input == "南阳市城乡一体化示范区" or input == "411372",
    do: [
      %{"name" => "白河街道", "code" => "411372005000"},
      %{"name" => "枣林街道", "code" => "411372006000"},
      %{"name" => "姜营街道", "code" => "411372007000"},
      %{"name" => "新店乡", "code" => "411372306000"}
    ]

  def next(input) when input == "南阳高新技术产业开发区" or input == "411371",
    do: [
      %{"name" => "南阳高新区张衡街道", "code" => "411371060000"},
      %{"name" => "南阳高新区百里奚街道", "code" => "411371061000"},
      %{"name" => "中关村南阳科技产业园", "code" => "411371401000"}
    ]

  def next(input) when input == "桐柏县" or input == "411330",
    do: [
      %{"name" => "城关镇", "code" => "411330100000"},
      %{"name" => "月河镇", "code" => "411330101000"},
      %{"name" => "吴城镇", "code" => "411330102000"},
      %{"name" => "固县镇", "code" => "411330103000"},
      %{"name" => "毛集镇", "code" => "411330104000"},
      %{"name" => "大河镇", "code" => "411330105000"},
      %{"name" => "埠江镇", "code" => "411330106000"},
      %{"name" => "平氏镇", "code" => "411330107000"},
      %{"name" => "淮源镇", "code" => "411330108000"},
      %{"name" => "黄岗镇", "code" => "411330109000"},
      %{"name" => "安棚镇", "code" => "411330110000"},
      %{"name" => "朱庄镇", "code" => "411330111000"},
      %{"name" => "程湾镇", "code" => "411330112000"},
      %{"name" => "城郊乡", "code" => "411330300000"},
      %{"name" => "回龙乡", "code" => "411330301000"},
      %{"name" => "新集乡", "code" => "411330306000"}
    ]

  def next(input) when input == "新野县" or input == "411329",
    do: [
      %{"name" => "汉城街道", "code" => "411329001000"},
      %{"name" => "汉华街道", "code" => "411329002000"},
      %{"name" => "王庄镇", "code" => "411329101000"},
      %{"name" => "沙堰镇", "code" => "411329102000"},
      %{"name" => "新甸铺镇", "code" => "411329103000"},
      %{"name" => "施庵镇", "code" => "411329104000"},
      %{"name" => "歪子镇", "code" => "411329105000"},
      %{"name" => "五星镇", "code" => "411329106000"},
      %{"name" => "溧河铺镇", "code" => "411329107000"},
      %{"name" => "王集镇", "code" => "411329108000"},
      %{"name" => "城郊乡", "code" => "411329300000"},
      %{"name" => "前高庙乡", "code" => "411329303000"},
      %{"name" => "樊集乡", "code" => "411329305000"},
      %{"name" => "上庄乡", "code" => "411329307000"},
      %{"name" => "上港乡", "code" => "411329309000"}
    ]

  def next(input) when input == "唐河县" or input == "411328",
    do: [
      %{"name" => "滨河街道", "code" => "411328001000"},
      %{"name" => "文峰街道", "code" => "411328002000"},
      %{"name" => "东兴街道", "code" => "411328003000"},
      %{"name" => "兴唐街道", "code" => "411328004000"},
      %{"name" => "泗洲街道", "code" => "411328005000"},
      %{"name" => "源潭镇", "code" => "411328101000"},
      %{"name" => "张店镇", "code" => "411328102000"},
      %{"name" => "郭滩镇", "code" => "411328103000"},
      %{"name" => "湖阳镇", "code" => "411328104000"},
      %{"name" => "黑龙镇", "code" => "411328105000"},
      %{"name" => "大河屯镇", "code" => "411328106000"},
      %{"name" => "龙潭镇", "code" => "411328107000"},
      %{"name" => "桐寨铺镇", "code" => "411328108000"},
      %{"name" => "苍台镇", "code" => "411328109000"},
      %{"name" => "上屯镇", "code" => "411328110000"},
      %{"name" => "毕店镇", "code" => "411328111000"},
      %{"name" => "少拜寺镇", "code" => "411328112000"},
      %{"name" => "祁仪镇", "code" => "411328113000"},
      %{"name" => "马振抚镇", "code" => "411328114000"},
      %{"name" => "城郊乡", "code" => "411328300000"},
      %{"name" => "桐河乡", "code" => "411328301000"},
      %{"name" => "昝岗乡", "code" => "411328306000"},
      %{"name" => "古城乡", "code" => "411328309000"},
      %{"name" => "东王集乡", "code" => "411328311000"}
    ]

  def next(input) when input == "社旗县" or input == "411327",
    do: [
      %{"name" => "赵河街道", "code" => "411327001000"},
      %{"name" => "潘河街道", "code" => "411327002000"},
      %{"name" => "赊店镇", "code" => "411327100000"},
      %{"name" => "桥头镇", "code" => "411327101000"},
      %{"name" => "饶良镇", "code" => "411327103000"},
      %{"name" => "兴隆镇", "code" => "411327104000"},
      %{"name" => "晋庄镇", "code" => "411327105000"},
      %{"name" => "李店镇", "code" => "411327106000"},
      %{"name" => "苗店镇", "code" => "411327107000"},
      %{"name" => "郝寨镇", "code" => "411327108000"},
      %{"name" => "朱集镇", "code" => "411327109000"},
      %{"name" => "下洼镇", "code" => "411327110000"},
      %{"name" => "太和镇", "code" => "411327111000"},
      %{"name" => "大冯营镇", "code" => "411327112000"},
      %{"name" => "陌陂镇", "code" => "411327113000"},
      %{"name" => "唐庄乡", "code" => "411327313000"}
    ]

  def next(input) when input == "淅川县" or input == "411326",
    do: [
      %{"name" => "龙城街道", "code" => "411326001000"},
      %{"name" => "商圣街道", "code" => "411326002000"},
      %{"name" => "荆紫关镇", "code" => "411326101000"},
      %{"name" => "老城镇", "code" => "411326102000"},
      %{"name" => "香花镇", "code" => "411326103000"},
      %{"name" => "厚坡镇", "code" => "411326104000"},
      %{"name" => "丹阳镇", "code" => "411326105000"},
      %{"name" => "盛湾镇", "code" => "411326106000"},
      %{"name" => "金河镇", "code" => "411326107000"},
      %{"name" => "寺湾镇", "code" => "411326108000"},
      %{"name" => "仓房镇", "code" => "411326109000"},
      %{"name" => "上集镇", "code" => "411326110000"},
      %{"name" => "马蹬镇", "code" => "411326111000"},
      %{"name" => "西簧乡", "code" => "411326301000"},
      %{"name" => "毛堂乡", "code" => "411326302000"},
      %{"name" => "大石桥乡", "code" => "411326303000"},
      %{"name" => "滔河乡", "code" => "411326304000"}
    ]

  def next(input) when input == "内乡县" or input == "411325",
    do: [
      %{"name" => "城关镇", "code" => "411325100000"},
      %{"name" => "夏馆镇", "code" => "411325101000"},
      %{"name" => "师岗镇", "code" => "411325102000"},
      %{"name" => "马山口镇", "code" => "411325103000"},
      %{"name" => "湍东镇", "code" => "411325104000"},
      %{"name" => "赤眉镇", "code" => "411325105000"},
      %{"name" => "瓦亭镇", "code" => "411325106000"},
      %{"name" => "王店镇", "code" => "411325107000"},
      %{"name" => "灌涨镇", "code" => "411325108000"},
      %{"name" => "桃溪镇", "code" => "411325109000"},
      %{"name" => "岞岖镇", "code" => "411325110000"},
      %{"name" => "余关镇", "code" => "411325111000"},
      %{"name" => "板场乡", "code" => "411325300000"},
      %{"name" => "大桥乡", "code" => "411325301000"},
      %{"name" => "赵店乡", "code" => "411325302000"},
      %{"name" => "七里坪乡", "code" => "411325306000"}
    ]

  def next(input) when input == "镇平县" or input == "411324",
    do: [
      %{"name" => "涅阳街道", "code" => "411324001000"},
      %{"name" => "雪枫街道", "code" => "411324002000"},
      %{"name" => "玉都街道", "code" => "411324003000"},
      %{"name" => "石佛寺镇", "code" => "411324101000"},
      %{"name" => "晁陂镇", "code" => "411324102000"},
      %{"name" => "贾宋镇", "code" => "411324103000"},
      %{"name" => "侯集镇", "code" => "411324104000"},
      %{"name" => "老庄镇", "code" => "411324105000"},
      %{"name" => "卢医镇", "code" => "411324106000"},
      %{"name" => "遮山镇", "code" => "411324107000"},
      %{"name" => "高丘镇", "code" => "411324108000"},
      %{"name" => "曲屯镇", "code" => "411324109000"},
      %{"name" => "枣园镇", "code" => "411324110000"},
      %{"name" => "杨营镇", "code" => "411324111000"},
      %{"name" => "安字营镇", "code" => "411324112000"},
      %{"name" => "张林镇", "code" => "411324113000"},
      %{"name" => "柳泉铺镇", "code" => "411324114000"},
      %{"name" => "彭营镇", "code" => "411324115000"},
      %{"name" => "二龙乡", "code" => "411324303000"},
      %{"name" => "王岗乡", "code" => "411324306000"},
      %{"name" => "马庄乡", "code" => "411324309000"},
      %{"name" => "郭庄回族乡", "code" => "411324315000"}
    ]

  def next(input) when input == "西峡县" or input == "411323",
    do: [
      %{"name" => "白羽街道", "code" => "411323001000"},
      %{"name" => "紫金街道", "code" => "411323002000"},
      %{"name" => "莲花街道", "code" => "411323003000"},
      %{"name" => "丹水镇", "code" => "411323101000"},
      %{"name" => "西坪镇", "code" => "411323102000"},
      %{"name" => "双龙镇", "code" => "411323103000"},
      %{"name" => "回车镇", "code" => "411323104000"},
      %{"name" => "丁河镇", "code" => "411323105000"},
      %{"name" => "桑坪镇", "code" => "411323106000"},
      %{"name" => "米坪镇", "code" => "411323107000"},
      %{"name" => "五里桥镇", "code" => "411323108000"},
      %{"name" => "重阳镇", "code" => "411323109000"},
      %{"name" => "太平镇", "code" => "411323110000"},
      %{"name" => "阳城镇", "code" => "411323111000"},
      %{"name" => "二郎坪镇", "code" => "411323112000"},
      %{"name" => "石界河镇", "code" => "411323113000"},
      %{"name" => "军马河镇", "code" => "411323114000"},
      %{"name" => "田关镇", "code" => "411323115000"},
      %{"name" => "寨根乡", "code" => "411323307000"}
    ]

  def next(input) when input == "方城县" or input == "411322",
    do: [
      %{"name" => "凤瑞街道", "code" => "411322001000"},
      %{"name" => "释之街道", "code" => "411322002000"},
      %{"name" => "赭阳街道", "code" => "411322003000"},
      %{"name" => "广安街道", "code" => "411322004000"},
      %{"name" => "独树镇", "code" => "411322101000"},
      %{"name" => "博望镇", "code" => "411322102000"},
      %{"name" => "拐河镇", "code" => "411322103000"},
      %{"name" => "小史店镇", "code" => "411322104000"},
      %{"name" => "赵河镇", "code" => "411322105000"},
      %{"name" => "广阳镇", "code" => "411322106000"},
      %{"name" => "杨楼镇", "code" => "411322108000"},
      %{"name" => "券桥镇", "code" => "411322109000"},
      %{"name" => "清河镇", "code" => "411322110000"},
      %{"name" => "四里店镇", "code" => "411322111000"},
      %{"name" => "古庄店镇", "code" => "411322112000"},
      %{"name" => "杨集镇", "code" => "411322113000"},
      %{"name" => "柳河镇", "code" => "411322114000"},
      %{"name" => "二郎庙镇", "code" => "411322115000"},
      %{"name" => "袁店回族乡", "code" => "411322311000"},
      %{"name" => "方城大寺林场", "code" => "411322401000"}
    ]

  def next(input) when input == "南召县" or input == "411321",
    do: [
      %{"name" => "城关镇", "code" => "411321100000"},
      %{"name" => "留山镇", "code" => "411321101000"},
      %{"name" => "云阳镇", "code" => "411321102000"},
      %{"name" => "皇路店镇", "code" => "411321103000"},
      %{"name" => "南河店镇", "code" => "411321104000"},
      %{"name" => "板山坪镇", "code" => "411321105000"},
      %{"name" => "乔端镇", "code" => "411321106000"},
      %{"name" => "白土岗镇", "code" => "411321107000"},
      %{"name" => "城郊乡", "code" => "411321300000"},
      %{"name" => "小店乡", "code" => "411321301000"},
      %{"name" => "皇后乡", "code" => "411321302000"},
      %{"name" => "太山庙乡", "code" => "411321303000"},
      %{"name" => "石门乡", "code" => "411321304000"},
      %{"name" => "四棵树乡", "code" => "411321305000"},
      %{"name" => "马市坪乡", "code" => "411321308000"},
      %{"name" => "崔庄乡", "code" => "411321310000"},
      %{"name" => "河南红阳机械厂", "code" => "411321400000"},
      %{"name" => "河南向东机械厂", "code" => "411321401000"},
      %{"name" => "河南红宇机械厂", "code" => "411321402000"},
      %{"name" => "国营东风机械厂", "code" => "411321403000"},
      %{"name" => "国营长江机械厂", "code" => "411321404000"}
    ]

  def next(input) when input == "卧龙区" or input == "411303",
    do: [
      %{"name" => "七一街道", "code" => "411303002000"},
      %{"name" => "卧龙岗街道", "code" => "411303003000"},
      %{"name" => "武侯街道", "code" => "411303004000"},
      %{"name" => "梅溪街道", "code" => "411303005000"},
      %{"name" => "车站街道", "code" => "411303006000"},
      %{"name" => "光武街道", "code" => "411303007000"},
      %{"name" => "靳岗街道", "code" => "411303008000"},
      %{"name" => "石桥镇", "code" => "411303101000"},
      %{"name" => "潦河镇", "code" => "411303102000"},
      %{"name" => "安皋镇", "code" => "411303103000"},
      %{"name" => "蒲山镇", "code" => "411303104000"},
      %{"name" => "陆营镇", "code" => "411303105000"},
      %{"name" => "青华镇", "code" => "411303106000"},
      %{"name" => "英庄镇", "code" => "411303107000"},
      %{"name" => "潦河坡镇", "code" => "411303108000"},
      %{"name" => "谢庄镇", "code" => "411303109000"},
      %{"name" => "七里园乡", "code" => "411303300000"},
      %{"name" => "王村乡", "code" => "411303306000"},
      %{"name" => "龙王沟风景区", "code" => "411303400000"}
    ]

  def next(input) when input == "宛城区" or input == "411302",
    do: [
      %{"name" => "东关街道", "code" => "411302001000"},
      %{"name" => "新华街道", "code" => "411302002000"},
      %{"name" => "汉冶街道", "code" => "411302003000"},
      %{"name" => "仲景街道", "code" => "411302004000"},
      %{"name" => "赤虎街道", "code" => "411302007000"},
      %{"name" => "五里堡街道", "code" => "411302008000"},
      %{"name" => "官庄镇", "code" => "411302102000"},
      %{"name" => "瓦店镇", "code" => "411302103000"},
      %{"name" => "红泥湾镇", "code" => "411302104000"},
      %{"name" => "黄台岗镇", "code" => "411302105000"},
      %{"name" => "金华镇", "code" => "411302106000"},
      %{"name" => "高庙镇", "code" => "411302107000"},
      %{"name" => "溧河乡", "code" => "411302301000"},
      %{"name" => "汉冢乡", "code" => "411302302000"},
      %{"name" => "茶庵乡", "code" => "411302304000"}
    ]

  def next(input) when input == "灵宝市" or input == "411282",
    do: [
      %{"name" => "城关镇", "code" => "411282100000"},
      %{"name" => "尹庄镇", "code" => "411282101000"},
      %{"name" => "朱阳镇", "code" => "411282102000"},
      %{"name" => "阳平镇", "code" => "411282103000"},
      %{"name" => "故县镇", "code" => "411282104000"},
      %{"name" => "豫灵镇", "code" => "411282105000"},
      %{"name" => "大王镇", "code" => "411282106000"},
      %{"name" => "阳店镇", "code" => "411282107000"},
      %{"name" => "函谷关镇", "code" => "411282108000"},
      %{"name" => "焦村镇", "code" => "411282109000"},
      %{"name" => "川口乡", "code" => "411282200000"},
      %{"name" => "寺河乡", "code" => "411282201000"},
      %{"name" => "苏村乡", "code" => "411282202000"},
      %{"name" => "五亩乡", "code" => "411282203000"},
      %{"name" => "西阎乡", "code" => "411282204000"},
      %{"name" => "灵宝市园艺场", "code" => "411282400000"},
      %{"name" => "涧东区", "code" => "411282401000"},
      %{"name" => "涧西区", "code" => "411282402000"}
    ]

  def next(input) when input == "义马市" or input == "411281",
    do: [
      %{"name" => "千秋路街道", "code" => "411281001000"},
      %{"name" => "朝阳路街道", "code" => "411281002000"},
      %{"name" => "新义街街道", "code" => "411281003000"},
      %{"name" => "常村路街道", "code" => "411281004000"},
      %{"name" => "泰山路街道", "code" => "411281005000"},
      %{"name" => "新区街道", "code" => "411281006000"},
      %{"name" => "东区街道", "code" => "411281007000"}
    ]

  def next(input) when input == "河南三门峡经济开发区" or input == "411271",
    do: [%{"name" => "向阳街道", "code" => "411271560000"}]

  def next(input) when input == "卢氏县" or input == "411224",
    do: [
      %{"name" => "兴贤里街道", "code" => "411224001000"},
      %{"name" => "城关镇", "code" => "411224100000"},
      %{"name" => "杜关镇", "code" => "411224101000"},
      %{"name" => "五里川镇", "code" => "411224102000"},
      %{"name" => "官道口镇", "code" => "411224103000"},
      %{"name" => "朱阳关镇", "code" => "411224104000"},
      %{"name" => "官坡镇", "code" => "411224105000"},
      %{"name" => "范里镇", "code" => "411224106000"},
      %{"name" => "东明镇", "code" => "411224107000"},
      %{"name" => "双龙湾镇", "code" => "411224108000"},
      %{"name" => "文峪乡", "code" => "411224200000"},
      %{"name" => "横涧乡", "code" => "411224201000"},
      %{"name" => "双槐树乡", "code" => "411224203000"},
      %{"name" => "汤河乡", "code" => "411224204000"},
      %{"name" => "瓦窑沟乡", "code" => "411224205000"},
      %{"name" => "狮子坪乡", "code" => "411224206000"},
      %{"name" => "沙河乡", "code" => "411224207000"},
      %{"name" => "徐家湾乡", "code" => "411224208000"},
      %{"name" => "潘河乡", "code" => "411224209000"},
      %{"name" => "木桐乡", "code" => "411224210000"}
    ]

  def next(input) when input == "渑池县" or input == "411221",
    do: [
      %{"name" => "城关镇", "code" => "411221100000"},
      %{"name" => "英豪镇", "code" => "411221101000"},
      %{"name" => "张村镇", "code" => "411221102000"},
      %{"name" => "洪阳镇", "code" => "411221103000"},
      %{"name" => "天池镇", "code" => "411221104000"},
      %{"name" => "仰韶镇", "code" => "411221105000"},
      %{"name" => "仁村乡", "code" => "411221203000"},
      %{"name" => "果园乡", "code" => "411221206000"},
      %{"name" => "陈村乡", "code" => "411221207000"},
      %{"name" => "坡头乡", "code" => "411221208000"},
      %{"name" => "段村乡", "code" => "411221209000"},
      %{"name" => "南村乡", "code" => "411221210000"}
    ]

  def next(input) when input == "陕州区" or input == "411203",
    do: [
      %{"name" => "甘棠街道", "code" => "411203001000"},
      %{"name" => "大营镇", "code" => "411203100000"},
      %{"name" => "原店镇", "code" => "411203101000"},
      %{"name" => "西张村镇", "code" => "411203102000"},
      %{"name" => "观音堂镇", "code" => "411203103000"},
      %{"name" => "张汴乡", "code" => "411203200000"},
      %{"name" => "菜园乡", "code" => "411203203000"},
      %{"name" => "张茅乡", "code" => "411203205000"},
      %{"name" => "王家后乡", "code" => "411203206000"},
      %{"name" => "硖石乡", "code" => "411203207000"},
      %{"name" => "西李村乡", "code" => "411203210000"},
      %{"name" => "宫前乡", "code" => "411203211000"},
      %{"name" => "店子乡", "code" => "411203212000"}
    ]

  def next(input) when input == "湖滨区" or input == "411202",
    do: [
      %{"name" => "湖滨街道", "code" => "411202001000"},
      %{"name" => "前进街道", "code" => "411202002000"},
      %{"name" => "车站街道", "code" => "411202003000"},
      %{"name" => "涧河街道", "code" => "411202004000"},
      %{"name" => "大安街道", "code" => "411202005000"},
      %{"name" => "会兴街道", "code" => "411202006000"},
      %{"name" => "崖底街道", "code" => "411202007000"},
      %{"name" => "交口乡", "code" => "411202201000"},
      %{"name" => "磁钟乡", "code" => "411202202000"},
      %{"name" => "高庙乡", "code" => "411202203000"}
    ]

  def next(input) when input == "漯河经济技术开发区" or input == "411171",
    do: [
      %{"name" => "后谢镇", "code" => "411171101000"},
      %{"name" => "邓襄镇", "code" => "411171102000"}
    ]

  def next(input) when input == "临颍县" or input == "411122",
    do: [
      %{"name" => "城关街道", "code" => "411122001000"},
      %{"name" => "新城街道", "code" => "411122002000"},
      %{"name" => "繁城回族镇", "code" => "411122101000"},
      %{"name" => "杜曲镇", "code" => "411122102000"},
      %{"name" => "王岗镇", "code" => "411122103000"},
      %{"name" => "台陈镇", "code" => "411122104000"},
      %{"name" => "巨陵镇", "code" => "411122105000"},
      %{"name" => "瓦店镇", "code" => "411122106000"},
      %{"name" => "三家店镇", "code" => "411122107000"},
      %{"name" => "窝城镇", "code" => "411122108000"},
      %{"name" => "王孟镇", "code" => "411122109000"},
      %{"name" => "大郭镇", "code" => "411122110000"},
      %{"name" => "皇帝庙乡", "code" => "411122201000"},
      %{"name" => "固厢乡", "code" => "411122202000"},
      %{"name" => "石桥乡", "code" => "411122203000"},
      %{"name" => "陈庄乡", "code" => "411122204000"}
    ]

  def next(input) when input == "舞阳县" or input == "411121",
    do: [
      %{"name" => "舞泉镇", "code" => "411121100000"},
      %{"name" => "吴城镇", "code" => "411121101000"},
      %{"name" => "北舞渡镇", "code" => "411121102000"},
      %{"name" => "莲花镇", "code" => "411121103000"},
      %{"name" => "辛安镇", "code" => "411121104000"},
      %{"name" => "孟寨镇", "code" => "411121105000"},
      %{"name" => "太尉镇", "code" => "411121106000"},
      %{"name" => "侯集镇", "code" => "411121107000"},
      %{"name" => "九街镇", "code" => "411121108000"},
      %{"name" => "章化镇", "code" => "411121109000"},
      %{"name" => "文峰乡", "code" => "411121200000"},
      %{"name" => "保和乡", "code" => "411121201000"},
      %{"name" => "马村乡", "code" => "411121202000"},
      %{"name" => "姜店乡", "code" => "411121204000"}
    ]

  def next(input) when input == "召陵区" or input == "411104",
    do: [
      %{"name" => "召陵区天桥街街道", "code" => "411104001000"},
      %{"name" => "召陵区翟庄街道", "code" => "411104002000"},
      %{"name" => "召陵区东城街道", "code" => "411104003000"},
      %{"name" => "召陵区召陵镇", "code" => "411104100000"},
      %{"name" => "召陵区万金镇", "code" => "411104102000"},
      %{"name" => "召陵区老窝镇", "code" => "411104103000"},
      %{"name" => "姬石镇", "code" => "411104104000"},
      %{"name" => "召陵区青年镇", "code" => "411104105000"}
    ]

  def next(input) when input == "郾城区" or input == "411103",
    do: [
      %{"name" => "沙北街道", "code" => "411103001000"},
      %{"name" => "龙塔街道", "code" => "411103002000"},
      %{"name" => "淞江街道", "code" => "411103003000"},
      %{"name" => "孟庙镇", "code" => "411103101000"},
      %{"name" => "商桥镇", "code" => "411103102000"},
      %{"name" => "裴城镇", "code" => "411103103000"},
      %{"name" => "新店镇", "code" => "411103104000"},
      %{"name" => "龙城镇", "code" => "411103105000"},
      %{"name" => "李集镇", "code" => "411103106000"},
      %{"name" => "黑龙潭镇", "code" => "411103107000"}
    ]

  def next(input) when input == "源汇区" or input == "411102",
    do: [
      %{"name" => "老街街道", "code" => "411102001000"},
      %{"name" => "马路街街道", "code" => "411102002000"},
      %{"name" => "顺河街街道", "code" => "411102003000"},
      %{"name" => "干河陈街道", "code" => "411102004000"},
      %{"name" => "大刘镇", "code" => "411102100000"},
      %{"name" => "阴阳赵镇", "code" => "411102101000"},
      %{"name" => "空冢郭镇", "code" => "411102102000"},
      %{"name" => "问十乡", "code" => "411102202000"}
    ]

  def next(input) when input == "长葛市" or input == "411082",
    do: [
      %{"name" => "建设路街道", "code" => "411082001000"},
      %{"name" => "长兴路街道", "code" => "411082002000"},
      %{"name" => "长社路街道", "code" => "411082003000"},
      %{"name" => "金桥路街道", "code" => "411082004000"},
      %{"name" => "和尚桥镇", "code" => "411082100000"},
      %{"name" => "坡胡镇", "code" => "411082101000"},
      %{"name" => "后河镇", "code" => "411082102000"},
      %{"name" => "石固镇", "code" => "411082103000"},
      %{"name" => "老城镇", "code" => "411082104000"},
      %{"name" => "南席镇", "code" => "411082105000"},
      %{"name" => "大周镇", "code" => "411082106000"},
      %{"name" => "董村镇", "code" => "411082107000"},
      %{"name" => "石象镇", "code" => "411082108000"},
      %{"name" => "古桥镇", "code" => "411082109000"},
      %{"name" => "增福镇", "code" => "411082110000"},
      %{"name" => "佛耳湖镇", "code" => "411082111000"}
    ]

  def next(input) when input == "禹州市" or input == "411081",
    do: [
      %{"name" => "颍川街道", "code" => "411081001000"},
      %{"name" => "夏都街道", "code" => "411081002000"},
      %{"name" => "韩城街道", "code" => "411081003000"},
      %{"name" => "钧台街道", "code" => "411081004000"},
      %{"name" => "褚河街道", "code" => "411081005000"},
      %{"name" => "火龙镇", "code" => "411081100000"},
      %{"name" => "顺店镇", "code" => "411081101000"},
      %{"name" => "方山镇", "code" => "411081102000"},
      %{"name" => "神垕镇", "code" => "411081103000"},
      %{"name" => "鸿畅镇", "code" => "411081104000"},
      %{"name" => "梁北镇", "code" => "411081105000"},
      %{"name" => "古城镇", "code" => "411081106000"},
      %{"name" => "无梁镇", "code" => "411081107000"},
      %{"name" => "文殊镇", "code" => "411081108000"},
      %{"name" => "鸠山镇", "code" => "411081109000"},
      %{"name" => "范坡镇", "code" => "411081111000"},
      %{"name" => "郭连镇", "code" => "411081112000"},
      %{"name" => "朱阁镇", "code" => "411081113000"},
      %{"name" => "浅井镇", "code" => "411081114000"},
      %{"name" => "方岗镇", "code" => "411081115000"},
      %{"name" => "花石镇", "code" => "411081116000"},
      %{"name" => "张得镇", "code" => "411081117000"},
      %{"name" => "苌庄镇", "code" => "411081118000"},
      %{"name" => "小吕镇", "code" => "411081119000"},
      %{"name" => "磨街乡", "code" => "411081204000"},
      %{"name" => "山货回族乡", "code" => "411081210000"}
    ]

  def next(input) when input == "许昌经济技术开发区" or input == "411071",
    do: [
      %{"name" => "长村张街道", "code" => "411071001000"},
      %{"name" => "龙湖街道", "code" => "411071400000"}
    ]

  def next(input) when input == "襄城县" or input == "411025",
    do: [
      %{"name" => "城关街道", "code" => "411025001000"},
      %{"name" => "茨沟街道", "code" => "411025002000"},
      %{"name" => "颍桥回族镇", "code" => "411025101000"},
      %{"name" => "麦岭镇", "code" => "411025102000"},
      %{"name" => "颍阳镇", "code" => "411025103000"},
      %{"name" => "王洛镇", "code" => "411025104000"},
      %{"name" => "紫云镇", "code" => "411025105000"},
      %{"name" => "库庄镇", "code" => "411025106000"},
      %{"name" => "十里铺镇", "code" => "411025107000"},
      %{"name" => "山头店镇", "code" => "411025108000"},
      %{"name" => "汾陈镇", "code" => "411025109000"},
      %{"name" => "湛北乡", "code" => "411025200000"},
      %{"name" => "丁营乡", "code" => "411025203000"},
      %{"name" => "姜庄乡", "code" => "411025204000"},
      %{"name" => "范湖乡", "code" => "411025205000"},
      %{"name" => "双庙乡", "code" => "411025206000"}
    ]

  def next(input) when input == "鄢陵县" or input == "411024",
    do: [
      %{"name" => "安陵镇", "code" => "411024100000"},
      %{"name" => "马栏镇", "code" => "411024101000"},
      %{"name" => "柏梁镇", "code" => "411024102000"},
      %{"name" => "陈化店镇", "code" => "411024103000"},
      %{"name" => "望田镇", "code" => "411024104000"},
      %{"name" => "大马镇", "code" => "411024105000"},
      %{"name" => "陶城镇", "code" => "411024106000"},
      %{"name" => "张桥镇", "code" => "411024107000"},
      %{"name" => "彭店镇", "code" => "411024108000"},
      %{"name" => "只乐镇", "code" => "411024109000"},
      %{"name" => "南坞镇", "code" => "411024110000"},
      %{"name" => "马坊镇", "code" => "411024111000"}
    ]

  def next(input) when input == "建安区" or input == "411003",
    do: [
      %{"name" => "许由街道", "code" => "411003001000"},
      %{"name" => "新元街道", "code" => "411003002000"},
      %{"name" => "邓庄街道", "code" => "411003003000"},
      %{"name" => "昌盛街道", "code" => "411003004000"},
      %{"name" => "小召街道", "code" => "411003005000"},
      %{"name" => "将官池镇", "code" => "411003100000"},
      %{"name" => "五女店镇", "code" => "411003101000"},
      %{"name" => "尚集镇", "code" => "411003102000"},
      %{"name" => "苏桥镇", "code" => "411003103000"},
      %{"name" => "蒋李集镇", "code" => "411003104000"},
      %{"name" => "张潘镇", "code" => "411003105000"},
      %{"name" => "灵井镇", "code" => "411003106000"},
      %{"name" => "陈曹乡", "code" => "411003200000"},
      %{"name" => "河街乡", "code" => "411003203000"},
      %{"name" => "桂村乡", "code" => "411003204000"},
      %{"name" => "椹涧乡", "code" => "411003205000"},
      %{"name" => "榆林乡", "code" => "411003206000"},
      %{"name" => "艾庄回族乡", "code" => "411003208000"}
    ]

  def next(input) when input == "魏都区" or input == "411002",
    do: [
      %{"name" => "西大街道", "code" => "411002001000"},
      %{"name" => "东大街道", "code" => "411002002000"},
      %{"name" => "西关街道", "code" => "411002003000"},
      %{"name" => "南关街道", "code" => "411002004000"},
      %{"name" => "北大街道", "code" => "411002005000"},
      %{"name" => "五一路街道", "code" => "411002006000"},
      %{"name" => "高桥营街道", "code" => "411002007000"},
      %{"name" => "丁庄街道", "code" => "411002008000"},
      %{"name" => "颍昌街道", "code" => "411002009000"},
      %{"name" => "文峰街道", "code" => "411002010000"},
      %{"name" => "新兴街道", "code" => "411002011000"},
      %{"name" => "灞陵街道", "code" => "411002013000"},
      %{"name" => "魏北街道", "code" => "411002015000"},
      %{"name" => "产业集聚区街道", "code" => "411002016000"},
      %{"name" => "东城区", "code" => "411002570000"}
    ]

  def next(input) when input == "濮阳经济技术开发区" or input == "410972",
    do: [
      %{"name" => "昆吾街道", "code" => "410972060000"},
      %{"name" => "皇甫街道", "code" => "410972061000"},
      %{"name" => "开州街道", "code" => "410972062000"},
      %{"name" => "濮上街道", "code" => "410972063000"},
      %{"name" => "王助镇", "code" => "410972100000"},
      %{"name" => "新习镇", "code" => "410972101000"},
      %{"name" => "胡村乡", "code" => "410972360000"}
    ]

  def next(input) when input == "河南濮阳工业园区" or input == "410971",
    do: [%{"name" => "河南濮阳工业园区昌湖街道", "code" => "410971001000"}]

  def next(input) when input == "濮阳县" or input == "410928",
    do: [
      %{"name" => "城关镇", "code" => "410928100000"},
      %{"name" => "濮阳县柳屯镇", "code" => "410928101000"},
      %{"name" => "濮阳县文留镇", "code" => "410928102000"},
      %{"name" => "濮阳县庆祖镇", "code" => "410928103000"},
      %{"name" => "濮阳县八公桥镇", "code" => "410928104000"},
      %{"name" => "濮阳县徐镇镇", "code" => "410928106000"},
      %{"name" => "濮阳县户部寨镇", "code" => "410928107000"},
      %{"name" => "濮阳县鲁河镇", "code" => "410928108000"},
      %{"name" => "濮阳县子岸镇", "code" => "410928109000"},
      %{"name" => "濮阳县胡状镇", "code" => "410928110000"},
      %{"name" => "濮阳县王称堌镇", "code" => "410928111000"},
      %{"name" => "濮阳县梁庄镇", "code" => "410928112000"},
      %{"name" => "濮阳县清河头乡", "code" => "410928202000"},
      %{"name" => "濮阳县白堽乡", "code" => "410928206000"},
      %{"name" => "濮阳县梨园乡", "code" => "410928207000"},
      %{"name" => "濮阳县五星乡", "code" => "410928208000"},
      %{"name" => "濮阳县郎中乡", "code" => "410928211000"},
      %{"name" => "濮阳县海通乡", "code" => "410928212000"},
      %{"name" => "濮阳县渠村乡", "code" => "410928213000"},
      %{"name" => "濮阳县习城乡", "code" => "410928214000"}
    ]

  def next(input) when input == "台前县" or input == "410927",
    do: [
      %{"name" => "城关镇", "code" => "410927100000"},
      %{"name" => "侯庙镇", "code" => "410927101000"},
      %{"name" => "孙口镇", "code" => "410927102000"},
      %{"name" => "打渔陈镇", "code" => "410927103000"},
      %{"name" => "马楼镇", "code" => "410927104000"},
      %{"name" => "吴坝镇", "code" => "410927105000"},
      %{"name" => "后方乡", "code" => "410927200000"},
      %{"name" => "清水河乡", "code" => "410927201000"},
      %{"name" => "夹河乡", "code" => "410927205000"}
    ]

  def next(input) when input == "范县" or input == "410926",
    do: [
      %{"name" => "城关镇", "code" => "410926100000"},
      %{"name" => "濮城镇", "code" => "410926101000"},
      %{"name" => "龙王庄镇", "code" => "410926102000"},
      %{"name" => "高码头镇", "code" => "410926103000"},
      %{"name" => "王楼镇", "code" => "410926104000"},
      %{"name" => "辛庄镇", "code" => "410926105000"},
      %{"name" => "陈庄镇", "code" => "410926106000"},
      %{"name" => "张庄镇", "code" => "410926107000"},
      %{"name" => "杨集乡", "code" => "410926201000"},
      %{"name" => "白衣阁乡", "code" => "410926203000"},
      %{"name" => "颜村铺乡", "code" => "410926205000"},
      %{"name" => "陆集乡", "code" => "410926208000"}
    ]

  def next(input) when input == "南乐县" or input == "410923",
    do: [
      %{"name" => "城关镇", "code" => "410923100000"},
      %{"name" => "韩张镇", "code" => "410923101000"},
      %{"name" => "元村镇", "code" => "410923102000"},
      %{"name" => "福堪镇", "code" => "410923103000"},
      %{"name" => "张果屯镇", "code" => "410923104000"},
      %{"name" => "千口镇", "code" => "410923105000"},
      %{"name" => "谷金楼镇", "code" => "410923106000"},
      %{"name" => "杨村乡", "code" => "410923200000"},
      %{"name" => "西邵乡", "code" => "410923205000"},
      %{"name" => "寺庄乡", "code" => "410923206000"},
      %{"name" => "梁村乡", "code" => "410923207000"},
      %{"name" => "近德固乡", "code" => "410923208000"}
    ]

  def next(input) when input == "清丰县" or input == "410922",
    do: [
      %{"name" => "城关镇", "code" => "410922100000"},
      %{"name" => "马庄桥镇", "code" => "410922101000"},
      %{"name" => "瓦屋头镇", "code" => "410922102000"},
      %{"name" => "仙庄镇", "code" => "410922103000"},
      %{"name" => "柳格镇", "code" => "410922104000"},
      %{"name" => "韩村镇", "code" => "410922105000"},
      %{"name" => "固城镇", "code" => "410922106000"},
      %{"name" => "阳邵镇", "code" => "410922107000"},
      %{"name" => "六塔乡", "code" => "410922200000"},
      %{"name" => "巩营乡", "code" => "410922202000"},
      %{"name" => "马村乡", "code" => "410922203000"},
      %{"name" => "高堡乡", "code" => "410922204000"},
      %{"name" => "古城乡", "code" => "410922205000"},
      %{"name" => "大流乡", "code" => "410922206000"},
      %{"name" => "大屯乡", "code" => "410922208000"},
      %{"name" => "双庙乡", "code" => "410922212000"},
      %{"name" => "纸房乡", "code" => "410922213000"}
    ]

  def next(input) when input == "华龙区" or input == "410902",
    do: [
      %{"name" => "中原路街道", "code" => "410902001000"},
      %{"name" => "胜利路街道", "code" => "410902002000"},
      %{"name" => "建设路街道", "code" => "410902003000"},
      %{"name" => "人民路街道", "code" => "410902004000"},
      %{"name" => "大庆路街道", "code" => "410902005000"},
      %{"name" => "黄河路街道", "code" => "410902006000"},
      %{"name" => "任丘路街道", "code" => "410902007000"},
      %{"name" => "长庆路街道", "code" => "410902008000"},
      %{"name" => "濮东街道", "code" => "410902009000"},
      %{"name" => "岳村镇", "code" => "410902101000"},
      %{"name" => "孟轲乡", "code" => "410902203000"}
    ]

  def next(input) when input == "孟州市" or input == "410883",
    do: [
      %{"name" => "大定街道", "code" => "410883001000"},
      %{"name" => "会昌街道", "code" => "410883002000"},
      %{"name" => "河雍街道", "code" => "410883003000"},
      %{"name" => "河阳街道", "code" => "410883004000"},
      %{"name" => "化工镇", "code" => "410883100000"},
      %{"name" => "南庄镇", "code" => "410883101000"},
      %{"name" => "城伯镇", "code" => "410883102000"},
      %{"name" => "谷旦镇", "code" => "410883103000"},
      %{"name" => "赵和镇", "code" => "410883104000"},
      %{"name" => "西虢镇", "code" => "410883105000"},
      %{"name" => "槐树乡", "code" => "410883201000"}
    ]

  def next(input) when input == "沁阳市" or input == "410882",
    do: [
      %{"name" => "覃怀街道", "code" => "410882001000"},
      %{"name" => "怀庆街道", "code" => "410882002000"},
      %{"name" => "太行街道", "code" => "410882003000"},
      %{"name" => "沁园街道", "code" => "410882004000"},
      %{"name" => "崇义镇", "code" => "410882100000"},
      %{"name" => "西向镇", "code" => "410882101000"},
      %{"name" => "西万镇", "code" => "410882102000"},
      %{"name" => "柏香镇", "code" => "410882103000"},
      %{"name" => "山王庄镇", "code" => "410882104000"},
      %{"name" => "紫陵镇", "code" => "410882105000"},
      %{"name" => "常平乡", "code" => "410882200000"},
      %{"name" => "王召乡", "code" => "410882201000"},
      %{"name" => "王曲乡", "code" => "410882202000"}
    ]

  def next(input) when input == "焦作城乡一体化示范区" or input == "410871",
    do: [
      %{"name" => "李万街道", "code" => "410871060000"},
      %{"name" => "文苑街道", "code" => "410871061000"},
      %{"name" => "文昌街道", "code" => "410871062000"},
      %{"name" => "阳庙镇", "code" => "410871100000"},
      %{"name" => "宁郭镇", "code" => "410871101000"},
      %{"name" => "苏家作乡", "code" => "410871203000"}
    ]

  def next(input) when input == "温县" or input == "410825",
    do: [
      %{"name" => "温泉街道", "code" => "410825001000"},
      %{"name" => "岳村街道", "code" => "410825002000"},
      %{"name" => "张羌街道", "code" => "410825003000"},
      %{"name" => "黄河街道", "code" => "410825004000"},
      %{"name" => "祥云镇", "code" => "410825101000"},
      %{"name" => "番田镇", "code" => "410825102000"},
      %{"name" => "黄庄镇", "code" => "410825104000"},
      %{"name" => "武德镇", "code" => "410825105000"},
      %{"name" => "赵堡镇", "code" => "410825106000"},
      %{"name" => "招贤乡", "code" => "410825201000"},
      %{"name" => "北冷乡", "code" => "410825203000"},
      %{"name" => "国营温县农场", "code" => "410825400000"}
    ]

  def next(input) when input == "武陟县" or input == "410823",
    do: [
      %{"name" => "木城街道", "code" => "410823001000"},
      %{"name" => "龙源街道", "code" => "410823002000"},
      %{"name" => "龙泉街道", "code" => "410823003000"},
      %{"name" => "木栾街道", "code" => "410823004000"},
      %{"name" => "詹店镇", "code" => "410823101000"},
      %{"name" => "西陶镇", "code" => "410823102000"},
      %{"name" => "谢旗营镇", "code" => "410823103000"},
      %{"name" => "大封镇", "code" => "410823104000"},
      %{"name" => "乔庙镇", "code" => "410823107000"},
      %{"name" => "圪垱店镇", "code" => "410823108000"},
      %{"name" => "嘉应观乡", "code" => "410823200000"},
      %{"name" => "三阳乡", "code" => "410823203000"},
      %{"name" => "小董乡", "code" => "410823204000"},
      %{"name" => "大虹桥乡", "code" => "410823205000"},
      %{"name" => "北郭乡", "code" => "410823206000"},
      %{"name" => "武陟宁郭农场", "code" => "410823598000"}
    ]

  def next(input) when input == "博爱县" or input == "410822",
    do: [
      %{"name" => "博爱县清化镇街道", "code" => "410822001000"},
      %{"name" => "博爱县鸿昌街道", "code" => "410822002000"},
      %{"name" => "博爱县柏山镇", "code" => "410822101000"},
      %{"name" => "博爱县月山镇", "code" => "410822102000"},
      %{"name" => "博爱县许良镇", "code" => "410822103000"},
      %{"name" => "博爱县磨头镇", "code" => "410822105000"},
      %{"name" => "博爱县孝敬镇", "code" => "410822106000"},
      %{"name" => "博爱县寨豁乡", "code" => "410822200000"},
      %{"name" => "博爱县金城乡", "code" => "410822203000"},
      %{"name" => "国营博爱农场", "code" => "410822400000"}
    ]

  def next(input) when input == "修武县" or input == "410821",
    do: [
      %{"name" => "城关镇", "code" => "410821100000"},
      %{"name" => "七贤镇", "code" => "410821101000"},
      %{"name" => "郇封镇", "code" => "410821102000"},
      %{"name" => "周庄镇", "code" => "410821103000"},
      %{"name" => "云台山镇", "code" => "410821104000"},
      %{"name" => "王屯乡", "code" => "410821202000"},
      %{"name" => "五里源乡", "code" => "410821204000"},
      %{"name" => "西村乡", "code" => "410821206000"},
      %{"name" => "小营工贸区", "code" => "410821400000"}
    ]

  def next(input) when input == "山阳区" or input == "410811",
    do: [
      %{"name" => "东方红街道", "code" => "410811001000"},
      %{"name" => "焦东街道", "code" => "410811002000"},
      %{"name" => "百间房街道", "code" => "410811003000"},
      %{"name" => "太行街道", "code" => "410811004000"},
      %{"name" => "艺新街道", "code" => "410811005000"},
      %{"name" => "光亚街道", "code" => "410811006000"},
      %{"name" => "定和街道", "code" => "410811007000"},
      %{"name" => "中星街道", "code" => "410811008000"},
      %{"name" => "新城街道", "code" => "410811009000"}
    ]

  def next(input) when input == "马村区" or input == "410804",
    do: [
      %{"name" => "马村街道", "code" => "410804001000"},
      %{"name" => "武王街道", "code" => "410804002000"},
      %{"name" => "冯营街道", "code" => "410804003000"},
      %{"name" => "九里山街道", "code" => "410804004000"},
      %{"name" => "待王街道", "code" => "410804005000"},
      %{"name" => "安阳城街道", "code" => "410804006000"},
      %{"name" => "演马街道", "code" => "410804007000"}
    ]

  def next(input) when input == "中站区" or input == "410803",
    do: [
      %{"name" => "李封街道", "code" => "410803001000"},
      %{"name" => "王封街道", "code" => "410803002000"},
      %{"name" => "朱村街道", "code" => "410803003000"},
      %{"name" => "冯封街道", "code" => "410803004000"},
      %{"name" => "龙洞街道", "code" => "410803005000"},
      %{"name" => "月山街道", "code" => "410803006000"},
      %{"name" => "丹河街道", "code" => "410803007000"},
      %{"name" => "许衡街道", "code" => "410803008000"},
      %{"name" => "府城街道", "code" => "410803009000"},
      %{"name" => "龙翔街道", "code" => "410803010000"}
    ]

  def next(input) when input == "解放区" or input == "410802",
    do: [
      %{"name" => "民生街道", "code" => "410802001000"},
      %{"name" => "民主街道", "code" => "410802002000"},
      %{"name" => "新华街道", "code" => "410802003000"},
      %{"name" => "焦西街道", "code" => "410802004000"},
      %{"name" => "焦南街道", "code" => "410802005000"},
      %{"name" => "焦北街道", "code" => "410802006000"},
      %{"name" => "七百间街道", "code" => "410802007000"},
      %{"name" => "上白作街道", "code" => "410802008000"},
      %{"name" => "王褚街道", "code" => "410802009000"}
    ]

  def next(input) when input == "长垣市" or input == "410783",
    do: [
      %{"name" => "蒲西街道", "code" => "410783001000"},
      %{"name" => "蒲东街道", "code" => "410783002000"},
      %{"name" => "南蒲街道", "code" => "410783003000"},
      %{"name" => "蒲北街道", "code" => "410783004000"},
      %{"name" => "魏庄街道", "code" => "410783005000"},
      %{"name" => "丁栾镇", "code" => "410783100000"},
      %{"name" => "樊相镇", "code" => "410783101000"},
      %{"name" => "恼里镇", "code" => "410783102000"},
      %{"name" => "常村镇", "code" => "410783103000"},
      %{"name" => "赵堤镇", "code" => "410783104000"},
      %{"name" => "孟岗镇", "code" => "410783105000"},
      %{"name" => "满村镇", "code" => "410783106000"},
      %{"name" => "苗寨镇", "code" => "410783107000"},
      %{"name" => "张三寨镇", "code" => "410783108000"},
      %{"name" => "方里镇", "code" => "410783109000"},
      %{"name" => "佘家镇", "code" => "410783110000"},
      %{"name" => "芦岗乡", "code" => "410783201000"},
      %{"name" => "武邱乡", "code" => "410783202000"},
      %{"name" => "河南长垣起重工业园区", "code" => "410783460000"}
    ]

  def next(input) when input == "辉县市" or input == "410782",
    do: [
      %{"name" => "城关街道", "code" => "410782001000"},
      %{"name" => "胡桥街道", "code" => "410782002000"},
      %{"name" => "薄壁镇", "code" => "410782101000"},
      %{"name" => "峪河镇", "code" => "410782102000"},
      %{"name" => "百泉镇", "code" => "410782103000"},
      %{"name" => "孟庄镇", "code" => "410782104000"},
      %{"name" => "常村镇", "code" => "410782105000"},
      %{"name" => "吴村镇", "code" => "410782106000"},
      %{"name" => "南村镇", "code" => "410782107000"},
      %{"name" => "南寨镇", "code" => "410782108000"},
      %{"name" => "上八里镇", "code" => "410782109000"},
      %{"name" => "北云门镇", "code" => "410782110000"},
      %{"name" => "占城镇", "code" => "410782111000"},
      %{"name" => "冀屯镇", "code" => "410782112000"},
      %{"name" => "赵固镇", "code" => "410782113000"},
      %{"name" => "黄水乡", "code" => "410782200000"},
      %{"name" => "拍石头乡", "code" => "410782201000"},
      %{"name" => "高庄乡", "code" => "410782202000"},
      %{"name" => "张村乡", "code" => "410782203000"},
      %{"name" => "西平罗乡", "code" => "410782206000"},
      %{"name" => "洪洲乡", "code" => "410782207000"},
      %{"name" => "沙窑乡", "code" => "410782208000"}
    ]

  def next(input) when input == "卫辉市" or input == "410781",
    do: [
      %{"name" => "汲水镇", "code" => "410781100000"},
      %{"name" => "太公镇", "code" => "410781101000"},
      %{"name" => "孙杏村镇", "code" => "410781102000"},
      %{"name" => "后河镇", "code" => "410781103000"},
      %{"name" => "李源屯镇", "code" => "410781104000"},
      %{"name" => "唐庄镇", "code" => "410781105000"},
      %{"name" => "上乐村镇", "code" => "410781106000"},
      %{"name" => "狮豹头乡", "code" => "410781201000"},
      %{"name" => "安都乡", "code" => "410781203000"},
      %{"name" => "顿坊店乡", "code" => "410781204000"},
      %{"name" => "柳庄乡", "code" => "410781205000"},
      %{"name" => "庞寨乡", "code" => "410781206000"},
      %{"name" => "城郊乡", "code" => "410781208000"},
      %{"name" => "卫辉市高效农业服务中心", "code" => "410781400000"},
      %{"name" => "东风农场", "code" => "410781401000"},
      %{"name" => "苗圃场", "code" => "410781402000"},
      %{"name" => "农科所", "code" => "410781403000"},
      %{"name" => "五四农场", "code" => "410781404000"}
    ]

  def next(input) when input == "新乡市平原城乡一体化示范区" or input == "410773",
    do: [
      %{"name" => "龙源街道", "code" => "410773002000"},
      %{"name" => "原武镇", "code" => "410773101000"},
      %{"name" => "师寨镇", "code" => "410773102000"},
      %{"name" => "韩董庄镇", "code" => "410773106000"},
      %{"name" => "祝楼乡", "code" => "410773203000"},
      %{"name" => "桥北乡", "code" => "410773204000"}
    ]

  def next(input) when input == "新乡经济技术开发区" or input == "410772",
    do: [%{"name" => "纬七路街道", "code" => "410772001000"}]

  def next(input) when input == "新乡高新技术产业开发区" or input == "410771",
    do: [
      %{"name" => "开发区关堤乡", "code" => "410771360000"},
      %{"name" => "振中街道", "code" => "410771560000"}
    ]

  def next(input) when input == "封丘县" or input == "410727",
    do: [
      %{"name" => "城关镇", "code" => "410727100000"},
      %{"name" => "黄陵镇", "code" => "410727101000"},
      %{"name" => "黄德镇", "code" => "410727102000"},
      %{"name" => "应举镇", "code" => "410727103000"},
      %{"name" => "陈桥镇", "code" => "410727104000"},
      %{"name" => "赵岗镇", "code" => "410727105000"},
      %{"name" => "留光镇", "code" => "410727106000"},
      %{"name" => "潘店镇", "code" => "410727107000"},
      %{"name" => "李庄镇", "code" => "410727108000"},
      %{"name" => "陈固镇", "code" => "410727109000"},
      %{"name" => "居厢镇", "code" => "410727110000"},
      %{"name" => "鲁岗镇", "code" => "410727111000"},
      %{"name" => "尹岗镇", "code" => "410727112000"},
      %{"name" => "城关乡", "code" => "410727200000"},
      %{"name" => "荆乡回族乡", "code" => "410727201000"},
      %{"name" => "王村乡", "code" => "410727202000"},
      %{"name" => "荆隆宫乡", "code" => "410727206000"},
      %{"name" => "曹岗乡", "code" => "410727208000"},
      %{"name" => "冯村乡", "code" => "410727212000"}
    ]

  def next(input) when input == "延津县" or input == "410726",
    do: [
      %{"name" => "文岩街道", "code" => "410726001000"},
      %{"name" => "潭龙街道", "code" => "410726002000"},
      %{"name" => "塔铺街道", "code" => "410726003000"},
      %{"name" => "东屯镇", "code" => "410726101000"},
      %{"name" => "丰庄镇", "code" => "410726102000"},
      %{"name" => "石婆固镇", "code" => "410726103000"},
      %{"name" => "王楼镇", "code" => "410726104000"},
      %{"name" => "僧固乡", "code" => "410726200000"},
      %{"name" => "魏邱乡", "code" => "410726202000"},
      %{"name" => "司寨乡", "code" => "410726203000"},
      %{"name" => "马庄乡", "code" => "410726205000"},
      %{"name" => "胙城乡", "code" => "410726206000"},
      %{"name" => "榆林乡", "code" => "410726207000"},
      %{"name" => "国营林场", "code" => "410726400000"},
      %{"name" => "新兴农场", "code" => "410726401000"},
      %{"name" => "新乡市食品工业聚集区", "code" => "410726402000"},
      %{"name" => "新乡市纺织工业聚集区", "code" => "410726403000"}
    ]

  def next(input) when input == "原阳县" or input == "410725",
    do: [
      %{"name" => "阳和街道", "code" => "410725002000"},
      %{"name" => "原兴街道", "code" => "410725003000"},
      %{"name" => "齐街镇", "code" => "410725103000"},
      %{"name" => "太平镇", "code" => "410725104000"},
      %{"name" => "福宁集镇", "code" => "410725105000"},
      %{"name" => "官厂镇", "code" => "410725107000"},
      %{"name" => "大宾镇", "code" => "410725108000"},
      %{"name" => "葛埠口乡", "code" => "410725200000"},
      %{"name" => "蒋庄乡", "code" => "410725206000"},
      %{"name" => "陡门乡", "code" => "410725211000"},
      %{"name" => "路寨乡", "code" => "410725215000"},
      %{"name" => "阳阿乡", "code" => "410725216000"},
      %{"name" => "靳堂乡", "code" => "410725218000"}
    ]

  def next(input) when input == "获嘉县" or input == "410724",
    do: [
      %{"name" => "城关镇", "code" => "410724100000"},
      %{"name" => "照镜镇", "code" => "410724101000"},
      %{"name" => "黄堤镇", "code" => "410724102000"},
      %{"name" => "中和镇", "code" => "410724103000"},
      %{"name" => "徐营镇", "code" => "410724104000"},
      %{"name" => "冯庄镇", "code" => "410724105000"},
      %{"name" => "亢村镇", "code" => "410724106000"},
      %{"name" => "史庄镇", "code" => "410724107000"},
      %{"name" => "太山镇", "code" => "410724108000"},
      %{"name" => "位庄乡", "code" => "410724200000"},
      %{"name" => "大新庄乡", "code" => "410724203000"},
      %{"name" => "原种场", "code" => "410724400000"},
      %{"name" => "园艺场", "code" => "410724401000"},
      %{"name" => "农场", "code" => "410724402000"},
      %{"name" => "西工区", "code" => "410724560000"}
    ]

  def next(input) when input == "新乡县" or input == "410721",
    do: [
      %{"name" => "翟坡镇", "code" => "410721101000"},
      %{"name" => "小冀镇", "code" => "410721102000"},
      %{"name" => "七里营镇", "code" => "410721103000"},
      %{"name" => "朗公庙镇", "code" => "410721104000"},
      %{"name" => "古固寨镇", "code" => "410721105000"},
      %{"name" => "大召营镇", "code" => "410721107000"},
      %{"name" => "合河乡", "code" => "410721200000"},
      %{"name" => "新乡经济开发区", "code" => "410721560000"}
    ]

  def next(input) when input == "牧野区" or input == "410711",
    do: [
      %{"name" => "东干道街道", "code" => "410711001000"},
      %{"name" => "荣校路街道", "code" => "410711002000"},
      %{"name" => "北干道街道", "code" => "410711003000"},
      %{"name" => "花园街道", "code" => "410711004000"},
      %{"name" => "卫北街道", "code" => "410711005000"},
      %{"name" => "新辉路街道", "code" => "410711006000"},
      %{"name" => "和平路街道", "code" => "410711007000"},
      %{"name" => "王村镇", "code" => "410711100000"},
      %{"name" => "牧野镇", "code" => "410711101000"},
      %{"name" => "新乡化学与物理电源产业园区", "code" => "410711400000"}
    ]

  def next(input) when input == "凤泉区" or input == "410704",
    do: [
      %{"name" => "宝西街道", "code" => "410704001000"},
      %{"name" => "宝东街道", "code" => "410704002000"},
      %{"name" => "大块镇", "code" => "410704100000"},
      %{"name" => "耿黄镇", "code" => "410704101000"},
      %{"name" => "潞王坟乡", "code" => "410704200000"}
    ]

  def next(input) when input == "卫滨区" or input == "410703",
    do: [
      %{"name" => "胜利路街道", "code" => "410703001000"},
      %{"name" => "解放路街道", "code" => "410703002000"},
      %{"name" => "中同街街道", "code" => "410703003000"},
      %{"name" => "健康路街道", "code" => "410703004000"},
      %{"name" => "自由路街道", "code" => "410703007000"},
      %{"name" => "南桥街道", "code" => "410703008000"},
      %{"name" => "铁西街道", "code" => "410703009000"},
      %{"name" => "平原镇", "code" => "410703100000"}
    ]

  def next(input) when input == "红旗区" or input == "410702",
    do: [
      %{"name" => "西街街道", "code" => "410702001000"},
      %{"name" => "东街街道", "code" => "410702002000"},
      %{"name" => "渠东街道", "code" => "410702003000"},
      %{"name" => "文化街街道", "code" => "410702007000"},
      %{"name" => "向阳小区街道", "code" => "410702009000"},
      %{"name" => "洪门镇", "code" => "410702100000"},
      %{"name" => "小店镇", "code" => "410702101000"}
    ]

  def next(input) when input == "鹤壁经济技术开发区" or input == "410671",
    do: [
      %{"name" => "龙岗街道", "code" => "410671400000"},
      %{"name" => "渤海路街道", "code" => "410671401000"},
      %{"name" => "海河路街道", "code" => "410671402000"}
    ]

  def next(input) when input == "淇县" or input == "410622",
    do: [
      %{"name" => "朝歌街道", "code" => "410622001000"},
      %{"name" => "桥盟街道", "code" => "410622002000"},
      %{"name" => "卫都街道", "code" => "410622003000"},
      %{"name" => "灵山街道", "code" => "410622004000"},
      %{"name" => "高村镇", "code" => "410622101000"},
      %{"name" => "北阳镇", "code" => "410622102000"},
      %{"name" => "西岗镇", "code" => "410622103000"},
      %{"name" => "庙口镇", "code" => "410622104000"},
      %{"name" => "黄洞乡", "code" => "410622202000"}
    ]

  def next(input) when input == "浚县" or input == "410621",
    do: [
      %{"name" => "卫溪街道", "code" => "410621001000"},
      %{"name" => "浚州街道", "code" => "410621002000"},
      %{"name" => "黎阳街道", "code" => "410621003000"},
      %{"name" => "伾山街道", "code" => "410621004000"},
      %{"name" => "善堂镇", "code" => "410621101000"},
      %{"name" => "屯子镇", "code" => "410621102000"},
      %{"name" => "新镇镇", "code" => "410621104000"},
      %{"name" => "小河镇", "code" => "410621105000"},
      %{"name" => "卫贤镇", "code" => "410621107000"},
      %{"name" => "王庄镇", "code" => "410621108000"},
      %{"name" => "白寺镇", "code" => "410621109000"}
    ]

  def next(input) when input == "淇滨区" or input == "410611",
    do: [
      %{"name" => "金山街道", "code" => "410611001000"},
      %{"name" => "九州路街道", "code" => "410611002000"},
      %{"name" => "黎阳路街道", "code" => "410611003000"},
      %{"name" => "长江路街道", "code" => "410611004000"},
      %{"name" => "泰山路街道", "code" => "410611005000"},
      %{"name" => "大赉店镇", "code" => "410611100000"},
      %{"name" => "钜桥镇", "code" => "410611101000"},
      %{"name" => "上峪乡", "code" => "410611200000"},
      %{"name" => "大河涧乡", "code" => "410611201000"},
      %{"name" => "天山路街道", "code" => "410611566000"}
    ]

  def next(input) when input == "山城区" or input == "410603",
    do: [
      %{"name" => "红旗街街道", "code" => "410603001000"},
      %{"name" => "长风中路街道", "code" => "410603002000"},
      %{"name" => "山城路街道", "code" => "410603003000"},
      %{"name" => "汤河桥街道", "code" => "410603004000"},
      %{"name" => "鹿楼街道", "code" => "410603005000"},
      %{"name" => "宝山街道", "code" => "410603006000"},
      %{"name" => "大胡街道", "code" => "410603007000"},
      %{"name" => "石林镇", "code" => "410603100000"}
    ]

  def next(input) when input == "鹤山区" or input == "410602",
    do: [
      %{"name" => "中山北路街道", "code" => "410602001000"},
      %{"name" => "中山路街道", "code" => "410602002000"},
      %{"name" => "新华街街道", "code" => "410602003000"},
      %{"name" => "鹤山街街道", "code" => "410602004000"},
      %{"name" => "九矿广场街道", "code" => "410602005000"},
      %{"name" => "鹤壁集镇", "code" => "410602100000"},
      %{"name" => "姬家山乡", "code" => "410602201000"}
    ]

  def next(input) when input == "林州市" or input == "410581",
    do: [
      %{"name" => "开元街道", "code" => "410581001000"},
      %{"name" => "振林街道", "code" => "410581002000"},
      %{"name" => "龙山街道", "code" => "410581003000"},
      %{"name" => "桂园街道", "code" => "410581004000"},
      %{"name" => "合涧镇", "code" => "410581101000"},
      %{"name" => "临淇镇", "code" => "410581102000"},
      %{"name" => "东姚镇", "code" => "410581103000"},
      %{"name" => "横水镇", "code" => "410581104000"},
      %{"name" => "河顺镇", "code" => "410581105000"},
      %{"name" => "任村镇", "code" => "410581106000"},
      %{"name" => "姚村镇", "code" => "410581107000"},
      %{"name" => "陵阳镇", "code" => "410581108000"},
      %{"name" => "原康镇", "code" => "410581109000"},
      %{"name" => "五龙镇", "code" => "410581110000"},
      %{"name" => "采桑镇", "code" => "410581111000"},
      %{"name" => "东岗镇", "code" => "410581112000"},
      %{"name" => "桂林镇", "code" => "410581113000"},
      %{"name" => "茶店镇", "code" => "410581114000"},
      %{"name" => "石板岩镇", "code" => "410581115000"},
      %{"name" => "黄华镇", "code" => "410581116000"}
    ]

  def next(input) when input == "安阳高新技术产业开发区" or input == "410571",
    do: [
      %{"name" => "开发区峨嵋大街街道", "code" => "410571563000"},
      %{"name" => "开发区银杏大街街道", "code" => "410571564000"},
      %{"name" => "开发区商颂大街街道", "code" => "410571565000"}
    ]

  def next(input) when input == "内黄县" or input == "410527",
    do: [
      %{"name" => "繁阳街道", "code" => "410527001000"},
      %{"name" => "龙庆街道", "code" => "410527002000"},
      %{"name" => "东庄镇", "code" => "410527101000"},
      %{"name" => "井店镇", "code" => "410527102000"},
      %{"name" => "梁庄镇", "code" => "410527103000"},
      %{"name" => "后河镇", "code" => "410527104000"},
      %{"name" => "楚旺镇", "code" => "410527105000"},
      %{"name" => "田氏镇", "code" => "410527106000"},
      %{"name" => "二安镇", "code" => "410527107000"},
      %{"name" => "亳城镇", "code" => "410527108000"},
      %{"name" => "豆公镇", "code" => "410527109000"},
      %{"name" => "马上乡", "code" => "410527201000"},
      %{"name" => "高堤乡", "code" => "410527202000"},
      %{"name" => "六村乡", "code" => "410527205000"},
      %{"name" => "中召乡", "code" => "410527206000"},
      %{"name" => "宋村乡", "code" => "410527207000"},
      %{"name" => "石盘屯乡", "code" => "410527209000"}
    ]

  def next(input) when input == "滑县" or input == "410526",
    do: [
      %{"name" => "道口镇街道", "code" => "410526001000"},
      %{"name" => "城关街道", "code" => "410526002000"},
      %{"name" => "锦和街道", "code" => "410526003000"},
      %{"name" => "白道口镇", "code" => "410526102000"},
      %{"name" => "留固镇", "code" => "410526103000"},
      %{"name" => "上官镇", "code" => "410526104000"},
      %{"name" => "牛屯镇", "code" => "410526105000"},
      %{"name" => "万古镇", "code" => "410526106000"},
      %{"name" => "高平镇", "code" => "410526107000"},
      %{"name" => "王庄镇", "code" => "410526108000"},
      %{"name" => "老店镇", "code" => "410526109000"},
      %{"name" => "慈周寨镇", "code" => "410526110000"},
      %{"name" => "焦虎镇", "code" => "410526111000"},
      %{"name" => "四间房镇", "code" => "410526112000"},
      %{"name" => "八里营镇", "code" => "410526113000"},
      %{"name" => "赵营镇", "code" => "410526114000"},
      %{"name" => "半坡店镇", "code" => "410526115000"},
      %{"name" => "枣村乡", "code" => "410526200000"},
      %{"name" => "大寨乡", "code" => "410526204000"},
      %{"name" => "桑村乡", "code" => "410526205000"},
      %{"name" => "老爷庙乡", "code" => "410526206000"},
      %{"name" => "瓦岗寨乡", "code" => "410526209000"},
      %{"name" => "小铺乡", "code" => "410526212000"}
    ]

  def next(input) when input == "汤阴县" or input == "410523",
    do: [
      %{"name" => "城关镇", "code" => "410523100000"},
      %{"name" => "菜园镇", "code" => "410523101000"},
      %{"name" => "任固镇", "code" => "410523102000"},
      %{"name" => "五陵镇", "code" => "410523103000"},
      %{"name" => "宜沟镇", "code" => "410523104000"},
      %{"name" => "白营镇", "code" => "410523105000"},
      %{"name" => "伏道镇", "code" => "410523106000"},
      %{"name" => "韩庄镇", "code" => "410523107000"},
      %{"name" => "古贤镇", "code" => "410523108000"},
      %{"name" => "瓦岗乡", "code" => "410523203000"}
    ]

  def next(input) when input == "安阳县" or input == "410522",
    do: [
      %{"name" => "铜冶镇", "code" => "410522102000"},
      %{"name" => "白璧镇", "code" => "410522106000"},
      %{"name" => "吕村镇", "code" => "410522108000"},
      %{"name" => "伦掌镇", "code" => "410522109000"},
      %{"name" => "崔家桥镇", "code" => "410522111000"},
      %{"name" => "辛村镇", "code" => "410522112000"},
      %{"name" => "韩陵镇", "code" => "410522113000"},
      %{"name" => "永和镇", "code" => "410522114000"},
      %{"name" => "都里镇", "code" => "410522115000"},
      %{"name" => "高庄镇", "code" => "410522116000"},
      %{"name" => "磊口乡", "code" => "410522203000"},
      %{"name" => "许家沟乡", "code" => "410522204000"},
      %{"name" => "安丰乡", "code" => "410522210000"},
      %{"name" => "洪河屯乡", "code" => "410522211000"},
      %{"name" => "瓦店乡", "code" => "410522214000"},
      %{"name" => "北郭乡", "code" => "410522216000"}
    ]

  def next(input) when input == "龙安区" or input == "410506",
    do: [
      %{"name" => "田村街道", "code" => "410506001000"},
      %{"name" => "彰武街道", "code" => "410506002000"},
      %{"name" => "文昌大道街道", "code" => "410506003000"},
      %{"name" => "文明大道街道", "code" => "410506004000"},
      %{"name" => "太行小区街道", "code" => "410506005000"},
      %{"name" => "中州路街道", "code" => "410506006000"},
      %{"name" => "龙泉镇", "code" => "410506100000"},
      %{"name" => "马投涧镇", "code" => "410506101000"},
      %{"name" => "善应镇", "code" => "410506103000"},
      %{"name" => "东风乡", "code" => "410506201000"},
      %{"name" => "马家乡", "code" => "410506205000"}
    ]

  def next(input) when input == "殷都区" or input == "410505",
    do: [
      %{"name" => "梅园庄街道", "code" => "410505001000"},
      %{"name" => "李珍街道", "code" => "410505002000"},
      %{"name" => "电厂路街道", "code" => "410505003000"},
      %{"name" => "纱厂路街道", "code" => "410505004000"},
      %{"name" => "铁西路街道", "code" => "410505005000"},
      %{"name" => "水冶街道", "code" => "410505006000"},
      %{"name" => "清风街街道", "code" => "410505007000"},
      %{"name" => "北蒙街道", "code" => "410505008000"},
      %{"name" => "相台街道", "code" => "410505009000"},
      %{"name" => "曲沟镇", "code" => "410505100000"},
      %{"name" => "水冶镇", "code" => "410505101000"},
      %{"name" => "西郊乡", "code" => "410505200000"}
    ]

  def next(input) when input == "北关区" or input == "410503",
    do: [
      %{"name" => "红旗路街道", "code" => "410503001000"},
      %{"name" => "解放路街道", "code" => "410503003000"},
      %{"name" => "灯塔路街道", "code" => "410503004000"},
      %{"name" => "豆腐营街道", "code" => "410503005000"},
      %{"name" => "洹北街道", "code" => "410503006000"},
      %{"name" => "彰东街道", "code" => "410503008000"},
      %{"name" => "彰北街道", "code" => "410503009000"},
      %{"name" => "民航路街道", "code" => "410503010000"},
      %{"name" => "曙光路街道", "code" => "410503011000"},
      %{"name" => "柏庄镇", "code" => "410503100000"}
    ]

  def next(input) when input == "文峰区" or input == "410502",
    do: [
      %{"name" => "东大街街道", "code" => "410502001000"},
      %{"name" => "头二三街道", "code" => "410502002000"},
      %{"name" => "甜水井街道", "code" => "410502003000"},
      %{"name" => "东关街道", "code" => "410502004000"},
      %{"name" => "南关街道", "code" => "410502005000"},
      %{"name" => "西大街街道", "code" => "410502006000"},
      %{"name" => "北大街街道", "code" => "410502008000"},
      %{"name" => "西关街道", "code" => "410502011000"},
      %{"name" => "紫薇大道街道", "code" => "410502012000"},
      %{"name" => "光华路街道", "code" => "410502013000"},
      %{"name" => "永明路街道", "code" => "410502014000"},
      %{"name" => "中华路街道", "code" => "410502015000"},
      %{"name" => "宝莲寺镇", "code" => "410502101000"},
      %{"name" => "步行街综合治理办公室", "code" => "410502561000"},
      %{"name" => "北大街综合治理办公室", "code" => "410502562000"}
    ]

  def next(input) when input == "汝州市" or input == "410482",
    do: [
      %{"name" => "煤山街道", "code" => "410482001000"},
      %{"name" => "风穴路街道", "code" => "410482002000"},
      %{"name" => "钟楼街道", "code" => "410482003000"},
      %{"name" => "洗耳河街道", "code" => "410482004000"},
      %{"name" => "汝南街道", "code" => "410482005000"},
      %{"name" => "紫云路街道", "code" => "410482006000"},
      %{"name" => "寄料镇", "code" => "410482101000"},
      %{"name" => "温泉镇", "code" => "410482102000"},
      %{"name" => "临汝镇", "code" => "410482103000"},
      %{"name" => "小屯镇", "code" => "410482104000"},
      %{"name" => "杨楼镇", "code" => "410482105000"},
      %{"name" => "蟒川镇", "code" => "410482106000"},
      %{"name" => "庙下镇", "code" => "410482107000"},
      %{"name" => "米庙镇", "code" => "410482108000"},
      %{"name" => "陵头镇", "code" => "410482109000"},
      %{"name" => "纸坊镇", "code" => "410482110000"},
      %{"name" => "大峪镇", "code" => "410482111000"},
      %{"name" => "夏店镇", "code" => "410482112000"},
      %{"name" => "焦村镇", "code" => "410482113000"},
      %{"name" => "王寨乡", "code" => "410482202000"},
      %{"name" => "骑岭乡", "code" => "410482207000"}
    ]

  def next(input) when input == "舞钢市" or input == "410481",
    do: [
      %{"name" => "垭口街道", "code" => "410481001000"},
      %{"name" => "寺坡街道", "code" => "410481002000"},
      %{"name" => "朱兰街道", "code" => "410481003000"},
      %{"name" => "院岭街道", "code" => "410481004000"},
      %{"name" => "矿建街道", "code" => "410481005000"},
      %{"name" => "铁山街道", "code" => "410481006000"},
      %{"name" => "红山街道", "code" => "410481007000"},
      %{"name" => "尚店镇", "code" => "410481100000"},
      %{"name" => "八台镇", "code" => "410481101000"},
      %{"name" => "尹集镇", "code" => "410481102000"},
      %{"name" => "枣林镇", "code" => "410481103000"},
      %{"name" => "庙街乡", "code" => "410481202000"},
      %{"name" => "武功乡", "code" => "410481204000"},
      %{"name" => "杨庄乡", "code" => "410481205000"}
    ]

  def next(input) when input == "平顶山市城乡一体化示范区" or input == "410472",
    do: [
      %{"name" => "湖滨路街道", "code" => "410472001000"},
      %{"name" => "滍阳镇", "code" => "410472101000"},
      %{"name" => "滨湖街道", "code" => "410472401000"},
      %{"name" => "应滨街道", "code" => "410472402000"}
    ]

  def next(input) when input == "平顶山高新技术产业开发区" or input == "410471",
    do: [
      %{"name" => "皇台街道", "code" => "410471001000"},
      %{"name" => "遵化店镇", "code" => "410471100000"}
    ]

  def next(input) when input == "郏县" or input == "410425",
    do: [
      %{"name" => "龙山街道", "code" => "410425001000"},
      %{"name" => "东城街道", "code" => "410425002000"},
      %{"name" => "冢头镇", "code" => "410425101000"},
      %{"name" => "安良镇", "code" => "410425102000"},
      %{"name" => "堂街镇", "code" => "410425103000"},
      %{"name" => "薛店镇", "code" => "410425104000"},
      %{"name" => "长桥镇", "code" => "410425105000"},
      %{"name" => "茨芭镇", "code" => "410425106000"},
      %{"name" => "黄道镇", "code" => "410425107000"},
      %{"name" => "李口镇", "code" => "410425108000"},
      %{"name" => "王集乡", "code" => "410425200000"},
      %{"name" => "姚庄回族乡", "code" => "410425202000"},
      %{"name" => "白庙乡", "code" => "410425203000"},
      %{"name" => "广阔天地乡", "code" => "410425204000"},
      %{"name" => "渣元乡", "code" => "410425205000"}
    ]

  def next(input) when input == "鲁山县" or input == "410423",
    do: [
      %{"name" => "露峰街道", "code" => "410423001000"},
      %{"name" => "琴台街道", "code" => "410423002000"},
      %{"name" => "鲁阳街道", "code" => "410423003000"},
      %{"name" => "汇源街道", "code" => "410423004000"},
      %{"name" => "下汤镇", "code" => "410423101000"},
      %{"name" => "梁洼镇", "code" => "410423102000"},
      %{"name" => "张官营镇", "code" => "410423103000"},
      %{"name" => "张良镇", "code" => "410423104000"},
      %{"name" => "尧山镇", "code" => "410423105000"},
      %{"name" => "瓦屋镇", "code" => "410423106000"},
      %{"name" => "赵村镇", "code" => "410423107000"},
      %{"name" => "四棵树乡", "code" => "410423201000"},
      %{"name" => "团城乡", "code" => "410423202000"},
      %{"name" => "熊背乡", "code" => "410423203000"},
      %{"name" => "让河乡", "code" => "410423204000"},
      %{"name" => "观音寺乡", "code" => "410423206000"},
      %{"name" => "昭平台库区乡", "code" => "410423207000"},
      %{"name" => "背孜乡", "code" => "410423208000"},
      %{"name" => "仓头乡", "code" => "410423209000"},
      %{"name" => "董周乡", "code" => "410423210000"},
      %{"name" => "张店乡", "code" => "410423211000"},
      %{"name" => "辛集乡", "code" => "410423212000"},
      %{"name" => "滚子营乡", "code" => "410423213000"},
      %{"name" => "马楼乡", "code" => "410423214000"}
    ]

  def next(input) when input == "叶县" or input == "410422",
    do: [
      %{"name" => "九龙街道", "code" => "410422001000"},
      %{"name" => "昆阳街道", "code" => "410422002000"},
      %{"name" => "盐都街道", "code" => "410422003000"},
      %{"name" => "任店镇", "code" => "410422101000"},
      %{"name" => "保安镇", "code" => "410422102000"},
      %{"name" => "仙台镇", "code" => "410422103000"},
      %{"name" => "叶邑镇", "code" => "410422105000"},
      %{"name" => "廉村镇", "code" => "410422106000"},
      %{"name" => "常村镇", "code" => "410422107000"},
      %{"name" => "辛店镇", "code" => "410422108000"},
      %{"name" => "洪庄杨镇", "code" => "410422109000"},
      %{"name" => "龚店镇", "code" => "410422110000"},
      %{"name" => "夏李乡", "code" => "410422201000"},
      %{"name" => "马庄回族乡", "code" => "410422203000"},
      %{"name" => "田庄乡", "code" => "410422204000"},
      %{"name" => "龙泉乡", "code" => "410422207000"},
      %{"name" => "水寨乡", "code" => "410422208000"},
      %{"name" => "邓李乡", "code" => "410422210000"}
    ]

  def next(input) when input == "宝丰县" or input == "410421",
    do: [
      %{"name" => "铁路街道", "code" => "410421001000"},
      %{"name" => "城关镇", "code" => "410421100000"},
      %{"name" => "周庄镇", "code" => "410421101000"},
      %{"name" => "闹店镇", "code" => "410421102000"},
      %{"name" => "石桥镇", "code" => "410421103000"},
      %{"name" => "商酒务镇", "code" => "410421104000"},
      %{"name" => "大营镇", "code" => "410421105000"},
      %{"name" => "张八桥镇", "code" => "410421106000"},
      %{"name" => "杨庄镇", "code" => "410421107000"},
      %{"name" => "赵庄镇", "code" => "410421108000"},
      %{"name" => "肖旗乡", "code" => "410421200000"},
      %{"name" => "前营乡", "code" => "410421202000"},
      %{"name" => "李庄乡", "code" => "410421203000"}
    ]

  def next(input) when input == "湛河区" or input == "410411",
    do: [
      %{"name" => "马庄街道", "code" => "410411001000"},
      %{"name" => "南环路街道", "code" => "410411002000"},
      %{"name" => "姚孟街道", "code" => "410411003000"},
      %{"name" => "九里山街道", "code" => "410411004000"},
      %{"name" => "轻工路街道", "code" => "410411005000"},
      %{"name" => "高阳路街道", "code" => "410411006000"},
      %{"name" => "北渡街道", "code" => "410411007000"},
      %{"name" => "荆山街道", "code" => "410411008000"},
      %{"name" => "河滨街道", "code" => "410411009000"},
      %{"name" => "曹镇乡", "code" => "410411200000"}
    ]

  def next(input) when input == "石龙区" or input == "410404",
    do: [
      %{"name" => "高庄街道", "code" => "410404001000"},
      %{"name" => "龙兴街道", "code" => "410404002000"},
      %{"name" => "人民路街道", "code" => "410404003000"},
      %{"name" => "龙河街道", "code" => "410404004000"}
    ]

  def next(input) when input == "卫东区" or input == "410403",
    do: [
      %{"name" => "东安路街道", "code" => "410403001000"},
      %{"name" => "优越路街道", "code" => "410403002000"},
      %{"name" => "五一路街道", "code" => "410403003000"},
      %{"name" => "建设路街道", "code" => "410403004000"},
      %{"name" => "东环路街道", "code" => "410403005000"},
      %{"name" => "东工人镇街道", "code" => "410403006000"},
      %{"name" => "光华路街道", "code" => "410403007000"},
      %{"name" => "鸿鹰街道", "code" => "410403008000"},
      %{"name" => "申楼街道", "code" => "410403009000"},
      %{"name" => "北环路街道", "code" => "410403010000"},
      %{"name" => "东高皇街道", "code" => "410403011000"},
      %{"name" => "蒲城街道", "code" => "410403012000"}
    ]

  def next(input) when input == "新华区" or input == "410402",
    do: [
      %{"name" => "曙光街街道", "code" => "410402001000"},
      %{"name" => "光明路街道", "code" => "410402002000"},
      %{"name" => "中兴路街道", "code" => "410402003000"},
      %{"name" => "矿工路街道", "code" => "410402004000"},
      %{"name" => "西市场街道", "code" => "410402005000"},
      %{"name" => "新新街街道", "code" => "410402006000"},
      %{"name" => "青石山街道", "code" => "410402007000"},
      %{"name" => "湛河北路街道", "code" => "410402008000"},
      %{"name" => "西高皇街道", "code" => "410402010000"},
      %{"name" => "焦店镇", "code" => "410402100000"},
      %{"name" => "香山街道筹备组", "code" => "410402400000"}
    ]

  def next(input) when input == "洛阳高新技术产业开发区" or input == "410371",
    do: [
      %{"name" => "瀛洲街道", "code" => "410371001000"},
      %{"name" => "辛店街道", "code" => "410371002000"},
      %{"name" => "徐家营街道", "code" => "410371003000"}
    ]

  def next(input) when input == "伊川县" or input == "410329",
    do: [
      %{"name" => "城关街道", "code" => "410329001000"},
      %{"name" => "河滨街道", "code" => "410329002000"},
      %{"name" => "鸣皋镇", "code" => "410329101000"},
      %{"name" => "水寨镇", "code" => "410329102000"},
      %{"name" => "彭婆镇", "code" => "410329103000"},
      %{"name" => "白沙镇", "code" => "410329104000"},
      %{"name" => "江左镇", "code" => "410329105000"},
      %{"name" => "高山镇", "code" => "410329106000"},
      %{"name" => "吕店镇", "code" => "410329107000"},
      %{"name" => "半坡镇", "code" => "410329108000"},
      %{"name" => "酒后镇", "code" => "410329109000"},
      %{"name" => "白元镇", "code" => "410329110000"},
      %{"name" => "鸦岭镇", "code" => "410329111000"},
      %{"name" => "葛寨镇", "code" => "410329112000"},
      %{"name" => "平等乡", "code" => "410329203000"}
    ]

  def next(input) when input == "洛宁县" or input == "410328",
    do: [
      %{"name" => "永宁街道", "code" => "410328001000"},
      %{"name" => "王范回族镇", "code" => "410328101000"},
      %{"name" => "上戈镇", "code" => "410328102000"},
      %{"name" => "下峪镇", "code" => "410328103000"},
      %{"name" => "河底镇", "code" => "410328104000"},
      %{"name" => "兴华镇", "code" => "410328105000"},
      %{"name" => "东宋镇", "code" => "410328106000"},
      %{"name" => "马店镇", "code" => "410328107000"},
      %{"name" => "故县镇", "code" => "410328108000"},
      %{"name" => "赵村镇", "code" => "410328109000"},
      %{"name" => "长水镇", "code" => "410328110000"},
      %{"name" => "景阳镇", "code" => "410328111000"},
      %{"name" => "城郊乡", "code" => "410328200000"},
      %{"name" => "小界乡", "code" => "410328205000"},
      %{"name" => "罗岭乡", "code" => "410328209000"},
      %{"name" => "底张乡", "code" => "410328213000"},
      %{"name" => "陈吴乡", "code" => "410328216000"},
      %{"name" => "涧口乡", "code" => "410328217000"}
    ]

  def next(input) when input == "宜阳县" or input == "410327",
    do: [
      %{"name" => "兴宜街道", "code" => "410327001000"},
      %{"name" => "柳泉镇", "code" => "410327102000"},
      %{"name" => "韩城镇", "code" => "410327103000"},
      %{"name" => "白杨镇", "code" => "410327104000"},
      %{"name" => "香鹿山镇", "code" => "410327105000"},
      %{"name" => "锦屏镇", "code" => "410327106000"},
      %{"name" => "三乡镇", "code" => "410327107000"},
      %{"name" => "张坞镇", "code" => "410327108000"},
      %{"name" => "莲庄镇", "code" => "410327109000"},
      %{"name" => "赵保镇", "code" => "410327110000"},
      %{"name" => "樊村镇", "code" => "410327111000"},
      %{"name" => "高村镇", "code" => "410327112000"},
      %{"name" => "盐镇乡", "code" => "410327203000"},
      %{"name" => "花果山乡", "code" => "410327208000"},
      %{"name" => "上观乡", "code" => "410327209000"},
      %{"name" => "董王庄乡", "code" => "410327212000"}
    ]

  def next(input) when input == "汝阳县" or input == "410326",
    do: [
      %{"name" => "城关镇", "code" => "410326100000"},
      %{"name" => "上店镇", "code" => "410326101000"},
      %{"name" => "付店镇", "code" => "410326102000"},
      %{"name" => "小店镇", "code" => "410326103000"},
      %{"name" => "三屯镇", "code" => "410326104000"},
      %{"name" => "刘店镇", "code" => "410326105000"},
      %{"name" => "内埠镇", "code" => "410326106000"},
      %{"name" => "陶营镇", "code" => "410326107000"},
      %{"name" => "柏树乡", "code" => "410326200000"},
      %{"name" => "十八盘乡", "code" => "410326202000"},
      %{"name" => "靳村乡", "code" => "410326203000"},
      %{"name" => "王坪乡", "code" => "410326204000"},
      %{"name" => "蔡店乡", "code" => "410326209000"},
      %{"name" => "大安工业园区", "code" => "410326400000"}
    ]

  def next(input) when input == "嵩县" or input == "410325",
    do: [
      %{"name" => "城关镇", "code" => "410325100000"},
      %{"name" => "田湖镇", "code" => "410325101000"},
      %{"name" => "旧县镇", "code" => "410325102000"},
      %{"name" => "车村镇", "code" => "410325103000"},
      %{"name" => "闫庄镇", "code" => "410325104000"},
      %{"name" => "德亭镇", "code" => "410325105000"},
      %{"name" => "大章镇", "code" => "410325106000"},
      %{"name" => "白河镇", "code" => "410325107000"},
      %{"name" => "纸房镇", "code" => "410325108000"},
      %{"name" => "饭坡镇", "code" => "410325109000"},
      %{"name" => "九皋镇", "code" => "410325110000"},
      %{"name" => "陆浑镇", "code" => "410325111000"},
      %{"name" => "大坪乡", "code" => "410325201000"},
      %{"name" => "何村乡", "code" => "410325203000"},
      %{"name" => "黄庄乡", "code" => "410325209000"},
      %{"name" => "木植街乡", "code" => "410325210000"},
      %{"name" => "陶村林场", "code" => "410325400000"},
      %{"name" => "五马寺林场", "code" => "410325401000"},
      %{"name" => "王莽寨林场", "code" => "410325402000"}
    ]

  def next(input) when input == "栾川县" or input == "410324",
    do: [
      %{"name" => "耕莘街道", "code" => "410324001000"},
      %{"name" => "赤土店镇", "code" => "410324101000"},
      %{"name" => "合峪镇", "code" => "410324102000"},
      %{"name" => "潭头镇", "code" => "410324103000"},
      %{"name" => "三川镇", "code" => "410324104000"},
      %{"name" => "冷水镇", "code" => "410324105000"},
      %{"name" => "陶湾镇", "code" => "410324106000"},
      %{"name" => "石庙镇", "code" => "410324107000"},
      %{"name" => "庙子镇", "code" => "410324108000"},
      %{"name" => "狮子庙镇", "code" => "410324109000"},
      %{"name" => "白土镇", "code" => "410324110000"},
      %{"name" => "叫河镇", "code" => "410324111000"},
      %{"name" => "栾川乡", "code" => "410324200000"},
      %{"name" => "秋扒乡", "code" => "410324203000"},
      %{"name" => "重渡沟生态旅游示范区", "code" => "410324400000"}
    ]

  def next(input) when input == "新安县" or input == "410323",
    do: [
      %{"name" => "汉关街道", "code" => "410323001000"},
      %{"name" => "石寺镇", "code" => "410323101000"},
      %{"name" => "五头镇", "code" => "410323102000"},
      %{"name" => "磁涧镇", "code" => "410323103000"},
      %{"name" => "铁门镇", "code" => "410323104000"},
      %{"name" => "南李村镇", "code" => "410323105000"},
      %{"name" => "北冶镇", "code" => "410323106000"},
      %{"name" => "仓头镇", "code" => "410323107000"},
      %{"name" => "正村镇", "code" => "410323108000"},
      %{"name" => "石井镇", "code" => "410323109000"},
      %{"name" => "青要山镇", "code" => "410323110000"}
    ]

  def next(input) when input == "洛龙区" or input == "410311",
    do: [
      %{"name" => "开元路街道", "code" => "410311002000"},
      %{"name" => "龙门石窟街道", "code" => "410311003000"},
      %{"name" => "关林街道", "code" => "410311004000"},
      %{"name" => "太康东路街道", "code" => "410311005000"},
      %{"name" => "古城街道", "code" => "410311006000"},
      %{"name" => "科技园街道", "code" => "410311007000"},
      %{"name" => "翠云路街道", "code" => "410311008000"},
      %{"name" => "龙门街道", "code" => "410311009000"},
      %{"name" => "学府街道", "code" => "410311010000"},
      %{"name" => "定鼎门街道", "code" => "410311011000"},
      %{"name" => "李楼街道", "code" => "410311012000"},
      %{"name" => "安乐街道", "code" => "410311013000"},
      %{"name" => "丰李街道", "code" => "410311014000"},
      %{"name" => "李村街道", "code" => "410311021000"},
      %{"name" => "寇店镇", "code" => "410311194000"},
      %{"name" => "诸葛镇", "code" => "410311195000"},
      %{"name" => "庞村镇", "code" => "410311197000"},
      %{"name" => "佃庄镇", "code" => "410311199000"}
    ]

  def next(input) when input == "孟津区" or input == "410308",
    do: [
      %{"name" => "西霞院街道", "code" => "410308002000"},
      %{"name" => "康乐街道", "code" => "410308003000"},
      %{"name" => "吉利街道", "code" => "410308004000"},
      %{"name" => "河阳街道", "code" => "410308005000"},
      %{"name" => "城关镇", "code" => "410308100000"},
      %{"name" => "会盟镇", "code" => "410308101000"},
      %{"name" => "平乐镇", "code" => "410308102000"},
      %{"name" => "送庄镇", "code" => "410308103000"},
      %{"name" => "白鹤镇", "code" => "410308104000"},
      %{"name" => "朝阳镇", "code" => "410308105000"},
      %{"name" => "马屯镇", "code" => "410308106000"},
      %{"name" => "麻屯镇", "code" => "410308107000"},
      %{"name" => "横水镇", "code" => "410308108000"},
      %{"name" => "常袋镇", "code" => "410308109000"}
    ]

  def next(input) when input == "偃师区" or input == "410307",
    do: [
      %{"name" => "首阳山街道", "code" => "410307004000"},
      %{"name" => "商城街道", "code" => "410307005000"},
      %{"name" => "槐新街道", "code" => "410307006000"},
      %{"name" => "伊洛街道", "code" => "410307007000"},
      %{"name" => "翟镇镇", "code" => "410307103000"},
      %{"name" => "岳滩镇", "code" => "410307104000"},
      %{"name" => "顾县镇", "code" => "410307105000"},
      %{"name" => "缑氏镇", "code" => "410307106000"},
      %{"name" => "府店镇", "code" => "410307107000"},
      %{"name" => "高龙镇", "code" => "410307108000"},
      %{"name" => "山化镇", "code" => "410307109000"},
      %{"name" => "大口镇", "code" => "410307110000"},
      %{"name" => "邙岭镇", "code" => "410307111000"}
    ]

  def next(input) when input == "涧西区" or input == "410305",
    do: [
      %{"name" => "湖北路街道", "code" => "410305001000"},
      %{"name" => "天津路街道", "code" => "410305002000"},
      %{"name" => "长春路街道", "code" => "410305003000"},
      %{"name" => "南昌路街道", "code" => "410305004000"},
      %{"name" => "长安路街道", "code" => "410305005000"},
      %{"name" => "重庆路街道", "code" => "410305006000"},
      %{"name" => "郑州路街道", "code" => "410305007000"},
      %{"name" => "武汉路街道", "code" => "410305008000"},
      %{"name" => "珠江路街道", "code" => "410305010000"},
      %{"name" => "周山路街道", "code" => "410305011000"},
      %{"name" => "工农街道", "code" => "410305012000"}
    ]

  def next(input) when input == "瀍河回族区" or input == "410304",
    do: [
      %{"name" => "东关街道", "code" => "410304001000"},
      %{"name" => "瀍西街道", "code" => "410304002000"},
      %{"name" => "五股路街道", "code" => "410304003000"},
      %{"name" => "北窑街道", "code" => "410304004000"},
      %{"name" => "塔湾街道", "code" => "410304005000"},
      %{"name" => "杨文街道", "code" => "410304006000"},
      %{"name" => "华林街道", "code" => "410304007000"},
      %{"name" => "白马寺镇", "code" => "410304100000"},
      %{"name" => "瀍河回族乡", "code" => "410304200000"}
    ]

  def next(input) when input == "西工区" or input == "410303",
    do: [
      %{"name" => "王城路街道", "code" => "410303001000"},
      %{"name" => "金谷园路街道", "code" => "410303002000"},
      %{"name" => "西工街道", "code" => "410303003000"},
      %{"name" => "邙岭路街道", "code" => "410303004000"},
      %{"name" => "唐宫路街道", "code" => "410303006000"},
      %{"name" => "汉屯路街道", "code" => "410303007000"},
      %{"name" => "凯旋东路街道", "code" => "410303008000"},
      %{"name" => "洛北街道", "code" => "410303009000"},
      %{"name" => "红山街道", "code" => "410303010000"}
    ]

  def next(input) when input == "老城区" or input == "410302",
    do: [
      %{"name" => "西关街道", "code" => "410302001000"},
      %{"name" => "西南隅街道", "code" => "410302002000"},
      %{"name" => "西北隅街道", "code" => "410302003000"},
      %{"name" => "东南隅街道", "code" => "410302004000"},
      %{"name" => "东北隅街道", "code" => "410302005000"},
      %{"name" => "南关街道", "code" => "410302006000"},
      %{"name" => "洛浦街道", "code" => "410302007000"},
      %{"name" => "邙山街道", "code" => "410302008000"},
      %{"name" => "道北路街道", "code" => "410302009000"}
    ]

  def next(input) when input == "兰考县" or input == "410225",
    do: [
      %{"name" => "兰阳街道", "code" => "410225001000"},
      %{"name" => "桐乡街道", "code" => "410225002000"},
      %{"name" => "惠安街道", "code" => "410225003000"},
      %{"name" => "堌阳镇", "code" => "410225101000"},
      %{"name" => "南彰镇", "code" => "410225102000"},
      %{"name" => "考城镇", "code" => "410225103000"},
      %{"name" => "红庙镇", "code" => "410225104000"},
      %{"name" => "谷营镇", "code" => "410225105000"},
      %{"name" => "东坝头镇", "code" => "410225106000"},
      %{"name" => "小宋镇", "code" => "410225107000"},
      %{"name" => "仪封镇", "code" => "410225108000"},
      %{"name" => "三义寨乡", "code" => "410225201000"},
      %{"name" => "孟寨乡", "code" => "410225206000"},
      %{"name" => "许河乡", "code" => "410225207000"},
      %{"name" => "葡萄架乡", "code" => "410225208000"},
      %{"name" => "阎楼乡", "code" => "410225209000"},
      %{"name" => "仪封园艺场", "code" => "410225401000"},
      %{"name" => "造纸林场", "code" => "410225402000"},
      %{"name" => "柳林林场", "code" => "410225403000"},
      %{"name" => "西关农场", "code" => "410225404000"},
      %{"name" => "畜牧良种农场", "code" => "410225405000"},
      %{"name" => "固阳农科所", "code" => "410225406000"}
    ]

  def next(input) when input == "尉氏县" or input == "410223",
    do: [
      %{"name" => "两湖街道", "code" => "410223001000"},
      %{"name" => "洧川镇", "code" => "410223101000"},
      %{"name" => "朱曲镇", "code" => "410223102000"},
      %{"name" => "蔡庄镇", "code" => "410223103000"},
      %{"name" => "永兴镇", "code" => "410223104000"},
      %{"name" => "张市镇", "code" => "410223105000"},
      %{"name" => "十八里镇", "code" => "410223106000"},
      %{"name" => "水坡镇", "code" => "410223107000"},
      %{"name" => "大营镇", "code" => "410223108000"},
      %{"name" => "庄头镇", "code" => "410223109000"},
      %{"name" => "邢庄乡", "code" => "410223200000"},
      %{"name" => "门楼任乡", "code" => "410223205000"},
      %{"name" => "大桥乡", "code" => "410223206000"},
      %{"name" => "南曹乡", "code" => "410223207000"},
      %{"name" => "小陈乡", "code" => "410223208000"}
    ]

  def next(input) when input == "通许县" or input == "410222",
    do: [
      %{"name" => "咸平街道", "code" => "410222001000"},
      %{"name" => "许城街道", "code" => "410222002000"},
      %{"name" => "竖岗镇", "code" => "410222101000"},
      %{"name" => "玉皇庙镇", "code" => "410222102000"},
      %{"name" => "四所楼镇", "code" => "410222103000"},
      %{"name" => "朱砂镇", "code" => "410222104000"},
      %{"name" => "长智镇", "code" => "410222105000"},
      %{"name" => "冯庄乡", "code" => "410222200000"},
      %{"name" => "孙营乡", "code" => "410222201000"},
      %{"name" => "大岗李乡", "code" => "410222202000"},
      %{"name" => "邸阁乡", "code" => "410222203000"},
      %{"name" => "练城乡", "code" => "410222204000"},
      %{"name" => "厉庄乡", "code" => "410222205000"}
    ]

  def next(input) when input == "杞县" or input == "410221",
    do: [
      %{"name" => "金城街道", "code" => "410221001000"},
      %{"name" => "五里河镇", "code" => "410221101000"},
      %{"name" => "傅集镇", "code" => "410221102000"},
      %{"name" => "圉镇镇", "code" => "410221103000"},
      %{"name" => "高阳镇", "code" => "410221104000"},
      %{"name" => "葛岗镇", "code" => "410221105000"},
      %{"name" => "阳堌镇", "code" => "410221106000"},
      %{"name" => "邢口镇", "code" => "410221107000"},
      %{"name" => "裴村店乡", "code" => "410221200000"},
      %{"name" => "宗店乡", "code" => "410221202000"},
      %{"name" => "板木乡", "code" => "410221203000"},
      %{"name" => "竹林乡", "code" => "410221204000"},
      %{"name" => "官庄乡", "code" => "410221205000"},
      %{"name" => "湖岗乡", "code" => "410221206000"},
      %{"name" => "苏木乡", "code" => "410221207000"},
      %{"name" => "沙沃乡", "code" => "410221208000"},
      %{"name" => "平城乡", "code" => "410221209000"},
      %{"name" => "泥沟乡", "code" => "410221210000"},
      %{"name" => "柿园乡", "code" => "410221211000"},
      %{"name" => "西寨乡", "code" => "410221212000"},
      %{"name" => "城郊乡", "code" => "410221213000"},
      %{"name" => "工业园区", "code" => "410221401000"}
    ]

  def next(input) when input == "祥符区" or input == "410212",
    do: [
      %{"name" => "城东街道", "code" => "410212001000"},
      %{"name" => "陈留镇", "code" => "410212101000"},
      %{"name" => "仇楼镇", "code" => "410212102000"},
      %{"name" => "八里湾镇", "code" => "410212103000"},
      %{"name" => "曲兴镇", "code" => "410212104000"},
      %{"name" => "朱仙镇", "code" => "410212106000"},
      %{"name" => "罗王镇", "code" => "410212107000"},
      %{"name" => "半坡店乡", "code" => "410212200000"},
      %{"name" => "刘店乡", "code" => "410212203000"},
      %{"name" => "袁坊乡", "code" => "410212204000"},
      %{"name" => "杜良乡", "code" => "410212205000"},
      %{"name" => "兴隆乡", "code" => "410212206000"},
      %{"name" => "西姜寨乡", "code" => "410212208000"},
      %{"name" => "万隆乡", "code" => "410212210000"},
      %{"name" => "范村乡", "code" => "410212211000"}
    ]

  def next(input) when input == "禹王台区" or input == "410205",
    do: [
      %{"name" => "三里堡街道", "code" => "410205001000"},
      %{"name" => "新门关街道", "code" => "410205002000"},
      %{"name" => "繁塔街道", "code" => "410205003000"},
      %{"name" => "官坊街道", "code" => "410205004000"},
      %{"name" => "菜市街道", "code" => "410205005000"},
      %{"name" => "南郊乡", "code" => "410205200000"},
      %{"name" => "汪屯乡", "code" => "410205201000"}
    ]

  def next(input) when input == "鼓楼区" or input == "410204",
    do: [
      %{"name" => "相国寺街道", "code" => "410204001000"},
      %{"name" => "新华街道", "code" => "410204002000"},
      %{"name" => "卧龙街道", "code" => "410204003000"},
      %{"name" => "州桥街道", "code" => "410204004000"},
      %{"name" => "西司门街道", "code" => "410204005000"},
      %{"name" => "南苑街道", "code" => "410204006000"},
      %{"name" => "五一街道", "code" => "410204007000"},
      %{"name" => "仙人庄街道", "code" => "410204008000"}
    ]

  def next(input) when input == "顺河回族区" or input == "410203",
    do: [
      %{"name" => "清平街道", "code" => "410203001000"},
      %{"name" => "铁塔街道", "code" => "410203002000"},
      %{"name" => "曹门街道", "code" => "410203003000"},
      %{"name" => "宋门街道", "code" => "410203004000"},
      %{"name" => "工业街道", "code" => "410203005000"},
      %{"name" => "苹果园街道", "code" => "410203006000"},
      %{"name" => "东郊乡", "code" => "410203200000"},
      %{"name" => "土柏岗乡", "code" => "410203201000"}
    ]

  def next(input) when input == "龙亭区" or input == "410202",
    do: [
      %{"name" => "北书店街道", "code" => "410202001000"},
      %{"name" => "午朝门街道", "code" => "410202002000"},
      %{"name" => "大兴街道", "code" => "410202003000"},
      %{"name" => "北道门街道", "code" => "410202005000"},
      %{"name" => "城西街道", "code" => "410202006000"},
      %{"name" => "梁苑街道", "code" => "410202007000"},
      %{"name" => "金明池街道", "code" => "410202008000"},
      %{"name" => "西湖街道", "code" => "410202009000"},
      %{"name" => "金耀街道", "code" => "410202010000"},
      %{"name" => "杏花营镇", "code" => "410202100000"},
      %{"name" => "北郊乡", "code" => "410202201000"},
      %{"name" => "柳园口乡", "code" => "410202202000"},
      %{"name" => "水稻乡", "code" => "410202204000"},
      %{"name" => "杏花营农场", "code" => "410202400000"}
    ]

  def next(input) when input == "登封市" or input == "410185",
    do: [
      %{"name" => "嵩阳街道", "code" => "410185001000"},
      %{"name" => "少林街道", "code" => "410185002000"},
      %{"name" => "中岳街道", "code" => "410185003000"},
      %{"name" => "卢店街道", "code" => "410185004000"},
      %{"name" => "大金店镇", "code" => "410185100000"},
      %{"name" => "颍阳镇", "code" => "410185101000"},
      %{"name" => "告成镇", "code" => "410185103000"},
      %{"name" => "大冶镇", "code" => "410185105000"},
      %{"name" => "宣化镇", "code" => "410185106000"},
      %{"name" => "徐庄镇", "code" => "410185107000"},
      %{"name" => "东华镇", "code" => "410185108000"},
      %{"name" => "唐庄镇", "code" => "410185109000"},
      %{"name" => "白坪乡", "code" => "410185202000"},
      %{"name" => "君召乡", "code" => "410185203000"},
      %{"name" => "石道乡", "code" => "410185204000"}
    ]

  def next(input) when input == "新郑市" or input == "410184",
    do: [
      %{"name" => "新建路街道", "code" => "410184001000"},
      %{"name" => "新华路街道", "code" => "410184002000"},
      %{"name" => "新烟街道", "code" => "410184003000"},
      %{"name" => "新村镇", "code" => "410184101000"},
      %{"name" => "辛店镇", "code" => "410184102000"},
      %{"name" => "观音寺镇", "code" => "410184103000"},
      %{"name" => "梨河镇", "code" => "410184104000"},
      %{"name" => "和庄镇", "code" => "410184105000"},
      %{"name" => "薛店镇", "code" => "410184106000"},
      %{"name" => "孟庄镇", "code" => "410184107000"},
      %{"name" => "郭店镇", "code" => "410184108000"},
      %{"name" => "龙湖镇", "code" => "410184109000"},
      %{"name" => "城关乡", "code" => "410184200000"},
      %{"name" => "具茨山国家级森林公园", "code" => "410184402000"},
      %{"name" => "新郑新区", "code" => "410184403000"}
    ]

  def next(input) when input == "新密市" or input == "410183",
    do: [
      %{"name" => "青屏街街道", "code" => "410183001000"},
      %{"name" => "新华路街道", "code" => "410183002000"},
      %{"name" => "西大街街道", "code" => "410183003000"},
      %{"name" => "城关镇", "code" => "410183100000"},
      %{"name" => "米村镇", "code" => "410183101000"},
      %{"name" => "牛店镇", "code" => "410183102000"},
      %{"name" => "平陌镇", "code" => "410183103000"},
      %{"name" => "超化镇", "code" => "410183104000"},
      %{"name" => "苟堂镇", "code" => "410183105000"},
      %{"name" => "大隗镇", "code" => "410183106000"},
      %{"name" => "刘寨镇", "code" => "410183107000"},
      %{"name" => "白寨镇", "code" => "410183108000"},
      %{"name" => "岳村镇", "code" => "410183109000"},
      %{"name" => "来集镇", "code" => "410183110000"},
      %{"name" => "曲梁镇", "code" => "410183113000"},
      %{"name" => "袁庄乡", "code" => "410183200000"},
      %{"name" => "矿区街道", "code" => "410183400000"},
      %{"name" => "伏羲山风景区", "code" => "410183401000"},
      %{"name" => "郑州曲梁产业集聚区", "code" => "410183402000"}
    ]

  def next(input) when input == "荥阳市" or input == "410182",
    do: [
      %{"name" => "索河街道", "code" => "410182001000"},
      %{"name" => "京城路街道", "code" => "410182002000"},
      %{"name" => "乔楼镇", "code" => "410182101000"},
      %{"name" => "豫龙镇", "code" => "410182102000"},
      %{"name" => "广武镇", "code" => "410182103000"},
      %{"name" => "王村镇", "code" => "410182104000"},
      %{"name" => "汜水镇", "code" => "410182105000"},
      %{"name" => "高山镇", "code" => "410182106000"},
      %{"name" => "刘河镇", "code" => "410182108000"},
      %{"name" => "崔庙镇", "code" => "410182109000"},
      %{"name" => "贾峪镇", "code" => "410182110000"},
      %{"name" => "城关乡", "code" => "410182200000"},
      %{"name" => "高村乡", "code" => "410182201000"},
      %{"name" => "金寨回族乡", "code" => "410182204000"}
    ]

  def next(input) when input == "巩义市" or input == "410181",
    do: [
      %{"name" => "新华路街道", "code" => "410181001000"},
      %{"name" => "杜甫路街道", "code" => "410181002000"},
      %{"name" => "永安路街道", "code" => "410181003000"},
      %{"name" => "孝义街道", "code" => "410181004000"},
      %{"name" => "紫荆路街道", "code" => "410181005000"},
      %{"name" => "米河镇", "code" => "410181100000"},
      %{"name" => "新中镇", "code" => "410181101000"},
      %{"name" => "小关镇", "code" => "410181102000"},
      %{"name" => "竹林镇", "code" => "410181103000"},
      %{"name" => "大峪沟镇", "code" => "410181104000"},
      %{"name" => "河洛镇", "code" => "410181105000"},
      %{"name" => "站街镇", "code" => "410181106000"},
      %{"name" => "康店镇", "code" => "410181108000"},
      %{"name" => "北山口镇", "code" => "410181110000"},
      %{"name" => "西村镇", "code" => "410181111000"},
      %{"name" => "芝田镇", "code" => "410181112000"},
      %{"name" => "回郭镇", "code" => "410181113000"},
      %{"name" => "鲁庄镇", "code" => "410181114000"},
      %{"name" => "夹津口镇", "code" => "410181115000"},
      %{"name" => "涉村镇", "code" => "410181116000"}
    ]

  def next(input) when input == "郑州航空港经济综合实验区" or input == "410173",
    do: [
      %{"name" => "张庄镇", "code" => "410173108000"},
      %{"name" => "八岗镇", "code" => "410173113000"},
      %{"name" => "三官庙镇", "code" => "410173116000"},
      %{"name" => "八千乡", "code" => "410173202000"},
      %{"name" => "龙王乡", "code" => "410173203000"},
      %{"name" => "岗李乡", "code" => "410173204000"},
      %{"name" => "大马乡", "code" => "410173205000"},
      %{"name" => "新港街道", "code" => "410173400000"},
      %{"name" => "郑港街道", "code" => "410173401000"},
      %{"name" => "银河街道", "code" => "410173404000"},
      %{"name" => "明港街道", "code" => "410173405000"},
      %{"name" => "滨河街道", "code" => "410173580000"},
      %{"name" => "冯堂街道", "code" => "410173581000"},
      %{"name" => "清河街道", "code" => "410173582000"},
      %{"name" => "龙港街道", "code" => "410173583000"}
    ]

  def next(input) when input == "郑州高新技术产业开发区" or input == "410172",
    do: [
      %{"name" => "石佛镇", "code" => "410172160000"},
      %{"name" => "沟赵乡", "code" => "410172360000"},
      %{"name" => "枫杨街道", "code" => "410172560000"},
      %{"name" => "梧桐街道", "code" => "410172561000"},
      %{"name" => "双桥街道", "code" => "410172562000"}
    ]

  def next(input) when input == "郑州经济技术开发区" or input == "410171",
    do: [
      %{"name" => "九龙镇", "code" => "410171111000"},
      %{"name" => "郑州经济技术开发区明湖街道", "code" => "410171560000"},
      %{"name" => "郑州经济技术开发区潮河街道", "code" => "410171561000"},
      %{"name" => "郑州经济技术开发区京航街道", "code" => "410171562000"},
      %{"name" => "郑州经济技术开发区前程街道", "code" => "410171563000"},
      %{"name" => "郑州经济技术开发区祥云街道", "code" => "410171565000"}
    ]

  def next(input) when input == "中牟县" or input == "410122",
    do: [
      %{"name" => "青年路街道", "code" => "410122001000"},
      %{"name" => "东风路街道", "code" => "410122002000"},
      %{"name" => "广惠街街道", "code" => "410122003000"},
      %{"name" => "大孟街道", "code" => "410122004000"},
      %{"name" => "韩寺镇", "code" => "410122101000"},
      %{"name" => "官渡镇", "code" => "410122102000"},
      %{"name" => "狼城岗镇", "code" => "410122103000"},
      %{"name" => "万滩镇", "code" => "410122104000"},
      %{"name" => "白沙镇", "code" => "410122105000"},
      %{"name" => "郑庵镇", "code" => "410122106000"},
      %{"name" => "黄店镇", "code" => "410122109000"},
      %{"name" => "刘集镇", "code" => "410122112000"},
      %{"name" => "雁鸣湖镇", "code" => "410122114000"},
      %{"name" => "姚家镇", "code" => "410122115000"},
      %{"name" => "刁家乡", "code" => "410122208000"},
      %{"name" => "杨桥街道", "code" => "410122570000"},
      %{"name" => "豫兴街道", "code" => "410122571000"}
    ]

  def next(input) when input == "惠济区" or input == "410108",
    do: [
      %{"name" => "新城街道", "code" => "410108001000"},
      %{"name" => "刘寨街道", "code" => "410108002000"},
      %{"name" => "江山路街道", "code" => "410108003000"},
      %{"name" => "长兴路街道", "code" => "410108004000"},
      %{"name" => "迎宾路街道", "code" => "410108005000"},
      %{"name" => "大河路街道", "code" => "410108006000"},
      %{"name" => "花园口镇", "code" => "410108100000"},
      %{"name" => "古荥镇", "code" => "410108101000"}
    ]

  def next(input) when input == "上街区" or input == "410106",
    do: [
      %{"name" => "济源路街道", "code" => "410106001000"},
      %{"name" => "中心路街道", "code" => "410106002000"},
      %{"name" => "新安路街道", "code" => "410106003000"},
      %{"name" => "工业路街道", "code" => "410106004000"},
      %{"name" => "矿山街道", "code" => "410106005000"},
      %{"name" => "峡窝镇", "code" => "410106100000"}
    ]

  def next(input) when input == "金水区" or input == "410105",
    do: [
      %{"name" => "经八路街道", "code" => "410105001000"},
      %{"name" => "花园路街道", "code" => "410105002000"},
      %{"name" => "人民路街道", "code" => "410105003000"},
      %{"name" => "杜岭街道", "code" => "410105004000"},
      %{"name" => "大石桥街道", "code" => "410105005000"},
      %{"name" => "南阳路街道", "code" => "410105006000"},
      %{"name" => "南阳新村街道", "code" => "410105007000"},
      %{"name" => "文化路街道", "code" => "410105008000"},
      %{"name" => "丰产路街道", "code" => "410105009000"},
      %{"name" => "东风路街道", "code" => "410105010000"},
      %{"name" => "北林路街道", "code" => "410105011000"},
      %{"name" => "未来路街道", "code" => "410105012000"},
      %{"name" => "凤凰台街道", "code" => "410105013000"},
      %{"name" => "龙子湖街道", "code" => "410105014000"},
      %{"name" => "祭城路街道", "code" => "410105015000"},
      %{"name" => "兴达路街道", "code" => "410105016000"},
      %{"name" => "国基路街道", "code" => "410105017000"},
      %{"name" => "杨金路街道", "code" => "410105018000"},
      %{"name" => "丰庆路街道", "code" => "410105019000"},
      %{"name" => "如意湖街道", "code" => "410105560000"},
      %{"name" => "博学路街道", "code" => "410105561000"},
      %{"name" => "龙湖街道", "code" => "410105562000"},
      %{"name" => "龙源路街道", "code" => "410105563000"},
      %{"name" => "金光路街道", "code" => "410105564000"}
    ]

  def next(input) when input == "管城回族区" or input == "410104",
    do: [
      %{"name" => "北下街街道", "code" => "410104001000"},
      %{"name" => "西大街街道", "code" => "410104002000"},
      %{"name" => "南关街街道", "code" => "410104003000"},
      %{"name" => "城东路街道", "code" => "410104004000"},
      %{"name" => "东大街街道", "code" => "410104005000"},
      %{"name" => "二里岗街道", "code" => "410104006000"},
      %{"name" => "陇海马路街道", "code" => "410104007000"},
      %{"name" => "紫荆山南路街道", "code" => "410104008000"},
      %{"name" => "航海东路街道", "code" => "410104009000"},
      %{"name" => "十八里河街道", "code" => "410104010000"},
      %{"name" => "南曹街道", "code" => "410104011000"},
      %{"name" => "金岱街道", "code" => "410104012000"},
      %{"name" => "圃田乡", "code" => "410104202000"},
      %{"name" => "商都路街道", "code" => "410104570000"}
    ]

  def next(input) when input == "二七区" or input == "410103",
    do: [
      %{"name" => "淮河路街道", "code" => "410103001000"},
      %{"name" => "铭功路街道", "code" => "410103003000"},
      %{"name" => "一马路街道", "code" => "410103004000"},
      %{"name" => "蜜蜂张街道", "code" => "410103005000"},
      %{"name" => "五里堡街道", "code" => "410103006000"},
      %{"name" => "大学路街道", "code" => "410103007000"},
      %{"name" => "建中街街道", "code" => "410103008000"},
      %{"name" => "福华街街道", "code" => "410103009000"},
      %{"name" => "德化街街道", "code" => "410103010000"},
      %{"name" => "嵩山路街道", "code" => "410103011000"},
      %{"name" => "京广路街道", "code" => "410103012000"},
      %{"name" => "长江路街道", "code" => "410103013000"},
      %{"name" => "人和路街道", "code" => "410103014000"},
      %{"name" => "侯寨街道", "code" => "410103015000"},
      %{"name" => "金水源街道", "code" => "410103016000"},
      %{"name" => "马寨镇", "code" => "410103100000"}
    ]

  def next(input) when input == "中原区" or input == "410102",
    do: [
      %{"name" => "林山寨街道", "code" => "410102001000"},
      %{"name" => "建设路街道", "code" => "410102002000"},
      %{"name" => "棉纺路街道", "code" => "410102003000"},
      %{"name" => "秦岭路街道", "code" => "410102004000"},
      %{"name" => "桐柏路街道", "code" => "410102005000"},
      %{"name" => "三官庙街道", "code" => "410102006000"},
      %{"name" => "绿东村街道", "code" => "410102007000"},
      %{"name" => "汝河路街道", "code" => "410102008000"},
      %{"name" => "航海西路街道", "code" => "410102009000"},
      %{"name" => "中原西路街道", "code" => "410102010000"},
      %{"name" => "西流湖街道", "code" => "410102011000"},
      %{"name" => "须水街道", "code" => "410102012000"},
      %{"name" => "莲湖街道", "code" => "410102013000"},
      %{"name" => "柳湖街道", "code" => "410102014000"}
    ]

  def next(_), do: nil
end