defmodule ChinaAdminDivisions.Gen.Lv3x.M42 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "仙桃市" or input == "429004",
    do: [
      %{"name" => "沙嘴街道", "code" => "429004001000"},
      %{"name" => "干河街道", "code" => "429004002000"},
      %{"name" => "龙华山街道", "code" => "429004003000"},
      %{"name" => "杜湖街道", "code" => "429004004000"},
      %{"name" => "郑场镇", "code" => "429004100000"},
      %{"name" => "毛嘴镇", "code" => "429004101000"},
      %{"name" => "剅河镇", "code" => "429004102000"},
      %{"name" => "三伏潭镇", "code" => "429004103000"},
      %{"name" => "胡场镇", "code" => "429004104000"},
      %{"name" => "长埫口镇", "code" => "429004105000"},
      %{"name" => "西流河镇", "code" => "429004106000"},
      %{"name" => "沙湖镇", "code" => "429004107000"},
      %{"name" => "杨林尾镇", "code" => "429004108000"},
      %{"name" => "彭场镇", "code" => "429004109000"},
      %{"name" => "张沟镇", "code" => "429004110000"},
      %{"name" => "郭河镇", "code" => "429004111000"},
      %{"name" => "沔城回族镇", "code" => "429004112000"},
      %{"name" => "通海口镇", "code" => "429004113000"},
      %{"name" => "陈场镇", "code" => "429004114000"},
      %{"name" => "九合垸原种场", "code" => "429004401000"},
      %{"name" => "沙湖原种场", "code" => "429004402000"},
      %{"name" => "五湖渔场", "code" => "429004404000"},
      %{"name" => "赵西垸林场", "code" => "429004405000"},
      %{"name" => "畜禽良种场", "code" => "429004407000"},
      %{"name" => "排湖风景区", "code" => "429004408000"}
    ]

  def next(input) when input == "潜江市" or input == "429005",
    do: [
      %{"name" => "园林街道", "code" => "429005001000"},
      %{"name" => "杨市街道", "code" => "429005002000"},
      %{"name" => "周矶街道", "code" => "429005003000"},
      %{"name" => "广华寺街道", "code" => "429005004000"},
      %{"name" => "泰丰街道", "code" => "429005005000"},
      %{"name" => "高场街道", "code" => "429005006000"},
      %{"name" => "泽口街道", "code" => "429005007000"},
      %{"name" => "竹根滩镇", "code" => "429005100000"},
      %{"name" => "渔洋镇", "code" => "429005101000"},
      %{"name" => "王场镇", "code" => "429005102000"},
      %{"name" => "高石碑镇", "code" => "429005103000"},
      %{"name" => "熊口镇", "code" => "429005104000"},
      %{"name" => "老新镇", "code" => "429005105000"},
      %{"name" => "浩口镇", "code" => "429005106000"},
      %{"name" => "积玉口镇", "code" => "429005107000"},
      %{"name" => "张金镇", "code" => "429005108000"},
      %{"name" => "龙湾镇", "code" => "429005109000"},
      %{"name" => "周矶管理区", "code" => "429005450000"},
      %{"name" => "后湖管理区", "code" => "429005451000"},
      %{"name" => "熊口管理区", "code" => "429005452000"},
      %{"name" => "总口管理区", "code" => "429005453000"},
      %{"name" => "白鹭湖管理区", "code" => "429005454000"},
      %{"name" => "运粮湖管理区", "code" => "429005455000"},
      %{"name" => "浩口原种场", "code" => "429005457000"}
    ]

  def next(input) when input == "天门市" or input == "429006",
    do: [
      %{"name" => "竟陵街道", "code" => "429006001000"},
      %{"name" => "候口街道", "code" => "429006002000"},
      %{"name" => "杨林街道", "code" => "429006003000"},
      %{"name" => "多宝镇", "code" => "429006100000"},
      %{"name" => "拖市镇", "code" => "429006101000"},
      %{"name" => "张港镇", "code" => "429006102000"},
      %{"name" => "蒋场镇", "code" => "429006103000"},
      %{"name" => "汪场镇", "code" => "429006104000"},
      %{"name" => "渔薪镇", "code" => "429006105000"},
      %{"name" => "黄潭镇", "code" => "429006106000"},
      %{"name" => "岳口镇", "code" => "429006107000"},
      %{"name" => "横林镇", "code" => "429006108000"},
      %{"name" => "彭市镇", "code" => "429006109000"},
      %{"name" => "麻洋镇", "code" => "429006110000"},
      %{"name" => "多祥镇", "code" => "429006111000"},
      %{"name" => "干驿镇", "code" => "429006112000"},
      %{"name" => "马湾镇", "code" => "429006113000"},
      %{"name" => "卢市镇", "code" => "429006114000"},
      %{"name" => "小板镇", "code" => "429006115000"},
      %{"name" => "九真镇", "code" => "429006116000"},
      %{"name" => "皂市镇", "code" => "429006118000"},
      %{"name" => "胡市镇", "code" => "429006119000"},
      %{"name" => "石家河镇", "code" => "429006120000"},
      %{"name" => "佛子山镇", "code" => "429006121000"},
      %{"name" => "净潭乡", "code" => "429006201000"},
      %{"name" => "蒋湖农场", "code" => "429006450000"},
      %{"name" => "白茅湖农场", "code" => "429006451000"},
      %{"name" => "沉湖管委会", "code" => "429006452000"}
    ]

  def next(input) when input == "神农架林区" or input == "429021",
    do: [
      %{"name" => "松柏镇", "code" => "429021100000"},
      %{"name" => "阳日镇", "code" => "429021101000"},
      %{"name" => "木鱼镇", "code" => "429021102000"},
      %{"name" => "红坪镇", "code" => "429021103000"},
      %{"name" => "新华镇", "code" => "429021104000"},
      %{"name" => "九湖镇", "code" => "429021105000"},
      %{"name" => "宋洛乡", "code" => "429021201000"},
      %{"name" => "下谷坪土家族乡", "code" => "429021203000"}
    ]

  def next(input) when input == "恩施市" or input == "422801",
    do: [
      %{"name" => "舞阳坝街道", "code" => "422801001000"},
      %{"name" => "六角亭街道", "code" => "422801002000"},
      %{"name" => "小渡船街道", "code" => "422801003000"},
      %{"name" => "七里坪街道", "code" => "422801004000"},
      %{"name" => "金子坝街道", "code" => "422801005000"},
      %{"name" => "龙凤镇", "code" => "422801100000"},
      %{"name" => "崔家坝镇", "code" => "422801101000"},
      %{"name" => "板桥镇", "code" => "422801102000"},
      %{"name" => "白杨坪镇", "code" => "422801103000"},
      %{"name" => "三岔镇", "code" => "422801104000"},
      %{"name" => "盛家坝镇", "code" => "422801105000"},
      %{"name" => "新塘乡", "code" => "422801201000"},
      %{"name" => "红土乡", "code" => "422801202000"},
      %{"name" => "沙地乡", "code" => "422801203000"},
      %{"name" => "太阳河乡", "code" => "422801204000"},
      %{"name" => "屯堡乡", "code" => "422801205000"},
      %{"name" => "白果乡", "code" => "422801206000"},
      %{"name" => "芭蕉侗族乡", "code" => "422801207000"},
      %{"name" => "恩施大峡谷风景管理处", "code" => "422801400000"}
    ]

  def next(input) when input == "利川市" or input == "422802",
    do: [
      %{"name" => "都亭街道", "code" => "422802001000"},
      %{"name" => "东城街道", "code" => "422802002000"},
      %{"name" => "谋道镇", "code" => "422802100000"},
      %{"name" => "柏杨坝镇", "code" => "422802101000"},
      %{"name" => "汪营镇", "code" => "422802102000"},
      %{"name" => "建南镇", "code" => "422802103000"},
      %{"name" => "忠路镇", "code" => "422802104000"},
      %{"name" => "团堡镇", "code" => "422802105000"},
      %{"name" => "毛坝镇", "code" => "422802106000"},
      %{"name" => "文斗镇", "code" => "422802107000"},
      %{"name" => "凉雾乡", "code" => "422802200000"},
      %{"name" => "元堡乡", "code" => "422802201000"},
      %{"name" => "南坪乡", "code" => "422802202000"},
      %{"name" => "沙溪乡", "code" => "422802205000"},
      %{"name" => "佛宝山生态综合开发区", "code" => "422802401000"}
    ]

  def next(input) when input == "建始县" or input == "422822",
    do: [
      %{"name" => "业州镇", "code" => "422822100000"},
      %{"name" => "高坪镇", "code" => "422822101000"},
      %{"name" => "红岩寺镇", "code" => "422822102000"},
      %{"name" => "景阳镇", "code" => "422822103000"},
      %{"name" => "官店镇", "code" => "422822104000"},
      %{"name" => "花坪镇", "code" => "422822105000"},
      %{"name" => "长梁镇", "code" => "422822106000"},
      %{"name" => "茅田乡", "code" => "422822201000"},
      %{"name" => "龙坪乡", "code" => "422822202000"},
      %{"name" => "三里乡", "code" => "422822203000"}
    ]

  def next(input) when input == "巴东县" or input == "422823",
    do: [
      %{"name" => "信陵镇", "code" => "422823100000"},
      %{"name" => "东瀼口镇", "code" => "422823101000"},
      %{"name" => "沿渡河镇", "code" => "422823102000"},
      %{"name" => "官渡口镇", "code" => "422823103000"},
      %{"name" => "茶店子镇", "code" => "422823104000"},
      %{"name" => "绿葱坡镇", "code" => "422823105000"},
      %{"name" => "大支坪镇", "code" => "422823106000"},
      %{"name" => "野三关镇", "code" => "422823107000"},
      %{"name" => "水布垭镇", "code" => "422823108000"},
      %{"name" => "清太坪镇", "code" => "422823109000"},
      %{"name" => "溪丘湾乡", "code" => "422823200000"},
      %{"name" => "金果坪乡", "code" => "422823201000"},
      %{"name" => "高铁新区", "code" => "422823401000"}
    ]

  def next(input) when input == "宣恩县" or input == "422825",
    do: [
      %{"name" => "珠山镇", "code" => "422825100000"},
      %{"name" => "椒园镇", "code" => "422825101000"},
      %{"name" => "沙道沟镇", "code" => "422825102000"},
      %{"name" => "李家河镇", "code" => "422825103000"},
      %{"name" => "高罗镇", "code" => "422825104000"},
      %{"name" => "万寨乡", "code" => "422825200000"},
      %{"name" => "长潭河侗族乡", "code" => "422825201000"},
      %{"name" => "晓关侗族乡", "code" => "422825203000"},
      %{"name" => "椿木营乡", "code" => "422825205000"}
    ]

  def next(input) when input == "咸丰县" or input == "422826",
    do: [
      %{"name" => "高乐山镇", "code" => "422826100000"},
      %{"name" => "忠堡镇", "code" => "422826101000"},
      %{"name" => "坪坝营镇", "code" => "422826102000"},
      %{"name" => "朝阳寺镇", "code" => "422826103000"},
      %{"name" => "清坪镇", "code" => "422826104000"},
      %{"name" => "唐崖镇", "code" => "422826105000"},
      %{"name" => "曲江镇", "code" => "422826106000"},
      %{"name" => "活龙坪乡", "code" => "422826202000"},
      %{"name" => "小村乡", "code" => "422826203000"},
      %{"name" => "黄金洞乡", "code" => "422826204000"},
      %{"name" => "大路坝区", "code" => "422826400000"}
    ]

  def next(input) when input == "来凤县" or input == "422827",
    do: [
      %{"name" => "翔凤镇", "code" => "422827100000"},
      %{"name" => "百福司镇", "code" => "422827101000"},
      %{"name" => "大河镇", "code" => "422827102000"},
      %{"name" => "绿水镇", "code" => "422827103000"},
      %{"name" => "旧司镇", "code" => "422827104000"},
      %{"name" => "革勒车镇", "code" => "422827105000"},
      %{"name" => "漫水乡", "code" => "422827200000"},
      %{"name" => "三胡乡", "code" => "422827202000"}
    ]

  def next(input) when input == "鹤峰县" or input == "422828",
    do: [
      %{"name" => "走马镇", "code" => "422828100000"},
      %{"name" => "容美镇", "code" => "422828101000"},
      %{"name" => "太平镇", "code" => "422828102000"},
      %{"name" => "燕子镇", "code" => "422828103000"},
      %{"name" => "中营镇", "code" => "422828104000"},
      %{"name" => "铁炉乡", "code" => "422828200000"},
      %{"name" => "五里乡", "code" => "422828201000"},
      %{"name" => "下坪乡", "code" => "422828203000"},
      %{"name" => "邬阳乡", "code" => "422828204000"}
    ]

  def next(input) when input == "曾都区" or input == "421303",
    do: [
      %{"name" => "西城街道", "code" => "421303001000"},
      %{"name" => "东城街道", "code" => "421303002000"},
      %{"name" => "南郊街道", "code" => "421303003000"},
      %{"name" => "北郊街道", "code" => "421303004000"},
      %{"name" => "涢水街道", "code" => "421303005000"},
      %{"name" => "万店镇", "code" => "421303101000"},
      %{"name" => "何店镇", "code" => "421303102000"},
      %{"name" => "洛阳镇", "code" => "421303103000"},
      %{"name" => "府河镇", "code" => "421303104000"},
      %{"name" => "淅河镇", "code" => "421303187000"},
      %{"name" => "湖北曾都经济开发区", "code" => "421303499000"},
      %{"name" => "随州市经济开发区", "code" => "421303587000"}
    ]

  def next(input) when input == "随县" or input == "421321",
    do: [
      %{"name" => "厉山镇", "code" => "421321101000"},
      %{"name" => "高城镇", "code" => "421321102000"},
      %{"name" => "殷店镇", "code" => "421321103000"},
      %{"name" => "草店镇", "code" => "421321104000"},
      %{"name" => "小林镇", "code" => "421321105000"},
      %{"name" => "淮河镇", "code" => "421321106000"},
      %{"name" => "万和镇", "code" => "421321107000"},
      %{"name" => "尚市镇", "code" => "421321108000"},
      %{"name" => "唐县镇", "code" => "421321109000"},
      %{"name" => "吴山镇", "code" => "421321110000"},
      %{"name" => "新街镇", "code" => "421321111000"},
      %{"name" => "安居镇", "code" => "421321112000"},
      %{"name" => "澴潭镇", "code" => "421321113000"},
      %{"name" => "洪山镇", "code" => "421321114000"},
      %{"name" => "长岗镇", "code" => "421321115000"},
      %{"name" => "三里岗镇", "code" => "421321116000"},
      %{"name" => "柳林镇", "code" => "421321117000"},
      %{"name" => "均川镇", "code" => "421321118000"},
      %{"name" => "万福店镇", "code" => "421321119000"}
    ]

  def next(input) when input == "广水市" or input == "421381",
    do: [
      %{"name" => "应山街道", "code" => "421381001000"},
      %{"name" => "十里街道", "code" => "421381002000"},
      %{"name" => "广水街道", "code" => "421381003000"},
      %{"name" => "城郊街道", "code" => "421381004000"},
      %{"name" => "武胜关镇", "code" => "421381100000"},
      %{"name" => "杨寨镇", "code" => "421381101000"},
      %{"name" => "陈巷镇", "code" => "421381102000"},
      %{"name" => "长岭镇", "code" => "421381103000"},
      %{"name" => "马坪镇", "code" => "421381104000"},
      %{"name" => "关庙镇", "code" => "421381105000"},
      %{"name" => "余店镇", "code" => "421381106000"},
      %{"name" => "吴店镇", "code" => "421381107000"},
      %{"name" => "郝店镇", "code" => "421381108000"},
      %{"name" => "蔡河镇", "code" => "421381109000"},
      %{"name" => "李店镇", "code" => "421381110000"},
      %{"name" => "太平镇", "code" => "421381111000"},
      %{"name" => "骆店镇", "code" => "421381112000"},
      %{"name" => "中华山林场", "code" => "421381400000"},
      %{"name" => "三潭风景区", "code" => "421381401000"},
      %{"name" => "经济开发区", "code" => "421381402000"}
    ]

  def next(input) when input == "咸安区" or input == "421202",
    do: [
      %{"name" => "温泉街道", "code" => "421202001000"},
      %{"name" => "浮山街道", "code" => "421202002000"},
      %{"name" => "永安街道", "code" => "421202003000"},
      %{"name" => "汀泗桥镇", "code" => "421202100000"},
      %{"name" => "向阳湖镇", "code" => "421202101000"},
      %{"name" => "官埠桥镇", "code" => "421202102000"},
      %{"name" => "横沟桥镇", "code" => "421202103000"},
      %{"name" => "贺胜桥镇", "code" => "421202104000"},
      %{"name" => "双溪桥镇", "code" => "421202105000"},
      %{"name" => "马桥镇", "code" => "421202106000"},
      %{"name" => "桂花镇", "code" => "421202107000"},
      %{"name" => "高桥镇", "code" => "421202108000"},
      %{"name" => "大幕乡", "code" => "421202200000"},
      %{"name" => "向阳湖奶牛良种场", "code" => "421202450000"},
      %{"name" => "咸安商贸物流区", "code" => "421202451000"},
      %{"name" => "咸宁市经济技术开发区", "code" => "421202570000"},
      %{"name" => "湖北咸安经济开发区", "code" => "421202571000"}
    ]

  def next(input) when input == "嘉鱼县" or input == "421221",
    do: [
      %{"name" => "陆溪镇", "code" => "421221100000"},
      %{"name" => "高铁岭镇", "code" => "421221101000"},
      %{"name" => "官桥镇", "code" => "421221102000"},
      %{"name" => "鱼岳镇", "code" => "421221103000"},
      %{"name" => "新街镇", "code" => "421221104000"},
      %{"name" => "渡普镇", "code" => "421221105000"},
      %{"name" => "潘家湾镇", "code" => "421221106000"},
      %{"name" => "牌洲湾镇", "code" => "421221107000"},
      %{"name" => "头墩农场", "code" => "421221450000"},
      %{"name" => "嘉鱼县经济开发区", "code" => "421221570000"}
    ]

  def next(input) when input == "通城县" or input == "421222",
    do: [
      %{"name" => "隽水镇", "code" => "421222100000"},
      %{"name" => "麦市镇", "code" => "421222101000"},
      %{"name" => "塘湖镇", "code" => "421222102000"},
      %{"name" => "关刀镇", "code" => "421222103000"},
      %{"name" => "沙堆镇", "code" => "421222104000"},
      %{"name" => "五里镇", "code" => "421222105000"},
      %{"name" => "石南镇", "code" => "421222106000"},
      %{"name" => "北港镇", "code" => "421222107000"},
      %{"name" => "马港镇", "code" => "421222108000"},
      %{"name" => "四庄乡", "code" => "421222200000"},
      %{"name" => "大坪乡", "code" => "421222201000"},
      %{"name" => "鹿角山林场", "code" => "421222500000"},
      %{"name" => "锡山森林公园管理处", "code" => "421222501000"},
      %{"name" => "黄龙林场", "code" => "421222502000"},
      %{"name" => "黄袍林场", "code" => "421222503000"},
      %{"name" => "药姑林场", "code" => "421222504000"}
    ]

  def next(input) when input == "崇阳县" or input == "421223",
    do: [
      %{"name" => "天城镇", "code" => "421223100000"},
      %{"name" => "沙坪镇", "code" => "421223101000"},
      %{"name" => "石城镇", "code" => "421223102000"},
      %{"name" => "桂花泉镇", "code" => "421223103000"},
      %{"name" => "白霓镇", "code" => "421223104000"},
      %{"name" => "路口镇", "code" => "421223105000"},
      %{"name" => "金塘镇", "code" => "421223106000"},
      %{"name" => "青山镇", "code" => "421223107000"},
      %{"name" => "肖岭乡", "code" => "421223200000"},
      %{"name" => "铜钟乡", "code" => "421223201000"},
      %{"name" => "港口乡", "code" => "421223202000"},
      %{"name" => "高枧乡", "code" => "421223203000"},
      %{"name" => "崇阳县工业园区", "code" => "421223570000"}
    ]

  def next(input) when input == "通山县" or input == "421224",
    do: [
      %{"name" => "通羊镇", "code" => "421224100000"},
      %{"name" => "南林桥镇", "code" => "421224101000"},
      %{"name" => "黄沙铺镇", "code" => "421224102000"},
      %{"name" => "厦铺镇", "code" => "421224103000"},
      %{"name" => "九宫山镇", "code" => "421224104000"},
      %{"name" => "闯王镇", "code" => "421224105000"},
      %{"name" => "洪港镇", "code" => "421224106000"},
      %{"name" => "大畈镇", "code" => "421224107000"},
      %{"name" => "大路乡", "code" => "421224200000"},
      %{"name" => "杨芳林乡", "code" => "421224201000"},
      %{"name" => "燕厦乡", "code" => "421224202000"},
      %{"name" => "慈口乡", "code" => "421224203000"},
      %{"name" => "九宫山自然保护管理局", "code" => "421224450000"},
      %{"name" => "开发区", "code" => "421224570000"}
    ]

  def next(input) when input == "赤壁市" or input == "421281",
    do: [
      %{"name" => "蒲圻街道", "code" => "421281001000"},
      %{"name" => "赤马港街道", "code" => "421281002000"},
      %{"name" => "陆水湖街道", "code" => "421281003000"},
      %{"name" => "新店镇", "code" => "421281100000"},
      %{"name" => "赵李桥镇", "code" => "421281101000"},
      %{"name" => "茶庵岭镇", "code" => "421281102000"},
      %{"name" => "车埠镇", "code" => "421281103000"},
      %{"name" => "赤壁镇", "code" => "421281104000"},
      %{"name" => "柳山湖镇", "code" => "421281105000"},
      %{"name" => "神山镇", "code" => "421281106000"},
      %{"name" => "中伙铺镇", "code" => "421281107000"},
      %{"name" => "官塘驿镇", "code" => "421281108000"},
      %{"name" => "黄盖湖镇", "code" => "421281109000"},
      %{"name" => "余家桥乡", "code" => "421281200000"},
      %{"name" => "蒲纺工业园", "code" => "421281400000"},
      %{"name" => "官塘驿林场", "code" => "421281401000"},
      %{"name" => "羊楼洞茶场", "code" => "421281402000"},
      %{"name" => "沧湖开发区", "code" => "421281403000"},
      %{"name" => "赤壁市经济开发区", "code" => "421281404000"}
    ]

  def next(input) when input == "黄州区" or input == "421102",
    do: [
      %{"name" => "赤壁街道", "code" => "421102001000"},
      %{"name" => "东湖街道", "code" => "421102002000"},
      %{"name" => "禹王街道", "code" => "421102003000"},
      %{"name" => "南湖街道", "code" => "421102004000"},
      %{"name" => "西湖街道", "code" => "421102005000"},
      %{"name" => "路口镇", "code" => "421102100000"},
      %{"name" => "堵城镇", "code" => "421102101000"},
      %{"name" => "陈策楼镇", "code" => "421102102000"},
      %{"name" => "陶店乡", "code" => "421102200000"},
      %{"name" => "火车站开发区", "code" => "421102450000"}
    ]

  def next(input) when input == "团风县" or input == "421121",
    do: [
      %{"name" => "团风镇", "code" => "421121100000"},
      %{"name" => "淋山河镇", "code" => "421121101000"},
      %{"name" => "方高坪镇", "code" => "421121102000"},
      %{"name" => "回龙山镇", "code" => "421121103000"},
      %{"name" => "马曹庙镇", "code" => "421121104000"},
      %{"name" => "上巴河镇", "code" => "421121105000"},
      %{"name" => "总路咀镇", "code" => "421121106000"},
      %{"name" => "但店镇", "code" => "421121107000"},
      %{"name" => "贾庙乡", "code" => "421121200000"},
      %{"name" => "杜皮乡", "code" => "421121201000"},
      %{"name" => "黄湖农场", "code" => "421121400000"}
    ]

  def next(input) when input == "红安县" or input == "421122",
    do: [
      %{"name" => "城关镇", "code" => "421122100000"},
      %{"name" => "七里坪镇", "code" => "421122101000"},
      %{"name" => "华家河镇", "code" => "421122102000"},
      %{"name" => "二程镇", "code" => "421122103000"},
      %{"name" => "上新集镇", "code" => "421122104000"},
      %{"name" => "高桥镇", "code" => "421122105000"},
      %{"name" => "觅儿寺镇", "code" => "421122106000"},
      %{"name" => "八里湾镇", "code" => "421122107000"},
      %{"name" => "太平桥镇", "code" => "421122108000"},
      %{"name" => "永佳河镇", "code" => "421122109000"},
      %{"name" => "杏花乡", "code" => "421122200000"},
      %{"name" => "火连畈茶场", "code" => "421122500000"},
      %{"name" => "天台山管理处", "code" => "421122501000"},
      %{"name" => "红安经济开发区", "code" => "421122503000"}
    ]

  def next(input) when input == "罗田县" or input == "421123",
    do: [
      %{"name" => "凤山镇", "code" => "421123100000"},
      %{"name" => "骆驼坳镇", "code" => "421123101000"},
      %{"name" => "大河岸镇", "code" => "421123102000"},
      %{"name" => "九资河镇", "code" => "421123103000"},
      %{"name" => "胜利镇", "code" => "421123104000"},
      %{"name" => "河铺镇", "code" => "421123105000"},
      %{"name" => "三里畈镇", "code" => "421123106000"},
      %{"name" => "匡河镇", "code" => "421123107000"},
      %{"name" => "白庙河镇", "code" => "421123108000"},
      %{"name" => "大崎镇", "code" => "421123109000"},
      %{"name" => "白莲河乡", "code" => "421123200000"},
      %{"name" => "平湖乡", "code" => "421123203000"},
      %{"name" => "罗田县经济开发区", "code" => "421123400000"},
      %{"name" => "青苔关林场", "code" => "421123500000"},
      %{"name" => "天堂寨林场", "code" => "421123501000"},
      %{"name" => "薄刀峰林场", "code" => "421123502000"},
      %{"name" => "黄狮寨林场", "code" => "421123503000"}
    ]

  def next(input) when input == "英山县" or input == "421124",
    do: [
      %{"name" => "温泉镇", "code" => "421124100000"},
      %{"name" => "南河镇", "code" => "421124101000"},
      %{"name" => "红山镇", "code" => "421124102000"},
      %{"name" => "金家铺镇", "code" => "421124103000"},
      %{"name" => "石头咀镇", "code" => "421124104000"},
      %{"name" => "草盘地镇", "code" => "421124105000"},
      %{"name" => "雷家店镇", "code" => "421124106000"},
      %{"name" => "杨柳湾镇", "code" => "421124107000"},
      %{"name" => "方家咀乡", "code" => "421124200000"},
      %{"name" => "孔家坊乡", "code" => "421124201000"},
      %{"name" => "陶家河乡", "code" => "421124202000"},
      %{"name" => "桃花冲林场", "code" => "421124400000"},
      %{"name" => "吴家山林场", "code" => "421124401000"},
      %{"name" => "五峰山林场", "code" => "421124402000"},
      %{"name" => "英山县经济开发区", "code" => "421124403000"}
    ]

  def next(input) when input == "浠水县" or input == "421125",
    do: [
      %{"name" => "清泉镇", "code" => "421125100000"},
      %{"name" => "巴河镇", "code" => "421125101000"},
      %{"name" => "竹瓦镇", "code" => "421125102000"},
      %{"name" => "汪岗镇", "code" => "421125103000"},
      %{"name" => "团陂镇", "code" => "421125104000"},
      %{"name" => "关口镇", "code" => "421125105000"},
      %{"name" => "白莲镇", "code" => "421125106000"},
      %{"name" => "蔡河镇", "code" => "421125107000"},
      %{"name" => "洗马镇", "code" => "421125108000"},
      %{"name" => "丁司垱镇", "code" => "421125109000"},
      %{"name" => "散花镇", "code" => "421125110000"},
      %{"name" => "兰溪镇", "code" => "421125111000"},
      %{"name" => "绿杨乡", "code" => "421125200000"},
      %{"name" => "策湖国家湿地公园管理处", "code" => "421125400000"},
      %{"name" => "三角山旅游度假区管理委员会", "code" => "421125401000"},
      %{"name" => "经济开发区", "code" => "421125402000"}
    ]

  def next(input) when input == "蕲春县" or input == "421126",
    do: [
      %{"name" => "漕河镇", "code" => "421126100000"},
      %{"name" => "赤东镇", "code" => "421126101000"},
      %{"name" => "蕲州镇", "code" => "421126102000"},
      %{"name" => "管窑镇", "code" => "421126103000"},
      %{"name" => "彭思镇", "code" => "421126104000"},
      %{"name" => "横车镇", "code" => "421126105000"},
      %{"name" => "株林镇", "code" => "421126106000"},
      %{"name" => "刘河镇", "code" => "421126107000"},
      %{"name" => "狮子镇", "code" => "421126108000"},
      %{"name" => "青石镇", "code" => "421126109000"},
      %{"name" => "张塝镇", "code" => "421126110000"},
      %{"name" => "大同镇", "code" => "421126111000"},
      %{"name" => "檀林镇", "code" => "421126112000"},
      %{"name" => "向桥乡", "code" => "421126200000"},
      %{"name" => "八里湖", "code" => "421126450000"},
      %{"name" => "蕲春经济开发区管委会", "code" => "421126451000"},
      %{"name" => "李时珍医药工业园区管委会", "code" => "421126453000"},
      %{"name" => "蕲春赤龙湖国家湿地公园管理处", "code" => "421126454000"},
      %{"name" => "蕲春县仙人台茶厂", "code" => "421126456000"}
    ]

  def next(input) when input == "黄梅县" or input == "421127",
    do: [
      %{"name" => "黄梅镇", "code" => "421127100000"},
      %{"name" => "孔垄镇", "code" => "421127101000"},
      %{"name" => "小池镇", "code" => "421127102000"},
      %{"name" => "下新镇", "code" => "421127103000"},
      %{"name" => "大河镇", "code" => "421127104000"},
      %{"name" => "停前镇", "code" => "421127105000"},
      %{"name" => "五祖镇", "code" => "421127106000"},
      %{"name" => "濯港镇", "code" => "421127107000"},
      %{"name" => "蔡山镇", "code" => "421127108000"},
      %{"name" => "新开镇", "code" => "421127109000"},
      %{"name" => "独山镇", "code" => "421127110000"},
      %{"name" => "分路镇", "code" => "421127111000"},
      %{"name" => "柳林乡", "code" => "421127200000"},
      %{"name" => "杉木乡", "code" => "421127201000"},
      %{"name" => "苦竹乡", "code" => "421127202000"},
      %{"name" => "刘佐乡", "code" => "421127203000"}
    ]

  def next(input) when input == "龙感湖管理区" or input == "421171",
    do: [
      %{"name" => "严家闸", "code" => "421171450000"},
      %{"name" => "芦柴湖", "code" => "421171451000"},
      %{"name" => "洋湖", "code" => "421171452000"},
      %{"name" => "沙湖", "code" => "421171453000"},
      %{"name" => "春港", "code" => "421171454000"},
      %{"name" => "塞湖", "code" => "421171455000"},
      %{"name" => "湖北龙感湖工业园区", "code" => "421171457000"}
    ]

  def next(input) when input == "麻城市" or input == "421181",
    do: [
      %{"name" => "龙池桥街道", "code" => "421181001000"},
      %{"name" => "鼓楼街道", "code" => "421181002000"},
      %{"name" => "南湖街道", "code" => "421181003000"},
      %{"name" => "中馆驿镇", "code" => "421181100000"},
      %{"name" => "宋埠镇", "code" => "421181101000"},
      %{"name" => "歧亭镇", "code" => "421181102000"},
      %{"name" => "白果镇", "code" => "421181103000"},
      %{"name" => "夫子河镇", "code" => "421181104000"},
      %{"name" => "阎家河镇", "code" => "421181105000"},
      %{"name" => "龟山镇", "code" => "421181106000"},
      %{"name" => "盐田河镇", "code" => "421181107000"},
      %{"name" => "张家畈镇", "code" => "421181108000"},
      %{"name" => "木子店镇", "code" => "421181109000"},
      %{"name" => "三河口镇", "code" => "421181110000"},
      %{"name" => "黄土岗镇", "code" => "421181111000"},
      %{"name" => "福田河镇", "code" => "421181112000"},
      %{"name" => "乘马岗镇", "code" => "421181113000"},
      %{"name" => "顺河镇", "code" => "421181114000"},
      %{"name" => "铁门岗乡", "code" => "421181200000"},
      %{"name" => "宋埠良种场", "code" => "421181401000"},
      %{"name" => "麻城明山水库", "code" => "421181402000"},
      %{"name" => "麻城三河水库", "code" => "421181403000"},
      %{"name" => "国营狮子峰林场", "code" => "421181404000"},
      %{"name" => "麻城林店茶场", "code" => "421181405000"},
      %{"name" => "湖北麻城经济开发区", "code" => "421181471000"},
      %{"name" => "龟峰山风景区管理处", "code" => "421181472000"},
      %{"name" => "浮桥河国家湿地公园管理处", "code" => "421181473000"},
      %{"name" => "五脑山林场", "code" => "421181500000"}
    ]

  def next(input) when input == "武穴市" or input == "421182",
    do: [
      %{"name" => "武穴街道", "code" => "421182001000"},
      %{"name" => "刊江街道", "code" => "421182002000"},
      %{"name" => "田镇街道", "code" => "421182003000"},
      %{"name" => "万丈湖街道", "code" => "421182004000"},
      %{"name" => "梅川镇", "code" => "421182100000"},
      %{"name" => "余川镇", "code" => "421182101000"},
      %{"name" => "花桥镇", "code" => "421182102000"},
      %{"name" => "大金镇", "code" => "421182103000"},
      %{"name" => "石佛寺镇", "code" => "421182104000"},
      %{"name" => "四望镇", "code" => "421182105000"},
      %{"name" => "大法寺镇", "code" => "421182106000"},
      %{"name" => "龙坪镇", "code" => "421182107000"}
    ]

  def next(input) when input == "沙市区" or input == "421002",
    do: [
      %{"name" => "中山街道", "code" => "421002001000"},
      %{"name" => "崇文街道", "code" => "421002002000"},
      %{"name" => "解放街道", "code" => "421002003000"},
      %{"name" => "胜利街道", "code" => "421002004000"},
      %{"name" => "朝阳街道", "code" => "421002005000"},
      %{"name" => "立新街道", "code" => "421002006000"},
      %{"name" => "锣场镇", "code" => "421002100000"},
      %{"name" => "岑河镇", "code" => "421002101000"},
      %{"name" => "观音垱镇", "code" => "421002102000"},
      %{"name" => "关沮镇", "code" => "421002103000"}
    ]

  def next(input) when input == "荆州区" or input == "421003",
    do: [
      %{"name" => "西城街道", "code" => "421003001000"},
      %{"name" => "东城街道", "code" => "421003002000"},
      %{"name" => "城南街道", "code" => "421003003000"},
      %{"name" => "凤凰街道", "code" => "421003004000"},
      %{"name" => "太湖港街道", "code" => "421003005000"},
      %{"name" => "纪南镇", "code" => "421003100000"},
      %{"name" => "川店镇", "code" => "421003101000"},
      %{"name" => "马山镇", "code" => "421003102000"},
      %{"name" => "八岭山镇", "code" => "421003103000"},
      %{"name" => "李埠镇", "code" => "421003104000"},
      %{"name" => "弥市镇", "code" => "421003105000"},
      %{"name" => "郢城镇", "code" => "421003106000"},
      %{"name" => "菱角湖管理区", "code" => "421003451000"}
    ]

  def next(input) when input == "公安县" or input == "421022",
    do: [
      %{"name" => "埠河镇", "code" => "421022100000"},
      %{"name" => "斗湖堤镇", "code" => "421022101000"},
      %{"name" => "夹竹园镇", "code" => "421022102000"},
      %{"name" => "闸口镇", "code" => "421022103000"},
      %{"name" => "杨家厂镇", "code" => "421022104000"},
      %{"name" => "麻豪口镇", "code" => "421022105000"},
      %{"name" => "藕池镇", "code" => "421022106000"},
      %{"name" => "黄山头镇", "code" => "421022107000"},
      %{"name" => "孟家溪镇", "code" => "421022108000"},
      %{"name" => "南平镇", "code" => "421022109000"},
      %{"name" => "章庄铺镇", "code" => "421022110000"},
      %{"name" => "狮子口镇", "code" => "421022111000"},
      %{"name" => "斑竹垱镇", "code" => "421022112000"},
      %{"name" => "毛家港镇", "code" => "421022113000"},
      %{"name" => "甘家厂乡", "code" => "421022200000"},
      %{"name" => "章田寺乡", "code" => "421022201000"}
    ]

  def next(input) when input == "江陵县" or input == "421024",
    do: [
      %{"name" => "资市镇", "code" => "421024100000"},
      %{"name" => "熊河镇", "code" => "421024102000"},
      %{"name" => "白马寺镇", "code" => "421024103000"},
      %{"name" => "沙岗镇", "code" => "421024104000"},
      %{"name" => "普济镇", "code" => "421024105000"},
      %{"name" => "郝穴镇", "code" => "421024106000"},
      %{"name" => "马家寨乡", "code" => "421024200000"},
      %{"name" => "秦市乡", "code" => "421024201000"},
      %{"name" => "江北监狱", "code" => "421024450000"},
      %{"name" => "三湖管理区", "code" => "421024500000"},
      %{"name" => "六合垸管理区", "code" => "421024501000"}
    ]

  def next(input) when input == "荆州经济技术开发区" or input == "421071",
    do: [
      %{"name" => "联合街道", "code" => "421071001000"},
      %{"name" => "西湖街道", "code" => "421071002000"},
      %{"name" => "鱼农桥街道", "code" => "421071003000"},
      %{"name" => "滩桥镇", "code" => "421071100000"}
    ]

  def next(input) when input == "石首市" or input == "421081",
    do: [
      %{"name" => "绣林街道", "code" => "421081001000"},
      %{"name" => "笔架山街道", "code" => "421081002000"},
      %{"name" => "新厂镇", "code" => "421081100000"},
      %{"name" => "横沟市镇", "code" => "421081101000"},
      %{"name" => "大垸镇", "code" => "421081102000"},
      %{"name" => "小河口镇", "code" => "421081103000"},
      %{"name" => "桃花山镇", "code" => "421081104000"},
      %{"name" => "调关镇", "code" => "421081105000"},
      %{"name" => "东升镇", "code" => "421081106000"},
      %{"name" => "高基庙镇", "code" => "421081107000"},
      %{"name" => "南口镇", "code" => "421081108000"},
      %{"name" => "高陵镇", "code" => "421081109000"},
      %{"name" => "团山寺镇", "code" => "421081110000"},
      %{"name" => "久合垸乡", "code" => "421081200000"},
      %{"name" => "天鹅洲开发区", "code" => "421081500000"}
    ]

  def next(input) when input == "洪湖市" or input == "421083",
    do: [
      %{"name" => "新堤街道", "code" => "421083001000"},
      %{"name" => "滨湖街道", "code" => "421083002000"},
      %{"name" => "螺山镇", "code" => "421083100000"},
      %{"name" => "乌林镇", "code" => "421083101000"},
      %{"name" => "龙口镇", "code" => "421083102000"},
      %{"name" => "燕窝镇", "code" => "421083103000"},
      %{"name" => "新滩镇", "code" => "421083104000"},
      %{"name" => "峰口镇", "code" => "421083105000"},
      %{"name" => "曹市镇", "code" => "421083106000"},
      %{"name" => "府场镇", "code" => "421083107000"},
      %{"name" => "戴家场镇", "code" => "421083108000"},
      %{"name" => "瞿家湾镇", "code" => "421083109000"},
      %{"name" => "沙口镇", "code" => "421083110000"},
      %{"name" => "万全镇", "code" => "421083111000"},
      %{"name" => "汊河镇", "code" => "421083112000"},
      %{"name" => "黄家口镇", "code" => "421083113000"},
      %{"name" => "老湾乡", "code" => "421083200000"},
      %{"name" => "小港管理区", "code" => "421083450000"},
      %{"name" => "大同湖管理区", "code" => "421083451000"},
      %{"name" => "大沙湖管理区", "code" => "421083452000"}
    ]

  def next(input) when input == "松滋市" or input == "421087",
    do: [
      %{"name" => "新江口街道", "code" => "421087001000"},
      %{"name" => "乐乡街道", "code" => "421087002000"},
      %{"name" => "南海镇", "code" => "421087101000"},
      %{"name" => "八宝镇", "code" => "421087102000"},
      %{"name" => "涴市镇", "code" => "421087103000"},
      %{"name" => "老城镇", "code" => "421087104000"},
      %{"name" => "陈店镇", "code" => "421087105000"},
      %{"name" => "王家桥镇", "code" => "421087106000"},
      %{"name" => "斯家场镇", "code" => "421087107000"},
      %{"name" => "杨林市镇", "code" => "421087108000"},
      %{"name" => "纸厂河镇", "code" => "421087109000"},
      %{"name" => "街河市镇", "code" => "421087110000"},
      %{"name" => "洈水镇", "code" => "421087111000"},
      %{"name" => "刘家场镇", "code" => "421087112000"},
      %{"name" => "沙道观镇", "code" => "421087113000"},
      %{"name" => "万家乡", "code" => "421087200000"},
      %{"name" => "卸甲坪土家族乡", "code" => "421087201000"}
    ]

  def next(input) when input == "监利市" or input == "421088",
    do: [
      %{"name" => "容城镇", "code" => "421088100000"},
      %{"name" => "朱河镇", "code" => "421088101000"},
      %{"name" => "新沟镇", "code" => "421088102000"},
      %{"name" => "龚场镇", "code" => "421088103000"},
      %{"name" => "周老嘴镇", "code" => "421088104000"},
      %{"name" => "黄歇口镇", "code" => "421088105000"},
      %{"name" => "汪桥镇", "code" => "421088106000"},
      %{"name" => "程集镇", "code" => "421088107000"},
      %{"name" => "分盐镇", "code" => "421088108000"},
      %{"name" => "毛市镇", "code" => "421088109000"},
      %{"name" => "福田寺镇", "code" => "421088110000"},
      %{"name" => "上车湾镇", "code" => "421088111000"},
      %{"name" => "汴河镇", "code" => "421088112000"},
      %{"name" => "尺八镇", "code" => "421088113000"},
      %{"name" => "白螺镇", "code" => "421088114000"},
      %{"name" => "网市镇", "code" => "421088115000"},
      %{"name" => "三洲镇", "code" => "421088116000"},
      %{"name" => "桥市镇", "code" => "421088117000"},
      %{"name" => "红城乡", "code" => "421088200000"},
      %{"name" => "棋盘乡", "code" => "421088201000"},
      %{"name" => "柘木乡", "code" => "421088202000"},
      %{"name" => "人民大垸农场管理区", "code" => "421088450000"},
      %{"name" => "荒湖农场管理区", "code" => "421088451000"}
    ]

  def next(input) when input == "孝南区" or input == "420902",
    do: [
      %{"name" => "书院街道", "code" => "420902001000"},
      %{"name" => "新华街道", "code" => "420902002000"},
      %{"name" => "广场街道", "code" => "420902003000"},
      %{"name" => "车站街道", "code" => "420902004000"},
      %{"name" => "新铺镇", "code" => "420902100000"},
      %{"name" => "西河镇", "code" => "420902101000"},
      %{"name" => "杨店镇", "code" => "420902102000"},
      %{"name" => "陡岗镇", "code" => "420902103000"},
      %{"name" => "肖港镇", "code" => "420902104000"},
      %{"name" => "毛陈镇", "code" => "420902105000"},
      %{"name" => "三汊镇", "code" => "420902106000"},
      %{"name" => "祝站镇", "code" => "420902107000"},
      %{"name" => "朋兴乡", "code" => "420902200000"},
      %{"name" => "卧龙乡", "code" => "420902201000"},
      %{"name" => "闵集乡", "code" => "420902202000"},
      %{"name" => "经济开发区", "code" => "420902400000"},
      %{"name" => "朱湖", "code" => "420902450000"},
      %{"name" => "东山头", "code" => "420902500000"},
      %{"name" => "孝感开发区丹阳", "code" => "420902570000"},
      %{"name" => "孝感开发区孝天", "code" => "420902571000"},
      %{"name" => "孝感开发区槐荫", "code" => "420902572000"}
    ]

  def next(input) when input == "孝昌县" or input == "420921",
    do: [
      %{"name" => "花园镇", "code" => "420921100000"},
      %{"name" => "丰山镇", "code" => "420921101000"},
      %{"name" => "周巷镇", "code" => "420921102000"},
      %{"name" => "小河镇", "code" => "420921103000"},
      %{"name" => "王店镇", "code" => "420921104000"},
      %{"name" => "卫店镇", "code" => "420921105000"},
      %{"name" => "白沙镇", "code" => "420921106000"},
      %{"name" => "邹岗镇", "code" => "420921107000"},
      %{"name" => "小悟乡", "code" => "420921200000"},
      %{"name" => "季店乡", "code" => "420921201000"},
      %{"name" => "花西乡", "code" => "420921202000"},
      %{"name" => "陡山乡", "code" => "420921203000"},
      %{"name" => "开发区", "code" => "420921400000"},
      %{"name" => "观音湖生态文化旅游渡假区", "code" => "420921450000"},
      %{"name" => "双峰山旅游渡假区", "code" => "420921500000"}
    ]

  def next(input) when input == "大悟县" or input == "420922",
    do: [
      %{"name" => "城关镇", "code" => "420922100000"},
      %{"name" => "阳平镇", "code" => "420922101000"},
      %{"name" => "芳畈镇", "code" => "420922102000"},
      %{"name" => "新城镇", "code" => "420922103000"},
      %{"name" => "夏店镇", "code" => "420922104000"},
      %{"name" => "刘集镇", "code" => "420922105000"},
      %{"name" => "河口镇", "code" => "420922106000"},
      %{"name" => "四姑镇", "code" => "420922107000"},
      %{"name" => "吕王镇", "code" => "420922108000"},
      %{"name" => "黄站镇", "code" => "420922109000"},
      %{"name" => "宣化店镇", "code" => "420922110000"},
      %{"name" => "丰店镇", "code" => "420922111000"},
      %{"name" => "大新镇", "code" => "420922112000"},
      %{"name" => "三里镇", "code" => "420922113000"},
      %{"name" => "高店乡", "code" => "420922200000"},
      %{"name" => "彭店乡", "code" => "420922201000"},
      %{"name" => "东新乡", "code" => "420922202000"},
      %{"name" => "高铁试验区", "code" => "420922501000"},
      %{"name" => "悟峰山度假区", "code" => "420922502000"}
    ]

  def next(input) when input == "云梦县" or input == "420923",
    do: [
      %{"name" => "城关镇", "code" => "420923100000"},
      %{"name" => "义堂镇", "code" => "420923101000"},
      %{"name" => "曾店镇", "code" => "420923102000"},
      %{"name" => "吴铺镇", "code" => "420923103000"},
      %{"name" => "伍洛镇", "code" => "420923104000"},
      %{"name" => "下辛店镇", "code" => "420923105000"},
      %{"name" => "道桥镇", "code" => "420923106000"},
      %{"name" => "隔蒲潭镇", "code" => "420923107000"},
      %{"name" => "胡金店镇", "code" => "420923108000"},
      %{"name" => "倒店乡", "code" => "420923200000"},
      %{"name" => "沙河乡", "code" => "420923201000"},
      %{"name" => "清明河乡", "code" => "420923202000"},
      %{"name" => "县经济开发区", "code" => "420923450000"}
    ]

  def next(input) when input == "应城市" or input == "420981",
    do: [
      %{"name" => "城中街道", "code" => "420981001000"},
      %{"name" => "城北街道", "code" => "420981002000"},
      %{"name" => "四里棚街道", "code" => "420981003000"},
      %{"name" => "东马坊街道", "code" => "420981004000"},
      %{"name" => "长江埠街道", "code" => "420981005000"},
      %{"name" => "田店镇", "code" => "420981100000"},
      %{"name" => "杨河镇", "code" => "420981101000"},
      %{"name" => "三合镇", "code" => "420981102000"},
      %{"name" => "郎君镇", "code" => "420981103000"},
      %{"name" => "黄滩镇", "code" => "420981104000"},
      %{"name" => "天鹅镇", "code" => "420981105000"},
      %{"name" => "义和镇", "code" => "420981106000"},
      %{"name" => "陈河镇", "code" => "420981107000"},
      %{"name" => "杨岭镇", "code" => "420981108000"},
      %{"name" => "汤池镇", "code" => "420981109000"},
      %{"name" => "经济技术开发区", "code" => "420981400000"},
      %{"name" => "南垸良种场", "code" => "420981500000"}
    ]

  def next(input) when input == "安陆市" or input == "420982",
    do: [
      %{"name" => "府城街道", "code" => "420982001000"},
      %{"name" => "南城街道", "code" => "420982002000"},
      %{"name" => "赵棚镇", "code" => "420982100000"},
      %{"name" => "李店镇", "code" => "420982101000"},
      %{"name" => "巡店镇", "code" => "420982102000"},
      %{"name" => "棠棣镇", "code" => "420982103000"},
      %{"name" => "雷公镇", "code" => "420982104000"},
      %{"name" => "王义贞镇", "code" => "420982105000"},
      %{"name" => "烟店镇", "code" => "420982106000"},
      %{"name" => "孛畈镇", "code" => "420982107000"},
      %{"name" => "洑水镇", "code" => "420982108000"},
      %{"name" => "陈店乡", "code" => "420982200000"},
      %{"name" => "辛榨乡", "code" => "420982201000"},
      %{"name" => "木梓乡", "code" => "420982202000"},
      %{"name" => "接官乡", "code" => "420982203000"},
      %{"name" => "开发区", "code" => "420982400000"}
    ]

  def next(input) when input == "汉川市" or input == "420984",
    do: [
      %{"name" => "仙女山街道", "code" => "420984001000"},
      %{"name" => "汈东街道", "code" => "420984002000"},
      %{"name" => "马口镇", "code" => "420984100000"},
      %{"name" => "脉旺镇", "code" => "420984101000"},
      %{"name" => "城隍镇", "code" => "420984102000"},
      %{"name" => "分水镇", "code" => "420984103000"},
      %{"name" => "沉湖镇", "code" => "420984104000"},
      %{"name" => "田二河镇", "code" => "420984105000"},
      %{"name" => "回龙镇", "code" => "420984106000"},
      %{"name" => "新堰镇", "code" => "420984107000"},
      %{"name" => "垌塚镇", "code" => "420984108000"},
      %{"name" => "麻河镇", "code" => "420984109000"},
      %{"name" => "刘家隔镇", "code" => "420984110000"},
      %{"name" => "新河镇", "code" => "420984111000"},
      %{"name" => "庙头镇", "code" => "420984112000"},
      %{"name" => "杨林沟镇", "code" => "420984113000"},
      %{"name" => "西江乡", "code" => "420984200000"},
      %{"name" => "湾潭乡", "code" => "420984201000"},
      %{"name" => "南河乡", "code" => "420984202000"},
      %{"name" => "马鞍乡", "code" => "420984203000"},
      %{"name" => "里潭乡", "code" => "420984204000"},
      %{"name" => "韩集乡", "code" => "420984205000"},
      %{"name" => "国营中洲农场", "code" => "420984450000"},
      %{"name" => "华严农场", "code" => "420984500000"},
      %{"name" => "三星垸原种场", "code" => "420984502000"},
      %{"name" => "汈汊湖养殖场", "code" => "420984503000"},
      %{"name" => "汉川市经济技术开发区", "code" => "420984504000"}
    ]

  def next(input) when input == "东宝区" or input == "420802",
    do: [
      %{"name" => "龙泉街道", "code" => "420802001000"},
      %{"name" => "泉口街道", "code" => "420802002000"},
      %{"name" => "栗溪镇", "code" => "420802100000"},
      %{"name" => "子陵铺镇", "code" => "420802101000"},
      %{"name" => "漳河镇", "code" => "420802102000"},
      %{"name" => "马河镇", "code" => "420802103000"},
      %{"name" => "石桥驿镇", "code" => "420802104000"},
      %{"name" => "牌楼镇", "code" => "420802105000"},
      %{"name" => "仙居乡", "code" => "420802200000"},
      %{"name" => "东宝工业园区", "code" => "420802400000"}
    ]

  def next(input) when input == "掇刀区" or input == "420804",
    do: [
      %{"name" => "掇刀石街道", "code" => "420804001000"},
      %{"name" => "白庙街道", "code" => "420804002000"},
      %{"name" => "兴隆街道", "code" => "420804003000"},
      %{"name" => "双喜街道", "code" => "420804004000"},
      %{"name" => "团林铺镇", "code" => "420804100000"},
      %{"name" => "麻城镇", "code" => "420804101000"}
    ]

  def next(input) when input == "沙洋县" or input == "420822",
    do: [
      %{"name" => "沙洋镇", "code" => "420822100000"},
      %{"name" => "五里铺镇", "code" => "420822101000"},
      %{"name" => "十里铺镇", "code" => "420822102000"},
      %{"name" => "纪山镇", "code" => "420822103000"},
      %{"name" => "拾回桥镇", "code" => "420822104000"},
      %{"name" => "后港镇", "code" => "420822105000"},
      %{"name" => "毛李镇", "code" => "420822106000"},
      %{"name" => "官垱镇", "code" => "420822107000"},
      %{"name" => "李市镇", "code" => "420822108000"},
      %{"name" => "马良镇", "code" => "420822109000"},
      %{"name" => "高阳镇", "code" => "420822110000"},
      %{"name" => "沈集镇", "code" => "420822111000"},
      %{"name" => "曾集镇", "code" => "420822112000"},
      %{"name" => "湖北沙洋经济开发区管理委员会", "code" => "420822400000"},
      %{"name" => "沙洋新港区管理委员会", "code" => "420822401000"},
      %{"name" => "沙洋滨江新区管理委员会", "code" => "420822402000"},
      %{"name" => "沙洋监狱管理局", "code" => "420822450000"}
    ]

  def next(input) when input == "钟祥市" or input == "420881",
    do: [
      %{"name" => "郢中街道", "code" => "420881001000"},
      %{"name" => "皇庄街道", "code" => "420881002000"},
      %{"name" => "洋梓镇", "code" => "420881100000"},
      %{"name" => "长寿镇", "code" => "420881101000"},
      %{"name" => "丰乐镇", "code" => "420881102000"},
      %{"name" => "胡集镇", "code" => "420881103000"},
      %{"name" => "双河镇", "code" => "420881104000"},
      %{"name" => "磷矿镇", "code" => "420881105000"},
      %{"name" => "文集镇", "code" => "420881106000"},
      %{"name" => "冷水镇", "code" => "420881107000"},
      %{"name" => "石牌镇", "code" => "420881108000"},
      %{"name" => "旧口镇", "code" => "420881109000"},
      %{"name" => "柴湖镇", "code" => "420881110000"},
      %{"name" => "长滩镇", "code" => "420881111000"},
      %{"name" => "东桥镇", "code" => "420881112000"},
      %{"name" => "客店镇", "code" => "420881113000"},
      %{"name" => "张集镇", "code" => "420881114000"},
      %{"name" => "九里乡", "code" => "420881200000"},
      %{"name" => "湖北钟祥经济开发区", "code" => "420881400000"},
      %{"name" => "钟祥市官庄湖管理区", "code" => "420881450000"},
      %{"name" => "南湖原种场", "code" => "420881451000"},
      %{"name" => "罗汉寺种畜场", "code" => "420881452000"},
      %{"name" => "双桥原种场", "code" => "420881453000"},
      %{"name" => "东岳种畜场", "code" => "420881454000"},
      %{"name" => "康桥湖农场", "code" => "420881455000"},
      %{"name" => "大口林场", "code" => "420881456000"},
      %{"name" => "盘石岭林场", "code" => "420881457000"},
      %{"name" => "温峡水库", "code" => "420881458000"},
      %{"name" => "石门水库", "code" => "420881459000"},
      %{"name" => "黄坡水库", "code" => "420881460000"},
      %{"name" => "湖北钟祥胡集经济技术开发区", "code" => "420881461000"}
    ]

  def next(input) when input == "京山市" or input == "420882",
    do: [
      %{"name" => "新市街道", "code" => "420882001000"},
      %{"name" => "永兴街道", "code" => "420882002000"},
      %{"name" => "温泉街道", "code" => "420882003000"},
      %{"name" => "曹武镇", "code" => "420882102000"},
      %{"name" => "罗店镇", "code" => "420882103000"},
      %{"name" => "宋河镇", "code" => "420882104000"},
      %{"name" => "坪坝镇", "code" => "420882105000"},
      %{"name" => "三阳镇", "code" => "420882106000"},
      %{"name" => "绿林镇", "code" => "420882107000"},
      %{"name" => "杨集镇", "code" => "420882108000"},
      %{"name" => "孙桥镇", "code" => "420882109000"},
      %{"name" => "石龙镇", "code" => "420882110000"},
      %{"name" => "永漋镇", "code" => "420882111000"},
      %{"name" => "雁门口镇", "code" => "420882112000"},
      %{"name" => "钱场镇", "code" => "420882113000"},
      %{"name" => "太子山", "code" => "420882450000"},
      %{"name" => "罗汉寺", "code" => "420882451000"},
      %{"name" => "长滩", "code" => "420882452000"},
      %{"name" => "何集", "code" => "420882453000"},
      %{"name" => "易家岭", "code" => "420882455000"}
    ]

  def next(input) when input == "梁子湖区" or input == "420702",
    do: [
      %{"name" => "太和镇", "code" => "420702100000"},
      %{"name" => "东沟镇", "code" => "420702101000"},
      %{"name" => "梁子镇", "code" => "420702102000"},
      %{"name" => "涂家垴镇", "code" => "420702103000"},
      %{"name" => "沼山镇", "code" => "420702104000"},
      %{"name" => "梧桐湖新区", "code" => "420702400000"}
    ]

  def next(input) when input == "华容区" or input == "420703",
    do: [
      %{"name" => "华容镇", "code" => "420703100000"},
      %{"name" => "葛店镇", "code" => "420703101000"},
      %{"name" => "庙岭镇", "code" => "420703102000"},
      %{"name" => "段店镇", "code" => "420703103000"},
      %{"name" => "临江乡", "code" => "420703200000"},
      %{"name" => "蒲团乡", "code" => "420703201000"},
      %{"name" => "葛店开发区", "code" => "420703400000"}
    ]

  def next(input) when input == "鄂城区" or input == "420704",
    do: [
      %{"name" => "凤凰街道", "code" => "420704001000"},
      %{"name" => "古楼街道", "code" => "420704002000"},
      %{"name" => "西山街道", "code" => "420704003000"},
      %{"name" => "泽林镇", "code" => "420704100000"},
      %{"name" => "杜山镇", "code" => "420704101000"},
      %{"name" => "新庙镇", "code" => "420704102000"},
      %{"name" => "碧石镇", "code" => "420704103000"},
      %{"name" => "汀祖镇", "code" => "420704104000"},
      %{"name" => "燕矶镇", "code" => "420704105000"},
      %{"name" => "杨叶镇", "code" => "420704106000"},
      %{"name" => "花湖镇", "code" => "420704107000"},
      %{"name" => "长港镇", "code" => "420704108000"},
      %{"name" => "沙窝乡", "code" => "420704200000"},
      %{"name" => "鄂州经济开发区", "code" => "420704400000"},
      %{"name" => "临空经济区", "code" => "420704401000"}
    ]

  def next(input) when input == "襄城区" or input == "420602",
    do: [
      %{"name" => "真武山街道", "code" => "420602001000"},
      %{"name" => "古城街道", "code" => "420602002000"},
      %{"name" => "庞公街道", "code" => "420602003000"},
      %{"name" => "檀溪街道", "code" => "420602004000"},
      %{"name" => "隆中街道", "code" => "420602005000"},
      %{"name" => "余家湖街道", "code" => "420602006000"},
      %{"name" => "欧庙镇", "code" => "420602100000"},
      %{"name" => "卧龙镇", "code" => "420602101000"},
      %{"name" => "尹集乡", "code" => "420602200000"}
    ]

  def next(input) when input == "樊城区" or input == "420606",
    do: [
      %{"name" => "汉江街道", "code" => "420606001000"},
      %{"name" => "王寨街道", "code" => "420606002000"},
      %{"name" => "中原街道", "code" => "420606003000"},
      %{"name" => "定中门街道", "code" => "420606004000"},
      %{"name" => "清河口街道", "code" => "420606005000"},
      %{"name" => "屏襄门街道", "code" => "420606006000"},
      %{"name" => "米公街道", "code" => "420606007000"},
      %{"name" => "柿铺街道", "code" => "420606008000"},
      %{"name" => "高新区紫贞街道", "code" => "420606070000"},
      %{"name" => "高新区七里河街道", "code" => "420606071000"},
      %{"name" => "高新区东风街道", "code" => "420606072000"},
      %{"name" => "牛首镇", "code" => "420606100000"},
      %{"name" => "太平店镇", "code" => "420606101000"},
      %{"name" => "高新区团山镇", "code" => "420606170000"},
      %{"name" => "高新区米庄镇", "code" => "420606171000"},
      %{"name" => "经济开发区", "code" => "420606400000"},
      %{"name" => "鱼梁洲开发区", "code" => "420606480000"},
      %{"name" => "高新区汽车工业园", "code" => "420606570000"},
      %{"name" => "高新区高新技术产业园", "code" => "420606571000"},
      %{"name" => "高新区高新技术创业服务中心", "code" => "420606572000"}
    ]

  def next(input) when input == "襄州区" or input == "420607",
    do: [
      %{"name" => "张湾街道", "code" => "420607001000"},
      %{"name" => "刘集街道", "code" => "420607002000"},
      %{"name" => "肖湾街道", "code" => "420607003000"},
      %{"name" => "六两河街道", "code" => "420607004000"},
      %{"name" => "浩然街道", "code" => "420607005000"},
      %{"name" => "金华街道", "code" => "420607006000"},
      %{"name" => "龙王镇", "code" => "420607100000"},
      %{"name" => "石桥镇", "code" => "420607101000"},
      %{"name" => "黄集镇", "code" => "420607102000"},
      %{"name" => "伙牌镇", "code" => "420607103000"},
      %{"name" => "古驿镇", "code" => "420607104000"},
      %{"name" => "朱集镇", "code" => "420607105000"},
      %{"name" => "程河镇", "code" => "420607106000"},
      %{"name" => "双沟镇", "code" => "420607107000"},
      %{"name" => "张家集镇", "code" => "420607108000"},
      %{"name" => "黄龙镇", "code" => "420607109000"},
      %{"name" => "峪山镇", "code" => "420607110000"},
      %{"name" => "东津镇", "code" => "420607111000"},
      %{"name" => "鹿门风景名胜区", "code" => "420607402000"},
      %{"name" => "襄北农场", "code" => "420607500000"},
      %{"name" => "深圳工业园", "code" => "420607570000"}
    ]

  def next(input) when input == "南漳县" or input == "420624",
    do: [
      %{"name" => "城关镇", "code" => "420624100000"},
      %{"name" => "武安镇", "code" => "420624101000"},
      %{"name" => "九集镇", "code" => "420624102000"},
      %{"name" => "李庙镇", "code" => "420624103000"},
      %{"name" => "长坪镇", "code" => "420624104000"},
      %{"name" => "薛坪镇", "code" => "420624105000"},
      %{"name" => "板桥镇", "code" => "420624106000"},
      %{"name" => "巡检镇", "code" => "420624107000"},
      %{"name" => "东巩镇", "code" => "420624108000"},
      %{"name" => "肖堰镇", "code" => "420624109000"},
      %{"name" => "清河管理区", "code" => "420624500000"}
    ]

  def next(input) when input == "谷城县" or input == "420625",
    do: [
      %{"name" => "城关镇", "code" => "420625100000"},
      %{"name" => "石花镇", "code" => "420625101000"},
      %{"name" => "盛康镇", "code" => "420625102000"},
      %{"name" => "庙滩镇", "code" => "420625103000"},
      %{"name" => "五山镇", "code" => "420625104000"},
      %{"name" => "茨河镇", "code" => "420625105000"},
      %{"name" => "南河镇", "code" => "420625106000"},
      %{"name" => "紫金镇", "code" => "420625107000"},
      %{"name" => "冷集镇", "code" => "420625108000"},
      %{"name" => "赵湾乡", "code" => "420625200000"},
      %{"name" => "薤山林场", "code" => "420625500000"}
    ]

  def next(input) when input == "保康县" or input == "420626",
    do: [
      %{"name" => "城关镇", "code" => "420626100000"},
      %{"name" => "黄堡镇", "code" => "420626101000"},
      %{"name" => "后坪镇", "code" => "420626102000"},
      %{"name" => "龙坪镇", "code" => "420626103000"},
      %{"name" => "店垭镇", "code" => "420626104000"},
      %{"name" => "马良镇", "code" => "420626105000"},
      %{"name" => "歇马镇", "code" => "420626106000"},
      %{"name" => "马桥镇", "code" => "420626107000"},
      %{"name" => "寺坪镇", "code" => "420626108000"},
      %{"name" => "过渡湾镇", "code" => "420626109000"},
      %{"name" => "两峪乡", "code" => "420626200000"},
      %{"name" => "湖北保康经济开发区管理委员会", "code" => "420626400000"}
    ]

  def next(input) when input == "老河口市" or input == "420682",
    do: [
      %{"name" => "光化街道", "code" => "420682001000"},
      %{"name" => "酂阳街道", "code" => "420682002000"},
      %{"name" => "孟楼镇", "code" => "420682100000"},
      %{"name" => "竹林桥镇", "code" => "420682101000"},
      %{"name" => "薛集镇", "code" => "420682102000"},
      %{"name" => "张集镇", "code" => "420682103000"},
      %{"name" => "仙人渡镇", "code" => "420682104000"},
      %{"name" => "洪山嘴镇", "code" => "420682105000"},
      %{"name" => "李楼镇", "code" => "420682106000"},
      %{"name" => "袁冲乡", "code" => "420682200000"},
      %{"name" => "蔬菜原种场", "code" => "420682501000"},
      %{"name" => "百花山林场", "code" => "420682502000"},
      %{"name" => "林茂山林场", "code" => "420682503000"}
    ]

  def next(input) when input == "枣阳市" or input == "420683",
    do: [
      %{"name" => "北城街道", "code" => "420683001000"},
      %{"name" => "南城街道", "code" => "420683002000"},
      %{"name" => "环城街道", "code" => "420683003000"},
      %{"name" => "琚湾镇", "code" => "420683100000"},
      %{"name" => "七方镇", "code" => "420683101000"},
      %{"name" => "杨当镇", "code" => "420683102000"},
      %{"name" => "太平镇", "code" => "420683103000"},
      %{"name" => "新市镇", "code" => "420683104000"},
      %{"name" => "鹿头镇", "code" => "420683105000"},
      %{"name" => "刘升镇", "code" => "420683106000"},
      %{"name" => "兴隆镇", "code" => "420683107000"},
      %{"name" => "王城镇", "code" => "420683108000"},
      %{"name" => "吴店镇", "code" => "420683109000"},
      %{"name" => "熊集镇", "code" => "420683110000"},
      %{"name" => "平林镇", "code" => "420683111000"},
      %{"name" => "枣阳经济开发区", "code" => "420683402000"},
      %{"name" => "随阳农场", "code" => "420683500000"},
      %{"name" => "车河农场", "code" => "420683501000"}
    ]

  def next(input) when input == "宜城市" or input == "420684",
    do: [
      %{"name" => "鄢城街道", "code" => "420684001000"},
      %{"name" => "南营街道", "code" => "420684002000"},
      %{"name" => "龙头街道", "code" => "420684003000"},
      %{"name" => "郑集镇", "code" => "420684102000"},
      %{"name" => "小河镇", "code" => "420684103000"},
      %{"name" => "刘猴镇", "code" => "420684104000"},
      %{"name" => "孔湾镇", "code" => "420684105000"},
      %{"name" => "流水镇", "code" => "420684106000"},
      %{"name" => "板桥店镇", "code" => "420684107000"},
      %{"name" => "王集镇", "code" => "420684108000"},
      %{"name" => "雷河镇", "code" => "420684109000"},
      %{"name" => "襄南监狱", "code" => "420684400000"},
      %{"name" => "劳教所", "code" => "420684401000"},
      %{"name" => "大雁工业园区", "code" => "420684450000"},
      %{"name" => "宜城经济开发区", "code" => "420684452000"}
    ]

  def next(input) when input == "西陵区" or input == "420502",
    do: [
      %{"name" => "西陵街道", "code" => "420502001000"},
      %{"name" => "学院街道", "code" => "420502002000"},
      %{"name" => "云集街道", "code" => "420502003000"},
      %{"name" => "西坝街道", "code" => "420502004000"},
      %{"name" => "葛洲坝街道", "code" => "420502005000"},
      %{"name" => "夜明珠街道", "code" => "420502006000"},
      %{"name" => "东苑街道", "code" => "420502007000"},
      %{"name" => "南苑街道", "code" => "420502008000"},
      %{"name" => "北苑街道", "code" => "420502009000"},
      %{"name" => "窑湾街道", "code" => "420502010000"}
    ]

  def next(input) when input == "伍家岗区" or input == "420503",
    do: [
      %{"name" => "大公桥街道", "code" => "420503001000"},
      %{"name" => "万寿桥街道", "code" => "420503002000"},
      %{"name" => "宝塔河街道", "code" => "420503003000"},
      %{"name" => "伍家岗街道", "code" => "420503004000"},
      %{"name" => "伍家乡", "code" => "420503201000"}
    ]

  def next(input) when input == "点军区" or input == "420504",
    do: [
      %{"name" => "点军街道", "code" => "420504001000"},
      %{"name" => "艾家镇", "code" => "420504101000"},
      %{"name" => "桥边镇", "code" => "420504102000"},
      %{"name" => "联棚乡", "code" => "420504201000"},
      %{"name" => "土城乡", "code" => "420504202000"}
    ]

  def next(input) when input == "猇亭区" or input == "420505",
    do: [
      %{"name" => "古老背街道", "code" => "420505001000"},
      %{"name" => "虎牙街道", "code" => "420505002000"},
      %{"name" => "云池街道", "code" => "420505003000"}
    ]

  def next(input) when input == "夷陵区" or input == "420506",
    do: [
      %{"name" => "小溪塔街道", "code" => "420506001000"},
      %{"name" => "樟村坪镇", "code" => "420506101000"},
      %{"name" => "雾渡河镇", "code" => "420506102000"},
      %{"name" => "分乡镇", "code" => "420506103000"},
      %{"name" => "太平溪镇", "code" => "420506104000"},
      %{"name" => "三斗坪镇", "code" => "420506105000"},
      %{"name" => "乐天溪镇", "code" => "420506106000"},
      %{"name" => "龙泉镇", "code" => "420506107000"},
      %{"name" => "鸦鹊岭镇", "code" => "420506108000"},
      %{"name" => "黄花镇", "code" => "420506109000"},
      %{"name" => "下堡坪乡", "code" => "420506201000"},
      %{"name" => "邓村乡", "code" => "420506202000"},
      %{"name" => "三峡坝区", "code" => "420506401000"},
      %{"name" => "东城城乡统筹发展试验区", "code" => "420506402000"}
    ]

  def next(input) when input == "远安县" or input == "420525",
    do: [
      %{"name" => "鸣凤镇", "code" => "420525101000"},
      %{"name" => "花林寺镇", "code" => "420525102000"},
      %{"name" => "旧县镇", "code" => "420525103000"},
      %{"name" => "洋坪镇", "code" => "420525104000"},
      %{"name" => "茅坪场镇", "code" => "420525105000"},
      %{"name" => "嫘祖镇", "code" => "420525106000"},
      %{"name" => "河口乡", "code" => "420525201000"}
    ]

  def next(input) when input == "兴山县" or input == "420526",
    do: [
      %{"name" => "古夫镇", "code" => "420526101000"},
      %{"name" => "昭君镇", "code" => "420526102000"},
      %{"name" => "峡口镇", "code" => "420526103000"},
      %{"name" => "南阳镇", "code" => "420526104000"},
      %{"name" => "黄粮镇", "code" => "420526105000"},
      %{"name" => "水月寺镇", "code" => "420526106000"},
      %{"name" => "高桥乡", "code" => "420526201000"},
      %{"name" => "榛子乡", "code" => "420526202000"}
    ]

  def next(input) when input == "秭归县" or input == "420527",
    do: [
      %{"name" => "茅坪镇", "code" => "420527101000"},
      %{"name" => "归州镇", "code" => "420527102000"},
      %{"name" => "屈原镇", "code" => "420527103000"},
      %{"name" => "沙镇溪镇", "code" => "420527104000"},
      %{"name" => "两河口镇", "code" => "420527105000"},
      %{"name" => "郭家坝镇", "code" => "420527106000"},
      %{"name" => "杨林桥镇", "code" => "420527107000"},
      %{"name" => "九畹溪镇", "code" => "420527108000"},
      %{"name" => "水田坝乡", "code" => "420527201000"},
      %{"name" => "泄滩乡", "code" => "420527202000"},
      %{"name" => "梅家河乡", "code" => "420527203000"},
      %{"name" => "磨坪乡", "code" => "420527204000"}
    ]

  def next(input) when input == "长阳土家族自治县" or input == "420528",
    do: [
      %{"name" => "龙舟坪镇", "code" => "420528101000"},
      %{"name" => "高家堰镇", "code" => "420528102000"},
      %{"name" => "磨市镇", "code" => "420528103000"},
      %{"name" => "都镇湾镇", "code" => "420528104000"},
      %{"name" => "资丘镇", "code" => "420528105000"},
      %{"name" => "渔峡口镇", "code" => "420528106000"},
      %{"name" => "榔坪镇", "code" => "420528107000"},
      %{"name" => "贺家坪镇", "code" => "420528108000"},
      %{"name" => "大堰乡", "code" => "420528201000"},
      %{"name" => "鸭子口乡", "code" => "420528202000"},
      %{"name" => "火烧坪乡", "code" => "420528203000"}
    ]

  def next(input) when input == "五峰土家族自治县" or input == "420529",
    do: [
      %{"name" => "渔洋关镇", "code" => "420529111000"},
      %{"name" => "仁和坪镇", "code" => "420529112000"},
      %{"name" => "长乐坪镇", "code" => "420529113000"},
      %{"name" => "五峰镇", "code" => "420529114000"},
      %{"name" => "湾潭镇", "code" => "420529115000"},
      %{"name" => "傅家堰乡", "code" => "420529201000"},
      %{"name" => "牛庄乡", "code" => "420529202000"},
      %{"name" => "采花乡", "code" => "420529203000"}
    ]

  def next(input) when input == "宜都市" or input == "420581",
    do: [
      %{"name" => "陆城街道", "code" => "420581001000"},
      %{"name" => "红花套镇", "code" => "420581100000"},
      %{"name" => "高坝洲镇", "code" => "420581101000"},
      %{"name" => "聂家河镇", "code" => "420581102000"},
      %{"name" => "松木坪镇", "code" => "420581103000"},
      %{"name" => "枝城镇", "code" => "420581104000"},
      %{"name" => "姚家店镇", "code" => "420581105000"},
      %{"name" => "五眼泉镇", "code" => "420581106000"},
      %{"name" => "王家畈镇", "code" => "420581107000"},
      %{"name" => "潘家湾土家族乡", "code" => "420581200000"},
      %{"name" => "松宜矿区管理委员会", "code" => "420581400000"}
    ]

  def next(input) when input == "当阳市" or input == "420582",
    do: [
      %{"name" => "当阳市玉阳街道", "code" => "420582001000"},
      %{"name" => "当阳市坝陵街道", "code" => "420582002000"},
      %{"name" => "当阳市玉泉街道", "code" => "420582003000"},
      %{"name" => "当阳市两河镇", "code" => "420582101000"},
      %{"name" => "当阳市河溶镇", "code" => "420582102000"},
      %{"name" => "当阳市淯溪镇", "code" => "420582103000"},
      %{"name" => "当阳市庙前镇", "code" => "420582104000"},
      %{"name" => "当阳市王店镇", "code" => "420582105000"},
      %{"name" => "当阳市半月镇", "code" => "420582106000"},
      %{"name" => "当阳市草埠湖镇", "code" => "420582107000"}
    ]

  def next(input) when input == "枝江市" or input == "420583",
    do: [
      %{"name" => "马家店街道", "code" => "420583001000"},
      %{"name" => "安福寺镇", "code" => "420583101000"},
      %{"name" => "白洋镇", "code" => "420583102000"},
      %{"name" => "顾家店镇", "code" => "420583103000"},
      %{"name" => "董市镇", "code" => "420583104000"},
      %{"name" => "仙女镇", "code" => "420583105000"},
      %{"name" => "问安镇", "code" => "420583106000"},
      %{"name" => "七星台镇", "code" => "420583107000"},
      %{"name" => "百里洲镇", "code" => "420583108000"}
    ]

  def next(input) when input == "茅箭区" or input == "420302",
    do: [
      %{"name" => "武当路街道", "code" => "420302001000"},
      %{"name" => "二堰街道", "code" => "420302002000"},
      %{"name" => "五堰街道", "code" => "420302003000"},
      %{"name" => "白浪开发区白浪街道", "code" => "420302004000"},
      %{"name" => "大川镇", "code" => "420302100000"},
      %{"name" => "茅塔乡", "code" => "420302201000"},
      %{"name" => "鸳鸯乡", "code" => "420302202000"}
    ]

  def next(input) when input == "张湾区" or input == "420303",
    do: [
      %{"name" => "花果街道", "code" => "420303001000"},
      %{"name" => "红卫街道", "code" => "420303002000"},
      %{"name" => "车城路街道", "code" => "420303003000"},
      %{"name" => "汉江路街道", "code" => "420303004000"},
      %{"name" => "黄龙镇", "code" => "420303100000"},
      %{"name" => "柏林镇", "code" => "420303101000"},
      %{"name" => "方滩乡", "code" => "420303200000"},
      %{"name" => "西沟乡", "code" => "420303201000"},
      %{"name" => "西城开发区", "code" => "420303400000"},
      %{"name" => "十堰工业新区", "code" => "420303401000"}
    ]

  def next(input) when input == "郧阳区" or input == "420304",
    do: [
      %{"name" => "安阳镇", "code" => "420304101000"},
      %{"name" => "杨溪铺镇", "code" => "420304102000"},
      %{"name" => "青曲镇", "code" => "420304103000"},
      %{"name" => "白桑关镇", "code" => "420304104000"},
      %{"name" => "南化塘镇", "code" => "420304105000"},
      %{"name" => "白浪镇", "code" => "420304106000"},
      %{"name" => "刘洞镇", "code" => "420304107000"},
      %{"name" => "谭山镇", "code" => "420304108000"},
      %{"name" => "梅铺镇", "code" => "420304109000"},
      %{"name" => "青山镇", "code" => "420304110000"},
      %{"name" => "茶店镇", "code" => "420304111000"},
      %{"name" => "柳陂镇", "code" => "420304112000"},
      %{"name" => "鲍峡镇", "code" => "420304113000"},
      %{"name" => "胡家营镇", "code" => "420304114000"},
      %{"name" => "谭家湾镇", "code" => "420304115000"},
      %{"name" => "城关镇", "code" => "420304117000"},
      %{"name" => "大柳乡", "code" => "420304200000"},
      %{"name" => "五峰乡", "code" => "420304201000"},
      %{"name" => "叶大乡", "code" => "420304202000"},
      %{"name" => "沧浪山林场", "code" => "420304400000"}
    ]

  def next(input) when input == "郧西县" or input == "420322",
    do: [
      %{"name" => "城关镇", "code" => "420322100000"},
      %{"name" => "土门镇", "code" => "420322101000"},
      %{"name" => "上津镇", "code" => "420322102000"},
      %{"name" => "店子镇", "code" => "420322103000"},
      %{"name" => "夹河镇", "code" => "420322104000"},
      %{"name" => "羊尾镇", "code" => "420322105000"},
      %{"name" => "观音镇", "code" => "420322106000"},
      %{"name" => "马鞍镇", "code" => "420322107000"},
      %{"name" => "河夹镇", "code" => "420322108000"},
      %{"name" => "香口乡", "code" => "420322200000"},
      %{"name" => "关防乡", "code" => "420322201000"},
      %{"name" => "湖北口回族乡", "code" => "420322202000"},
      %{"name" => "景阳乡", "code" => "420322203000"},
      %{"name" => "六郎乡", "code" => "420322204000"},
      %{"name" => "涧池乡", "code" => "420322205000"},
      %{"name" => "安家乡", "code" => "420322206000"},
      %{"name" => "槐树林特场管委会", "code" => "420322400000"},
      %{"name" => "三官洞林区", "code" => "420322401000"},
      %{"name" => "工业园区", "code" => "420322402000"}
    ]

  def next(input) when input == "竹山县" or input == "420323",
    do: [
      %{"name" => "城关镇", "code" => "420323100000"},
      %{"name" => "溢水镇", "code" => "420323101000"},
      %{"name" => "麻家渡镇", "code" => "420323102000"},
      %{"name" => "宝丰镇", "code" => "420323103000"},
      %{"name" => "擂鼓镇", "code" => "420323104000"},
      %{"name" => "秦古镇", "code" => "420323105000"},
      %{"name" => "得胜镇", "code" => "420323106000"},
      %{"name" => "上庸镇", "code" => "420323107000"},
      %{"name" => "官渡镇", "code" => "420323108000"},
      %{"name" => "潘口乡", "code" => "420323200000"},
      %{"name" => "竹坪乡", "code" => "420323201000"},
      %{"name" => "大庙乡", "code" => "420323202000"},
      %{"name" => "双台乡", "code" => "420323203000"},
      %{"name" => "楼台乡", "code" => "420323204000"},
      %{"name" => "文峰乡", "code" => "420323205000"},
      %{"name" => "深河乡", "code" => "420323206000"},
      %{"name" => "柳林乡", "code" => "420323207000"}
    ]

  def next(input) when input == "竹溪县" or input == "420324",
    do: [
      %{"name" => "城关镇", "code" => "420324100000"},
      %{"name" => "蒋家堰镇", "code" => "420324101000"},
      %{"name" => "中峰镇", "code" => "420324102000"},
      %{"name" => "水坪镇", "code" => "420324103000"},
      %{"name" => "县河镇", "code" => "420324104000"},
      %{"name" => "泉溪镇", "code" => "420324105000"},
      %{"name" => "丰溪镇", "code" => "420324106000"},
      %{"name" => "龙坝镇", "code" => "420324107000"},
      %{"name" => "兵营镇", "code" => "420324108000"},
      %{"name" => "汇湾镇", "code" => "420324109000"},
      %{"name" => "新洲镇", "code" => "420324110000"},
      %{"name" => "鄂坪乡", "code" => "420324203000"},
      %{"name" => "天宝乡", "code" => "420324205000"},
      %{"name" => "桃源乡", "code" => "420324206000"},
      %{"name" => "向坝乡", "code" => "420324207000"}
    ]

  def next(input) when input == "房县" or input == "420325",
    do: [
      %{"name" => "城关镇", "code" => "420325100000"},
      %{"name" => "军店镇", "code" => "420325101000"},
      %{"name" => "化龙堰镇", "code" => "420325102000"},
      %{"name" => "土城镇", "code" => "420325103000"},
      %{"name" => "大木厂镇", "code" => "420325104000"},
      %{"name" => "青峰镇", "code" => "420325105000"},
      %{"name" => "门古寺镇", "code" => "420325106000"},
      %{"name" => "白鹤镇", "code" => "420325107000"},
      %{"name" => "野人谷镇", "code" => "420325108000"},
      %{"name" => "红塔镇", "code" => "420325109000"},
      %{"name" => "窑淮镇", "code" => "420325110000"},
      %{"name" => "尹吉甫镇", "code" => "420325111000"},
      %{"name" => "姚坪乡", "code" => "420325203000"},
      %{"name" => "沙河乡", "code" => "420325205000"},
      %{"name" => "万峪河乡", "code" => "420325206000"},
      %{"name" => "上龛乡", "code" => "420325208000"},
      %{"name" => "中坝乡", "code" => "420325209000"},
      %{"name" => "九道乡", "code" => "420325210000"},
      %{"name" => "回龙乡", "code" => "420325211000"},
      %{"name" => "五台乡", "code" => "420325212000"}
    ]

  def next(input) when input == "丹江口市" or input == "420381",
    do: [
      %{"name" => "均州路街道", "code" => "420381001000"},
      %{"name" => "大坝路街道", "code" => "420381002000"},
      %{"name" => "丹赵路街道", "code" => "420381003000"},
      %{"name" => "三官殿街道", "code" => "420381005000"},
      %{"name" => "土关垭镇", "code" => "420381100000"},
      %{"name" => "浪河镇", "code" => "420381101000"},
      %{"name" => "丁家营镇", "code" => "420381102000"},
      %{"name" => "六里坪镇", "code" => "420381103000"},
      %{"name" => "盐池河镇", "code" => "420381104000"},
      %{"name" => "均县镇", "code" => "420381105000"},
      %{"name" => "习家店镇", "code" => "420381106000"},
      %{"name" => "蒿坪镇", "code" => "420381107000"},
      %{"name" => "石鼓镇", "code" => "420381108000"},
      %{"name" => "凉水河镇", "code" => "420381109000"},
      %{"name" => "官山镇", "code" => "420381110000"},
      %{"name" => "龙山镇", "code" => "420381111000"},
      %{"name" => "新港经济开发管理处", "code" => "420381400000"},
      %{"name" => "牛河林业开发管理区", "code" => "420381401000"},
      %{"name" => "白杨坪林业开发管理区", "code" => "420381402000"},
      %{"name" => "大沟林业开发管理区", "code" => "420381403000"},
      %{"name" => "武当山特区", "code" => "420381450000"}
    ]

  def next(input) when input == "黄石港区" or input == "420202",
    do: [
      %{"name" => "沈家营街道", "code" => "420202005000"},
      %{"name" => "黄石港街道", "code" => "420202006000"},
      %{"name" => "胜阳港街道", "code" => "420202007000"},
      %{"name" => "花湖街道", "code" => "420202070000"},
      %{"name" => "江北管理区", "code" => "420202400000"}
    ]

  def next(input) when input == "西塞山区" or input == "420203",
    do: [
      %{"name" => "章山街道", "code" => "420203007000"},
      %{"name" => "八泉街道", "code" => "420203008000"},
      %{"name" => "澄月街道", "code" => "420203009000"},
      %{"name" => "牧羊湖街道", "code" => "420203010000"},
      %{"name" => "黄思湾街道", "code" => "420203011000"},
      %{"name" => "冶钢农场", "code" => "420203400000"},
      %{"name" => "西塞山工业园区管委会", "code" => "420203402000"}
    ]

  def next(input) when input == "下陆区" or input == "420204",
    do: [
      %{"name" => "团城山街道", "code" => "420204004000"},
      %{"name" => "新下陆街道", "code" => "420204005000"},
      %{"name" => "老下陆街道", "code" => "420204006000"},
      %{"name" => "东方山街道", "code" => "420204007000"},
      %{"name" => "长乐山工业园管理委员会", "code" => "420204401000"}
    ]

  def next(input) when input == "铁山区" or input == "420205",
    do: [%{"name" => "铁山街道", "code" => "420205003000"}]

  def next(input) when input == "阳新县" or input == "420222",
    do: [
      %{"name" => "兴国镇", "code" => "420222100000"},
      %{"name" => "富池镇", "code" => "420222101000"},
      %{"name" => "黄颡口镇", "code" => "420222102000"},
      %{"name" => "韦源口镇", "code" => "420222103000"},
      %{"name" => "太子镇", "code" => "420222104000"},
      %{"name" => "大王镇", "code" => "420222105000"},
      %{"name" => "陶港镇", "code" => "420222106000"},
      %{"name" => "白沙镇", "code" => "420222107000"},
      %{"name" => "浮屠镇", "code" => "420222108000"},
      %{"name" => "三溪镇", "code" => "420222109000"},
      %{"name" => "龙港镇", "code" => "420222110000"},
      %{"name" => "洋港镇", "code" => "420222111000"},
      %{"name" => "排市镇", "code" => "420222112000"},
      %{"name" => "木港镇", "code" => "420222113000"},
      %{"name" => "枫林镇", "code" => "420222114000"},
      %{"name" => "王英镇", "code" => "420222115000"},
      %{"name" => "率洲农场", "code" => "420222451000"},
      %{"name" => "半壁山农场", "code" => "420222452000"},
      %{"name" => "荆头山农场", "code" => "420222453000"},
      %{"name" => "金海开发区", "code" => "420222455000"},
      %{"name" => "城东新区", "code" => "420222456000"}
    ]

  def next(input) when input == "大冶市" or input == "420281",
    do: [
      %{"name" => "东岳路街道", "code" => "420281001000"},
      %{"name" => "东风路街道", "code" => "420281002000"},
      %{"name" => "金湖街道", "code" => "420281003000"},
      %{"name" => "罗家桥街道", "code" => "420281004000"},
      %{"name" => "金山街道", "code" => "420281070000"},
      %{"name" => "金牛镇", "code" => "420281100000"},
      %{"name" => "保安镇", "code" => "420281101000"},
      %{"name" => "灵乡镇", "code" => "420281102000"},
      %{"name" => "金山店镇", "code" => "420281103000"},
      %{"name" => "还地桥镇", "code" => "420281104000"},
      %{"name" => "殷祖镇", "code" => "420281105000"},
      %{"name" => "刘仁八镇", "code" => "420281107000"},
      %{"name" => "陈贵镇", "code" => "420281108000"},
      %{"name" => "大箕铺镇", "code" => "420281109000"},
      %{"name" => "汪仁镇", "code" => "420281170000"},
      %{"name" => "茗山乡", "code" => "420281200000"},
      %{"name" => "东风农场管理区", "code" => "420281401000"},
      %{"name" => "四顾闸管理处", "code" => "420281402000"}
    ]

  def next(input) when input == "江岸区" or input == "420102",
    do: [
      %{"name" => "大智街道", "code" => "420102002000"},
      %{"name" => "一元街道", "code" => "420102003000"},
      %{"name" => "车站街道", "code" => "420102004000"},
      %{"name" => "四唯街道", "code" => "420102005000"},
      %{"name" => "永清街道", "code" => "420102006000"},
      %{"name" => "西马街道", "code" => "420102007000"},
      %{"name" => "球场街道", "code" => "420102008000"},
      %{"name" => "劳动街道", "code" => "420102009000"},
      %{"name" => "二七街道", "code" => "420102010000"},
      %{"name" => "新村街道", "code" => "420102011000"},
      %{"name" => "丹水池街道", "code" => "420102012000"},
      %{"name" => "台北街道", "code" => "420102014000"},
      %{"name" => "花桥街道", "code" => "420102015000"},
      %{"name" => "谌家矶街道", "code" => "420102016000"},
      %{"name" => "后湖街道", "code" => "420102017000"},
      %{"name" => "塔子湖街道", "code" => "420102018000"},
      %{"name" => "百步亭花园", "code" => "420102400000"}
    ]

  def next(input) when input == "江汉区" or input == "420103",
    do: [
      %{"name" => "民族街街道", "code" => "420103001000"},
      %{"name" => "花楼街街道", "code" => "420103002000"},
      %{"name" => "水塔街街道", "code" => "420103003000"},
      %{"name" => "民权街街道", "code" => "420103004000"},
      %{"name" => "满春街街道", "code" => "420103005000"},
      %{"name" => "民意街街道", "code" => "420103006000"},
      %{"name" => "新华街街道", "code" => "420103007000"},
      %{"name" => "万松街街道", "code" => "420103008000"},
      %{"name" => "唐家墩街街道", "code" => "420103009000"},
      %{"name" => "北湖街街道", "code" => "420103010000"},
      %{"name" => "前进街街道", "code" => "420103011000"},
      %{"name" => "常青街街道", "code" => "420103012000"},
      %{"name" => "汉兴街街道", "code" => "420103013000"},
      %{"name" => "江汉经济开发区", "code" => "420103400000"},
      %{"name" => "武汉中央商务区管理委员会", "code" => "420103401000"}
    ]

  def next(input) when input == "硚口区" or input == "420104",
    do: [
      %{"name" => "古田街道", "code" => "420104001000"},
      %{"name" => "韩家墩街道", "code" => "420104002000"},
      %{"name" => "宗关街道", "code" => "420104003000"},
      %{"name" => "汉水桥街道", "code" => "420104004000"},
      %{"name" => "宝丰街道", "code" => "420104005000"},
      %{"name" => "荣华街道", "code" => "420104006000"},
      %{"name" => "汉中街道", "code" => "420104008000"},
      %{"name" => "汉正街道", "code" => "420104009000"},
      %{"name" => "六角亭街道", "code" => "420104010000"},
      %{"name" => "长丰街道", "code" => "420104011000"},
      %{"name" => "易家街道", "code" => "420104012000"}
    ]

  def next(input) when input == "汉阳区" or input == "420105",
    do: [
      %{"name" => "建桥街道", "code" => "420105002000"},
      %{"name" => "晴川街道", "code" => "420105004000"},
      %{"name" => "鹦鹉街道", "code" => "420105005000"},
      %{"name" => "洲头街道", "code" => "420105006000"},
      %{"name" => "五里墩街道", "code" => "420105007000"},
      %{"name" => "琴断口街道", "code" => "420105008000"},
      %{"name" => "江汉二桥街道", "code" => "420105009000"},
      %{"name" => "永丰街道", "code" => "420105010000"},
      %{"name" => "江堤街道", "code" => "420105011000"},
      %{"name" => "四新街道", "code" => "420105012000"},
      %{"name" => "龙阳街道", "code" => "420105013000"}
    ]

  def next(input) when input == "武昌区" or input == "420106",
    do: [
      %{"name" => "积玉桥街道", "code" => "420106001000"},
      %{"name" => "杨园街道", "code" => "420106002000"},
      %{"name" => "徐家棚街道", "code" => "420106003000"},
      %{"name" => "粮道街道", "code" => "420106005000"},
      %{"name" => "中华路街道", "code" => "420106006000"},
      %{"name" => "黄鹤楼街道", "code" => "420106007000"},
      %{"name" => "紫阳街道", "code" => "420106008000"},
      %{"name" => "白沙洲街道", "code" => "420106009000"},
      %{"name" => "首义路街道", "code" => "420106010000"},
      %{"name" => "中南路街道", "code" => "420106011000"},
      %{"name" => "水果湖街道", "code" => "420106012000"},
      %{"name" => "珞珈山街道", "code" => "420106013000"},
      %{"name" => "石洞街道", "code" => "420106014000"},
      %{"name" => "南湖街道", "code" => "420106015000"},
      %{"name" => "东湖风景区街道（武昌）", "code" => "420106490000"}
    ]

  def next(input) when input == "青山区" or input == "420107",
    do: [
      %{"name" => "红卫路街道", "code" => "420107001000"},
      %{"name" => "冶金街道", "code" => "420107002000"},
      %{"name" => "新沟桥街道", "code" => "420107003000"},
      %{"name" => "红钢城街道", "code" => "420107004000"},
      %{"name" => "工人村街道", "code" => "420107005000"},
      %{"name" => "青山镇街道", "code" => "420107006000"},
      %{"name" => "武东街道", "code" => "420107008000"},
      %{"name" => "白玉山街道", "code" => "420107009000"},
      %{"name" => "钢花村街道", "code" => "420107010000"},
      %{"name" => "钢都花园街道", "code" => "420107013000"},
      %{"name" => "武钢集团", "code" => "420107400000"},
      %{"name" => "开发区", "code" => "420107404000"}
    ]

  def next(input) when input == "洪山区" or input == "420111",
    do: [
      %{"name" => "珞南街道", "code" => "420111001000"},
      %{"name" => "关山街道", "code" => "420111002000"},
      %{"name" => "狮子山街道", "code" => "420111003000"},
      %{"name" => "张家湾街道", "code" => "420111004000"},
      %{"name" => "梨园街道", "code" => "420111005000"},
      %{"name" => "卓刀泉街道", "code" => "420111006000"},
      %{"name" => "洪山街街道", "code" => "420111007000"},
      %{"name" => "和平街道", "code" => "420111008000"},
      %{"name" => "青菱街道", "code" => "420111009000"},
      %{"name" => "八吉府街道", "code" => "420111061000"},
      %{"name" => "关东街道", "code" => "420111080000"},
      %{"name" => "花山街道", "code" => "420111081000"},
      %{"name" => "左岭街道", "code" => "420111082000"},
      %{"name" => "九峰街道", "code" => "420111083000"},
      %{"name" => "天兴乡", "code" => "420111205000"},
      %{"name" => "清谭湖街道", "code" => "420111460000"},
      %{"name" => "东湖风景区街道（洪山）", "code" => "420111491000"}
    ]

  def next(input) when input == "东西湖区" or input == "420112",
    do: [
      %{"name" => "吴家山街", "code" => "420112001000"},
      %{"name" => "柏泉街道", "code" => "420112002000"},
      %{"name" => "将军路街道", "code" => "420112004000"},
      %{"name" => "慈惠街道", "code" => "420112005000"},
      %{"name" => "走马岭街道", "code" => "420112006000"},
      %{"name" => "径河街道", "code" => "420112007000"},
      %{"name" => "长青街道", "code" => "420112008000"},
      %{"name" => "辛安渡街道", "code" => "420112011000"},
      %{"name" => "东山街道", "code" => "420112012000"},
      %{"name" => "常青花园新区管理委员会街道", "code" => "420112013000"},
      %{"name" => "新沟镇街道", "code" => "420112014000"},
      %{"name" => "金银湖街道", "code" => "420112015000"},
      %{"name" => "产业管理处", "code" => "420112400000"},
      %{"name" => "保税物流管理处", "code" => "420112401000"},
      %{"name" => "海峡两岸科技产业管理处", "code" => "420112402000"},
      %{"name" => "食品工业管理处", "code" => "420112403000"},
      %{"name" => "临空经济管理处", "code" => "420112404000"},
      %{"name" => "农科所管理处", "code" => "420112405000"},
      %{"name" => "现代服务业管理处", "code" => "420112406000"}
    ]

  def next(input) when input == "汉南区" or input == "420113",
    do: [
      %{"name" => "纱帽街道", "code" => "420113001000"},
      %{"name" => "邓南街道", "code" => "420113002000"},
      %{"name" => "东荆街道", "code" => "420113003000"},
      %{"name" => "湘口街道", "code" => "420113004000"}
    ]

  def next(input) when input == "蔡甸区" or input == "420114",
    do: [
      %{"name" => "蔡甸街道", "code" => "420114001000"},
      %{"name" => "奓山街道", "code" => "420114002000"},
      %{"name" => "永安街道", "code" => "420114003000"},
      %{"name" => "侏儒山街道", "code" => "420114004000"},
      %{"name" => "大集街道", "code" => "420114005000"},
      %{"name" => "张湾街道", "code" => "420114006000"},
      %{"name" => "索河街道", "code" => "420114007000"},
      %{"name" => "玉贤街道", "code" => "420114008000"},
      %{"name" => "沌口街道", "code" => "420114070000"},
      %{"name" => "军山街道", "code" => "420114071000"},
      %{"name" => "沌阳街道", "code" => "420114072000"},
      %{"name" => "消泗乡", "code" => "420114200000"},
      %{"name" => "桐湖", "code" => "420114400000"},
      %{"name" => "侏儒山街道洪北片区", "code" => "420114401000"},
      %{"name" => "中法武汉生态示范城", "code" => "420114404000"},
      %{"name" => "侏儒山街道成功片区", "code" => "420114406000"},
      %{"name" => "蔡甸经济开发区", "code" => "420114407000"}
    ]

  def next(input) when input == "江夏区" or input == "420115",
    do: [
      %{"name" => "纸坊街道", "code" => "420115001000"},
      %{"name" => "金口街道", "code" => "420115002000"},
      %{"name" => "乌龙泉街道", "code" => "420115003000"},
      %{"name" => "郑店街道", "code" => "420115005000"},
      %{"name" => "五里界街道", "code" => "420115007000"},
      %{"name" => "金水街道", "code" => "420115008000"},
      %{"name" => "安山街道", "code" => "420115009000"},
      %{"name" => "山坡街道", "code" => "420115010000"},
      %{"name" => "法泗街道", "code" => "420115014000"},
      %{"name" => "湖泗街道", "code" => "420115015000"},
      %{"name" => "舒安街道", "code" => "420115016000"},
      %{"name" => "佛祖岭街道", "code" => "420115086000"},
      %{"name" => "豹澥街道", "code" => "420115087000"},
      %{"name" => "龙泉街道", "code" => "420115088000"},
      %{"name" => "滨湖街道", "code" => "420115089000"},
      %{"name" => "武汉江夏经济开发区庙山高新技术产业园", "code" => "420115401000"},
      %{"name" => "武汉江夏经济开发区藏龙岛高新技术产业园", "code" => "420115402000"},
      %{"name" => "武汉江夏经济开发区大桥现代产业园", "code" => "420115403000"},
      %{"name" => "江夏梁子湖风景区", "code" => "420115404000"},
      %{"name" => "武汉江夏经济开发区金港汽车产业园", "code" => "420115405000"}
    ]

  def next(input) when input == "黄陂区" or input == "420116",
    do: [
      %{"name" => "前川街道", "code" => "420116001000"},
      %{"name" => "祁家湾街道", "code" => "420116002000"},
      %{"name" => "横店街道", "code" => "420116003000"},
      %{"name" => "罗汉寺街道", "code" => "420116004000"},
      %{"name" => "滠口街道", "code" => "420116005000"},
      %{"name" => "六指街道", "code" => "420116006000"},
      %{"name" => "天河街道", "code" => "420116007000"},
      %{"name" => "王家河街道", "code" => "420116008000"},
      %{"name" => "长轩岭街道", "code" => "420116009000"},
      %{"name" => "李集街道", "code" => "420116010000"},
      %{"name" => "姚集街道", "code" => "420116011000"},
      %{"name" => "蔡榨街道", "code" => "420116012000"},
      %{"name" => "武湖街道", "code" => "420116013000"},
      %{"name" => "三里桥街道", "code" => "420116014000"},
      %{"name" => "蔡店街道", "code" => "420116015000"},
      %{"name" => "木兰乡", "code" => "420116201000"},
      %{"name" => "木兰山风景区管理处", "code" => "420116401000"},
      %{"name" => "大潭", "code" => "420116402000"},
      %{"name" => "盘龙城经济开发区", "code" => "420116403000"},
      %{"name" => "汉口北商贸物流枢纽区管委会", "code" => "420116404000"}
    ]

  def next(input) when input == "新洲区" or input == "420117",
    do: [
      %{"name" => "邾城街道", "code" => "420117001000"},
      %{"name" => "阳逻街道", "code" => "420117002000"},
      %{"name" => "仓埠街道", "code" => "420117003000"},
      %{"name" => "汪集街道", "code" => "420117004000"},
      %{"name" => "李集街道", "code" => "420117005000"},
      %{"name" => "三店街道", "code" => "420117006000"},
      %{"name" => "潘塘街道", "code" => "420117007000"},
      %{"name" => "旧街街道", "code" => "420117008000"},
      %{"name" => "双柳街道", "code" => "420117009000"},
      %{"name" => "涨渡湖街道", "code" => "420117010000"},
      %{"name" => "辛冲街道", "code" => "420117011000"},
      %{"name" => "徐古街道", "code" => "420117012000"},
      %{"name" => "凤凰镇", "code" => "420117102000"},
      %{"name" => "道观河风景旅游管理处", "code" => "420117400000"},
      %{"name" => "新洲原种场", "code" => "420117406000"}
    ]

  def next(_), do: nil
end