defmodule ChinaAdminDivisions.Gen.Lv3x.M43 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "吉首市" or input == "433101",
    do: [
      %{"name" => "峒河街道", "code" => "433101002000"},
      %{"name" => "乾州街道", "code" => "433101004000"},
      %{"name" => "镇溪街道", "code" => "433101005000"},
      %{"name" => "石家冲街道", "code" => "433101007000"},
      %{"name" => "双塘街道", "code" => "433101008000"},
      %{"name" => "吉凤街道", "code" => "433101009000"},
      %{"name" => "矮寨镇", "code" => "433101100000"},
      %{"name" => "马颈坳镇", "code" => "433101101000"},
      %{"name" => "河溪镇", "code" => "433101102000"},
      %{"name" => "丹青镇", "code" => "433101104000"},
      %{"name" => "太平镇", "code" => "433101105000"},
      %{"name" => "己略乡", "code" => "433101201000"}
    ]

  def next(input) when input == "泸溪县" or input == "433122",
    do: [
      %{"name" => "达岚镇", "code" => "433122102000"},
      %{"name" => "兴隆场镇", "code" => "433122104000"},
      %{"name" => "潭溪镇", "code" => "433122105000"},
      %{"name" => "洗溪镇", "code" => "433122106000"},
      %{"name" => "武溪镇", "code" => "433122107000"},
      %{"name" => "浦市镇", "code" => "433122108000"},
      %{"name" => "合水镇", "code" => "433122109000"},
      %{"name" => "石榴坪乡", "code" => "433122203000"},
      %{"name" => "解放岩乡", "code" => "433122206000"},
      %{"name" => "小章乡", "code" => "433122207000"},
      %{"name" => "白羊溪乡", "code" => "433122208000"},
      %{"name" => "军亭界林场", "code" => "433122400000"}
    ]

  def next(input) when input == "凤凰县" or input == "433123",
    do: [
      %{"name" => "廖家桥镇", "code" => "433123101000"},
      %{"name" => "茶田镇", "code" => "433123104000"},
      %{"name" => "吉信镇", "code" => "433123105000"},
      %{"name" => "腊尔山镇", "code" => "433123107000"},
      %{"name" => "禾库镇", "code" => "433123108000"},
      %{"name" => "沱江镇", "code" => "433123109000"},
      %{"name" => "阿拉营镇", "code" => "433123110000"},
      %{"name" => "木江坪镇", "code" => "433123111000"},
      %{"name" => "山江镇", "code" => "433123112000"},
      %{"name" => "落潮井镇", "code" => "433123113000"},
      %{"name" => "新场镇", "code" => "433123114000"},
      %{"name" => "筸子坪镇", "code" => "433123115000"},
      %{"name" => "千工坪镇", "code" => "433123116000"},
      %{"name" => "水打田乡", "code" => "433123204000"},
      %{"name" => "林峰乡", "code" => "433123205000"},
      %{"name" => "麻冲乡", "code" => "433123216000"},
      %{"name" => "两林乡", "code" => "433123220000"}
    ]

  def next(input) when input == "花垣县" or input == "433124",
    do: [
      %{"name" => "龙潭镇", "code" => "433124102000"},
      %{"name" => "民乐镇", "code" => "433124103000"},
      %{"name" => "吉卫镇", "code" => "433124105000"},
      %{"name" => "麻栗场镇", "code" => "433124106000"},
      %{"name" => "雅酉镇", "code" => "433124107000"},
      %{"name" => "边城镇", "code" => "433124108000"},
      %{"name" => "花垣镇", "code" => "433124109000"},
      %{"name" => "双龙镇", "code" => "433124110000"},
      %{"name" => "石栏镇", "code" => "433124111000"},
      %{"name" => "长乐乡", "code" => "433124200000"},
      %{"name" => "猫儿乡", "code" => "433124206000"},
      %{"name" => "补抽乡", "code" => "433124213000"}
    ]

  def next(input) when input == "保靖县" or input == "433125",
    do: [
      %{"name" => "普戎镇", "code" => "433125104000"},
      %{"name" => "复兴镇", "code" => "433125108000"},
      %{"name" => "迁陵镇", "code" => "433125109000"},
      %{"name" => "清水坪镇", "code" => "433125110000"},
      %{"name" => "比耳镇", "code" => "433125111000"},
      %{"name" => "毛沟镇", "code" => "433125112000"},
      %{"name" => "水田河镇", "code" => "433125113000"},
      %{"name" => "葫芦镇", "code" => "433125114000"},
      %{"name" => "碗米坡镇", "code" => "433125115000"},
      %{"name" => "吕洞山镇", "code" => "433125116000"},
      %{"name" => "阳朝乡", "code" => "433125217000"},
      %{"name" => "长潭河乡", "code" => "433125218000"}
    ]

  def next(input) when input == "古丈县" or input == "433126",
    do: [
      %{"name" => "古阳镇", "code" => "433126101000"},
      %{"name" => "岩头寨镇", "code" => "433126103000"},
      %{"name" => "默戎镇", "code" => "433126104000"},
      %{"name" => "红石林镇", "code" => "433126105000"},
      %{"name" => "断龙山镇", "code" => "433126106000"},
      %{"name" => "高峰镇", "code" => "433126107000"},
      %{"name" => "坪坝镇", "code" => "433126108000"}
    ]

  def next(input) when input == "永顺县" or input == "433127",
    do: [
      %{"name" => "首车镇", "code" => "433127101000"},
      %{"name" => "芙蓉镇", "code" => "433127103000"},
      %{"name" => "永茂镇", "code" => "433127104000"},
      %{"name" => "小溪镇", "code" => "433127108000"},
      %{"name" => "青坪镇", "code" => "433127109000"},
      %{"name" => "石堤镇", "code" => "433127112000"},
      %{"name" => "万坪镇", "code" => "433127113000"},
      %{"name" => "塔卧镇", "code" => "433127114000"},
      %{"name" => "砂坝镇", "code" => "433127115000"},
      %{"name" => "灵溪镇", "code" => "433127116000"},
      %{"name" => "松柏镇", "code" => "433127117000"},
      %{"name" => "泽家镇", "code" => "433127118000"},
      %{"name" => "两岔乡", "code" => "433127200000"},
      %{"name" => "西歧乡", "code" => "433127202000"},
      %{"name" => "对山乡", "code" => "433127203000"},
      %{"name" => "高坪乡", "code" => "433127210000"},
      %{"name" => "朗溪乡", "code" => "433127216000"},
      %{"name" => "润雅乡", "code" => "433127220000"},
      %{"name" => "车坪乡", "code" => "433127222000"},
      %{"name" => "毛坝乡", "code" => "433127228000"},
      %{"name" => "万民乡", "code" => "433127229000"},
      %{"name" => "盐井乡", "code" => "433127230000"},
      %{"name" => "颗砂乡", "code" => "433127238000"}
    ]

  def next(input) when input == "龙山县" or input == "433130",
    do: [
      %{"name" => "民安街道", "code" => "433130001000"},
      %{"name" => "华塘街道", "code" => "433130002000"},
      %{"name" => "兴隆街道", "code" => "433130004000"},
      %{"name" => "石羔街道", "code" => "433130005000"},
      %{"name" => "洗车河镇", "code" => "433130104000"},
      %{"name" => "石牌镇", "code" => "433130110000"},
      %{"name" => "茨岩塘镇", "code" => "433130112000"},
      %{"name" => "红岩溪镇", "code" => "433130113000"},
      %{"name" => "靛房镇", "code" => "433130114000"},
      %{"name" => "苗儿滩镇", "code" => "433130115000"},
      %{"name" => "里耶镇", "code" => "433130116000"},
      %{"name" => "桂塘镇", "code" => "433130117000"},
      %{"name" => "召市镇", "code" => "433130118000"},
      %{"name" => "洗洛镇", "code" => "433130119000"},
      %{"name" => "水田坝镇", "code" => "433130120000"},
      %{"name" => "农车镇", "code" => "433130121000"},
      %{"name" => "洛塔乡", "code" => "433130200000"},
      %{"name" => "大安乡", "code" => "433130210000"},
      %{"name" => "内溪乡", "code" => "433130220000"},
      %{"name" => "咱果乡", "code" => "433130236000"},
      %{"name" => "茅坪乡", "code" => "433130237000"}
    ]

  def next(input) when input == "娄星区" or input == "431302",
    do: [
      %{"name" => "乐坪街道", "code" => "431302001000"},
      %{"name" => "花山街道", "code" => "431302002000"},
      %{"name" => "黄泥塘街道", "code" => "431302003000"},
      %{"name" => "长青街道", "code" => "431302004000"},
      %{"name" => "大科街道", "code" => "431302005000"},
      %{"name" => "涟滨街道", "code" => "431302006000"},
      %{"name" => "大埠桥街道", "code" => "431302007000"},
      %{"name" => "杉山镇", "code" => "431302100000"},
      %{"name" => "万宝镇", "code" => "431302101000"},
      %{"name" => "石井镇", "code" => "431302104000"},
      %{"name" => "水洞底镇", "code" => "431302105000"},
      %{"name" => "蛇形山镇", "code" => "431302106000"},
      %{"name" => "双江乡", "code" => "431302204000"}
    ]

  def next(input) when input == "双峰县" or input == "431321",
    do: [
      %{"name" => "永丰街道", "code" => "431321001000"},
      %{"name" => "金开街道", "code" => "431321002000"},
      %{"name" => "荷叶镇", "code" => "431321101000"},
      %{"name" => "井字镇", "code" => "431321102000"},
      %{"name" => "梓门桥镇", "code" => "431321103000"},
      %{"name" => "杏子铺镇", "code" => "431321104000"},
      %{"name" => "走马街镇", "code" => "431321105000"},
      %{"name" => "洪山殿镇", "code" => "431321107000"},
      %{"name" => "甘棠镇", "code" => "431321108000"},
      %{"name" => "三塘铺镇", "code" => "431321109000"},
      %{"name" => "青树坪镇", "code" => "431321110000"},
      %{"name" => "花门镇", "code" => "431321111000"},
      %{"name" => "锁石镇", "code" => "431321112000"},
      %{"name" => "石牛乡", "code" => "431321200000"},
      %{"name" => "沙塘乡", "code" => "431321201000"},
      %{"name" => "印塘乡", "code" => "431321202000"}
    ]

  def next(input) when input == "新化县" or input == "431322",
    do: [
      %{"name" => "上梅街道", "code" => "431322001000"},
      %{"name" => "上渡街道", "code" => "431322002000"},
      %{"name" => "枫林街道", "code" => "431322003000"},
      %{"name" => "石冲口镇", "code" => "431322101000"},
      %{"name" => "洋溪镇", "code" => "431322102000"},
      %{"name" => "槎溪镇", "code" => "431322103000"},
      %{"name" => "水车镇", "code" => "431322104000"},
      %{"name" => "文田镇", "code" => "431322105000"},
      %{"name" => "奉家镇", "code" => "431322106000"},
      %{"name" => "炉观镇", "code" => "431322107000"},
      %{"name" => "游家镇", "code" => "431322108000"},
      %{"name" => "西河镇", "code" => "431322109000"},
      %{"name" => "孟公镇", "code" => "431322110000"},
      %{"name" => "琅塘镇", "code" => "431322111000"},
      %{"name" => "白溪镇", "code" => "431322112000"},
      %{"name" => "圳上镇", "code" => "431322113000"},
      %{"name" => "吉庆镇", "code" => "431322114000"},
      %{"name" => "温塘镇", "code" => "431322115000"},
      %{"name" => "田坪镇", "code" => "431322116000"},
      %{"name" => "桑梓镇", "code" => "431322117000"},
      %{"name" => "曹家镇", "code" => "431322118000"},
      %{"name" => "科头乡", "code" => "431322200000"},
      %{"name" => "维山乡", "code" => "431322201000"},
      %{"name" => "天门乡", "code" => "431322202000"},
      %{"name" => "荣华乡", "code" => "431322203000"},
      %{"name" => "金凤乡", "code" => "431322204000"},
      %{"name" => "油溪乡", "code" => "431322205000"},
      %{"name" => "坐石乡", "code" => "431322206000"},
      %{"name" => "大熊山国有林场", "code" => "431322500000"},
      %{"name" => "古台山国有林场", "code" => "431322501000"}
    ]

  def next(input) when input == "冷水江市" or input == "431381",
    do: [
      %{"name" => "冷水江街道", "code" => "431381001000"},
      %{"name" => "锡矿山街道", "code" => "431381002000"},
      %{"name" => "沙塘湾街道", "code" => "431381003000"},
      %{"name" => "布溪街道", "code" => "431381004000"},
      %{"name" => "禾青镇", "code" => "431381100000"},
      %{"name" => "渣渡镇", "code" => "431381102000"},
      %{"name" => "铎山镇", "code" => "431381103000"},
      %{"name" => "三尖镇", "code" => "431381105000"},
      %{"name" => "金竹山镇", "code" => "431381106000"},
      %{"name" => "中连乡", "code" => "431381205000"}
    ]

  def next(input) when input == "涟源市" or input == "431382",
    do: [
      %{"name" => "蓝田街道", "code" => "431382001000"},
      %{"name" => "六亩塘街道", "code" => "431382002000"},
      %{"name" => "石马山街道", "code" => "431382003000"},
      %{"name" => "安平镇", "code" => "431382102000"},
      %{"name" => "湄江镇", "code" => "431382103000"},
      %{"name" => "伏口镇", "code" => "431382104000"},
      %{"name" => "桥头河镇", "code" => "431382105000"},
      %{"name" => "七星街镇", "code" => "431382106000"},
      %{"name" => "杨市镇", "code" => "431382107000"},
      %{"name" => "枫坪镇", "code" => "431382108000"},
      %{"name" => "斗笠山镇", "code" => "431382109000"},
      %{"name" => "白马镇", "code" => "431382111000"},
      %{"name" => "茅塘镇", "code" => "431382112000"},
      %{"name" => "荷塘镇", "code" => "431382113000"},
      %{"name" => "金石镇", "code" => "431382114000"},
      %{"name" => "龙塘镇", "code" => "431382115000"},
      %{"name" => "渡头塘镇", "code" => "431382116000"},
      %{"name" => "湖泉镇", "code" => "431382117000"},
      %{"name" => "三甲乡", "code" => "431382200000"},
      %{"name" => "古塘乡", "code" => "431382202000"}
    ]

  def next(input) when input == "鹤城区" or input == "431202",
    do: [
      %{"name" => "城中街道", "code" => "431202001000"},
      %{"name" => "城北街道", "code" => "431202002000"},
      %{"name" => "红星街道", "code" => "431202003000"},
      %{"name" => "迎丰街道", "code" => "431202004000"},
      %{"name" => "坨院街道", "code" => "431202005000"},
      %{"name" => "河西街道", "code" => "431202006000"},
      %{"name" => "城南街道", "code" => "431202007000"},
      %{"name" => "黄金坳镇", "code" => "431202101000"},
      %{"name" => "盈口乡", "code" => "431202201000"},
      %{"name" => "凉亭坳乡", "code" => "431202205000"},
      %{"name" => "黄岩旅游度假区", "code" => "431202400000"}
    ]

  def next(input) when input == "中方县" or input == "431221",
    do: [
      %{"name" => "中方镇", "code" => "431221100000"},
      %{"name" => "泸阳镇", "code" => "431221102000"},
      %{"name" => "花桥镇", "code" => "431221103000"},
      %{"name" => "铜湾镇", "code" => "431221104000"},
      %{"name" => "桐木镇", "code" => "431221105000"},
      %{"name" => "铁坡镇", "code" => "431221106000"},
      %{"name" => "新建镇", "code" => "431221107000"},
      %{"name" => "接龙镇", "code" => "431221108000"},
      %{"name" => "铜鼎镇", "code" => "431221109000"},
      %{"name" => "新路河镇", "code" => "431221110000"},
      %{"name" => "袁家镇", "code" => "431221111000"},
      %{"name" => "蒿吉坪瑶族乡", "code" => "431221214000"}
    ]

  def next(input) when input == "沅陵县" or input == "431222",
    do: [
      %{"name" => "麻溪铺镇", "code" => "431222102000"},
      %{"name" => "五强溪镇", "code" => "431222105000"},
      %{"name" => "明溪口镇", "code" => "431222110000"},
      %{"name" => "凉水井镇", "code" => "431222111000"},
      %{"name" => "七甲坪镇", "code" => "431222112000"},
      %{"name" => "筲箕湾镇", "code" => "431222113000"},
      %{"name" => "官庄镇", "code" => "431222114000"},
      %{"name" => "沅陵镇", "code" => "431222115000"},
      %{"name" => "杜家坪乡", "code" => "431222223000"},
      %{"name" => "楠木铺乡", "code" => "431222224000"},
      %{"name" => "肖家桥乡", "code" => "431222230000"},
      %{"name" => "火场土家族乡", "code" => "431222234000"},
      %{"name" => "陈家滩乡", "code" => "431222238000"},
      %{"name" => "清浪乡", "code" => "431222239000"},
      %{"name" => "借母溪乡", "code" => "431222245000"},
      %{"name" => "荔溪乡", "code" => "431222247000"},
      %{"name" => "大合坪乡", "code" => "431222248000"},
      %{"name" => "马底驿乡", "code" => "431222250000"},
      %{"name" => "北溶乡", "code" => "431222251000"},
      %{"name" => "二酉乡", "code" => "431222252000"},
      %{"name" => "盘古乡", "code" => "431222253000"}
    ]

  def next(input) when input == "辰溪县" or input == "431223",
    do: [
      %{"name" => "辰阳镇", "code" => "431223100000"},
      %{"name" => "孝坪镇", "code" => "431223101000"},
      %{"name" => "田湾镇", "code" => "431223102000"},
      %{"name" => "火马冲镇", "code" => "431223103000"},
      %{"name" => "黄溪口镇", "code" => "431223104000"},
      %{"name" => "潭湾镇", "code" => "431223105000"},
      %{"name" => "安坪镇", "code" => "431223106000"},
      %{"name" => "锦滨镇", "code" => "431223108000"},
      %{"name" => "修溪镇", "code" => "431223109000"},
      %{"name" => "船溪乡", "code" => "431223200000"},
      %{"name" => "长田湾乡", "code" => "431223204000"},
      %{"name" => "小龙门乡", "code" => "431223205000"},
      %{"name" => "后塘瑶族乡", "code" => "431223206000"},
      %{"name" => "苏木溪瑶族乡", "code" => "431223207000"},
      %{"name" => "罗子山瑶族乡", "code" => "431223208000"},
      %{"name" => "上蒲溪瑶族乡", "code" => "431223209000"},
      %{"name" => "仙人湾瑶族乡", "code" => "431223210000"},
      %{"name" => "龙头庵乡", "code" => "431223211000"},
      %{"name" => "大水田乡", "code" => "431223215000"},
      %{"name" => "桥头溪乡", "code" => "431223216000"},
      %{"name" => "龙泉岩乡", "code" => "431223218000"},
      %{"name" => "柿溪乡", "code" => "431223221000"},
      %{"name" => "谭家场乡", "code" => "431223222000"}
    ]

  def next(input) when input == "溆浦县" or input == "431224",
    do: [
      %{"name" => "卢峰镇", "code" => "431224100000"},
      %{"name" => "低庄镇", "code" => "431224102000"},
      %{"name" => "桥江镇", "code" => "431224103000"},
      %{"name" => "龙潭镇", "code" => "431224104000"},
      %{"name" => "均坪镇", "code" => "431224105000"},
      %{"name" => "观音阁镇", "code" => "431224106000"},
      %{"name" => "双井镇", "code" => "431224107000"},
      %{"name" => "水东镇", "code" => "431224108000"},
      %{"name" => "两丫坪镇", "code" => "431224109000"},
      %{"name" => "黄茅园镇", "code" => "431224110000"},
      %{"name" => "葛竹坪镇", "code" => "431224112000"},
      %{"name" => "大江口镇", "code" => "431224118000"},
      %{"name" => "思蒙镇", "code" => "431224119000"},
      %{"name" => "深子湖镇", "code" => "431224120000"},
      %{"name" => "祖师殿镇", "code" => "431224121000"},
      %{"name" => "三江镇", "code" => "431224122000"},
      %{"name" => "统溪河镇", "code" => "431224123000"},
      %{"name" => "北斗溪镇", "code" => "431224124000"},
      %{"name" => "舒溶溪乡", "code" => "431224204000"},
      %{"name" => "油洋乡", "code" => "431224213000"},
      %{"name" => "小横垅乡", "code" => "431224219000"},
      %{"name" => "中都乡", "code" => "431224223000"},
      %{"name" => "沿溪乡", "code" => "431224224000"},
      %{"name" => "龙庄湾乡", "code" => "431224230000"},
      %{"name" => "淘金坪乡", "code" => "431224231000"}
    ]

  def next(input) when input == "会同县" or input == "431225",
    do: [
      %{"name" => "林城镇", "code" => "431225100000"},
      %{"name" => "坪村镇", "code" => "431225101000"},
      %{"name" => "堡子镇", "code" => "431225102000"},
      %{"name" => "团河镇", "code" => "431225103000"},
      %{"name" => "若水镇", "code" => "431225104000"},
      %{"name" => "广坪镇", "code" => "431225106000"},
      %{"name" => "马鞍镇", "code" => "431225107000"},
      %{"name" => "金竹镇", "code" => "431225108000"},
      %{"name" => "沙溪乡", "code" => "431225200000"},
      %{"name" => "金子岩侗族苗族乡", "code" => "431225201000"},
      %{"name" => "高椅乡", "code" => "431225204000"},
      %{"name" => "宝田侗族苗族乡", "code" => "431225209000"},
      %{"name" => "漠滨侗族苗族乡", "code" => "431225210000"},
      %{"name" => "蒲稳侗族苗族乡", "code" => "431225211000"},
      %{"name" => "青朗侗族苗族乡", "code" => "431225212000"},
      %{"name" => "炮团侗族苗族乡", "code" => "431225213000"},
      %{"name" => "地灵乡", "code" => "431225214000"},
      %{"name" => "连山乡", "code" => "431225215000"}
    ]

  def next(input) when input == "麻阳苗族自治县" or input == "431226",
    do: [
      %{"name" => "锦和镇", "code" => "431226101000"},
      %{"name" => "江口墟镇", "code" => "431226102000"},
      %{"name" => "岩门镇", "code" => "431226103000"},
      %{"name" => "兰里镇", "code" => "431226104000"},
      %{"name" => "吕家坪镇", "code" => "431226105000"},
      %{"name" => "高村镇", "code" => "431226106000"},
      %{"name" => "尧市镇", "code" => "431226107000"},
      %{"name" => "郭公坪镇", "code" => "431226108000"},
      %{"name" => "文昌阁乡", "code" => "431226204000"},
      %{"name" => "大桥江乡", "code" => "431226205000"},
      %{"name" => "舒家村乡", "code" => "431226206000"},
      %{"name" => "隆家堡乡", "code" => "431226207000"},
      %{"name" => "谭家寨乡", "code" => "431226208000"},
      %{"name" => "石羊哨乡", "code" => "431226209000"},
      %{"name" => "板栗树乡", "code" => "431226210000"},
      %{"name" => "兰村乡", "code" => "431226212000"},
      %{"name" => "和平溪乡", "code" => "431226215000"},
      %{"name" => "黄桑乡", "code" => "431226216000"}
    ]

  def next(input) when input == "新晃侗族自治县" or input == "431227",
    do: [
      %{"name" => "波洲镇", "code" => "431227101000"},
      %{"name" => "鱼市镇", "code" => "431227103000"},
      %{"name" => "凉伞镇", "code" => "431227104000"},
      %{"name" => "扶罗镇", "code" => "431227105000"},
      %{"name" => "中寨镇", "code" => "431227106000"},
      %{"name" => "晃洲镇", "code" => "431227107000"},
      %{"name" => "林冲镇", "code" => "431227108000"},
      %{"name" => "贡溪镇", "code" => "431227109000"},
      %{"name" => "禾滩镇", "code" => "431227110000"},
      %{"name" => "步头降苗族乡", "code" => "431227200000"},
      %{"name" => "米贝苗族乡", "code" => "431227215000"}
    ]

  def next(input) when input == "芷江侗族自治县" or input == "431228",
    do: [
      %{"name" => "芷江镇", "code" => "431228100000"},
      %{"name" => "罗旧镇", "code" => "431228101000"},
      %{"name" => "新店坪镇", "code" => "431228102000"},
      %{"name" => "碧涌镇", "code" => "431228103000"},
      %{"name" => "公坪镇", "code" => "431228104000"},
      %{"name" => "岩桥镇", "code" => "431228105000"},
      %{"name" => "三道坑镇", "code" => "431228106000"},
      %{"name" => "土桥镇", "code" => "431228107000"},
      %{"name" => "楠木坪镇", "code" => "431228108000"},
      %{"name" => "牛牯坪乡", "code" => "431228201000"},
      %{"name" => "水宽乡", "code" => "431228204000"},
      %{"name" => "大树坳乡", "code" => "431228212000"},
      %{"name" => "梨溪口乡", "code" => "431228215000"},
      %{"name" => "洞下场乡", "code" => "431228216000"},
      %{"name" => "禾梨坳乡", "code" => "431228220000"},
      %{"name" => "冷水溪乡", "code" => "431228221000"},
      %{"name" => "晓坪乡", "code" => "431228223000"},
      %{"name" => "罗卜田乡", "code" => "431228224000"}
    ]

  def next(input) when input == "靖州苗族侗族自治县" or input == "431229",
    do: [
      %{"name" => "渠阳镇", "code" => "431229100000"},
      %{"name" => "甘棠镇", "code" => "431229101000"},
      %{"name" => "大堡子镇", "code" => "431229102000"},
      %{"name" => "坳上镇", "code" => "431229103000"},
      %{"name" => "新厂镇", "code" => "431229104000"},
      %{"name" => "平茶镇", "code" => "431229105000"},
      %{"name" => "太阳坪乡", "code" => "431229200000"},
      %{"name" => "三锹乡", "code" => "431229201000"},
      %{"name" => "文溪乡", "code" => "431229202000"},
      %{"name" => "寨牙乡", "code" => "431229203000"},
      %{"name" => "藕团乡", "code" => "431229206000"}
    ]

  def next(input) when input == "通道侗族自治县" or input == "431230",
    do: [
      %{"name" => "双江镇", "code" => "431230100000"},
      %{"name" => "县溪镇", "code" => "431230101000"},
      %{"name" => "播阳镇", "code" => "431230102000"},
      %{"name" => "牙屯堡镇", "code" => "431230104000"},
      %{"name" => "菁芜洲镇", "code" => "431230105000"},
      %{"name" => "溪口镇", "code" => "431230106000"},
      %{"name" => "陇城镇", "code" => "431230107000"},
      %{"name" => "万佛山镇", "code" => "431230108000"},
      %{"name" => "独坡镇", "code" => "431230109000"},
      %{"name" => "大高坪苗族乡", "code" => "431230203000"},
      %{"name" => "坪坦乡", "code" => "431230216000"},
      %{"name" => "通道县地连林场", "code" => "431230400000"},
      %{"name" => "通道县播阳农场", "code" => "431230401000"}
    ]

  def next(input) when input == "怀化市洪江管理区" or input == "431271",
    do: [
      %{"name" => "河滨路街道", "code" => "431271001000"},
      %{"name" => "沅江路街道", "code" => "431271002000"},
      %{"name" => "新街街道", "code" => "431271003000"},
      %{"name" => "高坡街街道", "code" => "431271004000"},
      %{"name" => "横岩乡", "code" => "431271218000"},
      %{"name" => "桂花园乡", "code" => "431271220000"}
    ]

  def next(input) when input == "洪江市" or input == "431281",
    do: [
      %{"name" => "黔城镇", "code" => "431281101000"},
      %{"name" => "安江镇", "code" => "431281102000"},
      %{"name" => "托口镇", "code" => "431281103000"},
      %{"name" => "雪峰镇", "code" => "431281104000"},
      %{"name" => "江市镇", "code" => "431281106000"},
      %{"name" => "沅河镇", "code" => "431281107000"},
      %{"name" => "塘湾镇", "code" => "431281108000"},
      %{"name" => "岔头乡", "code" => "431281202000"},
      %{"name" => "茅渡乡", "code" => "431281203000"},
      %{"name" => "大崇乡", "code" => "431281204000"},
      %{"name" => "熟坪乡", "code" => "431281205000"},
      %{"name" => "铁山乡", "code" => "431281206000"},
      %{"name" => "群峰乡", "code" => "431281207000"},
      %{"name" => "湾溪乡", "code" => "431281208000"},
      %{"name" => "洗马乡", "code" => "431281209000"},
      %{"name" => "沙湾乡", "code" => "431281211000"},
      %{"name" => "深渡苗族乡", "code" => "431281212000"},
      %{"name" => "龙船塘瑶族乡", "code" => "431281213000"},
      %{"name" => "太平乡", "code" => "431281214000"},
      %{"name" => "岩垅乡", "code" => "431281217000"}
    ]

  def next(input) when input == "零陵区" or input == "431102",
    do: [
      %{"name" => "朝阳街道", "code" => "431102001000"},
      %{"name" => "南津渡街道", "code" => "431102002000"},
      %{"name" => "七里店街道", "code" => "431102003000"},
      %{"name" => "徐家井街道", "code" => "431102004000"},
      %{"name" => "接履桥街道", "code" => "431102005000"},
      %{"name" => "石山脚街道", "code" => "431102006000"},
      %{"name" => "水口山镇", "code" => "431102101000"},
      %{"name" => "珠山镇", "code" => "431102102000"},
      %{"name" => "黄田铺镇", "code" => "431102103000"},
      %{"name" => "富家桥镇", "code" => "431102104000"},
      %{"name" => "菱角塘镇", "code" => "431102105000"},
      %{"name" => "邮亭圩镇", "code" => "431102106000"},
      %{"name" => "石岩头镇", "code" => "431102108000"},
      %{"name" => "大庆坪乡", "code" => "431102200000"},
      %{"name" => "梳子铺乡", "code" => "431102201000"},
      %{"name" => "凼底乡", "code" => "431102203000"}
    ]

  def next(input) when input == "冷水滩区" or input == "431103",
    do: [
      %{"name" => "梅湾街道", "code" => "431103001000"},
      %{"name" => "菱角山街道", "code" => "431103002000"},
      %{"name" => "肖家园街道", "code" => "431103003000"},
      %{"name" => "杨家桥街道", "code" => "431103004000"},
      %{"name" => "梧桐街道", "code" => "431103005000"},
      %{"name" => "凤凰街道", "code" => "431103006000"},
      %{"name" => "珊瑚街道", "code" => "431103007000"},
      %{"name" => "曲河街道", "code" => "431103008000"},
      %{"name" => "岚角山街道", "code" => "431103009000"},
      %{"name" => "花桥街镇", "code" => "431103101000"},
      %{"name" => "普利桥镇", "code" => "431103102000"},
      %{"name" => "牛角坝镇", "code" => "431103103000"},
      %{"name" => "高溪市镇", "code" => "431103104000"},
      %{"name" => "黄阳司镇", "code" => "431103105000"},
      %{"name" => "上岭桥镇", "code" => "431103106000"},
      %{"name" => "伊塘镇", "code" => "431103108000"},
      %{"name" => "蔡市镇", "code" => "431103110000"},
      %{"name" => "杨村甸乡", "code" => "431103201000"}
    ]

  def next(input) when input == "东安县" or input == "431122",
    do: [
      %{"name" => "白牙市镇", "code" => "431122100000"},
      %{"name" => "大庙口镇", "code" => "431122101000"},
      %{"name" => "紫溪市镇", "code" => "431122102000"},
      %{"name" => "横塘镇", "code" => "431122103000"},
      %{"name" => "石期市镇", "code" => "431122104000"},
      %{"name" => "井头圩镇", "code" => "431122105000"},
      %{"name" => "端桥铺镇", "code" => "431122106000"},
      %{"name" => "鹿马桥镇", "code" => "431122107000"},
      %{"name" => "芦洪市镇", "code" => "431122108000"},
      %{"name" => "新圩江镇", "code" => "431122109000"},
      %{"name" => "花桥镇", "code" => "431122110000"},
      %{"name" => "大盛镇", "code" => "431122111000"},
      %{"name" => "南桥镇", "code" => "431122112000"},
      %{"name" => "川岩乡", "code" => "431122201000"},
      %{"name" => "水岭乡", "code" => "431122202000"},
      %{"name" => "大庙口林场", "code" => "431122400000"},
      %{"name" => "黄泥洞林场", "code" => "431122401000"}
    ]

  def next(input) when input == "双牌县" or input == "431123",
    do: [
      %{"name" => "泷泊镇", "code" => "431123100000"},
      %{"name" => "江村镇", "code" => "431123101000"},
      %{"name" => "五里牌镇", "code" => "431123102000"},
      %{"name" => "茶林镇", "code" => "431123103000"},
      %{"name" => "何家洞镇", "code" => "431123104000"},
      %{"name" => "麻江镇", "code" => "431123105000"},
      %{"name" => "塘底乡", "code" => "431123206000"},
      %{"name" => "上梧江瑶族乡", "code" => "431123207000"},
      %{"name" => "理家坪乡", "code" => "431123208000"},
      %{"name" => "五星岭乡", "code" => "431123209000"},
      %{"name" => "打鼓坪乡", "code" => "431123210000"},
      %{"name" => "双牌打鼓坪林场", "code" => "431123400000"},
      %{"name" => "双牌五星岭林场", "code" => "431123401000"},
      %{"name" => "阳明山国家森林公园管理局", "code" => "431123402000"}
    ]

  def next(input) when input == "道县" or input == "431124",
    do: [
      %{"name" => "濂溪街道", "code" => "431124001000"},
      %{"name" => "西洲街道", "code" => "431124002000"},
      %{"name" => "上关街道", "code" => "431124003000"},
      %{"name" => "营江街道", "code" => "431124004000"},
      %{"name" => "东门街道", "code" => "431124005000"},
      %{"name" => "富塘街道", "code" => "431124006000"},
      %{"name" => "万家庄街道", "code" => "431124007000"},
      %{"name" => "梅花镇", "code" => "431124101000"},
      %{"name" => "寿雁镇", "code" => "431124102000"},
      %{"name" => "仙子脚镇", "code" => "431124103000"},
      %{"name" => "清塘镇", "code" => "431124104000"},
      %{"name" => "祥霖铺镇", "code" => "431124105000"},
      %{"name" => "蚣坝镇", "code" => "431124106000"},
      %{"name" => "四马桥镇", "code" => "431124107000"},
      %{"name" => "白马渡镇", "code" => "431124108000"},
      %{"name" => "柑子园镇", "code" => "431124109000"},
      %{"name" => "白芒铺镇", "code" => "431124111000"},
      %{"name" => "桥头镇", "code" => "431124112000"},
      %{"name" => "乐福堂镇", "code" => "431124113000"},
      %{"name" => "审章塘瑶族乡", "code" => "431124210000"},
      %{"name" => "横岭瑶族乡", "code" => "431124212000"},
      %{"name" => "洪塘营瑶族乡", "code" => "431124213000"},
      %{"name" => "道县大坪铺农场", "code" => "431124402000"}
    ]

  def next(input) when input == "江永县" or input == "431125",
    do: [
      %{"name" => "潇浦镇", "code" => "431125100000"},
      %{"name" => "上江圩镇", "code" => "431125101000"},
      %{"name" => "夏层铺镇", "code" => "431125103000"},
      %{"name" => "桃川镇", "code" => "431125104000"},
      %{"name" => "粗石江镇", "code" => "431125105000"},
      %{"name" => "松柏瑶族乡", "code" => "431125200000"},
      %{"name" => "千家峒瑶族乡", "code" => "431125202000"},
      %{"name" => "兰溪瑶族乡", "code" => "431125203000"},
      %{"name" => "源口瑶族乡", "code" => "431125204000"}
    ]

  def next(input) when input == "宁远县" or input == "431126",
    do: [
      %{"name" => "文庙街道", "code" => "431126001000"},
      %{"name" => "舜陵街道", "code" => "431126002000"},
      %{"name" => "桐山街道", "code" => "431126003000"},
      %{"name" => "东溪街道", "code" => "431126004000"},
      %{"name" => "天堂镇", "code" => "431126101000"},
      %{"name" => "水市镇", "code" => "431126102000"},
      %{"name" => "湾井镇", "code" => "431126103000"},
      %{"name" => "冷水镇", "code" => "431126104000"},
      %{"name" => "太平镇", "code" => "431126105000"},
      %{"name" => "禾亭镇", "code" => "431126106000"},
      %{"name" => "仁和镇", "code" => "431126107000"},
      %{"name" => "中和镇", "code" => "431126108000"},
      %{"name" => "柏家坪镇", "code" => "431126109000"},
      %{"name" => "清水桥镇", "code" => "431126110000"},
      %{"name" => "鲤溪镇", "code" => "431126111000"},
      %{"name" => "保安镇", "code" => "431126112000"},
      %{"name" => "九疑山瑶族乡", "code" => "431126200000"},
      %{"name" => "五龙山瑶族乡", "code" => "431126202000"},
      %{"name" => "棉花坪瑶族乡", "code" => "431126203000"},
      %{"name" => "桐木漯瑶族乡", "code" => "431126204000"}
    ]

  def next(input) when input == "蓝山县" or input == "431127",
    do: [
      %{"name" => "塔峰镇", "code" => "431127100000"},
      %{"name" => "毛俊镇", "code" => "431127102000"},
      %{"name" => "楠市镇", "code" => "431127103000"},
      %{"name" => "所城镇", "code" => "431127104000"},
      %{"name" => "新圩镇", "code" => "431127105000"},
      %{"name" => "祠堂圩镇", "code" => "431127106000"},
      %{"name" => "土市镇", "code" => "431127107000"},
      %{"name" => "太平圩镇", "code" => "431127108000"},
      %{"name" => "汇源瑶族乡", "code" => "431127200000"},
      %{"name" => "犁头瑶族乡", "code" => "431127201000"},
      %{"name" => "浆洞瑶族乡", "code" => "431127202000"},
      %{"name" => "湘江源瑶族乡", "code" => "431127203000"},
      %{"name" => "大桥瑶族乡", "code" => "431127204000"},
      %{"name" => "荆竹瑶族乡", "code" => "431127205000"},
      %{"name" => "蓝山荆竹林场", "code" => "431127400000"},
      %{"name" => "蓝山浆洞林场", "code" => "431127401000"},
      %{"name" => "蓝山南岭林场", "code" => "431127402000"},
      %{"name" => "蓝山原种场", "code" => "431127403000"},
      %{"name" => "蓝山黄毛岭茶场", "code" => "431127404000"}
    ]

  def next(input) when input == "新田县" or input == "431128",
    do: [
      %{"name" => "龙泉街道", "code" => "431128001000"},
      %{"name" => "中山街道", "code" => "431128002000"},
      %{"name" => "金陵镇", "code" => "431128101000"},
      %{"name" => "骥村镇", "code" => "431128102000"},
      %{"name" => "枧头镇", "code" => "431128103000"},
      %{"name" => "新圩镇", "code" => "431128104000"},
      %{"name" => "石羊镇", "code" => "431128105000"},
      %{"name" => "新隆镇", "code" => "431128106000"},
      %{"name" => "三井镇", "code" => "431128107000"},
      %{"name" => "大坪塘镇", "code" => "431128108000"},
      %{"name" => "陶岭镇", "code" => "431128109000"},
      %{"name" => "金盆镇", "code" => "431128110000"},
      %{"name" => "门楼下瑶族乡", "code" => "431128202000"}
    ]

  def next(input) when input == "江华瑶族自治县" or input == "431129",
    do: [
      %{"name" => "沱江镇", "code" => "431129100000"},
      %{"name" => "大路铺镇", "code" => "431129103000"},
      %{"name" => "白芒营镇", "code" => "431129104000"},
      %{"name" => "涛圩镇", "code" => "431129105000"},
      %{"name" => "河路口镇", "code" => "431129106000"},
      %{"name" => "大圩镇", "code" => "431129108000"},
      %{"name" => "水口镇", "code" => "431129109000"},
      %{"name" => "码市镇", "code" => "431129110000"},
      %{"name" => "涔天河镇", "code" => "431129111000"},
      %{"name" => "界牌乡", "code" => "431129200000"},
      %{"name" => "桥市乡", "code" => "431129201000"},
      %{"name" => "大石桥乡", "code" => "431129202000"},
      %{"name" => "湘江乡", "code" => "431129207000"},
      %{"name" => "蔚竹口乡", "code" => "431129209000"},
      %{"name" => "大锡乡", "code" => "431129210000"},
      %{"name" => "小圩壮族乡", "code" => "431129211000"}
    ]

  def next(input) when input == "永州经济技术开发区" or input == "431171",
    do: [%{"name" => "仁湾街道", "code" => "431171001000"}]

  def next(input) when input == "永州市回龙圩管理区" or input == "431173",
    do: [%{"name" => "回龙圩镇", "code" => "431173100000"}]

  def next(input) when input == "祁阳市" or input == "431181",
    do: [
      %{"name" => "龙山街道", "code" => "431181001000"},
      %{"name" => "长虹街道", "code" => "431181002000"},
      %{"name" => "浯溪街道", "code" => "431181003000"},
      %{"name" => "观音滩镇", "code" => "431181101000"},
      %{"name" => "茅竹镇", "code" => "431181102000"},
      %{"name" => "三口塘镇", "code" => "431181103000"},
      %{"name" => "大忠桥镇", "code" => "431181104000"},
      %{"name" => "肖家镇", "code" => "431181105000"},
      %{"name" => "八宝镇", "code" => "431181106000"},
      %{"name" => "白水镇", "code" => "431181107000"},
      %{"name" => "进宝塘镇", "code" => "431181108000"},
      %{"name" => "黄泥塘镇", "code" => "431181109000"},
      %{"name" => "羊角塘镇", "code" => "431181110000"},
      %{"name" => "梅溪镇", "code" => "431181111000"},
      %{"name" => "潘市镇", "code" => "431181112000"},
      %{"name" => "七里桥镇", "code" => "431181113000"},
      %{"name" => "下马渡镇", "code" => "431181114000"},
      %{"name" => "黎家坪镇", "code" => "431181115000"},
      %{"name" => "文富市镇", "code" => "431181116000"},
      %{"name" => "大村甸镇", "code" => "431181117000"},
      %{"name" => "文明铺镇", "code" => "431181118000"},
      %{"name" => "龚家坪镇", "code" => "431181119000"},
      %{"name" => "金洞镇", "code" => "431181120000"},
      %{"name" => "凤凰乡", "code" => "431181201000"},
      %{"name" => "石鼓源乡", "code" => "431181202000"},
      %{"name" => "晒北滩瑶族乡", "code" => "431181203000"},
      %{"name" => "原种场", "code" => "431181401000"},
      %{"name" => "畜牧场", "code" => "431181402000"}
    ]

  def next(input) when input == "北湖区" or input == "431002",
    do: [
      %{"name" => "人民路街道", "code" => "431002001000"},
      %{"name" => "北湖街道", "code" => "431002002000"},
      %{"name" => "燕泉街道", "code" => "431002003000"},
      %{"name" => "下湄桥街道", "code" => "431002004000"},
      %{"name" => "骆仙街道", "code" => "431002005000"},
      %{"name" => "增福街道", "code" => "431002006000"},
      %{"name" => "郴江街道", "code" => "431002007000"},
      %{"name" => "涌泉街道", "code" => "431002008000"},
      %{"name" => "安和街道", "code" => "431002009000"},
      %{"name" => "石盖塘街道", "code" => "431002010000"},
      %{"name" => "华塘镇", "code" => "431002101000"},
      %{"name" => "鲁塘镇", "code" => "431002102000"},
      %{"name" => "仰天湖瑶族乡", "code" => "431002209000"},
      %{"name" => "保和瑶族乡", "code" => "431002210000"}
    ]

  def next(input) when input == "苏仙区" or input == "431003",
    do: [
      %{"name" => "苏仙岭街道", "code" => "431003001000"},
      %{"name" => "南塔街道", "code" => "431003002000"},
      %{"name" => "白鹿洞街道", "code" => "431003003000"},
      %{"name" => "王仙岭街道", "code" => "431003004000"},
      %{"name" => "卜里坪街道", "code" => "431003005000"},
      %{"name" => "观山洞街道", "code" => "431003006000"},
      %{"name" => "白露塘镇", "code" => "431003101000"},
      %{"name" => "良田镇", "code" => "431003102000"},
      %{"name" => "栖凤渡镇", "code" => "431003103000"},
      %{"name" => "坳上镇", "code" => "431003104000"},
      %{"name" => "许家洞镇", "code" => "431003105000"},
      %{"name" => "五里牌镇", "code" => "431003107000"},
      %{"name" => "五盖山镇", "code" => "431003109000"},
      %{"name" => "飞天山镇", "code" => "431003110000"}
    ]

  def next(input) when input == "桂阳县" or input == "431021",
    do: [
      %{"name" => "龙潭街道", "code" => "431021001000"},
      %{"name" => "鹿峰街道", "code" => "431021002000"},
      %{"name" => "黄沙坪街道", "code" => "431021003000"},
      %{"name" => "仁义镇", "code" => "431021102000"},
      %{"name" => "太和镇", "code" => "431021103000"},
      %{"name" => "洋市镇", "code" => "431021104000"},
      %{"name" => "和平镇", "code" => "431021105000"},
      %{"name" => "流峰镇", "code" => "431021106000"},
      %{"name" => "塘市镇", "code" => "431021107000"},
      %{"name" => "莲塘镇", "code" => "431021108000"},
      %{"name" => "舂陵江镇", "code" => "431021109000"},
      %{"name" => "荷叶镇", "code" => "431021110000"},
      %{"name" => "方元镇", "code" => "431021111000"},
      %{"name" => "樟市镇", "code" => "431021112000"},
      %{"name" => "敖泉镇", "code" => "431021113000"},
      %{"name" => "正和镇", "code" => "431021114000"},
      %{"name" => "浩塘镇", "code" => "431021115000"},
      %{"name" => "雷坪镇", "code" => "431021116000"},
      %{"name" => "欧阳海镇", "code" => "431021117000"},
      %{"name" => "四里镇", "code" => "431021118000"},
      %{"name" => "桥市乡", "code" => "431021209000"},
      %{"name" => "白水瑶族乡", "code" => "431021226000"}
    ]

  def next(input) when input == "宜章县" or input == "431022",
    do: [
      %{"name" => "白石渡镇", "code" => "431022101000"},
      %{"name" => "杨梅山镇", "code" => "431022102000"},
      %{"name" => "瑶岗仙镇", "code" => "431022103000"},
      %{"name" => "梅田镇", "code" => "431022104000"},
      %{"name" => "黄沙镇", "code" => "431022106000"},
      %{"name" => "迎春镇", "code" => "431022107000"},
      %{"name" => "一六镇", "code" => "431022108000"},
      %{"name" => "栗源镇", "code" => "431022109000"},
      %{"name" => "岩泉镇", "code" => "431022110000"},
      %{"name" => "玉溪镇", "code" => "431022111000"},
      %{"name" => "天塘镇", "code" => "431022112000"},
      %{"name" => "笆篱镇", "code" => "431022113000"},
      %{"name" => "里田镇", "code" => "431022114000"},
      %{"name" => "五岭镇", "code" => "431022115000"},
      %{"name" => "浆水乡", "code" => "431022201000"},
      %{"name" => "长村乡", "code" => "431022202000"},
      %{"name" => "莽山瑶族乡", "code" => "431022205000"},
      %{"name" => "关溪乡", "code" => "431022208000"},
      %{"name" => "赤石乡", "code" => "431022212000"}
    ]

  def next(input) when input == "永兴县" or input == "431023",
    do: [
      %{"name" => "便江街道", "code" => "431023001000"},
      %{"name" => "湘阴渡街道", "code" => "431023002000"},
      %{"name" => "马田镇", "code" => "431023101000"},
      %{"name" => "金龟镇", "code" => "431023104000"},
      %{"name" => "柏林镇", "code" => "431023105000"},
      %{"name" => "鲤鱼塘镇", "code" => "431023106000"},
      %{"name" => "悦来镇", "code" => "431023109000"},
      %{"name" => "黄泥镇", "code" => "431023112000"},
      %{"name" => "樟树镇", "code" => "431023113000"},
      %{"name" => "太和镇", "code" => "431023114000"},
      %{"name" => "油麻镇", "code" => "431023115000"},
      %{"name" => "高亭司镇", "code" => "431023116000"},
      %{"name" => "洋塘乡", "code" => "431023203000"},
      %{"name" => "大布江乡", "code" => "431023214000"},
      %{"name" => "龙形市乡", "code" => "431023215000"},
      %{"name" => "七甲乡", "code" => "431023216000"}
    ]

  def next(input) when input == "嘉禾县" or input == "431024",
    do: [
      %{"name" => "珠泉镇", "code" => "431024100000"},
      %{"name" => "塘村镇", "code" => "431024102000"},
      %{"name" => "袁家镇", "code" => "431024103000"},
      %{"name" => "行廊镇", "code" => "431024104000"},
      %{"name" => "龙潭镇", "code" => "431024106000"},
      %{"name" => "石桥镇", "code" => "431024107000"},
      %{"name" => "坦坪镇", "code" => "431024108000"},
      %{"name" => "广发镇", "code" => "431024110000"},
      %{"name" => "晋屏镇", "code" => "431024111000"},
      %{"name" => "普满乡", "code" => "431024201000"}
    ]

  def next(input) when input == "临武县" or input == "431025",
    do: [
      %{"name" => "舜峰镇", "code" => "431025100000"},
      %{"name" => "金江镇", "code" => "431025101000"},
      %{"name" => "武水镇", "code" => "431025104000"},
      %{"name" => "南强镇", "code" => "431025105000"},
      %{"name" => "汾市镇", "code" => "431025106000"},
      %{"name" => "水东镇", "code" => "431025107000"},
      %{"name" => "楚江镇", "code" => "431025108000"},
      %{"name" => "麦市镇", "code" => "431025109000"},
      %{"name" => "香花镇", "code" => "431025110000"},
      %{"name" => "花塘乡", "code" => "431025208000"},
      %{"name" => "万水乡", "code" => "431025211000"},
      %{"name" => "镇南乡", "code" => "431025214000"},
      %{"name" => "西山瑶族乡", "code" => "431025216000"}
    ]

  def next(input) when input == "汝城县" or input == "431026",
    do: [
      %{"name" => "热水镇", "code" => "431026102000"},
      %{"name" => "土桥镇", "code" => "431026103000"},
      %{"name" => "泉水镇", "code" => "431026104000"},
      %{"name" => "暖水镇", "code" => "431026105000"},
      %{"name" => "大坪镇", "code" => "431026106000"},
      %{"name" => "三江口瑶族镇", "code" => "431026107000"},
      %{"name" => "卢阳镇", "code" => "431026108000"},
      %{"name" => "马桥镇", "code" => "431026109000"},
      %{"name" => "井坡镇", "code" => "431026110000"},
      %{"name" => "南洞乡", "code" => "431026207000"},
      %{"name" => "濠头乡", "code" => "431026209000"},
      %{"name" => "延寿瑶族乡", "code" => "431026214000"},
      %{"name" => "集益乡", "code" => "431026216000"},
      %{"name" => "文明瑶族乡", "code" => "431026217000"},
      %{"name" => "大坪国有林场", "code" => "431026400000"},
      %{"name" => "汝城经济开发区", "code" => "431026401000"}
    ]

  def next(input) when input == "桂东县" or input == "431027",
    do: [
      %{"name" => "沤江镇", "code" => "431027100000"},
      %{"name" => "沙田镇", "code" => "431027101000"},
      %{"name" => "清泉镇", "code" => "431027102000"},
      %{"name" => "大塘镇", "code" => "431027103000"},
      %{"name" => "四都镇", "code" => "431027104000"},
      %{"name" => "寨前镇", "code" => "431027105000"},
      %{"name" => "普乐镇", "code" => "431027106000"},
      %{"name" => "桥头乡", "code" => "431027200000"},
      %{"name" => "新坊乡", "code" => "431027208000"},
      %{"name" => "东洛乡", "code" => "431027210000"},
      %{"name" => "青山乡", "code" => "431027213000"},
      %{"name" => "宋坪林场", "code" => "431027400000"}
    ]

  def next(input) when input == "安仁县" or input == "431028",
    do: [
      %{"name" => "安平镇", "code" => "431028101000"},
      %{"name" => "龙海镇", "code" => "431028102000"},
      %{"name" => "灵官镇", "code" => "431028105000"},
      %{"name" => "永乐江镇", "code" => "431028106000"},
      %{"name" => "金紫仙镇", "code" => "431028107000"},
      %{"name" => "龙市乡", "code" => "431028201000"},
      %{"name" => "渡口乡", "code" => "431028204000"},
      %{"name" => "华王乡", "code" => "431028205000"},
      %{"name" => "牌楼乡", "code" => "431028206000"},
      %{"name" => "平背乡", "code" => "431028207000"},
      %{"name" => "承坪乡", "code" => "431028209000"},
      %{"name" => "竹山乡", "code" => "431028210000"},
      %{"name" => "洋际乡", "code" => "431028214000"}
    ]

  def next(input) when input == "资兴市" or input == "431081",
    do: [
      %{"name" => "唐洞街道", "code" => "431081001000"},
      %{"name" => "东江街道", "code" => "431081002000"},
      %{"name" => "滁口镇", "code" => "431081100000"},
      %{"name" => "三都镇", "code" => "431081102000"},
      %{"name" => "蓼江镇", "code" => "431081103000"},
      %{"name" => "兴宁镇", "code" => "431081105000"},
      %{"name" => "州门司镇", "code" => "431081106000"},
      %{"name" => "黄草镇", "code" => "431081108000"},
      %{"name" => "汤溪镇", "code" => "431081110000"},
      %{"name" => "清江镇", "code" => "431081112000"},
      %{"name" => "白廊镇", "code" => "431081113000"},
      %{"name" => "回龙山瑶族乡", "code" => "431081219000"},
      %{"name" => "八面山瑶族乡", "code" => "431081220000"}
    ]

  def next(input) when input == "资阳区" or input == "430902",
    do: [
      %{"name" => "大码头街道", "code" => "430902005000"},
      %{"name" => "汽车路街道", "code" => "430902006000"},
      %{"name" => "迎风桥镇", "code" => "430902102000"},
      %{"name" => "沙头镇", "code" => "430902104000"},
      %{"name" => "茈湖口镇", "code" => "430902105000"},
      %{"name" => "长春镇", "code" => "430902106000"},
      %{"name" => "新桥河镇", "code" => "430902107000"},
      %{"name" => "张家塞乡", "code" => "430902203000"},
      %{"name" => "长春经济开发区", "code" => "430902401000"}
    ]

  def next(input) when input == "赫山区" or input == "430903",
    do: [
      %{"name" => "赫山街道", "code" => "430903001000"},
      %{"name" => "桃花仑街道", "code" => "430903002000"},
      %{"name" => "金银山街道", "code" => "430903003000"},
      %{"name" => "会龙山街道", "code" => "430903006000"},
      %{"name" => "鱼形山街道", "code" => "430903007000"},
      %{"name" => "龙光桥街道", "code" => "430903008000"},
      %{"name" => "八字哨镇", "code" => "430903101000"},
      %{"name" => "泉交河镇", "code" => "430903103000"},
      %{"name" => "欧江岔镇", "code" => "430903104000"},
      %{"name" => "沧水铺镇", "code" => "430903105000"},
      %{"name" => "岳家桥镇", "code" => "430903107000"},
      %{"name" => "新市渡镇", "code" => "430903110000"},
      %{"name" => "兰溪镇", "code" => "430903111000"},
      %{"name" => "衡龙桥镇", "code" => "430903113000"},
      %{"name" => "泥江口镇", "code" => "430903114000"},
      %{"name" => "笔架山乡", "code" => "430903209000"},
      %{"name" => "龙岭产业开发区", "code" => "430903402000"}
    ]

  def next(input) when input == "南县" or input == "430921",
    do: [
      %{"name" => "明山头镇", "code" => "430921102000"},
      %{"name" => "青树嘴镇", "code" => "430921103000"},
      %{"name" => "厂窖镇", "code" => "430921106000"},
      %{"name" => "武圣宫镇", "code" => "430921107000"},
      %{"name" => "南洲镇", "code" => "430921125000"},
      %{"name" => "华阁镇", "code" => "430921126000"},
      %{"name" => "茅草街镇", "code" => "430921127000"},
      %{"name" => "三仙湖镇", "code" => "430921128000"},
      %{"name" => "麻河口镇", "code" => "430921129000"},
      %{"name" => "浪拔湖镇", "code" => "430921131000"},
      %{"name" => "中鱼口镇", "code" => "430921132000"},
      %{"name" => "乌嘴乡", "code" => "430921201000"}
    ]

  def next(input) when input == "桃江县" or input == "430922",
    do: [
      %{"name" => "修山镇", "code" => "430922101000"},
      %{"name" => "鸬鹚渡镇", "code" => "430922103000"},
      %{"name" => "石牛江镇", "code" => "430922107000"},
      %{"name" => "牛田镇", "code" => "430922108000"},
      %{"name" => "松木塘镇", "code" => "430922109000"},
      %{"name" => "桃花江镇", "code" => "430922112000"},
      %{"name" => "灰山港镇", "code" => "430922113000"},
      %{"name" => "武潭镇", "code" => "430922114000"},
      %{"name" => "马迹塘镇", "code" => "430922115000"},
      %{"name" => "三堂街镇", "code" => "430922116000"},
      %{"name" => "大栗港镇", "code" => "430922117000"},
      %{"name" => "沾溪镇", "code" => "430922118000"},
      %{"name" => "高桥镇", "code" => "430922119000"},
      %{"name" => "鲊埠回族乡", "code" => "430922208000"},
      %{"name" => "浮丘山乡", "code" => "430922212000"}
    ]

  def next(input) when input == "安化县" or input == "430923",
    do: [
      %{"name" => "清塘铺镇", "code" => "430923101000"},
      %{"name" => "仙溪镇", "code" => "430923103000"},
      %{"name" => "长塘镇", "code" => "430923105000"},
      %{"name" => "小淹镇", "code" => "430923106000"},
      %{"name" => "羊角塘镇", "code" => "430923108000"},
      %{"name" => "冷市镇", "code" => "430923109000"},
      %{"name" => "奎溪镇", "code" => "430923111000"},
      %{"name" => "烟溪镇", "code" => "430923112000"},
      %{"name" => "渠江镇", "code" => "430923113000"},
      %{"name" => "平口镇", "code" => "430923114000"},
      %{"name" => "柘溪镇", "code" => "430923115000"},
      %{"name" => "乐安镇", "code" => "430923116000"},
      %{"name" => "滔溪镇", "code" => "430923117000"},
      %{"name" => "梅城镇", "code" => "430923118000"},
      %{"name" => "大福镇", "code" => "430923119000"},
      %{"name" => "马路镇", "code" => "430923120000"},
      %{"name" => "东坪镇", "code" => "430923121000"},
      %{"name" => "江南镇", "code" => "430923122000"},
      %{"name" => "龙塘镇", "code" => "430923123000"},
      %{"name" => "高明乡", "code" => "430923200000"},
      %{"name" => "田庄乡", "code" => "430923209000"},
      %{"name" => "南金乡", "code" => "430923211000"},
      %{"name" => "古楼乡", "code" => "430923212000"}
    ]

  def next(input) when input == "益阳市大通湖管理区" or input == "430971",
    do: [
      %{"name" => "河坝镇", "code" => "430971121000"},
      %{"name" => "金盆镇", "code" => "430971123000"},
      %{"name" => "北洲子镇", "code" => "430971124000"},
      %{"name" => "千山红镇", "code" => "430971130000"},
      %{"name" => "南湾湖管理处", "code" => "430971405000"}
    ]

  def next(input) when input == "湖南益阳高新技术产业园区" or input == "430972",
    do: [
      %{"name" => "朝阳街道", "code" => "430972005000"},
      %{"name" => "东部产业园地区", "code" => "430972006000"},
      %{"name" => "谢林港镇", "code" => "430972109000"}
    ]

  def next(input) when input == "沅江市" or input == "430981",
    do: [
      %{"name" => "琼湖街道", "code" => "430981006000"},
      %{"name" => "胭脂湖街道", "code" => "430981008000"},
      %{"name" => "四季红镇", "code" => "430981102000"},
      %{"name" => "泗湖山镇", "code" => "430981105000"},
      %{"name" => "南嘴镇", "code" => "430981107000"},
      %{"name" => "新湾镇", "code" => "430981108000"},
      %{"name" => "茶盘洲镇", "code" => "430981110000"},
      %{"name" => "南大膳镇", "code" => "430981112000"},
      %{"name" => "黄茅洲镇", "code" => "430981113000"},
      %{"name" => "草尾镇", "code" => "430981114000"},
      %{"name" => "阳罗洲镇", "code" => "430981115000"},
      %{"name" => "共华镇", "code" => "430981116000"},
      %{"name" => "南洞庭湿地保护与发展事务中心", "code" => "430981401000"},
      %{"name" => "漉湖湿地保护与发展事务中心", "code" => "430981402000"}
    ]

  def next(input) when input == "永定区" or input == "430802",
    do: [
      %{"name" => "永定街道", "code" => "430802001000"},
      %{"name" => "大庸桥街道", "code" => "430802002000"},
      %{"name" => "西溪坪街道", "code" => "430802003000"},
      %{"name" => "官黎坪街道", "code" => "430802004000"},
      %{"name" => "崇文街道", "code" => "430802005000"},
      %{"name" => "南庄坪街道", "code" => "430802006000"},
      %{"name" => "新桥镇", "code" => "430802100000"},
      %{"name" => "茅岩河镇", "code" => "430802101000"},
      %{"name" => "教字垭镇", "code" => "430802102000"},
      %{"name" => "天门山镇", "code" => "430802103000"},
      %{"name" => "沅古坪镇", "code" => "430802104000"},
      %{"name" => "尹家溪镇", "code" => "430802105000"},
      %{"name" => "王家坪镇", "code" => "430802108000"},
      %{"name" => "三家馆乡", "code" => "430802201000"},
      %{"name" => "合作桥乡", "code" => "430802204000"},
      %{"name" => "谢家垭乡", "code" => "430802206000"},
      %{"name" => "罗塔坪乡", "code" => "430802208000"},
      %{"name" => "罗水乡", "code" => "430802209000"},
      %{"name" => "桥头乡", "code" => "430802210000"},
      %{"name" => "四都坪乡", "code" => "430802212000"},
      %{"name" => "原种场", "code" => "430802404000"}
    ]

  def next(input) when input == "武陵源区" or input == "430811",
    do: [
      %{"name" => "军地坪街道", "code" => "430811001000"},
      %{"name" => "锣鼓塔街道", "code" => "430811002000"},
      %{"name" => "协合乡", "code" => "430811201000"},
      %{"name" => "中湖乡", "code" => "430811202000"}
    ]

  def next(input) when input == "慈利县" or input == "430821",
    do: [
      %{"name" => "零阳街道", "code" => "430821001000"},
      %{"name" => "金慈街道", "code" => "430821002000"},
      %{"name" => "岩泊渡镇", "code" => "430821101000"},
      %{"name" => "溪口镇", "code" => "430821102000"},
      %{"name" => "东岳观镇", "code" => "430821103000"},
      %{"name" => "通津铺镇", "code" => "430821104000"},
      %{"name" => "杉木桥镇", "code" => "430821105000"},
      %{"name" => "象市镇", "code" => "430821106000"},
      %{"name" => "江垭镇", "code" => "430821107000"},
      %{"name" => "苗市镇", "code" => "430821108000"},
      %{"name" => "零溪镇", "code" => "430821109000"},
      %{"name" => "高桥镇", "code" => "430821110000"},
      %{"name" => "龙潭河镇", "code" => "430821111000"},
      %{"name" => "广福桥镇", "code" => "430821112000"},
      %{"name" => "三合镇", "code" => "430821113000"},
      %{"name" => "二坊坪镇", "code" => "430821114000"},
      %{"name" => "南山坪乡", "code" => "430821200000"},
      %{"name" => "洞溪乡", "code" => "430821202000"},
      %{"name" => "杨柳铺乡", "code" => "430821209000"},
      %{"name" => "三官寺土家族乡", "code" => "430821211000"},
      %{"name" => "高峰土家族乡", "code" => "430821212000"},
      %{"name" => "许家坊土家族乡", "code" => "430821213000"},
      %{"name" => "金岩土家族乡", "code" => "430821214000"},
      %{"name" => "赵家岗土家族乡", "code" => "430821215000"},
      %{"name" => "甘堰土家族乡", "code" => "430821216000"},
      %{"name" => "阳和土家族乡", "code" => "430821217000"}
    ]

  def next(input) when input == "桑植县" or input == "430822",
    do: [
      %{"name" => "澧源镇", "code" => "430822100000"},
      %{"name" => "瑞塔铺镇", "code" => "430822101000"},
      %{"name" => "官地坪镇", "code" => "430822102000"},
      %{"name" => "凉水口镇", "code" => "430822103000"},
      %{"name" => "龙潭坪镇", "code" => "430822104000"},
      %{"name" => "五道水镇", "code" => "430822105000"},
      %{"name" => "陈家河镇", "code" => "430822106000"},
      %{"name" => "廖家村镇", "code" => "430822107000"},
      %{"name" => "利福塔镇", "code" => "430822108000"},
      %{"name" => "八大公山镇", "code" => "430822109000"},
      %{"name" => "桥自弯镇", "code" => "430822110000"},
      %{"name" => "人潮溪镇", "code" => "430822111000"},
      %{"name" => "空壳树乡", "code" => "430822200000"},
      %{"name" => "竹叶坪乡", "code" => "430822202000"},
      %{"name" => "走马坪白族乡", "code" => "430822203000"},
      %{"name" => "刘家坪白族乡", "code" => "430822207000"},
      %{"name" => "芙蓉桥白族乡", "code" => "430822208000"},
      %{"name" => "马合口白族乡", "code" => "430822210000"},
      %{"name" => "洪家关白族乡", "code" => "430822213000"},
      %{"name" => "沙塔坪乡", "code" => "430822216000"},
      %{"name" => "河口乡", "code" => "430822224000"},
      %{"name" => "上河溪乡", "code" => "430822225000"},
      %{"name" => "上洞街乡", "code" => "430822228000"}
    ]

  def next(input) when input == "武陵区" or input == "430702",
    do: [
      %{"name" => "启明街道", "code" => "430702001000"},
      %{"name" => "府坪街道", "code" => "430702002000"},
      %{"name" => "穿紫河街道", "code" => "430702003000"},
      %{"name" => "丹阳街道", "code" => "430702004000"},
      %{"name" => "白马湖街道", "code" => "430702005000"},
      %{"name" => "德山街道", "code" => "430702006000"},
      %{"name" => "东江街道", "code" => "430702007000"},
      %{"name" => "永安街道", "code" => "430702008000"},
      %{"name" => "南坪街道", "code" => "430702009000"},
      %{"name" => "长庚街道", "code" => "430702010000"},
      %{"name" => "芷兰街道", "code" => "430702011000"},
      %{"name" => "芙蓉街道", "code" => "430702012000"},
      %{"name" => "柳叶湖街道", "code" => "430702013000"},
      %{"name" => "七里桥街道", "code" => "430702014000"},
      %{"name" => "樟木桥街道", "code" => "430702015000"},
      %{"name" => "河洑镇", "code" => "430702100000"},
      %{"name" => "白鹤镇", "code" => "430702102000"},
      %{"name" => "芦荻山乡", "code" => "430702200000"},
      %{"name" => "丹洲乡", "code" => "430702204000"}
    ]

  def next(input) when input == "鼎城区" or input == "430703",
    do: [
      %{"name" => "玉霞街道", "code" => "430703001000"},
      %{"name" => "红云街道", "code" => "430703002000"},
      %{"name" => "郭家铺街道", "code" => "430703003000"},
      %{"name" => "斗姆湖街道", "code" => "430703004000"},
      %{"name" => "灌溪街道", "code" => "430703007000"},
      %{"name" => "蒿子港镇", "code" => "430703101000"},
      %{"name" => "中河口镇", "code" => "430703102000"},
      %{"name" => "十美堂镇", "code" => "430703103000"},
      %{"name" => "牛鼻滩镇", "code" => "430703104000"},
      %{"name" => "韩公渡镇", "code" => "430703105000"},
      %{"name" => "石公桥镇", "code" => "430703106000"},
      %{"name" => "镇德桥镇", "code" => "430703107000"},
      %{"name" => "周家店镇", "code" => "430703108000"},
      %{"name" => "双桥坪镇", "code" => "430703110000"},
      %{"name" => "蔡家岗镇", "code" => "430703112000"},
      %{"name" => "草坪镇", "code" => "430703114000"},
      %{"name" => "石门桥镇", "code" => "430703115000"},
      %{"name" => "谢家铺镇", "code" => "430703116000"},
      %{"name" => "黄土店镇", "code" => "430703117000"},
      %{"name" => "尧天坪镇", "code" => "430703118000"},
      %{"name" => "石板滩镇", "code" => "430703121000"},
      %{"name" => "花岩溪镇", "code" => "430703122000"},
      %{"name" => "许家桥回族维吾尔族乡", "code" => "430703204000"},
      %{"name" => "花岩溪林场", "code" => "430703502000"},
      %{"name" => "贺家山原种场", "code" => "430703503000"}
    ]

  def next(input) when input == "安乡县" or input == "430721",
    do: [
      %{"name" => "深柳镇", "code" => "430721100000"},
      %{"name" => "大鲸港镇", "code" => "430721101000"},
      %{"name" => "黄山头镇", "code" => "430721102000"},
      %{"name" => "三岔河镇", "code" => "430721103000"},
      %{"name" => "官垱镇", "code" => "430721104000"},
      %{"name" => "下渔口镇", "code" => "430721105000"},
      %{"name" => "陈家嘴镇", "code" => "430721106000"},
      %{"name" => "大湖口镇", "code" => "430721108000"},
      %{"name" => "安障乡", "code" => "430721201000"},
      %{"name" => "安全乡", "code" => "430721205000"},
      %{"name" => "安丰乡", "code" => "430721208000"},
      %{"name" => "安康乡", "code" => "430721210000"}
    ]

  def next(input) when input == "汉寿县" or input == "430722",
    do: [
      %{"name" => "龙阳街道", "code" => "430722001000"},
      %{"name" => "辰阳街道", "code" => "430722002000"},
      %{"name" => "沧浪街道", "code" => "430722003000"},
      %{"name" => "株木山街道", "code" => "430722004000"},
      %{"name" => "蒋家嘴镇", "code" => "430722101000"},
      %{"name" => "岩汪湖镇", "code" => "430722102000"},
      %{"name" => "坡头镇", "code" => "430722103000"},
      %{"name" => "酉港镇", "code" => "430722104000"},
      %{"name" => "洲口镇", "code" => "430722105000"},
      %{"name" => "罐头嘴镇", "code" => "430722106000"},
      %{"name" => "沧港镇", "code" => "430722107000"},
      %{"name" => "朱家铺镇", "code" => "430722108000"},
      %{"name" => "太子庙镇", "code" => "430722109000"},
      %{"name" => "崔家桥镇", "code" => "430722111000"},
      %{"name" => "军山铺镇", "code" => "430722112000"},
      %{"name" => "百禄桥镇", "code" => "430722113000"},
      %{"name" => "西湖镇", "code" => "430722114000"},
      %{"name" => "洋淘湖镇", "code" => "430722115000"},
      %{"name" => "丰家铺镇", "code" => "430722117000"},
      %{"name" => "龙潭桥镇", "code" => "430722118000"},
      %{"name" => "聂家桥乡", "code" => "430722205000"},
      %{"name" => "毛家滩回族维吾尔族乡", "code" => "430722206000"},
      %{"name" => "西洲乡", "code" => "430722217000"}
    ]

  def next(input) when input == "澧县" or input == "430723",
    do: [
      %{"name" => "澧西街道", "code" => "430723001000"},
      %{"name" => "澧阳街道", "code" => "430723002000"},
      %{"name" => "澧浦街道", "code" => "430723003000"},
      %{"name" => "澧澹街道", "code" => "430723004000"},
      %{"name" => "小渡口镇", "code" => "430723102000"},
      %{"name" => "梦溪镇", "code" => "430723103000"},
      %{"name" => "复兴镇", "code" => "430723104000"},
      %{"name" => "盐井镇", "code" => "430723105000"},
      %{"name" => "大堰垱镇", "code" => "430723107000"},
      %{"name" => "王家厂镇", "code" => "430723108000"},
      %{"name" => "金罗镇", "code" => "430723109000"},
      %{"name" => "码头铺镇", "code" => "430723110000"},
      %{"name" => "甘溪滩镇", "code" => "430723112000"},
      %{"name" => "火连坡镇", "code" => "430723113000"},
      %{"name" => "澧南镇", "code" => "430723114000"},
      %{"name" => "如东镇", "code" => "430723115000"},
      %{"name" => "涔南镇", "code" => "430723116000"},
      %{"name" => "官垸镇", "code" => "430723117000"},
      %{"name" => "城头山镇", "code" => "430723118000"}
    ]

  def next(input) when input == "临澧县" or input == "430724",
    do: [
      %{"name" => "安福街道", "code" => "430724001000"},
      %{"name" => "望城街道", "code" => "430724002000"},
      %{"name" => "合口镇", "code" => "430724101000"},
      %{"name" => "新安镇", "code" => "430724102000"},
      %{"name" => "佘市桥镇", "code" => "430724103000"},
      %{"name" => "太浮镇", "code" => "430724104000"},
      %{"name" => "四新岗镇", "code" => "430724105000"},
      %{"name" => "停弦渡镇", "code" => "430724106000"},
      %{"name" => "修梅镇", "code" => "430724107000"},
      %{"name" => "烽火乡", "code" => "430724204000"},
      %{"name" => "刻木山乡", "code" => "430724209000"}
    ]

  def next(input) when input == "桃源县" or input == "430725",
    do: [
      %{"name" => "漳江街道", "code" => "430725001000"},
      %{"name" => "浔阳街道", "code" => "430725002000"},
      %{"name" => "陬市镇", "code" => "430725101000"},
      %{"name" => "盘塘镇", "code" => "430725102000"},
      %{"name" => "热市镇", "code" => "430725103000"},
      %{"name" => "黄石镇", "code" => "430725104000"},
      %{"name" => "漆河镇", "code" => "430725105000"},
      %{"name" => "理公港镇", "code" => "430725106000"},
      %{"name" => "观音寺镇", "code" => "430725107000"},
      %{"name" => "龙潭镇", "code" => "430725108000"},
      %{"name" => "三阳港镇", "code" => "430725109000"},
      %{"name" => "剪市镇", "code" => "430725110000"},
      %{"name" => "茶庵铺镇", "code" => "430725111000"},
      %{"name" => "西安镇", "code" => "430725112000"},
      %{"name" => "沙坪镇", "code" => "430725113000"},
      %{"name" => "桃花源镇", "code" => "430725114000"},
      %{"name" => "架桥镇", "code" => "430725115000"},
      %{"name" => "马鬃岭镇", "code" => "430725116000"},
      %{"name" => "夷望溪镇", "code" => "430725117000"},
      %{"name" => "双溪口镇", "code" => "430725118000"},
      %{"name" => "九溪镇", "code" => "430725119000"},
      %{"name" => "牛车河镇", "code" => "430725120000"},
      %{"name" => "杨溪桥镇", "code" => "430725121000"},
      %{"name" => "郑家驿镇", "code" => "430725122000"},
      %{"name" => "木塘垸镇", "code" => "430725123000"},
      %{"name" => "佘家坪镇", "code" => "430725124000"},
      %{"name" => "青林回族维吾尔族乡", "code" => "430725200000"},
      %{"name" => "枫树维吾尔族回族乡", "code" => "430725202000"},
      %{"name" => "泥窝潭乡", "code" => "430725216000"}
    ]

  def next(input) when input == "石门县" or input == "430726",
    do: [
      %{"name" => "楚江街道", "code" => "430726001000"},
      %{"name" => "永兴街道", "code" => "430726002000"},
      %{"name" => "宝峰街道", "code" => "430726003000"},
      %{"name" => "二都街道", "code" => "430726004000"},
      %{"name" => "蒙泉镇", "code" => "430726101000"},
      %{"name" => "夹山镇", "code" => "430726102000"},
      %{"name" => "易家渡镇", "code" => "430726103000"},
      %{"name" => "新关镇", "code" => "430726104000"},
      %{"name" => "皂市镇", "code" => "430726105000"},
      %{"name" => "维新镇", "code" => "430726106000"},
      %{"name" => "太平镇", "code" => "430726107000"},
      %{"name" => "磨市镇", "code" => "430726108000"},
      %{"name" => "壶瓶山镇", "code" => "430726109000"},
      %{"name" => "南北镇", "code" => "430726110000"},
      %{"name" => "白云镇", "code" => "430726111000"},
      %{"name" => "新铺镇", "code" => "430726112000"},
      %{"name" => "子良镇", "code" => "430726113000"},
      %{"name" => "三圣乡", "code" => "430726203000"},
      %{"name" => "所街乡", "code" => "430726205000"},
      %{"name" => "雁池乡", "code" => "430726206000"},
      %{"name" => "罗坪乡", "code" => "430726207000"},
      %{"name" => "秀坪园艺场", "code" => "430726500000"},
      %{"name" => "东山峰管理区", "code" => "430726502000"},
      %{"name" => "大同山林场", "code" => "430726503000"},
      %{"name" => "白云山林场", "code" => "430726504000"},
      %{"name" => "洛浦寺林场", "code" => "430726505000"},
      %{"name" => "夹山管理处", "code" => "430726506000"}
    ]

  def next(input) when input == "常德市西洞庭管理区" or input == "430771",
    do: [
      %{"name" => "龙泉街道", "code" => "430771004000"},
      %{"name" => "金凤街道", "code" => "430771005000"},
      %{"name" => "祝丰镇", "code" => "430771101000"}
    ]

  def next(input) when input == "津市市" or input == "430781",
    do: [
      %{"name" => "三洲驿街道", "code" => "430781001000"},
      %{"name" => "汪家桥街道", "code" => "430781002000"},
      %{"name" => "襄阳街街道", "code" => "430781003000"},
      %{"name" => "金鱼岭街道", "code" => "430781004000"},
      %{"name" => "嘉山街道", "code" => "430781005000"},
      %{"name" => "新洲镇", "code" => "430781100000"},
      %{"name" => "白衣镇", "code" => "430781103000"},
      %{"name" => "药山镇", "code" => "430781105000"},
      %{"name" => "毛里湖镇", "code" => "430781106000"},
      %{"name" => "涔澹农场", "code" => "430781500000"}
    ]

  def next(input) when input == "岳阳楼区" or input == "430602",
    do: [
      %{"name" => "岳阳楼街道", "code" => "430602001000"},
      %{"name" => "三眼桥街道", "code" => "430602002000"},
      %{"name" => "吕仙亭街道", "code" => "430602003000"},
      %{"name" => "金鹗山街道", "code" => "430602004000"},
      %{"name" => "东茅岭街道", "code" => "430602005000"},
      %{"name" => "五里牌街道", "code" => "430602006000"},
      %{"name" => "望岳路街道", "code" => "430602007000"},
      %{"name" => "城陵矶街道", "code" => "430602008000"},
      %{"name" => "枫桥湖街道", "code" => "430602009000"},
      %{"name" => "奇家岭街道", "code" => "430602010000"},
      %{"name" => "洛王街道", "code" => "430602012000"},
      %{"name" => "南湖街道", "code" => "430602013000"},
      %{"name" => "站前街道", "code" => "430602014000"},
      %{"name" => "王家河街道", "code" => "430602015000"},
      %{"name" => "求索街道", "code" => "430602016000"},
      %{"name" => "湖滨街道", "code" => "430602017000"},
      %{"name" => "龙山街道", "code" => "430602018000"},
      %{"name" => "月山街道", "code" => "430602019000"},
      %{"name" => "梅溪街道", "code" => "430602020000"},
      %{"name" => "西塘镇", "code" => "430602100000"},
      %{"name" => "郭镇乡", "code" => "430602201000"},
      %{"name" => "康王乡", "code" => "430602203000"},
      %{"name" => "经济技术开发区通海路管理处", "code" => "430602402000"},
      %{"name" => "金凤桥管理处", "code" => "430602406000"},
      %{"name" => "木里港管理处", "code" => "430602407000"}
    ]

  def next(input) when input == "云溪区" or input == "430603",
    do: [
      %{"name" => "长岭街道", "code" => "430603001000"},
      %{"name" => "云溪街道", "code" => "430603002000"},
      %{"name" => "松杨湖街道", "code" => "430603003000"},
      %{"name" => "陆城镇", "code" => "430603101000"},
      %{"name" => "路口镇", "code" => "430603102000"}
    ]

  def next(input) when input == "君山区" or input == "430611",
    do: [
      %{"name" => "柳林洲街道", "code" => "430611001000"},
      %{"name" => "广兴洲镇", "code" => "430611101000"},
      %{"name" => "许市镇", "code" => "430611102000"},
      %{"name" => "钱粮湖镇", "code" => "430611103000"},
      %{"name" => "良心堡镇", "code" => "430611104000"}
    ]

  def next(input) when input == "岳阳县" or input == "430621",
    do: [
      %{"name" => "荣家湾镇", "code" => "430621100000"},
      %{"name" => "黄沙街镇", "code" => "430621104000"},
      %{"name" => "新墙镇", "code" => "430621105000"},
      %{"name" => "柏祥镇", "code" => "430621106000"},
      %{"name" => "筻口镇", "code" => "430621107000"},
      %{"name" => "公田镇", "code" => "430621108000"},
      %{"name" => "毛田镇", "code" => "430621109000"},
      %{"name" => "月田镇", "code" => "430621110000"},
      %{"name" => "张谷英镇", "code" => "430621111000"},
      %{"name" => "新开镇", "code" => "430621112000"},
      %{"name" => "步仙镇", "code" => "430621113000"},
      %{"name" => "杨林街镇", "code" => "430621114000"},
      %{"name" => "中洲乡", "code" => "430621202000"},
      %{"name" => "长湖乡", "code" => "430621203000"},
      %{"name" => "东洞庭湖管理处", "code" => "430621500000"}
    ]

  def next(input) when input == "华容县" or input == "430623",
    do: [
      %{"name" => "三封寺镇", "code" => "430623101000"},
      %{"name" => "治河渡镇", "code" => "430623102000"},
      %{"name" => "北景港镇", "code" => "430623103000"},
      %{"name" => "鲇鱼须镇", "code" => "430623104000"},
      %{"name" => "万庾镇", "code" => "430623106000"},
      %{"name" => "插旗镇", "code" => "430623110000"},
      %{"name" => "注滋口镇", "code" => "430623111000"},
      %{"name" => "操军镇", "code" => "430623112000"},
      %{"name" => "东山镇", "code" => "430623114000"},
      %{"name" => "梅田湖镇", "code" => "430623119000"},
      %{"name" => "章华镇", "code" => "430623120000"},
      %{"name" => "禹山镇", "code" => "430623121000"},
      %{"name" => "新河乡", "code" => "430623201000"},
      %{"name" => "团洲乡", "code" => "430623207000"}
    ]

  def next(input) when input == "湘阴县" or input == "430624",
    do: [
      %{"name" => "文星街道", "code" => "430624001000"},
      %{"name" => "东塘镇", "code" => "430624101000"},
      %{"name" => "樟树镇", "code" => "430624104000"},
      %{"name" => "三塘镇", "code" => "430624110000"},
      %{"name" => "岭北镇", "code" => "430624116000"},
      %{"name" => "新泉镇", "code" => "430624117000"},
      %{"name" => "湘滨镇", "code" => "430624118000"},
      %{"name" => "南湖洲镇", "code" => "430624119000"},
      %{"name" => "鹤龙湖镇", "code" => "430624120000"},
      %{"name" => "静河镇", "code" => "430624122000"},
      %{"name" => "石塘镇", "code" => "430624124000"},
      %{"name" => "洋沙湖镇", "code" => "430624125000"},
      %{"name" => "金龙镇", "code" => "430624126000"},
      %{"name" => "六塘乡", "code" => "430624201000"},
      %{"name" => "杨林寨乡", "code" => "430624206000"}
    ]

  def next(input) when input == "平江县" or input == "430626",
    do: [
      %{"name" => "汉昌街道", "code" => "430626001000"},
      %{"name" => "天岳街道", "code" => "430626002000"},
      %{"name" => "安定镇", "code" => "430626101000"},
      %{"name" => "三市镇", "code" => "430626102000"},
      %{"name" => "加义镇", "code" => "430626103000"},
      %{"name" => "长寿镇", "code" => "430626104000"},
      %{"name" => "龙门镇", "code" => "430626105000"},
      %{"name" => "虹桥镇", "code" => "430626106000"},
      %{"name" => "南江镇", "code" => "430626107000"},
      %{"name" => "梅仙镇", "code" => "430626108000"},
      %{"name" => "浯口镇", "code" => "430626109000"},
      %{"name" => "瓮江镇", "code" => "430626110000"},
      %{"name" => "伍市镇", "code" => "430626111000"},
      %{"name" => "向家镇", "code" => "430626112000"},
      %{"name" => "童市镇", "code" => "430626113000"},
      %{"name" => "岑川镇", "code" => "430626114000"},
      %{"name" => "福寿山镇", "code" => "430626115000"},
      %{"name" => "余坪镇", "code" => "430626116000"},
      %{"name" => "石牛寨镇", "code" => "430626117000"},
      %{"name" => "上塔市镇", "code" => "430626118000"},
      %{"name" => "三阳乡", "code" => "430626200000"},
      %{"name" => "木金乡", "code" => "430626205000"},
      %{"name" => "板江乡", "code" => "430626208000"},
      %{"name" => "大洲乡", "code" => "430626209000"},
      %{"name" => "三墩乡", "code" => "430626210000"}
    ]

  def next(input) when input == "岳阳市屈原管理区" or input == "430671",
    do: [
      %{"name" => "天问街道", "code" => "430671001000"},
      %{"name" => "营田镇", "code" => "430671101000"},
      %{"name" => "河市镇", "code" => "430671102000"},
      %{"name" => "凤凰乡", "code" => "430671203000"}
    ]

  def next(input) when input == "汨罗市" or input == "430681",
    do: [
      %{"name" => "汨罗镇", "code" => "430681101000"},
      %{"name" => "新市镇", "code" => "430681102000"},
      %{"name" => "古培镇", "code" => "430681103000"},
      %{"name" => "白水镇", "code" => "430681104000"},
      %{"name" => "川山坪镇", "code" => "430681105000"},
      %{"name" => "弼时镇", "code" => "430681107000"},
      %{"name" => "长乐镇", "code" => "430681110000"},
      %{"name" => "大荆镇", "code" => "430681111000"},
      %{"name" => "桃林寺镇", "code" => "430681112000"},
      %{"name" => "三江镇", "code" => "430681113000"},
      %{"name" => "屈子祠镇", "code" => "430681118000"},
      %{"name" => "归义镇", "code" => "430681119000"},
      %{"name" => "神鼎山镇", "code" => "430681120000"},
      %{"name" => "罗江镇", "code" => "430681121000"},
      %{"name" => "白塘镇", "code" => "430681122000"},
      %{"name" => "营田公务中心", "code" => "430681403000"}
    ]

  def next(input) when input == "临湘市" or input == "430682",
    do: [
      %{"name" => "长安街道", "code" => "430682001000"},
      %{"name" => "桃矿街道", "code" => "430682003000"},
      %{"name" => "五里牌街道", "code" => "430682004000"},
      %{"name" => "云湖街道", "code" => "430682005000"},
      %{"name" => "忠防镇", "code" => "430682101000"},
      %{"name" => "聂市镇", "code" => "430682103000"},
      %{"name" => "江南镇", "code" => "430682105000"},
      %{"name" => "桃林镇", "code" => "430682107000"},
      %{"name" => "长塘镇", "code" => "430682108000"},
      %{"name" => "白羊田镇", "code" => "430682109000"},
      %{"name" => "詹桥镇", "code" => "430682110000"},
      %{"name" => "黄盖镇", "code" => "430682113000"},
      %{"name" => "羊楼司镇", "code" => "430682114000"},
      %{"name" => "坦渡镇", "code" => "430682115000"}
    ]

  def next(input) when input == "双清区" or input == "430502",
    do: [
      %{"name" => "兴隆街道", "code" => "430502001000"},
      %{"name" => "龙须塘街道", "code" => "430502002000"},
      %{"name" => "汽车站街道", "code" => "430502003000"},
      %{"name" => "小江湖街道", "code" => "430502004000"},
      %{"name" => "东风路街道", "code" => "430502005000"},
      %{"name" => "桥头街道", "code" => "430502006000"},
      %{"name" => "滨江街道", "code" => "430502007000"},
      %{"name" => "石桥街道", "code" => "430502008000"},
      %{"name" => "爱莲街道", "code" => "430502009000"},
      %{"name" => "高崇山镇", "code" => "430502100000"},
      %{"name" => "渡头桥镇", "code" => "430502101000"},
      %{"name" => "火车站乡", "code" => "430502202000"}
    ]

  def next(input) when input == "大祥区" or input == "430503",
    do: [
      %{"name" => "中心路街道", "code" => "430503001000"},
      %{"name" => "红旗路街道", "code" => "430503002000"},
      %{"name" => "城北路街道", "code" => "430503003000"},
      %{"name" => "城西街道", "code" => "430503004000"},
      %{"name" => "翠园街道", "code" => "430503005000"},
      %{"name" => "百春园街道", "code" => "430503006000"},
      %{"name" => "城南街道", "code" => "430503007000"},
      %{"name" => "火车南站街道", "code" => "430503008000"},
      %{"name" => "学院路街道", "code" => "430503009000"},
      %{"name" => "雨溪街道", "code" => "430503010000"},
      %{"name" => "檀江街道", "code" => "430503011000"},
      %{"name" => "罗市镇", "code" => "430503101000"},
      %{"name" => "蔡锷乡", "code" => "430503202000"},
      %{"name" => "板桥乡", "code" => "430503203000"}
    ]

  def next(input) when input == "北塔区" or input == "430511",
    do: [
      %{"name" => "新滩镇街道", "code" => "430511001000"},
      %{"name" => "状元洲街道", "code" => "430511002000"},
      %{"name" => "田江街道", "code" => "430511003000"},
      %{"name" => "茶元头街道", "code" => "430511004000"},
      %{"name" => "陈家桥镇", "code" => "430511101000"}
    ]

  def next(input) when input == "新邵县" or input == "430522",
    do: [
      %{"name" => "酿溪镇", "code" => "430522100000"},
      %{"name" => "严塘镇", "code" => "430522101000"},
      %{"name" => "雀塘镇", "code" => "430522102000"},
      %{"name" => "陈家坊镇", "code" => "430522103000"},
      %{"name" => "潭溪镇", "code" => "430522104000"},
      %{"name" => "寸石镇", "code" => "430522105000"},
      %{"name" => "坪上镇", "code" => "430522106000"},
      %{"name" => "龙溪铺镇", "code" => "430522107000"},
      %{"name" => "巨口铺镇", "code" => "430522108000"},
      %{"name" => "新田铺镇", "code" => "430522109000"},
      %{"name" => "小塘镇", "code" => "430522110000"},
      %{"name" => "太芝庙镇", "code" => "430522111000"},
      %{"name" => "大新镇", "code" => "430522112000"},
      %{"name" => "潭府乡", "code" => "430522200000"},
      %{"name" => "迎光乡", "code" => "430522203000"}
    ]

  def next(input) when input == "邵阳县" or input == "430523",
    do: [
      %{"name" => "塘渡口镇", "code" => "430523100000"},
      %{"name" => "白仓镇", "code" => "430523101000"},
      %{"name" => "金称市镇", "code" => "430523102000"},
      %{"name" => "塘田市镇", "code" => "430523103000"},
      %{"name" => "黄亭市镇", "code" => "430523104000"},
      %{"name" => "长阳铺镇", "code" => "430523105000"},
      %{"name" => "岩口铺镇", "code" => "430523106000"},
      %{"name" => "九公桥镇", "code" => "430523107000"},
      %{"name" => "下花桥镇", "code" => "430523108000"},
      %{"name" => "谷洲镇", "code" => "430523109000"},
      %{"name" => "郦家坪镇", "code" => "430523110000"},
      %{"name" => "五峰铺镇", "code" => "430523111000"},
      %{"name" => "小溪市乡", "code" => "430523201000"},
      %{"name" => "长乐乡", "code" => "430523203000"},
      %{"name" => "蔡桥乡", "code" => "430523204000"},
      %{"name" => "河伯乡", "code" => "430523205000"},
      %{"name" => "黄荆乡", "code" => "430523206000"},
      %{"name" => "诸甲亭乡", "code" => "430523207000"},
      %{"name" => "罗城乡", "code" => "430523208000"},
      %{"name" => "金江乡", "code" => "430523209000"},
      %{"name" => "七里山园艺场", "code" => "430523401000"},
      %{"name" => "五峰铺国有林场", "code" => "430523402000"},
      %{"name" => "河伯岭国有林场", "code" => "430523403000"}
    ]

  def next(input) when input == "隆回县" or input == "430524",
    do: [
      %{"name" => "桃花坪街道", "code" => "430524001000"},
      %{"name" => "花门街道", "code" => "430524002000"},
      %{"name" => "小沙江镇", "code" => "430524101000"},
      %{"name" => "金石桥镇", "code" => "430524102000"},
      %{"name" => "司门前镇", "code" => "430524103000"},
      %{"name" => "高平镇", "code" => "430524104000"},
      %{"name" => "六都寨镇", "code" => "430524105000"},
      %{"name" => "荷香桥镇", "code" => "430524106000"},
      %{"name" => "横板桥镇", "code" => "430524107000"},
      %{"name" => "周旺镇", "code" => "430524108000"},
      %{"name" => "滩头镇", "code" => "430524109000"},
      %{"name" => "鸭田镇", "code" => "430524110000"},
      %{"name" => "西洋江镇", "code" => "430524111000"},
      %{"name" => "岩口镇", "code" => "430524113000"},
      %{"name" => "北山镇", "code" => "430524114000"},
      %{"name" => "三阁司镇", "code" => "430524115000"},
      %{"name" => "南岳庙镇", "code" => "430524116000"},
      %{"name" => "七江镇", "code" => "430524117000"},
      %{"name" => "羊古坳镇", "code" => "430524118000"},
      %{"name" => "罗洪镇", "code" => "430524119000"},
      %{"name" => "麻塘山乡", "code" => "430524200000"},
      %{"name" => "虎形山瑶族乡", "code" => "430524201000"},
      %{"name" => "大水田乡", "code" => "430524203000"},
      %{"name" => "荷田乡", "code" => "430524207000"},
      %{"name" => "山界回族乡", "code" => "430524212000"}
    ]

  def next(input) when input == "洞口县" or input == "430525",
    do: [
      %{"name" => "文昌街道", "code" => "430525001000"},
      %{"name" => "雪峰街道", "code" => "430525002000"},
      %{"name" => "花古街道", "code" => "430525003000"},
      %{"name" => "江口镇", "code" => "430525101000"},
      %{"name" => "毓兰镇", "code" => "430525102000"},
      %{"name" => "高沙镇", "code" => "430525103000"},
      %{"name" => "竹市镇", "code" => "430525104000"},
      %{"name" => "石江镇", "code" => "430525105000"},
      %{"name" => "黄桥镇", "code" => "430525106000"},
      %{"name" => "山门镇", "code" => "430525107000"},
      %{"name" => "醪田镇", "code" => "430525108000"},
      %{"name" => "花园镇", "code" => "430525109000"},
      %{"name" => "岩山镇", "code" => "430525110000"},
      %{"name" => "水东镇", "code" => "430525111000"},
      %{"name" => "杨林镇", "code" => "430525112000"},
      %{"name" => "月溪镇", "code" => "430525113000"},
      %{"name" => "石柱镇", "code" => "430525114000"},
      %{"name" => "古楼乡", "code" => "430525201000"},
      %{"name" => "长塘瑶族乡", "code" => "430525202000"},
      %{"name" => "罗溪瑶族乡", "code" => "430525203000"},
      %{"name" => "渣坪乡", "code" => "430525205000"},
      %{"name" => "桐山乡", "code" => "430525211000"},
      %{"name" => "大屋瑶族乡", "code" => "430525212000"},
      %{"name" => "茶铺茶场管理区", "code" => "430525500000"}
    ]

  def next(input) when input == "绥宁县" or input == "430527",
    do: [
      %{"name" => "长铺镇", "code" => "430527100000"},
      %{"name" => "武阳镇", "code" => "430527101000"},
      %{"name" => "李熙桥镇", "code" => "430527102000"},
      %{"name" => "红岩镇", "code" => "430527103000"},
      %{"name" => "唐家坊镇", "code" => "430527104000"},
      %{"name" => "金屋塘镇", "code" => "430527105000"},
      %{"name" => "瓦屋塘镇", "code" => "430527106000"},
      %{"name" => "黄土矿镇", "code" => "430527107000"},
      %{"name" => "东山侗族乡", "code" => "430527200000"},
      %{"name" => "鹅公岭侗族苗族乡", "code" => "430527201000"},
      %{"name" => "寨市苗族侗族乡", "code" => "430527203000"},
      %{"name" => "乐安铺苗族侗族乡", "code" => "430527204000"},
      %{"name" => "关峡苗族乡", "code" => "430527206000"},
      %{"name" => "长铺子苗族侗族乡", "code" => "430527207000"},
      %{"name" => "麻塘苗族瑶族乡", "code" => "430527210000"},
      %{"name" => "河口苗族乡", "code" => "430527212000"},
      %{"name" => "水口乡", "code" => "430527217000"}
    ]

  def next(input) when input == "新宁县" or input == "430528",
    do: [
      %{"name" => "金石镇", "code" => "430528100000"},
      %{"name" => "水庙镇", "code" => "430528101000"},
      %{"name" => "崀山镇", "code" => "430528102000"},
      %{"name" => "黄龙镇", "code" => "430528104000"},
      %{"name" => "高桥镇", "code" => "430528105000"},
      %{"name" => "回龙寺镇", "code" => "430528106000"},
      %{"name" => "一渡水镇", "code" => "430528107000"},
      %{"name" => "马头桥镇", "code" => "430528108000"},
      %{"name" => "黄金瑶族乡", "code" => "430528200000"},
      %{"name" => "麻林瑶族乡", "code" => "430528201000"},
      %{"name" => "万塘乡", "code" => "430528203000"},
      %{"name" => "清江桥乡", "code" => "430528204000"},
      %{"name" => "安山乡", "code" => "430528205000"},
      %{"name" => "丰田乡", "code" => "430528206000"},
      %{"name" => "巡田乡", "code" => "430528208000"},
      %{"name" => "靖位乡", "code" => "430528209000"}
    ]

  def next(input) when input == "城步苗族自治县" or input == "430529",
    do: [
      %{"name" => "儒林镇", "code" => "430529100000"},
      %{"name" => "茅坪镇", "code" => "430529101000"},
      %{"name" => "西岩镇", "code" => "430529102000"},
      %{"name" => "丹口镇", "code" => "430529103000"},
      %{"name" => "五团镇", "code" => "430529104000"},
      %{"name" => "长安营镇", "code" => "430529106000"},
      %{"name" => "白毛坪镇", "code" => "430529107000"},
      %{"name" => "威溪乡", "code" => "430529200000"},
      %{"name" => "兰蓉乡", "code" => "430529203000"},
      %{"name" => "汀坪乡", "code" => "430529204000"},
      %{"name" => "蒋坊乡", "code" => "430529205000"},
      %{"name" => "金紫乡", "code" => "430529206000"}
    ]

  def next(input) when input == "武冈市" or input == "430581",
    do: [
      %{"name" => "辕门口街道", "code" => "430581001000"},
      %{"name" => "迎春亭街道", "code" => "430581002000"},
      %{"name" => "法相岩街道", "code" => "430581003000"},
      %{"name" => "水西门街道", "code" => "430581004000"},
      %{"name" => "邓元泰镇", "code" => "430581100000"},
      %{"name" => "湾头桥镇", "code" => "430581101000"},
      %{"name" => "文坪镇", "code" => "430581102000"},
      %{"name" => "荆竹铺镇", "code" => "430581103000"},
      %{"name" => "稠树塘镇", "code" => "430581104000"},
      %{"name" => "邓家铺镇", "code" => "430581105000"},
      %{"name" => "龙溪镇", "code" => "430581106000"},
      %{"name" => "司马冲镇", "code" => "430581107000"},
      %{"name" => "秦桥镇", "code" => "430581108000"},
      %{"name" => "双牌镇", "code" => "430581109000"},
      %{"name" => "大甸镇", "code" => "430581110000"},
      %{"name" => "马坪乡", "code" => "430581204000"},
      %{"name" => "晏田乡", "code" => "430581205000"},
      %{"name" => "水浸坪乡", "code" => "430581207000"}
    ]

  def next(input) when input == "邵东市" or input == "430582",
    do: [
      %{"name" => "大禾塘街道", "code" => "430582001000"},
      %{"name" => "两市塘街道", "code" => "430582002000"},
      %{"name" => "宋家塘街道", "code" => "430582003000"},
      %{"name" => "牛马司镇", "code" => "430582101000"},
      %{"name" => "界岭镇", "code" => "430582102000"},
      %{"name" => "九龙岭镇", "code" => "430582103000"},
      %{"name" => "仙槎桥镇", "code" => "430582104000"},
      %{"name" => "火厂坪镇", "code" => "430582105000"},
      %{"name" => "佘田桥镇", "code" => "430582106000"},
      %{"name" => "灵官殿镇", "code" => "430582107000"},
      %{"name" => "团山镇", "code" => "430582108000"},
      %{"name" => "砂石镇", "code" => "430582109000"},
      %{"name" => "廉桥镇", "code" => "430582110000"},
      %{"name" => "流光岭镇", "code" => "430582111000"},
      %{"name" => "流泽镇", "code" => "430582112000"},
      %{"name" => "魏家桥镇", "code" => "430582113000"},
      %{"name" => "野鸡坪镇", "code" => "430582114000"},
      %{"name" => "杨桥镇", "code" => "430582115000"},
      %{"name" => "水东江镇", "code" => "430582116000"},
      %{"name" => "黑田铺镇", "code" => "430582117000"},
      %{"name" => "简家陇镇", "code" => "430582118000"},
      %{"name" => "双凤乡", "code" => "430582201000"},
      %{"name" => "周官桥乡", "code" => "430582202000"},
      %{"name" => "堡面前乡", "code" => "430582203000"},
      %{"name" => "斫曹乡", "code" => "430582204000"}
    ]

  def next(input) when input == "珠晖区" or input == "430405",
    do: [
      %{"name" => "衡州路街道", "code" => "430405007000"},
      %{"name" => "广东路街道", "code" => "430405009000"},
      %{"name" => "东风街道", "code" => "430405010000"},
      %{"name" => "冶金街道", "code" => "430405011000"},
      %{"name" => "苗圃街道", "code" => "430405012000"},
      %{"name" => "粤汉街道", "code" => "430405013000"},
      %{"name" => "东阳渡街道", "code" => "430405014000"},
      %{"name" => "茶山坳镇", "code" => "430405100000"},
      %{"name" => "和平乡", "code" => "430405200000"},
      %{"name" => "酃湖乡", "code" => "430405201000"}
    ]

  def next(input) when input == "雁峰区" or input == "430406",
    do: [
      %{"name" => "先锋街道", "code" => "430406001000"},
      %{"name" => "雁峰街道", "code" => "430406002000"},
      %{"name" => "天马山街道", "code" => "430406003000"},
      %{"name" => "黄茶岭街道", "code" => "430406004000"},
      %{"name" => "白沙洲街道", "code" => "430406005000"},
      %{"name" => "岳屏镇", "code" => "430406100000"},
      %{"name" => "白沙洲工业园", "code" => "430406400000"}
    ]

  def next(input) when input == "石鼓区" or input == "430407",
    do: [
      %{"name" => "人民街道", "code" => "430407001000"},
      %{"name" => "青山街道", "code" => "430407002000"},
      %{"name" => "潇湘街道", "code" => "430407003000"},
      %{"name" => "五一街道", "code" => "430407004000"},
      %{"name" => "合江街道", "code" => "430407005000"},
      %{"name" => "黄沙湾街道", "code" => "430407006000"},
      %{"name" => "角山镇", "code" => "430407100000"}
    ]

  def next(input) when input == "蒸湘区" or input == "430408",
    do: [
      %{"name" => "蒸湘街道", "code" => "430408001000"},
      %{"name" => "红湘街道", "code" => "430408002000"},
      %{"name" => "联合街道", "code" => "430408004000"},
      %{"name" => "呆鹰岭镇", "code" => "430408100000"},
      %{"name" => "雨母山镇", "code" => "430408101000"}
    ]

  def next(input) when input == "南岳区" or input == "430412",
    do: [
      %{"name" => "祝融街道", "code" => "430412001000"},
      %{"name" => "南岳镇", "code" => "430412100000"},
      %{"name" => "寿岳乡", "code" => "430412203000"}
    ]

  def next(input) when input == "衡阳县" or input == "430421",
    do: [
      %{"name" => "西渡镇", "code" => "430421100000"},
      %{"name" => "集兵镇", "code" => "430421101000"},
      %{"name" => "杉桥镇", "code" => "430421103000"},
      %{"name" => "井头镇", "code" => "430421104000"},
      %{"name" => "演陂镇", "code" => "430421105000"},
      %{"name" => "金兰镇", "code" => "430421106000"},
      %{"name" => "洪市镇", "code" => "430421107000"},
      %{"name" => "曲兰镇", "code" => "430421108000"},
      %{"name" => "金溪镇", "code" => "430421109000"},
      %{"name" => "界牌镇", "code" => "430421110000"},
      %{"name" => "渣江镇", "code" => "430421111000"},
      %{"name" => "三湖镇", "code" => "430421112000"},
      %{"name" => "台源镇", "code" => "430421113000"},
      %{"name" => "关市镇", "code" => "430421114000"},
      %{"name" => "库宗桥镇", "code" => "430421115000"},
      %{"name" => "岘山镇", "code" => "430421116000"},
      %{"name" => "石市镇", "code" => "430421117000"},
      %{"name" => "樟木乡", "code" => "430421200000"},
      %{"name" => "岣嵝乡", "code" => "430421201000"},
      %{"name" => "栏垅乡", "code" => "430421205000"},
      %{"name" => "大安乡", "code" => "430421207000"},
      %{"name" => "溪江乡", "code" => "430421208000"},
      %{"name" => "长安乡", "code" => "430421210000"},
      %{"name" => "板市乡", "code" => "430421211000"},
      %{"name" => "樟树乡", "code" => "430421212000"}
    ]

  def next(input) when input == "衡南县" or input == "430422",
    do: [
      %{"name" => "云集街道", "code" => "430422001000"},
      %{"name" => "车江街道", "code" => "430422002000"},
      %{"name" => "向阳桥街道", "code" => "430422003000"},
      %{"name" => "茶市镇", "code" => "430422103000"},
      %{"name" => "冠市镇", "code" => "430422104000"},
      %{"name" => "江口镇", "code" => "430422105000"},
      %{"name" => "宝盖镇", "code" => "430422106000"},
      %{"name" => "花桥镇", "code" => "430422107000"},
      %{"name" => "铁丝塘镇", "code" => "430422108000"},
      %{"name" => "泉溪镇", "code" => "430422109000"},
      %{"name" => "洪山镇", "code" => "430422110000"},
      %{"name" => "三塘镇", "code" => "430422111000"},
      %{"name" => "谭子山镇", "code" => "430422112000"},
      %{"name" => "岐山镇", "code" => "430422113000"},
      %{"name" => "泉湖镇", "code" => "430422114000"},
      %{"name" => "柞市镇", "code" => "430422115000"},
      %{"name" => "茅市镇", "code" => "430422116000"},
      %{"name" => "硫市镇", "code" => "430422117000"},
      %{"name" => "栗江镇", "code" => "430422118000"},
      %{"name" => "近尾洲镇", "code" => "430422119000"},
      %{"name" => "咸塘镇", "code" => "430422121000"},
      %{"name" => "松江镇", "code" => "430422122000"},
      %{"name" => "相市乡", "code" => "430422200000"},
      %{"name" => "衡州监狱", "code" => "430422407000"}
    ]

  def next(input) when input == "衡山县" or input == "430423",
    do: [
      %{"name" => "开云镇", "code" => "430423100000"},
      %{"name" => "白果镇", "code" => "430423101000"},
      %{"name" => "东湖镇", "code" => "430423102000"},
      %{"name" => "萱洲镇", "code" => "430423103000"},
      %{"name" => "长江镇", "code" => "430423104000"},
      %{"name" => "新桥镇", "code" => "430423105000"},
      %{"name" => "店门镇", "code" => "430423107000"},
      %{"name" => "永和乡", "code" => "430423201000"},
      %{"name" => "福田铺乡", "code" => "430423203000"},
      %{"name" => "岭坡乡", "code" => "430423204000"},
      %{"name" => "贯塘乡", "code" => "430423207000"},
      %{"name" => "江东乡", "code" => "430423208000"}
    ]

  def next(input) when input == "衡东县" or input == "430424",
    do: [
      %{"name" => "洣水镇", "code" => "430424100000"},
      %{"name" => "石湾镇", "code" => "430424101000"},
      %{"name" => "新塘镇", "code" => "430424102000"},
      %{"name" => "大浦镇", "code" => "430424103000"},
      %{"name" => "吴集镇", "code" => "430424104000"},
      %{"name" => "甘溪镇", "code" => "430424105000"},
      %{"name" => "杨林镇", "code" => "430424106000"},
      %{"name" => "草市镇", "code" => "430424107000"},
      %{"name" => "杨桥镇", "code" => "430424108000"},
      %{"name" => "霞流镇", "code" => "430424109000"},
      %{"name" => "荣桓镇", "code" => "430424110000"},
      %{"name" => "高湖镇", "code" => "430424111000"},
      %{"name" => "白莲镇", "code" => "430424112000"},
      %{"name" => "三樟镇", "code" => "430424113000"},
      %{"name" => "蓬源镇", "code" => "430424114000"},
      %{"name" => "南湾乡", "code" => "430424204000"},
      %{"name" => "石滩乡", "code" => "430424211000"},
      %{"name" => "河西开发区", "code" => "430424401000"},
      %{"name" => "大浦工业园", "code" => "430424403000"}
    ]

  def next(input) when input == "祁东县" or input == "430426",
    do: [
      %{"name" => "洪桥街道", "code" => "430426001000"},
      %{"name" => "玉合街道", "code" => "430426002000"},
      %{"name" => "永昌街道", "code" => "430426003000"},
      %{"name" => "白鹤街道", "code" => "430426004000"},
      %{"name" => "金桥镇", "code" => "430426102000"},
      %{"name" => "鸟江镇", "code" => "430426103000"},
      %{"name" => "粮市镇", "code" => "430426104000"},
      %{"name" => "河洲镇", "code" => "430426105000"},
      %{"name" => "归阳镇", "code" => "430426106000"},
      %{"name" => "过水坪镇", "code" => "430426107000"},
      %{"name" => "双桥镇", "code" => "430426108000"},
      %{"name" => "灵官镇", "code" => "430426109000"},
      %{"name" => "风石堰镇", "code" => "430426110000"},
      %{"name" => "白地市镇", "code" => "430426111000"},
      %{"name" => "黄土铺镇", "code" => "430426112000"},
      %{"name" => "石亭子镇", "code" => "430426113000"},
      %{"name" => "官家嘴镇", "code" => "430426114000"},
      %{"name" => "步云桥镇", "code" => "430426115000"},
      %{"name" => "砖塘镇", "code" => "430426116000"},
      %{"name" => "蒋家桥镇", "code" => "430426117000"},
      %{"name" => "太和堂镇", "code" => "430426118000"},
      %{"name" => "马杜桥乡", "code" => "430426200000"},
      %{"name" => "凤歧坪乡", "code" => "430426201000"},
      %{"name" => "城连墟乡", "code" => "430426202000"}
    ]

  def next(input) when input == "湖南衡阳松木经济开发区" or input == "430473",
    do: [%{"name" => "松木工业园", "code" => "430473400000"}]

  def next(input) when input == "湖南衡阳高新技术产业园区" or input == "430476",
    do: [%{"name" => "华兴街道", "code" => "430476001000"}]

  def next(input) when input == "耒阳市" or input == "430481",
    do: [
      %{"name" => "蔡子池街道", "code" => "430481001000"},
      %{"name" => "灶市街街道", "code" => "430481002000"},
      %{"name" => "水东江街道", "code" => "430481003000"},
      %{"name" => "五里牌街道", "code" => "430481004000"},
      %{"name" => "三架街道", "code" => "430481005000"},
      %{"name" => "余庆街道", "code" => "430481006000"},
      %{"name" => "黄市镇", "code" => "430481100000"},
      %{"name" => "小水镇", "code" => "430481101000"},
      %{"name" => "公平圩镇", "code" => "430481102000"},
      %{"name" => "三都镇", "code" => "430481104000"},
      %{"name" => "南阳镇", "code" => "430481105000"},
      %{"name" => "夏塘镇", "code" => "430481107000"},
      %{"name" => "龙塘镇", "code" => "430481108000"},
      %{"name" => "哲桥镇", "code" => "430481109000"},
      %{"name" => "永济镇", "code" => "430481110000"},
      %{"name" => "遥田镇", "code" => "430481111000"},
      %{"name" => "新市镇", "code" => "430481112000"},
      %{"name" => "淝田镇", "code" => "430481113000"},
      %{"name" => "大市镇", "code" => "430481114000"},
      %{"name" => "仁义镇", "code" => "430481115000"},
      %{"name" => "南京镇", "code" => "430481116000"},
      %{"name" => "大义镇", "code" => "430481117000"},
      %{"name" => "东湖圩镇", "code" => "430481118000"},
      %{"name" => "马水镇", "code" => "430481119000"},
      %{"name" => "导子镇", "code" => "430481120000"},
      %{"name" => "亮源乡", "code" => "430481201000"},
      %{"name" => "太平圩乡", "code" => "430481203000"},
      %{"name" => "长坪乡", "code" => "430481213000"},
      %{"name" => "大和圩乡", "code" => "430481214000"},
      %{"name" => "坛下乡", "code" => "430481215000"}
    ]

  def next(input) when input == "常宁市" or input == "430482",
    do: [
      %{"name" => "宜阳街道", "code" => "430482001000"},
      %{"name" => "泉峰街道", "code" => "430482002000"},
      %{"name" => "培元街道", "code" => "430482003000"},
      %{"name" => "曲潭街道", "code" => "430482005000"},
      %{"name" => "天堂山街道", "code" => "430482006000"},
      %{"name" => "柏坊镇", "code" => "430482101000"},
      %{"name" => "水口山镇", "code" => "430482102000"},
      %{"name" => "烟洲镇", "code" => "430482103000"},
      %{"name" => "荫田镇", "code" => "430482104000"},
      %{"name" => "白沙镇", "code" => "430482105000"},
      %{"name" => "西岭镇", "code" => "430482106000"},
      %{"name" => "三角塘镇", "code" => "430482108000"},
      %{"name" => "洋泉镇", "code" => "430482109000"},
      %{"name" => "庙前镇", "code" => "430482110000"},
      %{"name" => "罗桥镇", "code" => "430482111000"},
      %{"name" => "板桥镇", "code" => "430482112000"},
      %{"name" => "胜桥镇", "code" => "430482113000"},
      %{"name" => "官岭镇", "code" => "430482114000"},
      %{"name" => "新河镇", "code" => "430482115000"},
      %{"name" => "蓬塘乡", "code" => "430482201000"},
      %{"name" => "兰江乡", "code" => "430482202000"},
      %{"name" => "大堡乡", "code" => "430482203000"},
      %{"name" => "塔山瑶族乡", "code" => "430482206000"}
    ]

  def next(input) when input == "雨湖区" or input == "430302",
    do: [
      %{"name" => "雨湖路街道", "code" => "430302001000"},
      %{"name" => "城正街街道", "code" => "430302002000"},
      %{"name" => "云塘街道", "code" => "430302003000"},
      %{"name" => "广场街道", "code" => "430302004000"},
      %{"name" => "窑湾街道", "code" => "430302005000"},
      %{"name" => "昭潭街道", "code" => "430302006000"},
      %{"name" => "万楼街道", "code" => "430302007000"},
      %{"name" => "先锋街道", "code" => "430302008000"},
      %{"name" => "鹤岭镇", "code" => "430302100000"},
      %{"name" => "楠竹山镇", "code" => "430302101000"},
      %{"name" => "姜畲镇", "code" => "430302102000"},
      %{"name" => "长城乡", "code" => "430302202000"}
    ]

  def next(input) when input == "岳塘区" or input == "430304",
    do: [
      %{"name" => "岳塘街道", "code" => "430304001000"},
      %{"name" => "东坪街道", "code" => "430304002000"},
      %{"name" => "书院路街道", "code" => "430304004000"},
      %{"name" => "下摄司街道", "code" => "430304005000"},
      %{"name" => "建设路街道", "code" => "430304006000"},
      %{"name" => "五里堆街道", "code" => "430304008000"},
      %{"name" => "宝塔街道", "code" => "430304010000"},
      %{"name" => "霞城街道", "code" => "430304014000"},
      %{"name" => "荷塘街道", "code" => "430304015000"}
    ]

  def next(input) when input == "湘潭县" or input == "430321",
    do: [
      %{"name" => "易俗河镇", "code" => "430321100000"},
      %{"name" => "谭家山镇", "code" => "430321102000"},
      %{"name" => "中路铺镇", "code" => "430321103000"},
      %{"name" => "茶恩寺镇", "code" => "430321104000"},
      %{"name" => "河口镇", "code" => "430321105000"},
      %{"name" => "射埠镇", "code" => "430321106000"},
      %{"name" => "花石镇", "code" => "430321107000"},
      %{"name" => "青山桥镇", "code" => "430321108000"},
      %{"name" => "石鼓镇", "code" => "430321109000"},
      %{"name" => "云湖桥镇", "code" => "430321111000"},
      %{"name" => "石潭镇", "code" => "430321112000"},
      %{"name" => "杨嘉桥镇", "code" => "430321113000"},
      %{"name" => "乌石镇", "code" => "430321114000"},
      %{"name" => "白石镇", "code" => "430321115000"},
      %{"name" => "分水乡", "code" => "430321202000"},
      %{"name" => "排头乡", "code" => "430321203000"},
      %{"name" => "锦石乡", "code" => "430321205000"}
    ]

  def next(input) when input == "湖南湘潭高新技术产业园区" or input == "430371",
    do: [
      %{"name" => "板塘街道", "code" => "430371001000"},
      %{"name" => "双马街道", "code" => "430371002000"}
    ]

  def next(input) when input == "湘潭昭山示范区" or input == "430372",
    do: [%{"name" => "昭山镇", "code" => "430372100000"}]

  def next(input) when input == "湘潭九华示范区" or input == "430373",
    do: [
      %{"name" => "和平街道", "code" => "430373001000"},
      %{"name" => "九华街道", "code" => "430373002000"},
      %{"name" => "响水乡", "code" => "430373200000"}
    ]

  def next(input) when input == "湘乡市" or input == "430381",
    do: [
      %{"name" => "望春门街道", "code" => "430381001000"},
      %{"name" => "新湘路街道", "code" => "430381002000"},
      %{"name" => "昆仑桥街道", "code" => "430381003000"},
      %{"name" => "东山街道", "code" => "430381004000"},
      %{"name" => "山枣镇", "code" => "430381100000"},
      %{"name" => "栗山镇", "code" => "430381101000"},
      %{"name" => "中沙镇", "code" => "430381102000"},
      %{"name" => "虞唐镇", "code" => "430381103000"},
      %{"name" => "潭市镇", "code" => "430381104000"},
      %{"name" => "棋梓镇", "code" => "430381105000"},
      %{"name" => "壶天镇", "code" => "430381106000"},
      %{"name" => "翻江镇", "code" => "430381107000"},
      %{"name" => "金石镇", "code" => "430381108000"},
      %{"name" => "白田镇", "code" => "430381109000"},
      %{"name" => "月山镇", "code" => "430381110000"},
      %{"name" => "泉塘镇", "code" => "430381111000"},
      %{"name" => "梅桥镇", "code" => "430381112000"},
      %{"name" => "毛田镇", "code" => "430381113000"},
      %{"name" => "龙洞镇", "code" => "430381114000"},
      %{"name" => "东郊乡", "code" => "430381200000"},
      %{"name" => "金薮乡", "code" => "430381202000"},
      %{"name" => "育塅乡", "code" => "430381203000"}
    ]

  def next(input) when input == "韶山市" or input == "430382",
    do: [
      %{"name" => "清溪镇", "code" => "430382100000"},
      %{"name" => "银田镇", "code" => "430382101000"},
      %{"name" => "韶山乡", "code" => "430382200000"},
      %{"name" => "杨林乡", "code" => "430382203000"}
    ]

  def next(input) when input == "荷塘区" or input == "430202",
    do: [
      %{"name" => "月塘街道", "code" => "430202001000"},
      %{"name" => "茨菇塘街道", "code" => "430202002000"},
      %{"name" => "宋家桥街道", "code" => "430202003000"},
      %{"name" => "桂花街道", "code" => "430202004000"},
      %{"name" => "金山街道", "code" => "430202005000"},
      %{"name" => "明照街道", "code" => "430202006000"},
      %{"name" => "仙庾镇", "code" => "430202100000"}
    ]

  def next(input) when input == "芦淞区" or input == "430203",
    do: [
      %{"name" => "贺家土街道", "code" => "430203001000"},
      %{"name" => "建设街道", "code" => "430203002000"},
      %{"name" => "建宁街道", "code" => "430203003000"},
      %{"name" => "董家塅街道", "code" => "430203004000"},
      %{"name" => "庆云街道", "code" => "430203005000"},
      %{"name" => "枫溪街道", "code" => "430203006000"},
      %{"name" => "龙泉街道", "code" => "430203007000"},
      %{"name" => "白关镇", "code" => "430203100000"}
    ]

  def next(input) when input == "石峰区" or input == "430204",
    do: [
      %{"name" => "田心街道", "code" => "430204001000"},
      %{"name" => "响石岭街道", "code" => "430204002000"},
      %{"name" => "清水塘街道", "code" => "430204003000"},
      %{"name" => "铜塘湾街道", "code" => "430204004000"},
      %{"name" => "井龙街道", "code" => "430204005000"},
      %{"name" => "学林街道", "code" => "430204008000"},
      %{"name" => "龙头铺街道", "code" => "430204009000"},
      %{"name" => "云田镇", "code" => "430204102000"}
    ]

  def next(input) when input == "天元区" or input == "430211",
    do: [
      %{"name" => "嵩山路街道", "code" => "430211001000"},
      %{"name" => "泰山路街道", "code" => "430211002000"},
      %{"name" => "栗雨街道", "code" => "430211003000"},
      %{"name" => "马家河街道", "code" => "430211004000"},
      %{"name" => "群丰镇", "code" => "430211101000"},
      %{"name" => "雷打石镇", "code" => "430211102000"},
      %{"name" => "三门镇", "code" => "430211103000"}
    ]

  def next(input) when input == "渌口区" or input == "430212",
    do: [
      %{"name" => "渌口镇", "code" => "430212100000"},
      %{"name" => "朱亭镇", "code" => "430212101000"},
      %{"name" => "古岳峰镇", "code" => "430212106000"},
      %{"name" => "淦田镇", "code" => "430212107000"},
      %{"name" => "龙门镇", "code" => "430212108000"},
      %{"name" => "龙潭镇", "code" => "430212109000"},
      %{"name" => "南洲镇", "code" => "430212110000"},
      %{"name" => "龙船镇", "code" => "430212111000"}
    ]

  def next(input) when input == "攸县" or input == "430223",
    do: [
      %{"name" => "联星街道", "code" => "430223001000"},
      %{"name" => "江桥街道", "code" => "430223002000"},
      %{"name" => "春联街道", "code" => "430223003000"},
      %{"name" => "谭桥街道", "code" => "430223004000"},
      %{"name" => "酒埠江镇", "code" => "430223102000"},
      %{"name" => "桃水镇", "code" => "430223103000"},
      %{"name" => "网岭镇", "code" => "430223106000"},
      %{"name" => "渌田镇", "code" => "430223109000"},
      %{"name" => "石羊塘镇", "code" => "430223115000"},
      %{"name" => "黄丰桥镇", "code" => "430223118000"},
      %{"name" => "鸾山镇", "code" => "430223119000"},
      %{"name" => "丫江桥镇", "code" => "430223120000"},
      %{"name" => "皇图岭镇", "code" => "430223122000"},
      %{"name" => "新市镇", "code" => "430223123000"},
      %{"name" => "菜花坪镇", "code" => "430223124000"},
      %{"name" => "莲塘坳镇", "code" => "430223125000"},
      %{"name" => "宁家坪镇", "code" => "430223126000"},
      %{"name" => "攸县工业园", "code" => "430223400000"},
      %{"name" => "攸县网岭循环经济园", "code" => "430223401000"}
    ]

  def next(input) when input == "茶陵县" or input == "430224",
    do: [
      %{"name" => "下东街道", "code" => "430224002000"},
      %{"name" => "思聪街道", "code" => "430224003000"},
      %{"name" => "洣江街道", "code" => "430224004000"},
      %{"name" => "云阳街道", "code" => "430224005000"},
      %{"name" => "界首镇", "code" => "430224101000"},
      %{"name" => "湖口镇", "code" => "430224103000"},
      %{"name" => "马江镇", "code" => "430224105000"},
      %{"name" => "高陇镇", "code" => "430224106000"},
      %{"name" => "虎踞镇", "code" => "430224109000"},
      %{"name" => "枣市镇", "code" => "430224111000"},
      %{"name" => "火田镇", "code" => "430224112000"},
      %{"name" => "严塘镇", "code" => "430224113000"},
      %{"name" => "秩堂镇", "code" => "430224115000"},
      %{"name" => "腰潞镇", "code" => "430224116000"},
      %{"name" => "舲舫乡", "code" => "430224203000"},
      %{"name" => "桃坑乡", "code" => "430224213000"},
      %{"name" => "汉背管理处", "code" => "430224404000"},
      %{"name" => "茶陵县红色农场", "code" => "430224500000"}
    ]

  def next(input) when input == "炎陵县" or input == "430225",
    do: [
      %{"name" => "霞阳镇", "code" => "430225100000"},
      %{"name" => "沔渡镇", "code" => "430225101000"},
      %{"name" => "十都镇", "code" => "430225102000"},
      %{"name" => "水口镇", "code" => "430225103000"},
      %{"name" => "鹿原镇", "code" => "430225105000"},
      %{"name" => "垄溪乡", "code" => "430225200000"},
      %{"name" => "策源乡", "code" => "430225202000"},
      %{"name" => "下村乡", "code" => "430225203000"},
      %{"name" => "船形乡", "code" => "430225207000"},
      %{"name" => "中村瑶族乡", "code" => "430225209000"},
      %{"name" => "炎陵县大院农场", "code" => "430225400000"},
      %{"name" => "炎陵县桃源洞管理局", "code" => "430225401000"}
    ]

  def next(input) when input == "醴陵市" or input == "430281",
    do: [
      %{"name" => "阳三石街道", "code" => "430281002000"},
      %{"name" => "仙岳山街道", "code" => "430281003000"},
      %{"name" => "国瓷街道", "code" => "430281004000"},
      %{"name" => "来龙门街道", "code" => "430281006000"},
      %{"name" => "长庆街道", "code" => "430281007000"},
      %{"name" => "白兔潭镇", "code" => "430281102000"},
      %{"name" => "浦口镇", "code" => "430281103000"},
      %{"name" => "王仙镇", "code" => "430281105000"},
      %{"name" => "泗汾镇", "code" => "430281107000"},
      %{"name" => "沈潭镇", "code" => "430281108000"},
      %{"name" => "船湾镇", "code" => "430281109000"},
      %{"name" => "均楚镇", "code" => "430281120000"},
      %{"name" => "东富镇", "code" => "430281121000"},
      %{"name" => "石亭镇", "code" => "430281122000"},
      %{"name" => "孙家湾镇", "code" => "430281125000"},
      %{"name" => "官庄镇", "code" => "430281126000"},
      %{"name" => "嘉树镇", "code" => "430281127000"},
      %{"name" => "板杉镇", "code" => "430281128000"},
      %{"name" => "沩山镇", "code" => "430281129000"},
      %{"name" => "枫林镇", "code" => "430281130000"},
      %{"name" => "李畋镇", "code" => "430281131000"},
      %{"name" => "明月镇", "code" => "430281132000"},
      %{"name" => "左权镇", "code" => "430281133000"},
      %{"name" => "茶山镇", "code" => "430281134000"},
      %{"name" => "湖南醴陵经济开发区", "code" => "430281400000"}
    ]

  def next(input) when input == "芙蓉区" or input == "430102",
    do: [
      %{"name" => "文艺路街道", "code" => "430102001000"},
      %{"name" => "朝阳街街道", "code" => "430102002000"},
      %{"name" => "韭菜园街道", "code" => "430102003000"},
      %{"name" => "五里牌街道", "code" => "430102008000"},
      %{"name" => "火星街道", "code" => "430102009000"},
      %{"name" => "马王堆街道", "code" => "430102010000"},
      %{"name" => "东屯渡街道", "code" => "430102011000"},
      %{"name" => "湘湖街道", "code" => "430102012000"},
      %{"name" => "定王台街道", "code" => "430102013000"},
      %{"name" => "荷花园街道", "code" => "430102014000"},
      %{"name" => "东岸街道", "code" => "430102015000"},
      %{"name" => "马坡岭街道", "code" => "430102016000"},
      %{"name" => "东湖街道", "code" => "430102017000"},
      %{"name" => "隆平高科技园", "code" => "430102400000"}
    ]

  def next(input) when input == "天心区" or input == "430103",
    do: [
      %{"name" => "坡子街街道", "code" => "430103002000"},
      %{"name" => "城南路街道", "code" => "430103004000"},
      %{"name" => "裕南街街道", "code" => "430103005000"},
      %{"name" => "金盆岭街道", "code" => "430103006000"},
      %{"name" => "新开铺街道", "code" => "430103007000"},
      %{"name" => "青园街道", "code" => "430103008000"},
      %{"name" => "桂花坪街道", "code" => "430103009000"},
      %{"name" => "赤岭路街道", "code" => "430103010000"},
      %{"name" => "文源街道", "code" => "430103011000"},
      %{"name" => "先锋街道", "code" => "430103012000"},
      %{"name" => "黑石铺街道", "code" => "430103013000"},
      %{"name" => "大托铺街道", "code" => "430103014000"},
      %{"name" => "暮云街道", "code" => "430103015000"},
      %{"name" => "南托街道", "code" => "430103016000"}
    ]

  def next(input) when input == "岳麓区" or input == "430104",
    do: [
      %{"name" => "望月湖街道", "code" => "430104001000"},
      %{"name" => "岳麓街道", "code" => "430104002000"},
      %{"name" => "桔子洲街道", "code" => "430104003000"},
      %{"name" => "银盆岭街道", "code" => "430104004000"},
      %{"name" => "观沙岭街道", "code" => "430104005000"},
      %{"name" => "望城坡街道", "code" => "430104006000"},
      %{"name" => "西湖街道", "code" => "430104007000"},
      %{"name" => "咸嘉湖街道", "code" => "430104008000"},
      %{"name" => "望岳街道", "code" => "430104009000"},
      %{"name" => "梅溪湖街道", "code" => "430104010000"},
      %{"name" => "麓谷街道", "code" => "430104011000"},
      %{"name" => "坪塘街道", "code" => "430104012000"},
      %{"name" => "含浦街道", "code" => "430104013000"},
      %{"name" => "天顶街道", "code" => "430104014000"},
      %{"name" => "洋湖街道", "code" => "430104015000"},
      %{"name" => "学士街道", "code" => "430104016000"},
      %{"name" => "东方红街道", "code" => "430104017000"},
      %{"name" => "莲花镇", "code" => "430104102000"},
      %{"name" => "雨敞坪镇", "code" => "430104105000"}
    ]

  def next(input) when input == "开福区" or input == "430105",
    do: [
      %{"name" => "芙蓉北路街道", "code" => "430105001000"},
      %{"name" => "东风路街道", "code" => "430105002000"},
      %{"name" => "清水塘街道", "code" => "430105003000"},
      %{"name" => "望麓园街道", "code" => "430105004000"},
      %{"name" => "湘雅路街道", "code" => "430105005000"},
      %{"name" => "伍家岭街道", "code" => "430105006000"},
      %{"name" => "新河街道", "code" => "430105009000"},
      %{"name" => "通泰街街道", "code" => "430105010000"},
      %{"name" => "四方坪街道", "code" => "430105012000"},
      %{"name" => "洪山街道", "code" => "430105013000"},
      %{"name" => "浏阳河街道", "code" => "430105014000"},
      %{"name" => "月湖街道", "code" => "430105015000"},
      %{"name" => "秀峰街道", "code" => "430105016000"},
      %{"name" => "沙坪街道", "code" => "430105019000"},
      %{"name" => "捞刀河街道", "code" => "430105020000"},
      %{"name" => "青竹湖街道", "code" => "430105021000"}
    ]

  def next(input) when input == "雨花区" or input == "430111",
    do: [
      %{"name" => "侯家塘街道", "code" => "430111001000"},
      %{"name" => "左家塘街道", "code" => "430111002000"},
      %{"name" => "圭塘街道", "code" => "430111003000"},
      %{"name" => "砂子塘街道", "code" => "430111004000"},
      %{"name" => "东塘街道", "code" => "430111005000"},
      %{"name" => "雨花亭街道", "code" => "430111006000"},
      %{"name" => "高桥街道", "code" => "430111007000"},
      %{"name" => "洞井街道", "code" => "430111008000"},
      %{"name" => "黎托街道", "code" => "430111009000"},
      %{"name" => "井湾子街道", "code" => "430111010000"},
      %{"name" => "同升街道", "code" => "430111011000"},
      %{"name" => "东山街道", "code" => "430111012000"},
      %{"name" => "跳马镇", "code" => "430111101000"},
      %{"name" => "雨花经济开发区", "code" => "430111400000"}
    ]

  def next(input) when input == "望城区" or input == "430112",
    do: [
      %{"name" => "高塘岭街道", "code" => "430112001000"},
      %{"name" => "丁字湾街道", "code" => "430112003000"},
      %{"name" => "大泽湖街道", "code" => "430112005000"},
      %{"name" => "月亮岛街道", "code" => "430112006000"},
      %{"name" => "白沙洲街道", "code" => "430112007000"},
      %{"name" => "金山桥街道", "code" => "430112008000"},
      %{"name" => "黄金园街道", "code" => "430112009000"},
      %{"name" => "乌山街道", "code" => "430112011000"},
      %{"name" => "铜官街道", "code" => "430112012000"},
      %{"name" => "雷锋街道", "code" => "430112013000"},
      %{"name" => "白马街道", "code" => "430112017000"},
      %{"name" => "桥驿镇", "code" => "430112101000"},
      %{"name" => "茶亭镇", "code" => "430112103000"},
      %{"name" => "靖港镇", "code" => "430112106000"},
      %{"name" => "乔口镇", "code" => "430112107000"},
      %{"name" => "白箬铺镇", "code" => "430112115000"}
    ]

  def next(input) when input == "长沙县" or input == "430121",
    do: [
      %{"name" => "星沙街道", "code" => "430121001000"},
      %{"name" => "泉塘街道", "code" => "430121002000"},
      %{"name" => "湘龙街道", "code" => "430121003000"},
      %{"name" => "㮾梨街道", "code" => "430121004000"},
      %{"name" => "长龙街道", "code" => "430121005000"},
      %{"name" => "黄兴镇", "code" => "430121102000"},
      %{"name" => "江背镇", "code" => "430121104000"},
      %{"name" => "黄花镇", "code" => "430121105000"},
      %{"name" => "春华镇", "code" => "430121106000"},
      %{"name" => "果园镇", "code" => "430121107000"},
      %{"name" => "路口镇", "code" => "430121108000"},
      %{"name" => "高桥镇", "code" => "430121109000"},
      %{"name" => "金井镇", "code" => "430121110000"},
      %{"name" => "福临镇", "code" => "430121111000"},
      %{"name" => "青山铺镇", "code" => "430121112000"},
      %{"name" => "安沙镇", "code" => "430121113000"},
      %{"name" => "北山镇", "code" => "430121114000"},
      %{"name" => "开慧镇", "code" => "430121116000"}
    ]

  def next(input) when input == "浏阳市" or input == "430181",
    do: [
      %{"name" => "淮川街道", "code" => "430181001000"},
      %{"name" => "集里街道", "code" => "430181002000"},
      %{"name" => "荷花街道", "code" => "430181003000"},
      %{"name" => "关口街道", "code" => "430181004000"},
      %{"name" => "社港镇", "code" => "430181102000"},
      %{"name" => "官渡镇", "code" => "430181104000"},
      %{"name" => "张坊镇", "code" => "430181105000"},
      %{"name" => "达浒镇", "code" => "430181106000"},
      %{"name" => "沿溪镇", "code" => "430181107000"},
      %{"name" => "古港镇", "code" => "430181108000"},
      %{"name" => "永和镇", "code" => "430181109000"},
      %{"name" => "大瑶镇", "code" => "430181110000"},
      %{"name" => "金刚镇", "code" => "430181111000"},
      %{"name" => "文家市镇", "code" => "430181112000"},
      %{"name" => "枨冲镇", "code" => "430181114000"},
      %{"name" => "镇头镇", "code" => "430181115000"},
      %{"name" => "普迹镇", "code" => "430181116000"},
      %{"name" => "永安镇", "code" => "430181117000"},
      %{"name" => "北盛镇", "code" => "430181118000"},
      %{"name" => "龙伏镇", "code" => "430181120000"},
      %{"name" => "澄潭江镇", "code" => "430181121000"},
      %{"name" => "中和镇", "code" => "430181122000"},
      %{"name" => "柏加镇", "code" => "430181123000"},
      %{"name" => "洞阳镇", "code" => "430181124000"},
      %{"name" => "大围山镇", "code" => "430181125000"},
      %{"name" => "沙市镇", "code" => "430181126000"},
      %{"name" => "淳口镇", "code" => "430181127000"},
      %{"name" => "高坪镇", "code" => "430181128000"},
      %{"name" => "官桥镇", "code" => "430181130000"},
      %{"name" => "葛家镇", "code" => "430181131000"},
      %{"name" => "蕉溪镇", "code" => "430181132000"},
      %{"name" => "小河乡", "code" => "430181201000"}
    ]

  def next(input) when input == "宁乡市" or input == "430182",
    do: [
      %{"name" => "玉潭街道", "code" => "430182001000"},
      %{"name" => "白马桥街道", "code" => "430182002000"},
      %{"name" => "历经铺街道", "code" => "430182003000"},
      %{"name" => "城郊街道", "code" => "430182004000"},
      %{"name" => "道林镇", "code" => "430182101000"},
      %{"name" => "花明楼镇", "code" => "430182102000"},
      %{"name" => "东湖塘镇", "code" => "430182103000"},
      %{"name" => "夏铎铺镇", "code" => "430182104000"},
      %{"name" => "双江口镇", "code" => "430182105000"},
      %{"name" => "煤炭坝镇", "code" => "430182106000"},
      %{"name" => "坝塘镇", "code" => "430182107000"},
      %{"name" => "灰汤镇", "code" => "430182109000"},
      %{"name" => "双凫铺镇", "code" => "430182110000"},
      %{"name" => "老粮仓镇", "code" => "430182111000"},
      %{"name" => "流沙河镇", "code" => "430182112000"},
      %{"name" => "巷子口镇", "code" => "430182113000"},
      %{"name" => "龙田镇", "code" => "430182114000"},
      %{"name" => "横市镇", "code" => "430182116000"},
      %{"name" => "回龙铺镇", "code" => "430182117000"},
      %{"name" => "黄材镇", "code" => "430182118000"},
      %{"name" => "大成桥镇", "code" => "430182119000"},
      %{"name" => "青山桥镇", "code" => "430182120000"},
      %{"name" => "金洲镇", "code" => "430182121000"},
      %{"name" => "大屯营镇", "code" => "430182122000"},
      %{"name" => "资福镇", "code" => "430182123000"},
      %{"name" => "菁华铺乡", "code" => "430182203000"},
      %{"name" => "喻家坳乡", "code" => "430182209000"},
      %{"name" => "沙田乡", "code" => "430182213000"},
      %{"name" => "沩山乡", "code" => "430182218000"}
    ]

  def next(_), do: nil
end