defmodule ChinaAdminDivisions.Gen.Lv3x.M44 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "罗定市" or input == "445381",
    do: [
      %{"name" => "罗城街道", "code" => "445381001000"},
      %{"name" => "素龙街道", "code" => "445381002000"},
      %{"name" => "附城街道", "code" => "445381003000"},
      %{"name" => "双东街道", "code" => "445381004000"},
      %{"name" => "罗镜镇", "code" => "445381100000"},
      %{"name" => "太平镇", "code" => "445381101000"},
      %{"name" => "分界镇", "code" => "445381102000"},
      %{"name" => "罗平镇", "code" => "445381104000"},
      %{"name" => "船步镇", "code" => "445381105000"},
      %{"name" => "朗塘镇", "code" => "445381106000"},
      %{"name" => "苹塘镇", "code" => "445381107000"},
      %{"name" => "金鸡镇", "code" => "445381108000"},
      %{"name" => "围底镇", "code" => "445381109000"},
      %{"name" => "华石镇", "code" => "445381110000"},
      %{"name" => "榃滨镇", "code" => "445381111000"},
      %{"name" => "黎少镇", "code" => "445381113000"},
      %{"name" => "生江镇", "code" => "445381114000"},
      %{"name" => "连州镇", "code" => "445381115000"},
      %{"name" => "泗纶镇", "code" => "445381116000"},
      %{"name" => "加益镇", "code" => "445381118000"},
      %{"name" => "龙湾镇", "code" => "445381119000"},
      %{"name" => "罗平农场", "code" => "445381400000"}
    ]

  def next(input) when input == "郁南县" or input == "445322",
    do: [
      %{"name" => "都城镇", "code" => "445322100000"},
      %{"name" => "平台镇", "code" => "445322101000"},
      %{"name" => "桂圩镇", "code" => "445322102000"},
      %{"name" => "通门镇", "code" => "445322104000"},
      %{"name" => "建城镇", "code" => "445322105000"},
      %{"name" => "宝珠镇", "code" => "445322106000"},
      %{"name" => "大方镇", "code" => "445322108000"},
      %{"name" => "千官镇", "code" => "445322110000"},
      %{"name" => "大湾镇", "code" => "445322111000"},
      %{"name" => "河口镇", "code" => "445322112000"},
      %{"name" => "宋桂镇", "code" => "445322113000"},
      %{"name" => "东坝镇", "code" => "445322114000"},
      %{"name" => "连滩镇", "code" => "445322115000"},
      %{"name" => "历洞镇", "code" => "445322116000"},
      %{"name" => "南江口镇", "code" => "445322117000"},
      %{"name" => "西江林场", "code" => "445322400000"},
      %{"name" => "通门林场", "code" => "445322401000"},
      %{"name" => "大历林场", "code" => "445322402000"},
      %{"name" => "同乐林场", "code" => "445322403000"}
    ]

  def next(input) when input == "新兴县" or input == "445321",
    do: [
      %{"name" => "新城镇", "code" => "445321100000"},
      %{"name" => "车岗镇", "code" => "445321101000"},
      %{"name" => "水台镇", "code" => "445321103000"},
      %{"name" => "稔村镇", "code" => "445321104000"},
      %{"name" => "东成镇", "code" => "445321105000"},
      %{"name" => "太平镇", "code" => "445321107000"},
      %{"name" => "里洞镇", "code" => "445321108000"},
      %{"name" => "大江镇", "code" => "445321110000"},
      %{"name" => "天堂镇", "code" => "445321112000"},
      %{"name" => "河头镇", "code" => "445321113000"},
      %{"name" => "簕竹镇", "code" => "445321114000"},
      %{"name" => "六祖镇", "code" => "445321115000"},
      %{"name" => "广东省西江林业局良洞迳林场", "code" => "445321501000"},
      %{"name" => "云浮市国有水台林场", "code" => "445321502000"},
      %{"name" => "国营新兴县岩头林场", "code" => "445321503000"}
    ]

  def next(input) when input == "云安区" or input == "445303",
    do: [
      %{"name" => "六都镇", "code" => "445303100000"},
      %{"name" => "高村镇", "code" => "445303101000"},
      %{"name" => "白石镇", "code" => "445303102000"},
      %{"name" => "镇安镇", "code" => "445303103000"},
      %{"name" => "富林镇", "code" => "445303104000"},
      %{"name" => "石城镇", "code" => "445303105000"},
      %{"name" => "都杨镇", "code" => "445303106000"}
    ]

  def next(input) when input == "云城区" or input == "445302",
    do: [
      %{"name" => "云城街道", "code" => "445302001000"},
      %{"name" => "高峰街道", "code" => "445302002000"},
      %{"name" => "河口街道", "code" => "445302003000"},
      %{"name" => "安塘街道", "code" => "445302004000"},
      %{"name" => "腰古镇", "code" => "445302102000"},
      %{"name" => "思劳镇", "code" => "445302103000"},
      %{"name" => "前锋镇", "code" => "445302105000"},
      %{"name" => "南盛镇", "code" => "445302106000"}
    ]

  def next(input) when input == "普宁市" or input == "445281",
    do: [
      %{"name" => "流沙东街道", "code" => "445281001000"},
      %{"name" => "流沙南街道", "code" => "445281002000"},
      %{"name" => "流沙西街道", "code" => "445281003000"},
      %{"name" => "流沙北街道", "code" => "445281004000"},
      %{"name" => "池尾街道", "code" => "445281005000"},
      %{"name" => "燎原街道", "code" => "445281006000"},
      %{"name" => "大南山街道", "code" => "445281007000"},
      %{"name" => "赤岗镇", "code" => "445281102000"},
      %{"name" => "大坝镇", "code" => "445281103000"},
      %{"name" => "洪阳镇", "code" => "445281104000"},
      %{"name" => "南溪镇", "code" => "445281105000"},
      %{"name" => "广太镇", "code" => "445281106000"},
      %{"name" => "麒麟镇", "code" => "445281107000"},
      %{"name" => "南径镇", "code" => "445281108000"},
      %{"name" => "占陇镇", "code" => "445281109000"},
      %{"name" => "军埠镇", "code" => "445281110000"},
      %{"name" => "下架山镇", "code" => "445281111000"},
      %{"name" => "高埔镇", "code" => "445281113000"},
      %{"name" => "云落镇", "code" => "445281114000"},
      %{"name" => "大坪镇", "code" => "445281115000"},
      %{"name" => "船埔镇", "code" => "445281116000"},
      %{"name" => "梅林镇", "code" => "445281117000"},
      %{"name" => "里湖镇", "code" => "445281119000"},
      %{"name" => "梅塘镇", "code" => "445281121000"},
      %{"name" => "普侨镇", "code" => "445281123000"},
      %{"name" => "后溪乡", "code" => "445281201000"},
      %{"name" => "大池农场", "code" => "445281401000"},
      %{"name" => "马鞍山农场", "code" => "445281402000"},
      %{"name" => "大坪农场", "code" => "445281403000"},
      %{"name" => "三坑农场", "code" => "445281405000"},
      %{"name" => "乌石农场", "code" => "445281406000"},
      %{"name" => "科技工业园", "code" => "445281407000"},
      %{"name" => "普宁产业转移工业园", "code" => "445281408000"}
    ]

  def next(input) when input == "惠来县" or input == "445224",
    do: [
      %{"name" => "惠城镇", "code" => "445224100000"},
      %{"name" => "华湖镇", "code" => "445224102000"},
      %{"name" => "仙庵镇", "code" => "445224103000"},
      %{"name" => "靖海镇", "code" => "445224104000"},
      %{"name" => "周田镇", "code" => "445224105000"},
      %{"name" => "前詹镇", "code" => "445224106000"},
      %{"name" => "神泉镇", "code" => "445224107000"},
      %{"name" => "东陇镇", "code" => "445224108000"},
      %{"name" => "岐石镇", "code" => "445224109000"},
      %{"name" => "隆江镇", "code" => "445224110000"},
      %{"name" => "溪西镇", "code" => "445224111000"},
      %{"name" => "鳌江镇", "code" => "445224112000"},
      %{"name" => "东港镇", "code" => "445224113000"},
      %{"name" => "葵潭镇", "code" => "445224114000"},
      %{"name" => "侨园镇", "code" => "445224115000"},
      %{"name" => "东埔农场", "code" => "445224401000"},
      %{"name" => "葵潭农场", "code" => "445224403000"},
      %{"name" => "青坑林场", "code" => "445224404000"},
      %{"name" => "揭阳（惠来）沿海经济开发试验区", "code" => "445224450000"}
    ]

  def next(input) when input == "揭西县" or input == "445222",
    do: [
      %{"name" => "河婆街道", "code" => "445222001000"},
      %{"name" => "龙潭镇", "code" => "445222102000"},
      %{"name" => "南山镇", "code" => "445222103000"},
      %{"name" => "五经富镇", "code" => "445222104000"},
      %{"name" => "京溪园镇", "code" => "445222105000"},
      %{"name" => "灰寨镇", "code" => "445222106000"},
      %{"name" => "塔头镇", "code" => "445222107000"},
      %{"name" => "东园镇", "code" => "445222108000"},
      %{"name" => "凤江镇", "code" => "445222109000"},
      %{"name" => "棉湖镇", "code" => "445222110000"},
      %{"name" => "金和镇", "code" => "445222111000"},
      %{"name" => "大溪镇", "code" => "445222112000"},
      %{"name" => "钱坑镇", "code" => "445222113000"},
      %{"name" => "坪上镇", "code" => "445222114000"},
      %{"name" => "五云镇", "code" => "445222115000"},
      %{"name" => "上砂镇", "code" => "445222116000"},
      %{"name" => "良田乡", "code" => "445222201000"},
      %{"name" => "北山农林场", "code" => "445222401000"},
      %{"name" => "果林场", "code" => "445222402000"},
      %{"name" => "油桐林场", "code" => "445222403000"},
      %{"name" => "高田农场", "code" => "445222404000"},
      %{"name" => "河輋农场", "code" => "445222405000"},
      %{"name" => "县苗圃场", "code" => "445222406000"}
    ]

  def next(input) when input == "揭东区" or input == "445203",
    do: [
      %{"name" => "曲溪街道", "code" => "445203001000"},
      %{"name" => "磐东街道", "code" => "445203002000"},
      %{"name" => "云路镇", "code" => "445203102000"},
      %{"name" => "玉窖镇", "code" => "445203103000"},
      %{"name" => "锡场镇", "code" => "445203104000"},
      %{"name" => "新亨镇", "code" => "445203105000"},
      %{"name" => "玉湖镇", "code" => "445203106000"},
      %{"name" => "埔田镇", "code" => "445203107000"},
      %{"name" => "霖磐镇", "code" => "445203108000"},
      %{"name" => "月城镇", "code" => "445203109000"},
      %{"name" => "白塔镇", "code" => "445203110000"},
      %{"name" => "龙尾镇", "code" => "445203111000"},
      %{"name" => "桂岭镇", "code" => "445203112000"},
      %{"name" => "东径茶场", "code" => "445203401000"},
      %{"name" => "坪上农场", "code" => "445203402000"},
      %{"name" => "揭阳高新技术产业开发区", "code" => "445203403000"},
      %{"name" => "卅岭农场", "code" => "445203404000"},
      %{"name" => "蓝城区工业园区管理处", "code" => "445203405000"},
      %{"name" => "珠海（揭阳）产业转移工业园", "code" => "445203406000"}
    ]

  def next(input) when input == "榕城区" or input == "445202",
    do: [
      %{"name" => "榕华街道", "code" => "445202001000"},
      %{"name" => "新兴街道", "code" => "445202002000"},
      %{"name" => "中山街道", "code" => "445202003000"},
      %{"name" => "西马街道", "code" => "445202004000"},
      %{"name" => "东兴街道", "code" => "445202005000"},
      %{"name" => "榕东街道", "code" => "445202006000"},
      %{"name" => "仙桥街道", "code" => "445202007000"},
      %{"name" => "梅云街道", "code" => "445202008000"},
      %{"name" => "东升街道", "code" => "445202009000"},
      %{"name" => "东阳街道", "code" => "445202010000"},
      %{"name" => "渔湖街道", "code" => "445202011000"},
      %{"name" => "炮台镇", "code" => "445202102000"},
      %{"name" => "地都镇", "code" => "445202103000"},
      %{"name" => "登岗镇", "code" => "445202105000"}
    ]

  def next(input) when input == "饶平县" or input == "445122",
    do: [
      %{"name" => "黄冈镇", "code" => "445122100000"},
      %{"name" => "上饶镇", "code" => "445122102000"},
      %{"name" => "饶洋镇", "code" => "445122103000"},
      %{"name" => "新丰镇", "code" => "445122104000"},
      %{"name" => "建饶镇", "code" => "445122106000"},
      %{"name" => "三饶镇", "code" => "445122107000"},
      %{"name" => "新塘镇", "code" => "445122108000"},
      %{"name" => "汤溪镇", "code" => "445122109000"},
      %{"name" => "浮滨镇", "code" => "445122110000"},
      %{"name" => "浮山镇", "code" => "445122112000"},
      %{"name" => "东山镇", "code" => "445122113000"},
      %{"name" => "新圩镇", "code" => "445122114000"},
      %{"name" => "樟溪镇", "code" => "445122116000"},
      %{"name" => "钱东镇", "code" => "445122117000"},
      %{"name" => "高堂镇", "code" => "445122118000"},
      %{"name" => "联饶镇", "code" => "445122119000"},
      %{"name" => "所城镇", "code" => "445122120000"},
      %{"name" => "大埕镇", "code" => "445122121000"},
      %{"name" => "柘林镇", "code" => "445122122000"},
      %{"name" => "汫洲镇", "code" => "445122123000"},
      %{"name" => "海山镇", "code" => "445122124000"}
    ]

  def next(input) when input == "潮安区" or input == "445103",
    do: [
      %{"name" => "古巷镇", "code" => "445103100000"},
      %{"name" => "登塘镇", "code" => "445103101000"},
      %{"name" => "凤塘镇", "code" => "445103103000"},
      %{"name" => "浮洋镇", "code" => "445103104000"},
      %{"name" => "龙湖镇", "code" => "445103105000"},
      %{"name" => "金石镇", "code" => "445103106000"},
      %{"name" => "沙溪镇", "code" => "445103107000"},
      %{"name" => "彩塘镇", "code" => "445103108000"},
      %{"name" => "东凤镇", "code" => "445103109000"},
      %{"name" => "庵埠镇", "code" => "445103110000"},
      %{"name" => "江东镇", "code" => "445103114000"},
      %{"name" => "归湖镇", "code" => "445103115000"},
      %{"name" => "文祠镇", "code" => "445103116000"},
      %{"name" => "凤凰镇", "code" => "445103117000"},
      %{"name" => "赤凤镇", "code" => "445103120000"},
      %{"name" => "枫溪镇", "code" => "445103121000"},
      %{"name" => "万峰林场", "code" => "445103400000"},
      %{"name" => "广东潮安经济开发区", "code" => "445103450000"}
    ]

  def next(input) when input == "湘桥区" or input == "445102",
    do: [
      %{"name" => "桥东街道", "code" => "445102007000"},
      %{"name" => "城西街道", "code" => "445102008000"},
      %{"name" => "凤新街道", "code" => "445102009000"},
      %{"name" => "太平街道", "code" => "445102010000"},
      %{"name" => "西新街道", "code" => "445102011000"},
      %{"name" => "意溪镇", "code" => "445102100000"},
      %{"name" => "磷溪镇", "code" => "445102111000"},
      %{"name" => "铁铺镇", "code" => "445102112000"},
      %{"name" => "官塘镇", "code" => "445102113000"},
      %{"name" => "红山林场", "code" => "445102400000"},
      %{"name" => "开发区", "code" => "445102401000"},
      %{"name" => "潮州市凤泉湖高新技术产业开发区", "code" => "445102402000"}
    ]

  def next(input) when input == "中山市" or input == "442000",
    do: [
      %{"name" => "石岐街道", "code" => "442000001000"},
      %{"name" => "东区街道", "code" => "442000002000"},
      %{"name" => "中山港街道", "code" => "442000003000"},
      %{"name" => "西区街道", "code" => "442000004000"},
      %{"name" => "南区街道", "code" => "442000005000"},
      %{"name" => "五桂山街道", "code" => "442000006000"},
      %{"name" => "民众街道", "code" => "442000007000"},
      %{"name" => "南朗街道", "code" => "442000008000"},
      %{"name" => "黄圃镇", "code" => "442000101000"},
      %{"name" => "东凤镇", "code" => "442000103000"},
      %{"name" => "古镇镇", "code" => "442000105000"},
      %{"name" => "沙溪镇", "code" => "442000106000"},
      %{"name" => "坦洲镇", "code" => "442000107000"},
      %{"name" => "港口镇", "code" => "442000108000"},
      %{"name" => "三角镇", "code" => "442000109000"},
      %{"name" => "横栏镇", "code" => "442000110000"},
      %{"name" => "南头镇", "code" => "442000111000"},
      %{"name" => "阜沙镇", "code" => "442000112000"},
      %{"name" => "三乡镇", "code" => "442000114000"},
      %{"name" => "板芙镇", "code" => "442000115000"},
      %{"name" => "大涌镇", "code" => "442000116000"},
      %{"name" => "神湾镇", "code" => "442000117000"},
      %{"name" => "小榄镇", "code" => "442000118000"}
    ]

  def next(input) when input == "东莞市" or input == "441900",
    do: [
      %{"name" => "东城街道", "code" => "441900003000"},
      %{"name" => "南城街道", "code" => "441900004000"},
      %{"name" => "万江街道", "code" => "441900005000"},
      %{"name" => "莞城街道", "code" => "441900006000"},
      %{"name" => "石碣镇", "code" => "441900101000"},
      %{"name" => "石龙镇", "code" => "441900102000"},
      %{"name" => "茶山镇", "code" => "441900103000"},
      %{"name" => "石排镇", "code" => "441900104000"},
      %{"name" => "企石镇", "code" => "441900105000"},
      %{"name" => "横沥镇", "code" => "441900106000"},
      %{"name" => "桥头镇", "code" => "441900107000"},
      %{"name" => "谢岗镇", "code" => "441900108000"},
      %{"name" => "东坑镇", "code" => "441900109000"},
      %{"name" => "常平镇", "code" => "441900110000"},
      %{"name" => "寮步镇", "code" => "441900111000"},
      %{"name" => "樟木头镇", "code" => "441900112000"},
      %{"name" => "大朗镇", "code" => "441900113000"},
      %{"name" => "黄江镇", "code" => "441900114000"},
      %{"name" => "清溪镇", "code" => "441900115000"},
      %{"name" => "塘厦镇", "code" => "441900116000"},
      %{"name" => "凤岗镇", "code" => "441900117000"},
      %{"name" => "大岭山镇", "code" => "441900118000"},
      %{"name" => "长安镇", "code" => "441900119000"},
      %{"name" => "虎门镇", "code" => "441900121000"},
      %{"name" => "厚街镇", "code" => "441900122000"},
      %{"name" => "沙田镇", "code" => "441900123000"},
      %{"name" => "道滘镇", "code" => "441900124000"},
      %{"name" => "洪梅镇", "code" => "441900125000"},
      %{"name" => "麻涌镇", "code" => "441900126000"},
      %{"name" => "望牛墩镇", "code" => "441900127000"},
      %{"name" => "中堂镇", "code" => "441900128000"},
      %{"name" => "高埗镇", "code" => "441900129000"},
      %{"name" => "松山湖", "code" => "441900401000"},
      %{"name" => "东莞港", "code" => "441900402000"},
      %{"name" => "东莞生态园", "code" => "441900403000"},
      %{"name" => "东莞滨海湾新区", "code" => "441900404000"}
    ]

  def next(input) when input == "连州市" or input == "441882",
    do: [
      %{"name" => "连州镇", "code" => "441882100000"},
      %{"name" => "星子镇", "code" => "441882101000"},
      %{"name" => "大路边镇", "code" => "441882102000"},
      %{"name" => "龙坪镇", "code" => "441882103000"},
      %{"name" => "西岸镇", "code" => "441882104000"},
      %{"name" => "保安镇", "code" => "441882105000"},
      %{"name" => "丰阳镇", "code" => "441882106000"},
      %{"name" => "东陂镇", "code" => "441882107000"},
      %{"name" => "九陂镇", "code" => "441882109000"},
      %{"name" => "西江镇", "code" => "441882118000"},
      %{"name" => "瑶安瑶族乡", "code" => "441882200000"},
      %{"name" => "三水瑶族乡", "code" => "441882201000"}
    ]

  def next(input) when input == "英德市" or input == "441881",
    do: [
      %{"name" => "英城街道", "code" => "441881001000"},
      %{"name" => "沙口镇", "code" => "441881101000"},
      %{"name" => "望埠镇", "code" => "441881102000"},
      %{"name" => "横石水镇", "code" => "441881103000"},
      %{"name" => "桥头镇", "code" => "441881105000"},
      %{"name" => "青塘镇", "code" => "441881106000"},
      %{"name" => "白沙镇", "code" => "441881108000"},
      %{"name" => "大站镇", "code" => "441881109000"},
      %{"name" => "西牛镇", "code" => "441881110000"},
      %{"name" => "九龙镇", "code" => "441881111000"},
      %{"name" => "浛洸镇", "code" => "441881112000"},
      %{"name" => "大湾镇", "code" => "441881114000"},
      %{"name" => "石灰铺镇", "code" => "441881115000"},
      %{"name" => "石牯塘镇", "code" => "441881116000"},
      %{"name" => "下石太镇", "code" => "441881120000"},
      %{"name" => "波罗镇", "code" => "441881124000"},
      %{"name" => "横石塘镇", "code" => "441881125000"},
      %{"name" => "大洞镇", "code" => "441881126000"},
      %{"name" => "连江口镇", "code" => "441881129000"},
      %{"name" => "黎溪镇", "code" => "441881130000"},
      %{"name" => "水边镇", "code" => "441881131000"},
      %{"name" => "英红镇", "code" => "441881136000"},
      %{"name" => "东华镇", "code" => "441881137000"},
      %{"name" => "黄花镇", "code" => "441881138000"}
    ]

  def next(input) when input == "连南瑶族自治县" or input == "441826",
    do: [
      %{"name" => "三江镇", "code" => "441826100000"},
      %{"name" => "大麦山镇", "code" => "441826101000"},
      %{"name" => "寨岗镇", "code" => "441826102000"},
      %{"name" => "三排镇", "code" => "441826105000"},
      %{"name" => "涡水镇", "code" => "441826106000"},
      %{"name" => "大坪镇", "code" => "441826108000"},
      %{"name" => "香坪镇", "code" => "441826109000"}
    ]

  def next(input) when input == "连山壮族瑶族自治县" or input == "441825",
    do: [
      %{"name" => "永和镇", "code" => "441825100000"},
      %{"name" => "吉田镇", "code" => "441825104000"},
      %{"name" => "太保镇", "code" => "441825105000"},
      %{"name" => "禾洞镇", "code" => "441825106000"},
      %{"name" => "福堂镇", "code" => "441825108000"},
      %{"name" => "小三江镇", "code" => "441825109000"},
      %{"name" => "上帅镇", "code" => "441825111000"},
      %{"name" => "连山林场", "code" => "441825450000"},
      %{"name" => "禾洞农林场", "code" => "441825451000"}
    ]

  def next(input) when input == "阳山县" or input == "441823",
    do: [
      %{"name" => "青莲镇", "code" => "441823100000"},
      %{"name" => "江英镇", "code" => "441823101000"},
      %{"name" => "杜步镇", "code" => "441823104000"},
      %{"name" => "七拱镇", "code" => "441823105000"},
      %{"name" => "太平镇", "code" => "441823107000"},
      %{"name" => "杨梅镇", "code" => "441823108000"},
      %{"name" => "大崀镇", "code" => "441823110000"},
      %{"name" => "小江镇", "code" => "441823111000"},
      %{"name" => "岭背镇", "code" => "441823113000"},
      %{"name" => "黄坌镇", "code" => "441823115000"},
      %{"name" => "黎埠镇", "code" => "441823116000"},
      %{"name" => "阳城镇", "code" => "441823119000"},
      %{"name" => "秤架瑶族乡", "code" => "441823201000"}
    ]

  def next(input) when input == "佛冈县" or input == "441821",
    do: [
      %{"name" => "石角镇", "code" => "441821100000"},
      %{"name" => "水头镇", "code" => "441821101000"},
      %{"name" => "汤塘镇", "code" => "441821102000"},
      %{"name" => "龙山镇", "code" => "441821103000"},
      %{"name" => "高岗镇", "code" => "441821104000"},
      %{"name" => "迳头镇", "code" => "441821107000"},
      %{"name" => "清远市羊角山林场", "code" => "441821400000"},
      %{"name" => "广东佛冈观音山省级自然保护区", "code" => "441821401000"}
    ]

  def next(input) when input == "清新区" or input == "441803",
    do: [
      %{"name" => "太和镇", "code" => "441803102000"},
      %{"name" => "太平镇", "code" => "441803104000"},
      %{"name" => "山塘镇", "code" => "441803105000"},
      %{"name" => "三坑镇", "code" => "441803106000"},
      %{"name" => "龙颈镇", "code" => "441803112000"},
      %{"name" => "禾云镇", "code" => "441803113000"},
      %{"name" => "浸潭镇", "code" => "441803117000"},
      %{"name" => "石潭镇", "code" => "441803118000"},
      %{"name" => "笔架林场", "code" => "441803450000"}
    ]

  def next(input) when input == "清城区" or input == "441802",
    do: [
      %{"name" => "凤城街道", "code" => "441802006000"},
      %{"name" => "东城街道", "code" => "441802007000"},
      %{"name" => "洲心街道", "code" => "441802008000"},
      %{"name" => "横荷街道", "code" => "441802009000"},
      %{"name" => "源潭镇", "code" => "441802103000"},
      %{"name" => "龙塘镇", "code" => "441802105000"},
      %{"name" => "石角镇", "code" => "441802106000"},
      %{"name" => "飞来峡镇", "code" => "441802107000"},
      %{"name" => "清远市高新技术产业开发区", "code" => "441802400000"},
      %{"name" => "清远市国营银盏林场", "code" => "441802450000"}
    ]

  def next(input) when input == "阳春市" or input == "441781",
    do: [
      %{"name" => "春城街道", "code" => "441781001000"},
      %{"name" => "河西街道", "code" => "441781002000"},
      %{"name" => "河朗镇", "code" => "441781101000"},
      %{"name" => "松柏镇", "code" => "441781102000"},
      %{"name" => "石望镇", "code" => "441781103000"},
      %{"name" => "春湾镇", "code" => "441781105000"},
      %{"name" => "合水镇", "code" => "441781106000"},
      %{"name" => "陂面镇", "code" => "441781107000"},
      %{"name" => "圭岗镇", "code" => "441781108000"},
      %{"name" => "永宁镇", "code" => "441781109000"},
      %{"name" => "马水镇", "code" => "441781110000"},
      %{"name" => "岗美镇", "code" => "441781111000"},
      %{"name" => "河口镇", "code" => "441781112000"},
      %{"name" => "潭水镇", "code" => "441781113000"},
      %{"name" => "三甲镇", "code" => "441781114000"},
      %{"name" => "双窖镇", "code" => "441781116000"},
      %{"name" => "八甲镇", "code" => "441781117000"},
      %{"name" => "石录矿区", "code" => "441781403000"},
      %{"name" => "花滩林场", "code" => "441781404000"},
      %{"name" => "东湖林场", "code" => "441781405000"},
      %{"name" => "河尾山林场", "code" => "441781406000"},
      %{"name" => "南山矿", "code" => "441781407000"},
      %{"name" => "阳春监狱", "code" => "441781408000"},
      %{"name" => "硫铁矿", "code" => "441781410000"}
    ]

  def next(input) when input == "阳西县" or input == "441721",
    do: [
      %{"name" => "织篢镇", "code" => "441721100000"},
      %{"name" => "程村镇", "code" => "441721101000"},
      %{"name" => "塘口镇", "code" => "441721102000"},
      %{"name" => "上洋镇", "code" => "441721103000"},
      %{"name" => "溪头镇", "code" => "441721104000"},
      %{"name" => "沙扒镇", "code" => "441721105000"},
      %{"name" => "儒洞镇", "code" => "441721106000"},
      %{"name" => "新圩镇", "code" => "441721107000"},
      %{"name" => "阳江林场儒洞分场", "code" => "441721502000"}
    ]

  def next(input) when input == "阳东区" or input == "441704",
    do: [
      %{"name" => "东城镇", "code" => "441704100000"},
      %{"name" => "北惯镇", "code" => "441704101000"},
      %{"name" => "那龙镇", "code" => "441704102000"},
      %{"name" => "东平镇", "code" => "441704103000"},
      %{"name" => "雅韶镇", "code" => "441704104000"},
      %{"name" => "大沟镇", "code" => "441704105000"},
      %{"name" => "新洲镇", "code" => "441704106000"},
      %{"name" => "合山镇", "code" => "441704107000"},
      %{"name" => "塘坪镇", "code" => "441704108000"},
      %{"name" => "大八镇", "code" => "441704109000"},
      %{"name" => "红丰镇", "code" => "441704110000"},
      %{"name" => "阳江监狱", "code" => "441704400000"},
      %{"name" => "阳江林场宝山分场", "code" => "441704501000"},
      %{"name" => "阳江林场田畔分场", "code" => "441704502000"},
      %{"name" => "阳东原种场", "code" => "441704503000"},
      %{"name" => "阳东林场", "code" => "441704504000"},
      %{"name" => "阳江林场东岸分场", "code" => "441704505000"}
    ]

  def next(input) when input == "江城区" or input == "441702",
    do: [
      %{"name" => "南恩街道", "code" => "441702001000"},
      %{"name" => "城南街道", "code" => "441702002000"},
      %{"name" => "城北街道", "code" => "441702003000"},
      %{"name" => "中洲街道", "code" => "441702004000"},
      %{"name" => "城东街道", "code" => "441702006000"},
      %{"name" => "岗列街道", "code" => "441702008000"},
      %{"name" => "城西街道", "code" => "441702009000"},
      %{"name" => "白沙街道", "code" => "441702011000"},
      %{"name" => "埠场镇", "code" => "441702102000"},
      %{"name" => "平冈镇", "code" => "441702103000"},
      %{"name" => "闸坡镇", "code" => "441702105000"},
      %{"name" => "双捷镇", "code" => "441702106000"},
      %{"name" => "阳江林场罗琴分场", "code" => "441702401000"}
    ]

  def next(input) when input == "东源县" or input == "441625",
    do: [
      %{"name" => "仙塘镇", "code" => "441625100000"},
      %{"name" => "灯塔镇", "code" => "441625101000"},
      %{"name" => "骆湖镇", "code" => "441625102000"},
      %{"name" => "船塘镇", "code" => "441625103000"},
      %{"name" => "顺天镇", "code" => "441625104000"},
      %{"name" => "上莞镇", "code" => "441625105000"},
      %{"name" => "曾田镇", "code" => "441625106000"},
      %{"name" => "柳城镇", "code" => "441625107000"},
      %{"name" => "义合镇", "code" => "441625108000"},
      %{"name" => "蓝口镇", "code" => "441625109000"},
      %{"name" => "黄田镇", "code" => "441625110000"},
      %{"name" => "叶潭镇", "code" => "441625111000"},
      %{"name" => "黄村镇", "code" => "441625112000"},
      %{"name" => "康禾镇", "code" => "441625113000"},
      %{"name" => "锡场镇", "code" => "441625114000"},
      %{"name" => "新港镇", "code" => "441625115000"},
      %{"name" => "双江镇", "code" => "441625116000"},
      %{"name" => "涧头镇", "code" => "441625117000"},
      %{"name" => "新回龙镇", "code" => "441625121000"},
      %{"name" => "半江镇", "code" => "441625122000"},
      %{"name" => "漳溪乡", "code" => "441625200000"}
    ]

  def next(input) when input == "和平县" or input == "441624",
    do: [
      %{"name" => "阳明镇", "code" => "441624100000"},
      %{"name" => "大坝镇", "code" => "441624101000"},
      %{"name" => "长塘镇", "code" => "441624102000"},
      %{"name" => "下车镇", "code" => "441624103000"},
      %{"name" => "上陵镇", "code" => "441624104000"},
      %{"name" => "优胜镇", "code" => "441624105000"},
      %{"name" => "贝墩镇", "code" => "441624106000"},
      %{"name" => "古寨镇", "code" => "441624107000"},
      %{"name" => "彭寨镇", "code" => "441624108000"},
      %{"name" => "合水镇", "code" => "441624109000"},
      %{"name" => "公白镇", "code" => "441624110000"},
      %{"name" => "青州镇", "code" => "441624111000"},
      %{"name" => "浰源镇", "code" => "441624112000"},
      %{"name" => "热水镇", "code" => "441624113000"},
      %{"name" => "东水镇", "code" => "441624114000"},
      %{"name" => "礼士镇", "code" => "441624115000"},
      %{"name" => "林寨镇", "code" => "441624116000"}
    ]

  def next(input) when input == "连平县" or input == "441623",
    do: [
      %{"name" => "元善镇", "code" => "441623100000"},
      %{"name" => "上坪镇", "code" => "441623101000"},
      %{"name" => "内莞镇", "code" => "441623102000"},
      %{"name" => "陂头镇", "code" => "441623104000"},
      %{"name" => "溪山镇", "code" => "441623105000"},
      %{"name" => "隆街镇", "code" => "441623107000"},
      %{"name" => "田源镇", "code" => "441623108000"},
      %{"name" => "油溪镇", "code" => "441623109000"},
      %{"name" => "忠信镇", "code" => "441623110000"},
      %{"name" => "高莞镇", "code" => "441623111000"},
      %{"name" => "大湖镇", "code" => "441623113000"},
      %{"name" => "三角镇", "code" => "441623114000"},
      %{"name" => "绣缎镇", "code" => "441623115000"}
    ]

  def next(input) when input == "龙川县" or input == "441622",
    do: [
      %{"name" => "老隆镇", "code" => "441622100000"},
      %{"name" => "义都镇", "code" => "441622102000"},
      %{"name" => "佗城镇", "code" => "441622103000"},
      %{"name" => "鹤市镇", "code" => "441622104000"},
      %{"name" => "黄布镇", "code" => "441622105000"},
      %{"name" => "紫市镇", "code" => "441622106000"},
      %{"name" => "通衢镇", "code" => "441622107000"},
      %{"name" => "登云镇", "code" => "441622109000"},
      %{"name" => "丰稔镇", "code" => "441622110000"},
      %{"name" => "四都镇", "code" => "441622111000"},
      %{"name" => "铁场镇", "code" => "441622112000"},
      %{"name" => "龙母镇", "code" => "441622114000"},
      %{"name" => "田心镇", "code" => "441622115000"},
      %{"name" => "黎咀镇", "code" => "441622116000"},
      %{"name" => "黄石镇", "code" => "441622117000"},
      %{"name" => "赤光镇", "code" => "441622118000"},
      %{"name" => "廻龙镇", "code" => "441622119000"},
      %{"name" => "新田镇", "code" => "441622120000"},
      %{"name" => "车田镇", "code" => "441622121000"},
      %{"name" => "岩镇镇", "code" => "441622123000"},
      %{"name" => "麻布岗镇", "code" => "441622124000"},
      %{"name" => "贝岭镇", "code" => "441622125000"},
      %{"name" => "细坳镇", "code" => "441622126000"},
      %{"name" => "上坪镇", "code" => "441622127000"}
    ]

  def next(input) when input == "紫金县" or input == "441621",
    do: [
      %{"name" => "紫城镇", "code" => "441621100000"},
      %{"name" => "龙窝镇", "code" => "441621102000"},
      %{"name" => "九和镇", "code" => "441621103000"},
      %{"name" => "上义镇", "code" => "441621104000"},
      %{"name" => "蓝塘镇", "code" => "441621105000"},
      %{"name" => "凤安镇", "code" => "441621106000"},
      %{"name" => "义容镇", "code" => "441621107000"},
      %{"name" => "古竹镇", "code" => "441621108000"},
      %{"name" => "临江镇", "code" => "441621109000"},
      %{"name" => "柏埔镇", "code" => "441621110000"},
      %{"name" => "黄塘镇", "code" => "441621111000"},
      %{"name" => "敬梓镇", "code" => "441621112000"},
      %{"name" => "水墩镇", "code" => "441621114000"},
      %{"name" => "南岭镇", "code" => "441621115000"},
      %{"name" => "苏区镇", "code" => "441621116000"},
      %{"name" => "瓦溪镇", "code" => "441621117000"},
      %{"name" => "好义镇", "code" => "441621118000"},
      %{"name" => "中坝镇", "code" => "441621119000"}
    ]

  def next(input) when input == "源城区" or input == "441602",
    do: [
      %{"name" => "上城街道", "code" => "441602001000"},
      %{"name" => "新江街道", "code" => "441602002000"},
      %{"name" => "东埔街道", "code" => "441602003000"},
      %{"name" => "源西街道", "code" => "441602004000"},
      %{"name" => "高埔岗街道", "code" => "441602005000"},
      %{"name" => "城东街道", "code" => "441602006000"},
      %{"name" => "源南镇", "code" => "441602100000"},
      %{"name" => "埔前镇", "code" => "441602101000"}
    ]

  def next(input) when input == "陆丰市" or input == "441581",
    do: [
      %{"name" => "东海街道", "code" => "441581001000"},
      %{"name" => "河西街道", "code" => "441581002000"},
      %{"name" => "城东街道", "code" => "441581003000"},
      %{"name" => "甲子镇", "code" => "441581101000"},
      %{"name" => "碣石镇", "code" => "441581102000"},
      %{"name" => "湖东镇", "code" => "441581103000"},
      %{"name" => "大安镇", "code" => "441581104000"},
      %{"name" => "博美镇", "code" => "441581105000"},
      %{"name" => "内湖镇", "code" => "441581106000"},
      %{"name" => "南塘镇", "code" => "441581107000"},
      %{"name" => "陂洋镇", "code" => "441581108000"},
      %{"name" => "八万镇", "code" => "441581109000"},
      %{"name" => "金厢镇", "code" => "441581110000"},
      %{"name" => "潭西镇", "code" => "441581111000"},
      %{"name" => "甲东镇", "code" => "441581112000"},
      %{"name" => "河东镇", "code" => "441581115000"},
      %{"name" => "上英镇", "code" => "441581116000"},
      %{"name" => "桥冲镇", "code" => "441581117000"},
      %{"name" => "甲西镇", "code" => "441581118000"},
      %{"name" => "西南镇", "code" => "441581119000"},
      %{"name" => "华侨管理区", "code" => "441581400000"},
      %{"name" => "铜锣湖农场", "code" => "441581450000"},
      %{"name" => "星都经济开发试验区", "code" => "441581451000"},
      %{"name" => "大安农场", "code" => "441581452000"},
      %{"name" => "罗经嶂林场", "code" => "441581453000"},
      %{"name" => "湖东林场", "code" => "441581454000"},
      %{"name" => "东海岸林场", "code" => "441581455000"},
      %{"name" => "红岭林场", "code" => "441581456000"},
      %{"name" => "畜牧果林场", "code" => "441581457000"}
    ]

  def next(input) when input == "陆河县" or input == "441523",
    do: [
      %{"name" => "河田镇", "code" => "441523100000"},
      %{"name" => "水唇镇", "code" => "441523101000"},
      %{"name" => "河口镇", "code" => "441523102000"},
      %{"name" => "新田镇", "code" => "441523103000"},
      %{"name" => "上护镇", "code" => "441523104000"},
      %{"name" => "螺溪镇", "code" => "441523105000"},
      %{"name" => "东坑镇", "code" => "441523106000"},
      %{"name" => "南万镇", "code" => "441523107000"}
    ]

  def next(input) when input == "海丰县" or input == "441521",
    do: [
      %{"name" => "梅陇镇", "code" => "441521101000"},
      %{"name" => "小漠镇", "code" => "441521102000"},
      %{"name" => "鹅埠镇", "code" => "441521103000"},
      %{"name" => "赤石镇", "code" => "441521104000"},
      %{"name" => "鮜门镇", "code" => "441521105000"},
      %{"name" => "联安镇", "code" => "441521106000"},
      %{"name" => "陶河镇", "code" => "441521107000"},
      %{"name" => "赤坑镇", "code" => "441521108000"},
      %{"name" => "大湖镇", "code" => "441521109000"},
      %{"name" => "可塘镇", "code" => "441521110000"},
      %{"name" => "黄羌镇", "code" => "441521112000"},
      %{"name" => "平东镇", "code" => "441521113000"},
      %{"name" => "海城镇", "code" => "441521115000"},
      %{"name" => "公平镇", "code" => "441521118000"},
      %{"name" => "附城镇", "code" => "441521119000"},
      %{"name" => "城东镇", "code" => "441521120000"}
    ]

  def next(input) when input == "城区" or input == "441502",
    do: [
      %{"name" => "新港街道", "code" => "441502001000"},
      %{"name" => "香洲街道", "code" => "441502002000"},
      %{"name" => "凤山街道", "code" => "441502003000"},
      %{"name" => "田墘街道", "code" => "441502004000"},
      %{"name" => "东洲街道", "code" => "441502005000"},
      %{"name" => "遮浪街道", "code" => "441502006000"},
      %{"name" => "马宫街道", "code" => "441502007000"},
      %{"name" => "红草镇", "code" => "441502100000"},
      %{"name" => "东涌镇", "code" => "441502102000"},
      %{"name" => "捷胜镇", "code" => "441502103000"}
    ]

  def next(input) when input == "兴宁市" or input == "441481",
    do: [
      %{"name" => "兴田街道", "code" => "441481001000"},
      %{"name" => "福兴街道", "code" => "441481002000"},
      %{"name" => "宁新街道", "code" => "441481003000"},
      %{"name" => "宁中镇", "code" => "441481102000"},
      %{"name" => "新陂镇", "code" => "441481104000"},
      %{"name" => "刁坊镇", "code" => "441481105000"},
      %{"name" => "永和镇", "code" => "441481107000"},
      %{"name" => "径南镇", "code" => "441481108000"},
      %{"name" => "坭陂镇", "code" => "441481110000"},
      %{"name" => "新圩镇", "code" => "441481111000"},
      %{"name" => "水口镇", "code" => "441481112000"},
      %{"name" => "罗浮镇", "code" => "441481115000"},
      %{"name" => "罗岗镇", "code" => "441481116000"},
      %{"name" => "黄槐镇", "code" => "441481117000"},
      %{"name" => "黄陂镇", "code" => "441481118000"},
      %{"name" => "合水镇", "code" => "441481122000"},
      %{"name" => "龙田镇", "code" => "441481123000"},
      %{"name" => "石马镇", "code" => "441481124000"},
      %{"name" => "大坪镇", "code" => "441481125000"},
      %{"name" => "叶塘镇", "code" => "441481126000"}
    ]

  def next(input) when input == "蕉岭县" or input == "441427",
    do: [
      %{"name" => "蕉城镇", "code" => "441427100000"},
      %{"name" => "长潭镇", "code" => "441427102000"},
      %{"name" => "三圳镇", "code" => "441427103000"},
      %{"name" => "新铺镇", "code" => "441427104000"},
      %{"name" => "文福镇", "code" => "441427106000"},
      %{"name" => "广福镇", "code" => "441427107000"},
      %{"name" => "蓝坊镇", "code" => "441427108000"},
      %{"name" => "南礤镇", "code" => "441427110000"}
    ]

  def next(input) when input == "平远县" or input == "441426",
    do: [
      %{"name" => "大柘镇", "code" => "441426100000"},
      %{"name" => "石正镇", "code" => "441426101000"},
      %{"name" => "东石镇", "code" => "441426102000"},
      %{"name" => "仁居镇", "code" => "441426103000"},
      %{"name" => "八尺镇", "code" => "441426104000"},
      %{"name" => "差干镇", "code" => "441426105000"},
      %{"name" => "河头镇", "code" => "441426107000"},
      %{"name" => "中行镇", "code" => "441426108000"},
      %{"name" => "上举镇", "code" => "441426109000"},
      %{"name" => "泗水镇", "code" => "441426110000"},
      %{"name" => "长田镇", "code" => "441426114000"},
      %{"name" => "热柘镇", "code" => "441426115000"}
    ]

  def next(input) when input == "五华县" or input == "441424",
    do: [
      %{"name" => "水寨镇", "code" => "441424100000"},
      %{"name" => "河东镇", "code" => "441424101000"},
      %{"name" => "转水镇", "code" => "441424103000"},
      %{"name" => "华城镇", "code" => "441424104000"},
      %{"name" => "岐岭镇", "code" => "441424106000"},
      %{"name" => "潭下镇", "code" => "441424108000"},
      %{"name" => "长布镇", "code" => "441424109000"},
      %{"name" => "周江镇", "code" => "441424111000"},
      %{"name" => "横陂镇", "code" => "441424113000"},
      %{"name" => "郭田镇", "code" => "441424117000"},
      %{"name" => "双华镇", "code" => "441424118000"},
      %{"name" => "安流镇", "code" => "441424120000"},
      %{"name" => "棉洋镇", "code" => "441424123000"},
      %{"name" => "梅林镇", "code" => "441424125000"},
      %{"name" => "华阳镇", "code" => "441424126000"},
      %{"name" => "龙村镇", "code" => "441424127000"}
    ]

  def next(input) when input == "丰顺县" or input == "441423",
    do: [
      %{"name" => "汤坑镇", "code" => "441423100000"},
      %{"name" => "北斗镇", "code" => "441423103000"},
      %{"name" => "汤西镇", "code" => "441423104000"},
      %{"name" => "汤南镇", "code" => "441423105000"},
      %{"name" => "埔寨镇", "code" => "441423106000"},
      %{"name" => "八乡山镇", "code" => "441423108000"},
      %{"name" => "丰良镇", "code" => "441423109000"},
      %{"name" => "建桥镇", "code" => "441423110000"},
      %{"name" => "龙岗镇", "code" => "441423111000"},
      %{"name" => "潘田镇", "code" => "441423112000"},
      %{"name" => "黄金镇", "code" => "441423114000"},
      %{"name" => "留隍镇", "code" => "441423115000"},
      %{"name" => "大龙华镇", "code" => "441423118000"},
      %{"name" => "潭江镇", "code" => "441423120000"},
      %{"name" => "小胜镇", "code" => "441423122000"},
      %{"name" => "砂田镇", "code" => "441423123000"},
      %{"name" => "埔寨农场", "code" => "441423450000"}
    ]

  def next(input) when input == "大埔县" or input == "441422",
    do: [
      %{"name" => "湖寮镇", "code" => "441422100000"},
      %{"name" => "茶阳镇", "code" => "441422101000"},
      %{"name" => "高陂镇", "code" => "441422102000"},
      %{"name" => "青溪镇", "code" => "441422103000"},
      %{"name" => "三河镇", "code" => "441422105000"},
      %{"name" => "大麻镇", "code" => "441422107000"},
      %{"name" => "银江镇", "code" => "441422108000"},
      %{"name" => "洲瑞镇", "code" => "441422109000"},
      %{"name" => "光德镇", "code" => "441422112000"},
      %{"name" => "桃源镇", "code" => "441422113000"},
      %{"name" => "枫朗镇", "code" => "441422114000"},
      %{"name" => "百侯镇", "code" => "441422116000"},
      %{"name" => "大东镇", "code" => "441422117000"},
      %{"name" => "西河镇", "code" => "441422118000"},
      %{"name" => "丰溪林场", "code" => "441422400000"},
      %{"name" => "洲瑞林场", "code" => "441422401000"},
      %{"name" => "大埔林场", "code" => "441422402000"}
    ]

  def next(input) when input == "梅县区" or input == "441403",
    do: [
      %{"name" => "新城街道", "code" => "441403001000"},
      %{"name" => "松口镇", "code" => "441403100000"},
      %{"name" => "城东镇", "code" => "441403101000"},
      %{"name" => "石扇镇", "code" => "441403102000"},
      %{"name" => "梅西镇", "code" => "441403103000"},
      %{"name" => "大坪镇", "code" => "441403104000"},
      %{"name" => "石坑镇", "code" => "441403105000"},
      %{"name" => "南口镇", "code" => "441403106000"},
      %{"name" => "畲江镇", "code" => "441403107000"},
      %{"name" => "水车镇", "code" => "441403108000"},
      %{"name" => "梅南镇", "code" => "441403110000"},
      %{"name" => "雁洋镇", "code" => "441403111000"},
      %{"name" => "白渡镇", "code" => "441403112000"},
      %{"name" => "丙村镇", "code" => "441403113000"},
      %{"name" => "隆文镇", "code" => "441403114000"},
      %{"name" => "松源镇", "code" => "441403116000"},
      %{"name" => "桃尧镇", "code" => "441403118000"},
      %{"name" => "程江镇", "code" => "441403132000"},
      %{"name" => "扶大镇", "code" => "441403133000"},
      %{"name" => "梅西水库", "code" => "441403500000"}
    ]

  def next(input) when input == "梅江区" or input == "441402",
    do: [
      %{"name" => "江南街道", "code" => "441402004000"},
      %{"name" => "金山街道", "code" => "441402006000"},
      %{"name" => "西郊街道", "code" => "441402007000"},
      %{"name" => "三角镇", "code" => "441402102000"},
      %{"name" => "长沙镇", "code" => "441402103000"},
      %{"name" => "城北镇", "code" => "441402105000"},
      %{"name" => "西阳镇", "code" => "441402106000"}
    ]

  def next(input) when input == "龙门县" or input == "441324",
    do: [
      %{"name" => "龙城街道", "code" => "441324001000"},
      %{"name" => "平陵街道", "code" => "441324002000"},
      %{"name" => "麻榨镇", "code" => "441324100000"},
      %{"name" => "永汉镇", "code" => "441324101000"},
      %{"name" => "龙田镇", "code" => "441324115000"},
      %{"name" => "龙潭镇", "code" => "441324116000"},
      %{"name" => "地派镇", "code" => "441324117000"},
      %{"name" => "龙华镇", "code" => "441324118000"},
      %{"name" => "龙江镇", "code" => "441324119000"},
      %{"name" => "蓝田瑶族乡", "code" => "441324200000"},
      %{"name" => "龙门县密溪林场", "code" => "441324453000"},
      %{"name" => "南昆山生态旅游区", "code" => "441324570000"}
    ]

  def next(input) when input == "惠东县" or input == "441323",
    do: [
      %{"name" => "平山街道", "code" => "441323001000"},
      %{"name" => "大岭街道", "code" => "441323002000"},
      %{"name" => "白花镇", "code" => "441323102000"},
      %{"name" => "梁化镇", "code" => "441323103000"},
      %{"name" => "稔山镇", "code" => "441323104000"},
      %{"name" => "铁涌镇", "code" => "441323105000"},
      %{"name" => "平海镇", "code" => "441323106000"},
      %{"name" => "吉隆镇", "code" => "441323109000"},
      %{"name" => "黄埠镇", "code" => "441323110000"},
      %{"name" => "多祝镇", "code" => "441323113000"},
      %{"name" => "安墩镇", "code" => "441323115000"},
      %{"name" => "高潭镇", "code" => "441323118000"},
      %{"name" => "宝口镇", "code" => "441323120000"},
      %{"name" => "白盆珠镇", "code" => "441323121000"},
      %{"name" => "广东省惠州市国营惠东梁化林场", "code" => "441323450000"},
      %{"name" => "广东省惠州市国营惠东九龙峰林场", "code" => "441323451000"},
      %{"name" => "惠东县港口海龟湾自然保护区", "code" => "441323452000"},
      %{"name" => "莲花山白盆珠省级自然保护区", "code" => "441323453000"},
      %{"name" => "广东惠东古田省级自然保护区", "code" => "441323454000"},
      %{"name" => "惠东县珠三角产业转移园", "code" => "441323455000"},
      %{"name" => "巺寮滨海旅游度假区", "code" => "441323570000"}
    ]

  def next(input) when input == "博罗县" or input == "441322",
    do: [
      %{"name" => "罗阳街道", "code" => "441322001000"},
      %{"name" => "龙溪街道", "code" => "441322002000"},
      %{"name" => "石坝镇", "code" => "441322100000"},
      %{"name" => "麻陂镇", "code" => "441322102000"},
      %{"name" => "观音阁镇", "code" => "441322103000"},
      %{"name" => "公庄镇", "code" => "441322104000"},
      %{"name" => "杨村镇", "code" => "441322105000"},
      %{"name" => "柏塘镇", "code" => "441322106000"},
      %{"name" => "泰美镇", "code" => "441322108000"},
      %{"name" => "湖镇镇", "code" => "441322113000"},
      %{"name" => "长宁镇", "code" => "441322115000"},
      %{"name" => "福田镇", "code" => "441322116000"},
      %{"name" => "龙华镇", "code" => "441322117000"},
      %{"name" => "园洲镇", "code" => "441322119000"},
      %{"name" => "石湾镇", "code" => "441322121000"},
      %{"name" => "杨侨镇", "code" => "441322122000"},
      %{"name" => "横河镇", "code" => "441322123000"},
      %{"name" => "罗浮山管理区", "code" => "441322570000"}
    ]

  def next(input) when input == "惠阳区" or input == "441303",
    do: [
      %{"name" => "淡水街道", "code" => "441303001000"},
      %{"name" => "秋长街道", "code" => "441303002000"},
      %{"name" => "三和街道", "code" => "441303003000"},
      %{"name" => "大亚湾澳头街道", "code" => "441303006000"},
      %{"name" => "大亚湾霞涌街道", "code" => "441303007000"},
      %{"name" => "大亚湾西区街道", "code" => "441303008000"},
      %{"name" => "沙田镇", "code" => "441303101000"},
      %{"name" => "新圩镇", "code" => "441303103000"},
      %{"name" => "镇隆镇", "code" => "441303104000"},
      %{"name" => "永湖镇", "code" => "441303108000"},
      %{"name" => "良井镇", "code" => "441303109000"},
      %{"name" => "平潭镇", "code" => "441303110000"}
    ]

  def next(input) when input == "惠城区" or input == "441302",
    do: [
      %{"name" => "桥东街道", "code" => "441302001000"},
      %{"name" => "桥西街道", "code" => "441302002000"},
      %{"name" => "江南街道", "code" => "441302003000"},
      %{"name" => "江北街道", "code" => "441302004000"},
      %{"name" => "龙丰街道", "code" => "441302005000"},
      %{"name" => "河南岸街道", "code" => "441302006000"},
      %{"name" => "惠环街道", "code" => "441302007000"},
      %{"name" => "陈江街道", "code" => "441302008000"},
      %{"name" => "水口街道", "code" => "441302009000"},
      %{"name" => "小金口街道", "code" => "441302010000"},
      %{"name" => "汝湖镇", "code" => "441302100000"},
      %{"name" => "三栋镇", "code" => "441302103000"},
      %{"name" => "潼湖镇", "code" => "441302106000"},
      %{"name" => "沥林镇", "code" => "441302107000"},
      %{"name" => "马安镇", "code" => "441302109000"},
      %{"name" => "横沥镇", "code" => "441302110000"},
      %{"name" => "芦洲镇", "code" => "441302112000"},
      %{"name" => "潼侨镇", "code" => "441302114000"},
      %{"name" => "东江高新科技产业园", "code" => "441302401000"},
      %{"name" => "惠南高新科技产业园", "code" => "441302402000"},
      %{"name" => "惠州市林场", "code" => "441302450000"}
    ]

  def next(input) when input == "四会市" or input == "441284",
    do: [
      %{"name" => "城中街道", "code" => "441284001000"},
      %{"name" => "东城街道", "code" => "441284002000"},
      %{"name" => "贞山街道", "code" => "441284003000"},
      %{"name" => "龙甫镇", "code" => "441284100000"},
      %{"name" => "地豆镇", "code" => "441284101000"},
      %{"name" => "威整镇", "code" => "441284102000"},
      %{"name" => "罗源镇", "code" => "441284103000"},
      %{"name" => "迳口镇", "code" => "441284104000"},
      %{"name" => "大沙镇", "code" => "441284105000"},
      %{"name" => "石狗镇", "code" => "441284107000"},
      %{"name" => "黄田镇", "code" => "441284108000"},
      %{"name" => "江谷镇", "code" => "441284110000"},
      %{"name" => "下茆镇", "code" => "441284113000"},
      %{"name" => "广东省济广监狱", "code" => "441284400000"},
      %{"name" => "肇庆高新技术产业开发区", "code" => "441284450000"}
    ]

  def next(input) when input == "德庆县" or input == "441226",
    do: [
      %{"name" => "德城街道", "code" => "441226001000"},
      %{"name" => "新圩镇", "code" => "441226101000"},
      %{"name" => "回龙镇", "code" => "441226102000"},
      %{"name" => "官圩镇", "code" => "441226103000"},
      %{"name" => "马圩镇", "code" => "441226105000"},
      %{"name" => "高良镇", "code" => "441226106000"},
      %{"name" => "莫村镇", "code" => "441226107000"},
      %{"name" => "永丰镇", "code" => "441226109000"},
      %{"name" => "武垄镇", "code" => "441226110000"},
      %{"name" => "播植镇", "code" => "441226111000"},
      %{"name" => "凤村镇", "code" => "441226112000"},
      %{"name" => "悦城镇", "code" => "441226113000"},
      %{"name" => "九市镇", "code" => "441226114000"}
    ]

  def next(input) when input == "封开县" or input == "441225",
    do: [
      %{"name" => "江口街道", "code" => "441225001000"},
      %{"name" => "江川镇", "code" => "441225101000"},
      %{"name" => "白垢镇", "code" => "441225102000"},
      %{"name" => "大洲镇", "code" => "441225103000"},
      %{"name" => "渔涝镇", "code" => "441225104000"},
      %{"name" => "河儿口镇", "code" => "441225105000"},
      %{"name" => "莲都镇", "code" => "441225106000"},
      %{"name" => "杏花镇", "code" => "441225107000"},
      %{"name" => "罗董镇", "code" => "441225108000"},
      %{"name" => "长岗镇", "code" => "441225109000"},
      %{"name" => "平凤镇", "code" => "441225110000"},
      %{"name" => "南丰镇", "code" => "441225111000"},
      %{"name" => "大玉口镇", "code" => "441225112000"},
      %{"name" => "都平镇", "code" => "441225113000"},
      %{"name" => "金装镇", "code" => "441225114000"},
      %{"name" => "长安镇", "code" => "441225115000"}
    ]

  def next(input) when input == "怀集县" or input == "441224",
    do: [
      %{"name" => "怀城街道", "code" => "441224001000"},
      %{"name" => "幸福街道", "code" => "441224002000"},
      %{"name" => "坳仔镇", "code" => "441224102000"},
      %{"name" => "汶朗镇", "code" => "441224103000"},
      %{"name" => "甘洒镇", "code" => "441224104000"},
      %{"name" => "凤岗镇", "code" => "441224105000"},
      %{"name" => "洽水镇", "code" => "441224106000"},
      %{"name" => "梁村镇", "code" => "441224107000"},
      %{"name" => "大岗镇", "code" => "441224108000"},
      %{"name" => "岗坪镇", "code" => "441224109000"},
      %{"name" => "冷坑镇", "code" => "441224110000"},
      %{"name" => "马宁镇", "code" => "441224111000"},
      %{"name" => "蓝钟镇", "code" => "441224112000"},
      %{"name" => "永固镇", "code" => "441224113000"},
      %{"name" => "诗洞镇", "code" => "441224114000"},
      %{"name" => "桥头镇", "code" => "441224115000"},
      %{"name" => "中洲镇", "code" => "441224116000"},
      %{"name" => "连麦镇", "code" => "441224118000"},
      %{"name" => "下帅壮族瑶族乡", "code" => "441224200000"}
    ]

  def next(input) when input == "广宁县" or input == "441223",
    do: [
      %{"name" => "南街街道", "code" => "441223001000"},
      %{"name" => "排沙镇", "code" => "441223100000"},
      %{"name" => "潭布镇", "code" => "441223102000"},
      %{"name" => "江屯镇", "code" => "441223103000"},
      %{"name" => "螺岗镇", "code" => "441223105000"},
      %{"name" => "北市镇", "code" => "441223106000"},
      %{"name" => "坑口镇", "code" => "441223107000"},
      %{"name" => "赤坑镇", "code" => "441223108000"},
      %{"name" => "宾亨镇", "code" => "441223110000"},
      %{"name" => "五和镇", "code" => "441223111000"},
      %{"name" => "横山镇", "code" => "441223112000"},
      %{"name" => "木格镇", "code" => "441223113000"},
      %{"name" => "石咀镇", "code" => "441223114000"},
      %{"name" => "古水镇", "code" => "441223115000"},
      %{"name" => "洲仔镇", "code" => "441223116000"}
    ]

  def next(input) when input == "高要区" or input == "441204",
    do: [
      %{"name" => "南岸街道", "code" => "441204001000"},
      %{"name" => "河台镇", "code" => "441204100000"},
      %{"name" => "乐城镇", "code" => "441204101000"},
      %{"name" => "水南镇", "code" => "441204102000"},
      %{"name" => "禄步镇", "code" => "441204103000"},
      %{"name" => "小湘镇", "code" => "441204105000"},
      %{"name" => "大湾镇", "code" => "441204106000"},
      %{"name" => "新桥镇", "code" => "441204107000"},
      %{"name" => "白诸镇", "code" => "441204108000"},
      %{"name" => "莲塘镇", "code" => "441204109000"},
      %{"name" => "活道镇", "code" => "441204110000"},
      %{"name" => "蛟塘镇", "code" => "441204111000"},
      %{"name" => "回龙镇", "code" => "441204112000"},
      %{"name" => "白土镇", "code" => "441204113000"},
      %{"name" => "金渡镇", "code" => "441204114000"},
      %{"name" => "金利镇", "code" => "441204115000"},
      %{"name" => "蚬岗镇", "code" => "441204116000"}
    ]

  def next(input) when input == "鼎湖区" or input == "441203",
    do: [
      %{"name" => "坑口街道", "code" => "441203001000"},
      %{"name" => "桂城街道", "code" => "441203002000"},
      %{"name" => "广利街道", "code" => "441203003000"},
      %{"name" => "永安镇", "code" => "441203101000"},
      %{"name" => "沙浦镇", "code" => "441203102000"},
      %{"name" => "凤凰镇", "code" => "441203103000"},
      %{"name" => "莲花镇", "code" => "441203104000"}
    ]

  def next(input) when input == "端州区" or input == "441202",
    do: [
      %{"name" => "端州区城东街道", "code" => "441202001000"},
      %{"name" => "端州区城西街道", "code" => "441202003000"},
      %{"name" => "端州区黄岗街道", "code" => "441202005000"},
      %{"name" => "端州区睦岗街道", "code" => "441202006000"}
    ]

  def next(input) when input == "信宜市" or input == "440983",
    do: [
      %{"name" => "东镇街道", "code" => "440983001000"},
      %{"name" => "玉都街道", "code" => "440983002000"},
      %{"name" => "镇隆镇", "code" => "440983101000"},
      %{"name" => "水口镇", "code" => "440983102000"},
      %{"name" => "丁堡镇", "code" => "440983105000"},
      %{"name" => "池洞镇", "code" => "440983106000"},
      %{"name" => "贵子镇", "code" => "440983112000"},
      %{"name" => "怀乡镇", "code" => "440983113000"},
      %{"name" => "茶山镇", "code" => "440983114000"},
      %{"name" => "洪冠镇", "code" => "440983115000"},
      %{"name" => "白石镇", "code" => "440983116000"},
      %{"name" => "大成镇", "code" => "440983117000"},
      %{"name" => "钱排镇", "code" => "440983118000"},
      %{"name" => "合水镇", "code" => "440983119000"},
      %{"name" => "新宝镇", "code" => "440983120000"},
      %{"name" => "平塘镇", "code" => "440983121000"},
      %{"name" => "思贺镇", "code" => "440983122000"},
      %{"name" => "金垌镇", "code" => "440983123000"},
      %{"name" => "朱砂镇", "code" => "440983124000"},
      %{"name" => "北界镇", "code" => "440983125000"},
      %{"name" => "信宜市国营红旗农场", "code" => "440983400000"}
    ]

  def next(input) when input == "化州市" or input == "440982",
    do: [
      %{"name" => "河西街道", "code" => "440982001000"},
      %{"name" => "东山街道", "code" => "440982002000"},
      %{"name" => "下郭街道", "code" => "440982003000"},
      %{"name" => "南盛街道", "code" => "440982004000"},
      %{"name" => "石湾街道", "code" => "440982005000"},
      %{"name" => "鉴江街道", "code" => "440982006000"},
      %{"name" => "长岐镇", "code" => "440982100000"},
      %{"name" => "同庆镇", "code" => "440982101000"},
      %{"name" => "杨梅镇", "code" => "440982102000"},
      %{"name" => "良光镇", "code" => "440982103000"},
      %{"name" => "笪桥镇", "code" => "440982104000"},
      %{"name" => "丽岗镇", "code" => "440982106000"},
      %{"name" => "新安镇", "code" => "440982107000"},
      %{"name" => "官桥镇", "code" => "440982108000"},
      %{"name" => "林尘镇", "code" => "440982110000"},
      %{"name" => "合江镇", "code" => "440982112000"},
      %{"name" => "那务镇", "code" => "440982113000"},
      %{"name" => "播扬镇", "code" => "440982114000"},
      %{"name" => "宝圩镇", "code" => "440982115000"},
      %{"name" => "平定镇", "code" => "440982116000"},
      %{"name" => "文楼镇", "code" => "440982117000"},
      %{"name" => "江湖镇", "code" => "440982118000"},
      %{"name" => "中垌镇", "code" => "440982120000"},
      %{"name" => "新时代农场", "code" => "440982401000"},
      %{"name" => "新华农场", "code" => "440982402000"},
      %{"name" => "和平农场", "code" => "440982403000"},
      %{"name" => "红阳农场", "code" => "440982404000"},
      %{"name" => "红峰农场", "code" => "440982405000"},
      %{"name" => "建设农场", "code" => "440982406000"},
      %{"name" => "石滩农场", "code" => "440982407000"}
    ]

  def next(input) when input == "高州市" or input == "440981",
    do: [
      %{"name" => "石仔岭街道", "code" => "440981002000"},
      %{"name" => "山美街道", "code" => "440981003000"},
      %{"name" => "金山街道", "code" => "440981006000"},
      %{"name" => "潘州街道", "code" => "440981007000"},
      %{"name" => "宝光街道", "code" => "440981008000"},
      %{"name" => "谢鸡镇", "code" => "440981100000"},
      %{"name" => "新垌镇", "code" => "440981101000"},
      %{"name" => "云潭镇", "code" => "440981102000"},
      %{"name" => "分界镇", "code" => "440981103000"},
      %{"name" => "根子镇", "code" => "440981104000"},
      %{"name" => "泗水镇", "code" => "440981105000"},
      %{"name" => "镇江镇", "code" => "440981107000"},
      %{"name" => "沙田镇", "code" => "440981109000"},
      %{"name" => "南塘镇", "code" => "440981110000"},
      %{"name" => "荷花镇", "code" => "440981111000"},
      %{"name" => "石板镇", "code" => "440981112000"},
      %{"name" => "大井镇", "code" => "440981115000"},
      %{"name" => "潭头镇", "code" => "440981116000"},
      %{"name" => "大坡镇", "code" => "440981119000"},
      %{"name" => "平山镇", "code" => "440981120000"},
      %{"name" => "深镇镇", "code" => "440981121000"},
      %{"name" => "马贵镇", "code" => "440981122000"},
      %{"name" => "古丁镇", "code" => "440981123000"},
      %{"name" => "曹江镇", "code" => "440981124000"},
      %{"name" => "荷塘镇", "code" => "440981126000"},
      %{"name" => "石鼓镇", "code" => "440981127000"},
      %{"name" => "东岸镇", "code" => "440981128000"},
      %{"name" => "长坡镇", "code" => "440981129000"},
      %{"name" => "团结农场", "code" => "440981450000"},
      %{"name" => "胜利农场", "code" => "440981451000"},
      %{"name" => "火星农场", "code" => "440981452000"}
    ]

  def next(input) when input == "电白区" or input == "440904",
    do: [
      %{"name" => "南海街道", "code" => "440904001000"},
      %{"name" => "高地街道", "code" => "440904002000"},
      %{"name" => "水东街道", "code" => "440904003000"},
      %{"name" => "电海街道", "code" => "440904004000"},
      %{"name" => "陈村街道", "code" => "440904005000"},
      %{"name" => "马踏镇", "code" => "440904100000"},
      %{"name" => "岭门镇", "code" => "440904101000"},
      %{"name" => "坡心镇", "code" => "440904102000"},
      %{"name" => "七迳镇", "code" => "440904103000"},
      %{"name" => "树仔镇", "code" => "440904104000"},
      %{"name" => "沙院镇", "code" => "440904105000"},
      %{"name" => "麻岗镇", "code" => "440904106000"},
      %{"name" => "旦场镇", "code" => "440904107000"},
      %{"name" => "小良镇", "code" => "440904109000"},
      %{"name" => "霞洞镇", "code" => "440904115000"},
      %{"name" => "观珠镇", "code" => "440904116000"},
      %{"name" => "沙琅镇", "code" => "440904117000"},
      %{"name" => "黄岭镇", "code" => "440904118000"},
      %{"name" => "望夫镇", "code" => "440904119000"},
      %{"name" => "罗坑镇", "code" => "440904120000"},
      %{"name" => "那霍镇", "code" => "440904121000"},
      %{"name" => "博贺镇", "code" => "440904125000"},
      %{"name" => "林头镇", "code" => "440904126000"},
      %{"name" => "电城镇", "code" => "440904127000"},
      %{"name" => "曙光农场", "code" => "440904451000"},
      %{"name" => "水丰农场", "code" => "440904452000"},
      %{"name" => "新华农场", "code" => "440904453000"},
      %{"name" => "电白盐场", "code" => "440904454000"}
    ]

  def next(input) when input == "茂南区" or input == "440902",
    do: [
      %{"name" => "红旗街道", "code" => "440902001000"},
      %{"name" => "河西街道", "code" => "440902002000"},
      %{"name" => "河东街道", "code" => "440902003000"},
      %{"name" => "露天矿街道", "code" => "440902004000"},
      %{"name" => "新华街道", "code" => "440902005000"},
      %{"name" => "官渡街道", "code" => "440902006000"},
      %{"name" => "站前街道", "code" => "440902007000"},
      %{"name" => "城南街道", "code" => "440902008000"},
      %{"name" => "金塘镇", "code" => "440902100000"},
      %{"name" => "公馆镇", "code" => "440902101000"},
      %{"name" => "新坡镇", "code" => "440902102000"},
      %{"name" => "镇盛镇", "code" => "440902103000"},
      %{"name" => "鳌头镇", "code" => "440902104000"},
      %{"name" => "袂花镇", "code" => "440902105000"},
      %{"name" => "高山镇", "code" => "440902106000"},
      %{"name" => "山阁镇", "code" => "440902107000"},
      %{"name" => "羊角镇", "code" => "440902108000"}
    ]

  def next(input) when input == "吴川市" or input == "440883",
    do: [
      %{"name" => "梅菉街道", "code" => "440883001000"},
      %{"name" => "塘尾街道", "code" => "440883002000"},
      %{"name" => "大山江街道", "code" => "440883003000"},
      %{"name" => "博铺街道", "code" => "440883004000"},
      %{"name" => "海滨街道", "code" => "440883005000"},
      %{"name" => "浅水镇", "code" => "440883100000"},
      %{"name" => "长岐镇", "code" => "440883101000"},
      %{"name" => "覃巴镇", "code" => "440883102000"},
      %{"name" => "王村港镇", "code" => "440883103000"},
      %{"name" => "振文镇", "code" => "440883104000"},
      %{"name" => "樟铺镇", "code" => "440883105000"},
      %{"name" => "吴阳镇", "code" => "440883106000"},
      %{"name" => "塘㙍镇", "code" => "440883107000"},
      %{"name" => "黄坡镇", "code" => "440883109000"},
      %{"name" => "兰石镇", "code" => "440883111000"}
    ]

  def next(input) when input == "雷州市" or input == "440882",
    do: [
      %{"name" => "雷城街道", "code" => "440882001000"},
      %{"name" => "西湖街道", "code" => "440882002000"},
      %{"name" => "新城街道", "code" => "440882003000"},
      %{"name" => "白沙镇", "code" => "440882100000"},
      %{"name" => "沈塘镇", "code" => "440882101000"},
      %{"name" => "客路镇", "code" => "440882102000"},
      %{"name" => "杨家镇", "code" => "440882103000"},
      %{"name" => "唐家镇", "code" => "440882104000"},
      %{"name" => "企水镇", "code" => "440882105000"},
      %{"name" => "纪家镇", "code" => "440882106000"},
      %{"name" => "松竹镇", "code" => "440882107000"},
      %{"name" => "南兴镇", "code" => "440882108000"},
      %{"name" => "雷高镇", "code" => "440882109000"},
      %{"name" => "东里镇", "code" => "440882110000"},
      %{"name" => "调风镇", "code" => "440882111000"},
      %{"name" => "龙门镇", "code" => "440882112000"},
      %{"name" => "英利镇", "code" => "440882113000"},
      %{"name" => "北和镇", "code" => "440882114000"},
      %{"name" => "乌石镇", "code" => "440882115000"},
      %{"name" => "覃斗镇", "code" => "440882116000"},
      %{"name" => "附城镇", "code" => "440882117000"},
      %{"name" => "湛江奋勇高新技术产业开发区", "code" => "440882450000"}
    ]

  def next(input) when input == "廉江市" or input == "440881",
    do: [
      %{"name" => "罗州街道", "code" => "440881001000"},
      %{"name" => "城南街道", "code" => "440881002000"},
      %{"name" => "城北街道", "code" => "440881003000"},
      %{"name" => "石城镇", "code" => "440881101000"},
      %{"name" => "新民镇", "code" => "440881102000"},
      %{"name" => "吉水镇", "code" => "440881103000"},
      %{"name" => "河唇镇", "code" => "440881104000"},
      %{"name" => "石角镇", "code" => "440881105000"},
      %{"name" => "良垌镇", "code" => "440881106000"},
      %{"name" => "横山镇", "code" => "440881107000"},
      %{"name" => "安铺镇", "code" => "440881108000"},
      %{"name" => "营仔镇", "code" => "440881109000"},
      %{"name" => "青平镇", "code" => "440881110000"},
      %{"name" => "车板镇", "code" => "440881111000"},
      %{"name" => "高桥镇", "code" => "440881112000"},
      %{"name" => "石岭镇", "code" => "440881113000"},
      %{"name" => "雅塘镇", "code" => "440881114000"},
      %{"name" => "石颈镇", "code" => "440881115000"},
      %{"name" => "长山镇", "code" => "440881116000"},
      %{"name" => "塘蓬镇", "code" => "440881117000"},
      %{"name" => "和寮镇", "code" => "440881118000"},
      %{"name" => "九洲江开发区", "code" => "440881401000"}
    ]

  def next(input) when input == "徐闻县" or input == "440825",
    do: [
      %{"name" => "徐城街道", "code" => "440825001000"},
      %{"name" => "迈陈镇", "code" => "440825102000"},
      %{"name" => "海安镇", "code" => "440825103000"},
      %{"name" => "曲界镇", "code" => "440825104000"},
      %{"name" => "前山镇", "code" => "440825105000"},
      %{"name" => "西连镇", "code" => "440825106000"},
      %{"name" => "下桥镇", "code" => "440825107000"},
      %{"name" => "龙塘镇", "code" => "440825108000"},
      %{"name" => "下洋镇", "code" => "440825109000"},
      %{"name" => "锦和镇", "code" => "440825110000"},
      %{"name" => "和安镇", "code" => "440825111000"},
      %{"name" => "新寮镇", "code" => "440825112000"},
      %{"name" => "南山镇", "code" => "440825113000"},
      %{"name" => "城北乡", "code" => "440825201000"},
      %{"name" => "角尾乡", "code" => "440825204000"}
    ]

  def next(input) when input == "遂溪县" or input == "440823",
    do: [
      %{"name" => "遂城街道", "code" => "440823001000"},
      %{"name" => "黄略镇", "code" => "440823101000"},
      %{"name" => "洋青镇", "code" => "440823102000"},
      %{"name" => "界炮镇", "code" => "440823103000"},
      %{"name" => "乐民镇", "code" => "440823104000"},
      %{"name" => "江洪镇", "code" => "440823105000"},
      %{"name" => "杨柑镇", "code" => "440823106000"},
      %{"name" => "城月镇", "code" => "440823107000"},
      %{"name" => "乌塘镇", "code" => "440823108000"},
      %{"name" => "建新镇", "code" => "440823109000"},
      %{"name" => "岭北镇", "code" => "440823110000"},
      %{"name" => "北坡镇", "code" => "440823111000"},
      %{"name" => "港门镇", "code" => "440823112000"},
      %{"name" => "草潭镇", "code" => "440823113000"},
      %{"name" => "河头镇", "code" => "440823114000"},
      %{"name" => "附城镇", "code" => "440823115000"}
    ]

  def next(input) when input == "麻章区" or input == "440811",
    do: [
      %{"name" => "东山街道", "code" => "440811070000"},
      %{"name" => "东简街道", "code" => "440811071000"},
      %{"name" => "民安街道", "code" => "440811072000"},
      %{"name" => "麻章镇", "code" => "440811100000"},
      %{"name" => "太平镇", "code" => "440811101000"},
      %{"name" => "湖光镇", "code" => "440811102000"},
      %{"name" => "硇洲镇", "code" => "440811173000"}
    ]

  def next(input) when input == "坡头区" or input == "440804",
    do: [
      %{"name" => "南调街道", "code" => "440804001000"},
      %{"name" => "麻斜街道", "code" => "440804002000"},
      %{"name" => "南三镇", "code" => "440804100000"},
      %{"name" => "坡头镇", "code" => "440804101000"},
      %{"name" => "乾塘镇", "code" => "440804102000"},
      %{"name" => "龙头镇", "code" => "440804103000"},
      %{"name" => "官渡镇", "code" => "440804104000"},
      %{"name" => "湛江市坡头区官渡工业园", "code" => "440804401000"}
    ]

  def next(input) when input == "霞山区" or input == "440803",
    do: [
      %{"name" => "解放街道", "code" => "440803001000"},
      %{"name" => "爱国街道", "code" => "440803002000"},
      %{"name" => "工农街道", "code" => "440803003000"},
      %{"name" => "友谊街道", "code" => "440803004000"},
      %{"name" => "新兴街道", "code" => "440803005000"},
      %{"name" => "海滨街道", "code" => "440803006000"},
      %{"name" => "建设街道", "code" => "440803009000"},
      %{"name" => "东新街道", "code" => "440803010000"},
      %{"name" => "新园街道", "code" => "440803011000"},
      %{"name" => "海头街道", "code" => "440803012000"},
      %{"name" => "泉庄街道", "code" => "440803070000"},
      %{"name" => "乐华街道", "code" => "440803071000"}
    ]

  def next(input) when input == "赤坎区" or input == "440802",
    do: [
      %{"name" => "中华街道", "code" => "440802001000"},
      %{"name" => "寸金街道", "code" => "440802002000"},
      %{"name" => "民主街道", "code" => "440802003000"},
      %{"name" => "中山街道", "code" => "440802004000"},
      %{"name" => "沙湾街道", "code" => "440802005000"},
      %{"name" => "调顺街道", "code" => "440802006000"},
      %{"name" => "南桥街道", "code" => "440802007000"},
      %{"name" => "北桥街道", "code" => "440802008000"}
    ]

  def next(input) when input == "恩平市" or input == "440785",
    do: [
      %{"name" => "恩城街道", "code" => "440785001000"},
      %{"name" => "横陂镇", "code" => "440785100000"},
      %{"name" => "圣堂镇", "code" => "440785101000"},
      %{"name" => "良西镇", "code" => "440785102000"},
      %{"name" => "沙湖镇", "code" => "440785103000"},
      %{"name" => "牛江镇", "code" => "440785104000"},
      %{"name" => "君堂镇", "code" => "440785105000"},
      %{"name" => "大田镇", "code" => "440785106000"},
      %{"name" => "那吉镇", "code" => "440785107000"},
      %{"name" => "大槐镇", "code" => "440785108000"},
      %{"name" => "东成镇", "code" => "440785109000"},
      %{"name" => "恩平园区", "code" => "440785400000"}
    ]

  def next(input) when input == "鹤山市" or input == "440784",
    do: [
      %{"name" => "沙坪街道", "code" => "440784001000"},
      %{"name" => "龙口镇", "code" => "440784101000"},
      %{"name" => "雅瑶镇", "code" => "440784102000"},
      %{"name" => "古劳镇", "code" => "440784103000"},
      %{"name" => "桃源镇", "code" => "440784104000"},
      %{"name" => "鹤城镇", "code" => "440784105000"},
      %{"name" => "共和镇", "code" => "440784106000"},
      %{"name" => "址山镇", "code" => "440784107000"},
      %{"name" => "宅梧镇", "code" => "440784108000"},
      %{"name" => "双合镇", "code" => "440784112000"},
      %{"name" => "广东省江门监狱", "code" => "440784401000"},
      %{"name" => "江门市四堡林场", "code" => "440784402000"}
    ]

  def next(input) when input == "开平市" or input == "440783",
    do: [
      %{"name" => "三埠街道", "code" => "440783001000"},
      %{"name" => "长沙街道", "code" => "440783002000"},
      %{"name" => "沙塘镇", "code" => "440783103000"},
      %{"name" => "苍城镇", "code" => "440783104000"},
      %{"name" => "龙胜镇", "code" => "440783105000"},
      %{"name" => "大沙镇", "code" => "440783106000"},
      %{"name" => "马冈镇", "code" => "440783107000"},
      %{"name" => "塘口镇", "code" => "440783108000"},
      %{"name" => "赤坎镇", "code" => "440783109000"},
      %{"name" => "百合镇", "code" => "440783110000"},
      %{"name" => "蚬冈镇", "code" => "440783111000"},
      %{"name" => "金鸡镇", "code" => "440783112000"},
      %{"name" => "月山镇", "code" => "440783115000"},
      %{"name" => "赤水镇", "code" => "440783116000"},
      %{"name" => "水口镇", "code" => "440783117000"},
      %{"name" => "翠山湖新区", "code" => "440783400000"}
    ]

  def next(input) when input == "台山市" or input == "440781",
    do: [
      %{"name" => "台城街道", "code" => "440781001000"},
      %{"name" => "大江镇", "code" => "440781100000"},
      %{"name" => "水步镇", "code" => "440781101000"},
      %{"name" => "四九镇", "code" => "440781102000"},
      %{"name" => "白沙镇", "code" => "440781103000"},
      %{"name" => "三合镇", "code" => "440781104000"},
      %{"name" => "冲蒌镇", "code" => "440781105000"},
      %{"name" => "斗山镇", "code" => "440781106000"},
      %{"name" => "都斛镇", "code" => "440781107000"},
      %{"name" => "赤溪镇", "code" => "440781108000"},
      %{"name" => "端芬镇", "code" => "440781109000"},
      %{"name" => "广海镇", "code" => "440781110000"},
      %{"name" => "海宴镇", "code" => "440781111000"},
      %{"name" => "汶村镇", "code" => "440781112000"},
      %{"name" => "深井镇", "code" => "440781113000"},
      %{"name" => "北陡镇", "code" => "440781114000"},
      %{"name" => "川岛镇", "code" => "440781115000"}
    ]

  def next(input) when input == "新会区" or input == "440705",
    do: [
      %{"name" => "会城街道", "code" => "440705001000"},
      %{"name" => "大泽镇", "code" => "440705101000"},
      %{"name" => "司前镇", "code" => "440705102000"},
      %{"name" => "罗坑镇", "code" => "440705103000"},
      %{"name" => "双水镇", "code" => "440705104000"},
      %{"name" => "崖门镇", "code" => "440705105000"},
      %{"name" => "沙堆镇", "code" => "440705106000"},
      %{"name" => "古井镇", "code" => "440705107000"},
      %{"name" => "三江镇", "code" => "440705108000"},
      %{"name" => "睦洲镇", "code" => "440705109000"},
      %{"name" => "大鳌镇", "code" => "440705110000"},
      %{"name" => "圭峰区", "code" => "440705450000"},
      %{"name" => "银湖湾", "code" => "440705451000"},
      %{"name" => "银湖湾滨海新区", "code" => "440705452000"},
      %{"name" => "工业园区", "code" => "440705453000"},
      %{"name" => "新会经济开发区", "code" => "440705470000"}
    ]

  def next(input) when input == "江海区" or input == "440704",
    do: [
      %{"name" => "江南街道", "code" => "440704001000"},
      %{"name" => "外海街道", "code" => "440704004000"},
      %{"name" => "礼乐街道", "code" => "440704005000"}
    ]

  def next(input) when input == "蓬江区" or input == "440703",
    do: [
      %{"name" => "白沙街道", "code" => "440703002000"},
      %{"name" => "潮连街道", "code" => "440703005000"},
      %{"name" => "环市街道", "code" => "440703006000"},
      %{"name" => "棠下镇", "code" => "440703101000"},
      %{"name" => "荷塘镇", "code" => "440703102000"},
      %{"name" => "杜阮镇", "code" => "440703103000"}
    ]

  def next(input) when input == "高明区" or input == "440608",
    do: [
      %{"name" => "荷城街道", "code" => "440608004000"},
      %{"name" => "杨和镇", "code" => "440608106000"},
      %{"name" => "明城镇", "code" => "440608107000"},
      %{"name" => "更合镇", "code" => "440608108000"},
      %{"name" => "高明监狱", "code" => "440608400000"},
      %{"name" => "云勇林场", "code" => "440608401000"},
      %{"name" => "对川茶场", "code" => "440608402000"},
      %{"name" => "佛山监狱", "code" => "440608403000"}
    ]

  def next(input) when input == "三水区" or input == "440607",
    do: [
      %{"name" => "西南街道", "code" => "440607001000"},
      %{"name" => "云东海街道", "code" => "440607004000"},
      %{"name" => "大塘镇", "code" => "440607101000"},
      %{"name" => "乐平镇", "code" => "440607103000"},
      %{"name" => "白坭镇", "code" => "440607104000"},
      %{"name" => "芦苞镇", "code" => "440607105000"},
      %{"name" => "南山镇", "code" => "440607106000"},
      %{"name" => "省三水劳教所", "code" => "440607400000"},
      %{"name" => "省南丰劳教所", "code" => "440607401000"},
      %{"name" => "省女子劳教所", "code" => "440607402000"},
      %{"name" => "省第二戒毒劳教所", "code" => "440607403000"},
      %{"name" => "广州军区三水农场", "code" => "440607404000"}
    ]

  def next(input) when input == "顺德区" or input == "440606",
    do: [
      %{"name" => "伦教街道", "code" => "440606003000"},
      %{"name" => "勒流街道", "code" => "440606004000"},
      %{"name" => "大良街道", "code" => "440606005000"},
      %{"name" => "容桂街道", "code" => "440606006000"},
      %{"name" => "陈村镇", "code" => "440606101000"},
      %{"name" => "北滘镇", "code" => "440606102000"},
      %{"name" => "乐从镇", "code" => "440606103000"},
      %{"name" => "龙江镇", "code" => "440606104000"},
      %{"name" => "杏坛镇", "code" => "440606105000"},
      %{"name" => "均安镇", "code" => "440606106000"}
    ]

  def next(input) when input == "南海区" or input == "440605",
    do: [
      %{"name" => "桂城街道", "code" => "440605011000"},
      %{"name" => "九江镇", "code" => "440605121000"},
      %{"name" => "西樵镇", "code" => "440605122000"},
      %{"name" => "丹灶镇", "code" => "440605123000"},
      %{"name" => "狮山镇", "code" => "440605124000"},
      %{"name" => "大沥镇", "code" => "440605125000"},
      %{"name" => "里水镇", "code" => "440605126000"}
    ]

  def next(input) when input == "禅城区" or input == "440604",
    do: [
      %{"name" => "石湾镇街道", "code" => "440604010000"},
      %{"name" => "张槎街道", "code" => "440604011000"},
      %{"name" => "祖庙街道", "code" => "440604012000"},
      %{"name" => "南庄镇", "code" => "440604100000"}
    ]

  def next(input) when input == "南澳县" or input == "440523",
    do: [
      %{"name" => "后宅镇", "code" => "440523100000"},
      %{"name" => "云澳镇", "code" => "440523101000"},
      %{"name" => "深澳镇", "code" => "440523102000"}
    ]

  def next(input) when input == "澄海区" or input == "440515",
    do: [
      %{"name" => "凤翔街道", "code" => "440515001000"},
      %{"name" => "广益街道", "code" => "440515002000"},
      %{"name" => "澄华街道", "code" => "440515003000"},
      %{"name" => "上华镇", "code" => "440515100000"},
      %{"name" => "隆都镇", "code" => "440515101000"},
      %{"name" => "莲下镇", "code" => "440515102000"},
      %{"name" => "莲上镇", "code" => "440515103000"},
      %{"name" => "溪南镇", "code" => "440515104000"},
      %{"name" => "东里镇", "code" => "440515105000"},
      %{"name" => "盐鸿镇", "code" => "440515106000"},
      %{"name" => "莲华镇", "code" => "440515107000"}
    ]

  def next(input) when input == "潮南区" or input == "440514",
    do: [
      %{"name" => "峡山街道", "code" => "440514001000"},
      %{"name" => "井都镇", "code" => "440514101000"},
      %{"name" => "成田镇", "code" => "440514103000"},
      %{"name" => "司马浦镇", "code" => "440514104000"},
      %{"name" => "陈店镇", "code" => "440514105000"},
      %{"name" => "两英镇", "code" => "440514106000"},
      %{"name" => "仙城镇", "code" => "440514107000"},
      %{"name" => "胪岗镇", "code" => "440514108000"},
      %{"name" => "红场镇", "code" => "440514109000"},
      %{"name" => "雷岭镇", "code" => "440514110000"},
      %{"name" => "陇田镇", "code" => "440514112000"}
    ]

  def next(input) when input == "潮阳区" or input == "440513",
    do: [
      %{"name" => "文光街道", "code" => "440513001000"},
      %{"name" => "棉北街道", "code" => "440513002000"},
      %{"name" => "城南街道", "code" => "440513003000"},
      %{"name" => "金浦街道", "code" => "440513004000"},
      %{"name" => "海门镇", "code" => "440513100000"},
      %{"name" => "河溪镇", "code" => "440513101000"},
      %{"name" => "和平镇", "code" => "440513102000"},
      %{"name" => "西胪镇", "code" => "440513103000"},
      %{"name" => "关埠镇", "code" => "440513104000"},
      %{"name" => "谷饶镇", "code" => "440513106000"},
      %{"name" => "贵屿镇", "code" => "440513107000"},
      %{"name" => "铜盂镇", "code" => "440513108000"},
      %{"name" => "金灶镇", "code" => "440513110000"}
    ]

  def next(input) when input == "濠江区" or input == "440512",
    do: [
      %{"name" => "达濠街道", "code" => "440512001000"},
      %{"name" => "马窖街道", "code" => "440512002000"},
      %{"name" => "礐石街道", "code" => "440512003000"},
      %{"name" => "广澳街道", "code" => "440512004000"},
      %{"name" => "滨海街道", "code" => "440512005000"},
      %{"name" => "河浦街道", "code" => "440512006000"},
      %{"name" => "玉新街道", "code" => "440512007000"}
    ]

  def next(input) when input == "金平区" or input == "440511",
    do: [
      %{"name" => "石炮台街道", "code" => "440511001000"},
      %{"name" => "金砂街道", "code" => "440511002000"},
      %{"name" => "东方街道", "code" => "440511004000"},
      %{"name" => "大华街道", "code" => "440511005000"},
      %{"name" => "光华街道", "code" => "440511007000"},
      %{"name" => "广厦街道", "code" => "440511009000"},
      %{"name" => "岐山街道", "code" => "440511013000"},
      %{"name" => "鮀莲街道", "code" => "440511015000"},
      %{"name" => "鮀江街道", "code" => "440511016000"},
      %{"name" => "月浦街道", "code" => "440511017000"},
      %{"name" => "小公园街道", "code" => "440511018000"},
      %{"name" => "金东街道", "code" => "440511019000"}
    ]

  def next(input) when input == "龙湖区" or input == "440507",
    do: [
      %{"name" => "金霞街道", "code" => "440507001000"},
      %{"name" => "珠池街道", "code" => "440507003000"},
      %{"name" => "新津街道", "code" => "440507004000"},
      %{"name" => "鸥汀街道", "code" => "440507005000"},
      %{"name" => "龙祥街道", "code" => "440507008000"},
      %{"name" => "外砂街道", "code" => "440507009000"},
      %{"name" => "龙华街道", "code" => "440507010000"},
      %{"name" => "新溪街道", "code" => "440507011000"},
      %{"name" => "新海街道", "code" => "440507012000"},
      %{"name" => "龙腾街道", "code" => "440507013000"}
    ]

  def next(input) when input == "金湾区" or input == "440404",
    do: [
      %{"name" => "三灶镇", "code" => "440404100000"},
      %{"name" => "南水镇", "code" => "440404101000"},
      %{"name" => "红旗镇", "code" => "440404103000"},
      %{"name" => "平沙镇", "code" => "440404104000"},
      %{"name" => "联港工业区", "code" => "440404400000"},
      %{"name" => "航空产业园", "code" => "440404401000"}
    ]

  def next(input) when input == "斗门区" or input == "440403",
    do: [
      %{"name" => "白藤街道", "code" => "440403001000"},
      %{"name" => "莲洲镇", "code" => "440403100000"},
      %{"name" => "斗门镇", "code" => "440403103000"},
      %{"name" => "乾务镇", "code" => "440403105000"},
      %{"name" => "白蕉镇", "code" => "440403106000"},
      %{"name" => "井岸镇", "code" => "440403107000"}
    ]

  def next(input) when input == "香洲区" or input == "440402",
    do: [
      %{"name" => "翠香街道", "code" => "440402001000"},
      %{"name" => "梅华街道", "code" => "440402002000"},
      %{"name" => "前山街道", "code" => "440402003000"},
      %{"name" => "吉大街道", "code" => "440402004000"},
      %{"name" => "拱北街道", "code" => "440402005000"},
      %{"name" => "香湾街道", "code" => "440402006000"},
      %{"name" => "狮山街道", "code" => "440402007000"},
      %{"name" => "湾仔街道", "code" => "440402008000"},
      %{"name" => "凤山街道", "code" => "440402009000"},
      %{"name" => "唐家湾镇", "code" => "440402100000"},
      %{"name" => "南屏镇", "code" => "440402102000"},
      %{"name" => "横琴镇", "code" => "440402104000"},
      %{"name" => "桂山镇", "code" => "440402105000"},
      %{"name" => "万山镇", "code" => "440402106000"},
      %{"name" => "担杆镇", "code" => "440402107000"},
      %{"name" => "南屏科技园", "code" => "440402401000"},
      %{"name" => "保税区", "code" => "440402402000"},
      %{"name" => "三溪科创小镇发展中心", "code" => "440402403000"},
      %{"name" => "洪湾商贸物流中心", "code" => "440402404000"}
    ]

  def next(input) when input == "光明区" or input == "440311",
    do: [
      %{"name" => "光明街道", "code" => "440311001000"},
      %{"name" => "公明街道", "code" => "440311002000"},
      %{"name" => "新湖街道", "code" => "440311003000"},
      %{"name" => "凤凰街道", "code" => "440311004000"},
      %{"name" => "玉塘街道", "code" => "440311005000"},
      %{"name" => "马田街道", "code" => "440311006000"}
    ]

  def next(input) when input == "坪山区" or input == "440310",
    do: [
      %{"name" => "坪山街道", "code" => "440310001000"},
      %{"name" => "马峦街道", "code" => "440310002000"},
      %{"name" => "碧岭街道", "code" => "440310003000"},
      %{"name" => "石井街道", "code" => "440310004000"},
      %{"name" => "坑梓街道", "code" => "440310005000"},
      %{"name" => "龙田街道", "code" => "440310006000"},
      %{"name" => "深圳坪山综合保税区", "code" => "440310401000"}
    ]

  def next(input) when input == "龙华区" or input == "440309",
    do: [
      %{"name" => "观湖街道", "code" => "440309001000"},
      %{"name" => "民治街道", "code" => "440309002000"},
      %{"name" => "龙华街道", "code" => "440309003000"},
      %{"name" => "大浪街道", "code" => "440309004000"},
      %{"name" => "福城街道", "code" => "440309005000"},
      %{"name" => "观澜街道", "code" => "440309006000"}
    ]

  def next(input) when input == "盐田区" or input == "440308",
    do: [
      %{"name" => "梅沙街道", "code" => "440308001000"},
      %{"name" => "盐田街道", "code" => "440308002000"},
      %{"name" => "沙头角街道", "code" => "440308003000"},
      %{"name" => "海山街道", "code" => "440308004000"},
      %{"name" => "深圳盐田综合保税区", "code" => "440308403000"}
    ]

  def next(input) when input == "龙岗区" or input == "440307",
    do: [
      %{"name" => "平湖街道", "code" => "440307003000"},
      %{"name" => "坪地街道", "code" => "440307006000"},
      %{"name" => "葵涌街道", "code" => "440307009000"},
      %{"name" => "大鹏街道", "code" => "440307010000"},
      %{"name" => "南澳街道", "code" => "440307011000"},
      %{"name" => "南湾街道", "code" => "440307012000"},
      %{"name" => "坂田街道", "code" => "440307013000"},
      %{"name" => "布吉街道", "code" => "440307014000"},
      %{"name" => "龙城街道", "code" => "440307015000"},
      %{"name" => "龙岗街道", "code" => "440307016000"},
      %{"name" => "横岗街道", "code" => "440307017000"},
      %{"name" => "吉华街道", "code" => "440307018000"},
      %{"name" => "宝龙街道", "code" => "440307019000"},
      %{"name" => "园山街道", "code" => "440307020000"}
    ]

  def next(input) when input == "宝安区" or input == "440306",
    do: [
      %{"name" => "新安街道", "code" => "440306017000"},
      %{"name" => "西乡街道", "code" => "440306018000"},
      %{"name" => "航城街道", "code" => "440306019000"},
      %{"name" => "福永街道", "code" => "440306020000"},
      %{"name" => "福海街道", "code" => "440306021000"},
      %{"name" => "沙井街道", "code" => "440306022000"},
      %{"name" => "新桥街道", "code" => "440306023000"},
      %{"name" => "松岗街道", "code" => "440306024000"},
      %{"name" => "燕罗街道", "code" => "440306025000"},
      %{"name" => "石岩街道", "code" => "440306026000"},
      %{"name" => "深圳市宝安国际机场", "code" => "440306400000"}
    ]

  def next(input) when input == "南山区" or input == "440305",
    do: [
      %{"name" => "南头街道", "code" => "440305001000"},
      %{"name" => "南山街道", "code" => "440305002000"},
      %{"name" => "沙河街道", "code" => "440305003000"},
      %{"name" => "蛇口街道", "code" => "440305005000"},
      %{"name" => "招商街道", "code" => "440305006000"},
      %{"name" => "粤海街道", "code" => "440305007000"},
      %{"name" => "桃源街道", "code" => "440305008000"},
      %{"name" => "西丽街道", "code" => "440305009000"},
      %{"name" => "前海合作区", "code" => "440305400000"}
    ]

  def next(input) when input == "福田区" or input == "440304",
    do: [
      %{"name" => "南园街道", "code" => "440304001000"},
      %{"name" => "园岭街道", "code" => "440304002000"},
      %{"name" => "福田街道", "code" => "440304004000"},
      %{"name" => "沙头街道", "code" => "440304005000"},
      %{"name" => "香蜜湖街道", "code" => "440304006000"},
      %{"name" => "梅林街道", "code" => "440304007000"},
      %{"name" => "莲花街道", "code" => "440304008000"},
      %{"name" => "华富街道", "code" => "440304009000"},
      %{"name" => "福保街道", "code" => "440304010000"},
      %{"name" => "华强北街道", "code" => "440304011000"},
      %{"name" => "福田保税区", "code" => "440304400000"}
    ]

  def next(input) when input == "罗湖区" or input == "440303",
    do: [
      %{"name" => "桂园街道", "code" => "440303001000"},
      %{"name" => "黄贝街道", "code" => "440303002000"},
      %{"name" => "东门街道", "code" => "440303003000"},
      %{"name" => "翠竹街道", "code" => "440303004000"},
      %{"name" => "南湖街道", "code" => "440303005000"},
      %{"name" => "笋岗街道", "code" => "440303006000"},
      %{"name" => "东湖街道", "code" => "440303007000"},
      %{"name" => "莲塘街道", "code" => "440303008000"},
      %{"name" => "东晓街道", "code" => "440303009000"},
      %{"name" => "清水河街道", "code" => "440303010000"}
    ]

  def next(input) when input == "南雄市" or input == "440282",
    do: [
      %{"name" => "雄州街道", "code" => "440282001000"},
      %{"name" => "乌迳镇", "code" => "440282100000"},
      %{"name" => "界址镇", "code" => "440282103000"},
      %{"name" => "坪田镇", "code" => "440282104000"},
      %{"name" => "黄坑镇", "code" => "440282105000"},
      %{"name" => "邓坊镇", "code" => "440282106000"},
      %{"name" => "油山镇", "code" => "440282107000"},
      %{"name" => "南亩镇", "code" => "440282109000"},
      %{"name" => "水口镇", "code" => "440282110000"},
      %{"name" => "江头镇", "code" => "440282111000"},
      %{"name" => "湖口镇", "code" => "440282112000"},
      %{"name" => "珠玑镇", "code" => "440282113000"},
      %{"name" => "主田镇", "code" => "440282115000"},
      %{"name" => "古市镇", "code" => "440282116000"},
      %{"name" => "全安镇", "code" => "440282118000"},
      %{"name" => "百顺镇", "code" => "440282120000"},
      %{"name" => "澜河镇", "code" => "440282121000"},
      %{"name" => "帽子峰镇", "code" => "440282122000"},
      %{"name" => "东莞大岭山（南雄）产业转移工业园", "code" => "440282400000"}
    ]

  def next(input) when input == "乐昌市" or input == "440281",
    do: [
      %{"name" => "乐城街道", "code" => "440281001000"},
      %{"name" => "北乡镇", "code" => "440281102000"},
      %{"name" => "九峰镇", "code" => "440281103000"},
      %{"name" => "廊田镇", "code" => "440281104000"},
      %{"name" => "长来镇", "code" => "440281105000"},
      %{"name" => "梅花镇", "code" => "440281106000"},
      %{"name" => "三溪镇", "code" => "440281107000"},
      %{"name" => "坪石镇", "code" => "440281108000"},
      %{"name" => "黄圃镇", "code" => "440281110000"},
      %{"name" => "五山镇", "code" => "440281111000"},
      %{"name" => "两江镇", "code" => "440281112000"},
      %{"name" => "沙坪镇", "code" => "440281113000"},
      %{"name" => "云岩镇", "code" => "440281114000"},
      %{"name" => "秀水镇", "code" => "440281115000"},
      %{"name" => "大源镇", "code" => "440281117000"},
      %{"name" => "庆云镇", "code" => "440281118000"},
      %{"name" => "白石镇", "code" => "440281119000"},
      %{"name" => "坪梅矿务局坪石管理区", "code" => "440281451000"},
      %{"name" => "坪梅矿务局梅田管理区", "code" => "440281452000"}
    ]

  def next(input) when input == "新丰县" or input == "440233",
    do: [
      %{"name" => "丰城街道", "code" => "440233001000"},
      %{"name" => "黄磜镇", "code" => "440233100000"},
      %{"name" => "马头镇", "code" => "440233101000"},
      %{"name" => "梅坑镇", "code" => "440233102000"},
      %{"name" => "沙田镇", "code" => "440233103000"},
      %{"name" => "遥田镇", "code" => "440233104000"},
      %{"name" => "回龙镇", "code" => "440233105000"}
    ]

  def next(input) when input == "乳源瑶族自治县" or input == "440232",
    do: [
      %{"name" => "乳城镇", "code" => "440232100000"},
      %{"name" => "一六镇", "code" => "440232103000"},
      %{"name" => "桂头镇", "code" => "440232104000"},
      %{"name" => "洛阳镇", "code" => "440232106000"},
      %{"name" => "大布镇", "code" => "440232108000"},
      %{"name" => "大桥镇", "code" => "440232109000"},
      %{"name" => "东坪镇", "code" => "440232111000"},
      %{"name" => "游溪镇", "code" => "440232112000"},
      %{"name" => "必背镇", "code" => "440232113000"},
      %{"name" => "天井山林场", "code" => "440232450000"},
      %{"name" => "乳阳林场", "code" => "440232451000"}
    ]

  def next(input) when input == "翁源县" or input == "440229",
    do: [
      %{"name" => "龙仙镇", "code" => "440229100000"},
      %{"name" => "坝仔镇", "code" => "440229104000"},
      %{"name" => "江尾镇", "code" => "440229106000"},
      %{"name" => "官渡镇", "code" => "440229109000"},
      %{"name" => "周陂镇", "code" => "440229111000"},
      %{"name" => "翁城镇", "code" => "440229113000"},
      %{"name" => "新江镇", "code" => "440229114000"},
      %{"name" => "铁龙镇", "code" => "440229115000"}
    ]

  def next(input) when input == "仁化县" or input == "440224",
    do: [
      %{"name" => "丹霞街道", "code" => "440224001000"},
      %{"name" => "闻韶镇", "code" => "440224102000"},
      %{"name" => "扶溪镇", "code" => "440224103000"},
      %{"name" => "长江镇", "code" => "440224104000"},
      %{"name" => "城口镇", "code" => "440224105000"},
      %{"name" => "红山镇", "code" => "440224106000"},
      %{"name" => "石塘镇", "code" => "440224107000"},
      %{"name" => "董塘镇", "code" => "440224108000"},
      %{"name" => "大桥镇", "code" => "440224109000"},
      %{"name" => "周田镇", "code" => "440224110000"},
      %{"name" => "黄坑镇", "code" => "440224111000"}
    ]

  def next(input) when input == "始兴县" or input == "440222",
    do: [
      %{"name" => "太平镇", "code" => "440222100000"},
      %{"name" => "马市镇", "code" => "440222101000"},
      %{"name" => "澄江镇", "code" => "440222102000"},
      %{"name" => "顿岗镇", "code" => "440222103000"},
      %{"name" => "罗坝镇", "code" => "440222104000"},
      %{"name" => "司前镇", "code" => "440222105000"},
      %{"name" => "隘子镇", "code" => "440222106000"},
      %{"name" => "城南镇", "code" => "440222107000"},
      %{"name" => "沈所镇", "code" => "440222108000"},
      %{"name" => "深渡水乡", "code" => "440222204000"}
    ]

  def next(input) when input == "曲江区" or input == "440205",
    do: [
      %{"name" => "松山街道", "code" => "440205001000"},
      %{"name" => "马坝镇", "code" => "440205100000"},
      %{"name" => "大塘镇", "code" => "440205101000"},
      %{"name" => "枫湾镇", "code" => "440205102000"},
      %{"name" => "小坑镇", "code" => "440205103000"},
      %{"name" => "沙溪镇", "code" => "440205104000"},
      %{"name" => "乌石镇", "code" => "440205106000"},
      %{"name" => "樟市镇", "code" => "440205107000"},
      %{"name" => "白土镇", "code" => "440205108000"},
      %{"name" => "罗坑镇", "code" => "440205109000"}
    ]

  def next(input) when input == "浈江区" or input == "440204",
    do: [
      %{"name" => "东河街道", "code" => "440204001000"},
      %{"name" => "车站街道", "code" => "440204002000"},
      %{"name" => "风采街道", "code" => "440204008000"},
      %{"name" => "新韶镇", "code" => "440204100000"},
      %{"name" => "乐园镇", "code" => "440204101000"},
      %{"name" => "十里亭镇", "code" => "440204102000"},
      %{"name" => "犁市镇", "code" => "440204103000"},
      %{"name" => "花坪镇", "code" => "440204104000"},
      %{"name" => "曲仁矿务局田螺冲管理区", "code" => "440204401000"},
      %{"name" => "曲仁矿务局曲仁管理区", "code" => "440204402000"}
    ]

  def next(input) when input == "武江区" or input == "440203",
    do: [
      %{"name" => "新华街道", "code" => "440203001000"},
      %{"name" => "惠民街道", "code" => "440203002000"},
      %{"name" => "西联镇", "code" => "440203100000"},
      %{"name" => "西河镇", "code" => "440203101000"},
      %{"name" => "龙归镇", "code" => "440203102000"},
      %{"name" => "江湾镇", "code" => "440203103000"},
      %{"name" => "重阳镇", "code" => "440203104000"}
    ]

  def next(input) when input == "增城区" or input == "440118",
    do: [
      %{"name" => "荔城街道", "code" => "440118001000"},
      %{"name" => "增江街道", "code" => "440118002000"},
      %{"name" => "朱村街道", "code" => "440118003000"},
      %{"name" => "永宁街道", "code" => "440118004000"},
      %{"name" => "荔湖街道", "code" => "440118005000"},
      %{"name" => "宁西街道", "code" => "440118006000"},
      %{"name" => "新塘镇", "code" => "440118101000"},
      %{"name" => "石滩镇", "code" => "440118102000"},
      %{"name" => "中新镇", "code" => "440118103000"},
      %{"name" => "正果镇", "code" => "440118104000"},
      %{"name" => "派潭镇", "code" => "440118105000"},
      %{"name" => "小楼镇", "code" => "440118106000"},
      %{"name" => "仙村镇", "code" => "440118107000"}
    ]

  def next(input) when input == "从化区" or input == "440117",
    do: [
      %{"name" => "街口街道", "code" => "440117001000"},
      %{"name" => "江埔街道", "code" => "440117002000"},
      %{"name" => "城郊街道", "code" => "440117003000"},
      %{"name" => "温泉镇", "code" => "440117103000"},
      %{"name" => "良口镇", "code" => "440117104000"},
      %{"name" => "吕田镇", "code" => "440117107000"},
      %{"name" => "太平镇", "code" => "440117111000"},
      %{"name" => "鳌头镇", "code" => "440117113000"},
      %{"name" => "黄龙带水库", "code" => "440117404000"},
      %{"name" => "大岭山林场", "code" => "440117405000"}
    ]

  def next(input) when input == "南沙区" or input == "440115",
    do: [
      %{"name" => "南沙街道", "code" => "440115001000"},
      %{"name" => "珠江街道", "code" => "440115002000"},
      %{"name" => "龙穴街道", "code" => "440115003000"},
      %{"name" => "万顷沙镇", "code" => "440115100000"},
      %{"name" => "横沥镇", "code" => "440115101000"},
      %{"name" => "黄阁镇", "code" => "440115102000"},
      %{"name" => "东涌镇", "code" => "440115103000"},
      %{"name" => "大岗镇", "code" => "440115104000"},
      %{"name" => "榄核镇", "code" => "440115105000"}
    ]

  def next(input) when input == "花都区" or input == "440114",
    do: [
      %{"name" => "新华街道", "code" => "440114001000"},
      %{"name" => "花城街道", "code" => "440114002000"},
      %{"name" => "秀全街道", "code" => "440114003000"},
      %{"name" => "新雅街道", "code" => "440114004000"},
      %{"name" => "梯面镇", "code" => "440114103000"},
      %{"name" => "花山镇", "code" => "440114104000"},
      %{"name" => "花东镇", "code" => "440114105000"},
      %{"name" => "炭步镇", "code" => "440114107000"},
      %{"name" => "赤坭镇", "code" => "440114108000"},
      %{"name" => "狮岭镇", "code" => "440114109000"}
    ]

  def next(input) when input == "番禺区" or input == "440113",
    do: [
      %{"name" => "市桥街道", "code" => "440113007000"},
      %{"name" => "沙头街道", "code" => "440113008000"},
      %{"name" => "东环街道", "code" => "440113009000"},
      %{"name" => "桥南街道", "code" => "440113010000"},
      %{"name" => "小谷围街道", "code" => "440113011000"},
      %{"name" => "大石街道", "code" => "440113012000"},
      %{"name" => "洛浦街道", "code" => "440113013000"},
      %{"name" => "石壁街道", "code" => "440113014000"},
      %{"name" => "钟村街道", "code" => "440113015000"},
      %{"name" => "大龙街道", "code" => "440113016000"},
      %{"name" => "沙湾街道", "code" => "440113017000"},
      %{"name" => "南村镇", "code" => "440113102000"},
      %{"name" => "新造镇", "code" => "440113103000"},
      %{"name" => "化龙镇", "code" => "440113104000"},
      %{"name" => "石楼镇", "code" => "440113105000"},
      %{"name" => "石碁镇", "code" => "440113120000"}
    ]

  def next(input) when input == "黄埔区" or input == "440112",
    do: [
      %{"name" => "黄埔街道", "code" => "440112001000"},
      %{"name" => "红山街道", "code" => "440112002000"},
      %{"name" => "鱼珠街道", "code" => "440112003000"},
      %{"name" => "大沙街道", "code" => "440112005000"},
      %{"name" => "文冲街道", "code" => "440112006000"},
      %{"name" => "穗东街道", "code" => "440112007000"},
      %{"name" => "南岗街道", "code" => "440112008000"},
      %{"name" => "长洲街道", "code" => "440112010000"},
      %{"name" => "夏港街道", "code" => "440112011000"},
      %{"name" => "萝岗街道", "code" => "440112012000"},
      %{"name" => "云埔街道", "code" => "440112013000"},
      %{"name" => "联和街道", "code" => "440112014000"},
      %{"name" => "永和街道", "code" => "440112015000"},
      %{"name" => "长岭街道", "code" => "440112016000"},
      %{"name" => "九佛街道", "code" => "440112017000"},
      %{"name" => "龙湖街道", "code" => "440112018000"},
      %{"name" => "新龙镇", "code" => "440112101000"}
    ]

  def next(input) when input == "白云区" or input == "440111",
    do: [
      %{"name" => "三元里街道", "code" => "440111002000"},
      %{"name" => "松洲街道", "code" => "440111003000"},
      %{"name" => "景泰街道", "code" => "440111004000"},
      %{"name" => "同德街道", "code" => "440111005000"},
      %{"name" => "黄石街道", "code" => "440111006000"},
      %{"name" => "棠景街道", "code" => "440111007000"},
      %{"name" => "新市街道", "code" => "440111008000"},
      %{"name" => "同和街道", "code" => "440111009000"},
      %{"name" => "京溪街道", "code" => "440111010000"},
      %{"name" => "永平街道", "code" => "440111011000"},
      %{"name" => "嘉禾街道", "code" => "440111012000"},
      %{"name" => "均禾街道", "code" => "440111013000"},
      %{"name" => "石井街道", "code" => "440111014000"},
      %{"name" => "金沙街道", "code" => "440111015000"},
      %{"name" => "云城街道", "code" => "440111016000"},
      %{"name" => "鹤龙街道", "code" => "440111017000"},
      %{"name" => "白云湖街道", "code" => "440111018000"},
      %{"name" => "石门街道", "code" => "440111019000"},
      %{"name" => "龙归街道", "code" => "440111020000"},
      %{"name" => "大源街道", "code" => "440111021000"},
      %{"name" => "人和镇", "code" => "440111103000"},
      %{"name" => "太和镇", "code" => "440111107000"},
      %{"name" => "钟落潭镇", "code" => "440111108000"},
      %{"name" => "江高镇", "code" => "440111113000"}
    ]

  def next(input) when input == "天河区" or input == "440106",
    do: [
      %{"name" => "五山街道", "code" => "440106001000"},
      %{"name" => "员村街道", "code" => "440106002000"},
      %{"name" => "车陂街道", "code" => "440106003000"},
      %{"name" => "沙河街道", "code" => "440106004000"},
      %{"name" => "石牌街道", "code" => "440106006000"},
      %{"name" => "沙东街道", "code" => "440106007000"},
      %{"name" => "天河南街道", "code" => "440106008000"},
      %{"name" => "林和街道", "code" => "440106009000"},
      %{"name" => "兴华街道", "code" => "440106010000"},
      %{"name" => "棠下街道", "code" => "440106011000"},
      %{"name" => "天园街道", "code" => "440106012000"},
      %{"name" => "猎德街道", "code" => "440106013000"},
      %{"name" => "冼村街道", "code" => "440106014000"},
      %{"name" => "元岗街道", "code" => "440106015000"},
      %{"name" => "黄村街道", "code" => "440106016000"},
      %{"name" => "长兴街道", "code" => "440106017000"},
      %{"name" => "龙洞街道", "code" => "440106018000"},
      %{"name" => "凤凰街道", "code" => "440106019000"},
      %{"name" => "前进街道", "code" => "440106020000"},
      %{"name" => "珠吉街道", "code" => "440106021000"},
      %{"name" => "新塘街道", "code" => "440106022000"}
    ]

  def next(input) when input == "海珠区" or input == "440105",
    do: [
      %{"name" => "赤岗街道", "code" => "440105001000"},
      %{"name" => "新港街道", "code" => "440105002000"},
      %{"name" => "昌岗街道", "code" => "440105003000"},
      %{"name" => "江南中街道", "code" => "440105004000"},
      %{"name" => "滨江街道", "code" => "440105005000"},
      %{"name" => "素社街道", "code" => "440105006000"},
      %{"name" => "海幢街道", "code" => "440105007000"},
      %{"name" => "南华西街道", "code" => "440105008000"},
      %{"name" => "龙凤街道", "code" => "440105009000"},
      %{"name" => "沙园街道", "code" => "440105010000"},
      %{"name" => "南石头街道", "code" => "440105011000"},
      %{"name" => "凤阳街道", "code" => "440105012000"},
      %{"name" => "瑞宝街道", "code" => "440105013000"},
      %{"name" => "江海街道", "code" => "440105014000"},
      %{"name" => "琶洲街道", "code" => "440105015000"},
      %{"name" => "南洲街道", "code" => "440105016000"},
      %{"name" => "华洲街道", "code" => "440105017000"},
      %{"name" => "官洲街道", "code" => "440105018000"}
    ]

  def next(input) when input == "越秀区" or input == "440104",
    do: [
      %{"name" => "洪桥街道", "code" => "440104001000"},
      %{"name" => "北京街道", "code" => "440104003000"},
      %{"name" => "六榕街道", "code" => "440104004000"},
      %{"name" => "流花街道", "code" => "440104005000"},
      %{"name" => "光塔街道", "code" => "440104007000"},
      %{"name" => "人民街道", "code" => "440104010000"},
      %{"name" => "东山街道", "code" => "440104011000"},
      %{"name" => "农林街道", "code" => "440104012000"},
      %{"name" => "梅花村街道", "code" => "440104013000"},
      %{"name" => "黄花岗街道", "code" => "440104014000"},
      %{"name" => "华乐街道", "code" => "440104015000"},
      %{"name" => "建设街道", "code" => "440104016000"},
      %{"name" => "大塘街道", "code" => "440104017000"},
      %{"name" => "珠光街道", "code" => "440104018000"},
      %{"name" => "大东街道", "code" => "440104019000"},
      %{"name" => "白云街道", "code" => "440104020000"},
      %{"name" => "登峰街道", "code" => "440104021000"},
      %{"name" => "矿泉街道", "code" => "440104022000"}
    ]

  def next(input) when input == "荔湾区" or input == "440103",
    do: [
      %{"name" => "沙面街道", "code" => "440103001000"},
      %{"name" => "岭南街道", "code" => "440103002000"},
      %{"name" => "华林街道", "code" => "440103003000"},
      %{"name" => "多宝街道", "code" => "440103004000"},
      %{"name" => "昌华街道", "code" => "440103005000"},
      %{"name" => "逢源街道", "code" => "440103006000"},
      %{"name" => "龙津街道", "code" => "440103007000"},
      %{"name" => "金花街道", "code" => "440103008000"},
      %{"name" => "彩虹街道", "code" => "440103009000"},
      %{"name" => "南源街道", "code" => "440103010000"},
      %{"name" => "西村街道", "code" => "440103011000"},
      %{"name" => "站前街道", "code" => "440103012000"},
      %{"name" => "桥中街道", "code" => "440103013000"},
      %{"name" => "白鹤洞街道", "code" => "440103014000"},
      %{"name" => "冲口街道", "code" => "440103015000"},
      %{"name" => "花地街道", "code" => "440103016000"},
      %{"name" => "石围塘街道", "code" => "440103017000"},
      %{"name" => "茶滘街道", "code" => "440103018000"},
      %{"name" => "东漖街道", "code" => "440103019000"},
      %{"name" => "海龙街道", "code" => "440103020000"},
      %{"name" => "东沙街道", "code" => "440103021000"},
      %{"name" => "中南街道", "code" => "440103022000"}
    ]

  def next(_), do: nil
end