defmodule ChinaAdminDivisions.Gen.Lv3x.M44 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "云城区" or input == "445302",
    do: [
      %{"name" => "云城街道", "code" => "445302001"},
      %{"name" => "高峰街道", "code" => "445302002"},
      %{"name" => "河口街道", "code" => "445302003"},
      %{"name" => "安塘街道", "code" => "445302004"},
      %{"name" => "腰古镇", "code" => "445302102"},
      %{"name" => "思劳镇", "code" => "445302103"},
      %{"name" => "前锋镇", "code" => "445302105"},
      %{"name" => "南盛镇", "code" => "445302106"}
    ]

  def next(input) when input == "云安区" or input == "445303",
    do: [
      %{"name" => "六都镇", "code" => "445303100"},
      %{"name" => "高村镇", "code" => "445303101"},
      %{"name" => "白石镇", "code" => "445303102"},
      %{"name" => "镇安镇", "code" => "445303103"},
      %{"name" => "富林镇", "code" => "445303104"},
      %{"name" => "石城镇", "code" => "445303105"},
      %{"name" => "都杨镇", "code" => "445303106"}
    ]

  def next(input) when input == "新兴县" or input == "445321",
    do: [
      %{"name" => "新城镇", "code" => "445321100"},
      %{"name" => "车岗镇", "code" => "445321101"},
      %{"name" => "水台镇", "code" => "445321103"},
      %{"name" => "稔村镇", "code" => "445321104"},
      %{"name" => "东成镇", "code" => "445321105"},
      %{"name" => "太平镇", "code" => "445321107"},
      %{"name" => "里洞镇", "code" => "445321108"},
      %{"name" => "大江镇", "code" => "445321110"},
      %{"name" => "天堂镇", "code" => "445321112"},
      %{"name" => "河头镇", "code" => "445321113"},
      %{"name" => "簕竹镇", "code" => "445321114"},
      %{"name" => "六祖镇", "code" => "445321115"},
      %{"name" => "广东省西江林业局良洞迳林场", "code" => "445321501"},
      %{"name" => "云浮市国有水台林场", "code" => "445321502"},
      %{"name" => "国营新兴县岩头林场", "code" => "445321503"}
    ]

  def next(input) when input == "郁南县" or input == "445322",
    do: [
      %{"name" => "都城镇", "code" => "445322100"},
      %{"name" => "平台镇", "code" => "445322101"},
      %{"name" => "桂圩镇", "code" => "445322102"},
      %{"name" => "通门镇", "code" => "445322104"},
      %{"name" => "建城镇", "code" => "445322105"},
      %{"name" => "宝珠镇", "code" => "445322106"},
      %{"name" => "大方镇", "code" => "445322108"},
      %{"name" => "千官镇", "code" => "445322110"},
      %{"name" => "大湾镇", "code" => "445322111"},
      %{"name" => "河口镇", "code" => "445322112"},
      %{"name" => "宋桂镇", "code" => "445322113"},
      %{"name" => "东坝镇", "code" => "445322114"},
      %{"name" => "连滩镇", "code" => "445322115"},
      %{"name" => "历洞镇", "code" => "445322116"},
      %{"name" => "南江口镇", "code" => "445322117"},
      %{"name" => "西江林场", "code" => "445322400"},
      %{"name" => "通门林场", "code" => "445322401"},
      %{"name" => "大历林场", "code" => "445322402"},
      %{"name" => "同乐林场", "code" => "445322403"}
    ]

  def next(input) when input == "罗定市" or input == "445381",
    do: [
      %{"name" => "罗城街道", "code" => "445381001"},
      %{"name" => "素龙街道", "code" => "445381002"},
      %{"name" => "附城街道", "code" => "445381003"},
      %{"name" => "双东街道", "code" => "445381004"},
      %{"name" => "罗镜镇", "code" => "445381100"},
      %{"name" => "太平镇", "code" => "445381101"},
      %{"name" => "分界镇", "code" => "445381102"},
      %{"name" => "罗平镇", "code" => "445381104"},
      %{"name" => "船步镇", "code" => "445381105"},
      %{"name" => "朗塘镇", "code" => "445381106"},
      %{"name" => "苹塘镇", "code" => "445381107"},
      %{"name" => "金鸡镇", "code" => "445381108"},
      %{"name" => "围底镇", "code" => "445381109"},
      %{"name" => "华石镇", "code" => "445381110"},
      %{"name" => "榃滨镇", "code" => "445381111"},
      %{"name" => "黎少镇", "code" => "445381113"},
      %{"name" => "生江镇", "code" => "445381114"},
      %{"name" => "连州镇", "code" => "445381115"},
      %{"name" => "泗纶镇", "code" => "445381116"},
      %{"name" => "加益镇", "code" => "445381118"},
      %{"name" => "龙湾镇", "code" => "445381119"},
      %{"name" => "罗平农场", "code" => "445381400"}
    ]

  def next(input) when input == "榕城区" or input == "445202",
    do: [
      %{"name" => "榕华街道", "code" => "445202001"},
      %{"name" => "新兴街道", "code" => "445202002"},
      %{"name" => "中山街道", "code" => "445202003"},
      %{"name" => "西马街道", "code" => "445202004"},
      %{"name" => "东兴街道", "code" => "445202005"},
      %{"name" => "榕东街道", "code" => "445202006"},
      %{"name" => "仙桥街道", "code" => "445202007"},
      %{"name" => "梅云街道", "code" => "445202008"},
      %{"name" => "东升街道", "code" => "445202009"},
      %{"name" => "东阳街道", "code" => "445202010"},
      %{"name" => "渔湖街道", "code" => "445202011"},
      %{"name" => "炮台镇", "code" => "445202102"},
      %{"name" => "地都镇", "code" => "445202103"},
      %{"name" => "登岗镇", "code" => "445202105"}
    ]

  def next(input) when input == "揭东区" or input == "445203",
    do: [
      %{"name" => "曲溪街道", "code" => "445203001"},
      %{"name" => "磐东街道", "code" => "445203002"},
      %{"name" => "云路镇", "code" => "445203102"},
      %{"name" => "玉窖镇", "code" => "445203103"},
      %{"name" => "锡场镇", "code" => "445203104"},
      %{"name" => "新亨镇", "code" => "445203105"},
      %{"name" => "玉湖镇", "code" => "445203106"},
      %{"name" => "埔田镇", "code" => "445203107"},
      %{"name" => "霖磐镇", "code" => "445203108"},
      %{"name" => "月城镇", "code" => "445203109"},
      %{"name" => "白塔镇", "code" => "445203110"},
      %{"name" => "龙尾镇", "code" => "445203111"},
      %{"name" => "桂岭镇", "code" => "445203112"},
      %{"name" => "东径茶场", "code" => "445203401"},
      %{"name" => "坪上农场", "code" => "445203402"},
      %{"name" => "揭阳高新技术产业开发区", "code" => "445203403"},
      %{"name" => "卅岭农场", "code" => "445203404"},
      %{"name" => "蓝城区工业园区管理处", "code" => "445203405"},
      %{"name" => "珠海（揭阳）产业转移工业园", "code" => "445203406"}
    ]

  def next(input) when input == "揭西县" or input == "445222",
    do: [
      %{"name" => "河婆街道", "code" => "445222001"},
      %{"name" => "龙潭镇", "code" => "445222102"},
      %{"name" => "南山镇", "code" => "445222103"},
      %{"name" => "五经富镇", "code" => "445222104"},
      %{"name" => "京溪园镇", "code" => "445222105"},
      %{"name" => "灰寨镇", "code" => "445222106"},
      %{"name" => "塔头镇", "code" => "445222107"},
      %{"name" => "东园镇", "code" => "445222108"},
      %{"name" => "凤江镇", "code" => "445222109"},
      %{"name" => "棉湖镇", "code" => "445222110"},
      %{"name" => "金和镇", "code" => "445222111"},
      %{"name" => "大溪镇", "code" => "445222112"},
      %{"name" => "钱坑镇", "code" => "445222113"},
      %{"name" => "坪上镇", "code" => "445222114"},
      %{"name" => "五云镇", "code" => "445222115"},
      %{"name" => "上砂镇", "code" => "445222116"},
      %{"name" => "良田乡", "code" => "445222201"},
      %{"name" => "北山农林场", "code" => "445222401"},
      %{"name" => "果林场", "code" => "445222402"},
      %{"name" => "油桐林场", "code" => "445222403"},
      %{"name" => "高田农场", "code" => "445222404"},
      %{"name" => "河輋农场", "code" => "445222405"},
      %{"name" => "县苗圃场", "code" => "445222406"}
    ]

  def next(input) when input == "惠来县" or input == "445224",
    do: [
      %{"name" => "惠城镇", "code" => "445224100"},
      %{"name" => "华湖镇", "code" => "445224102"},
      %{"name" => "仙庵镇", "code" => "445224103"},
      %{"name" => "靖海镇", "code" => "445224104"},
      %{"name" => "周田镇", "code" => "445224105"},
      %{"name" => "前詹镇", "code" => "445224106"},
      %{"name" => "神泉镇", "code" => "445224107"},
      %{"name" => "东陇镇", "code" => "445224108"},
      %{"name" => "岐石镇", "code" => "445224109"},
      %{"name" => "隆江镇", "code" => "445224110"},
      %{"name" => "溪西镇", "code" => "445224111"},
      %{"name" => "鳌江镇", "code" => "445224112"},
      %{"name" => "东港镇", "code" => "445224113"},
      %{"name" => "葵潭镇", "code" => "445224114"},
      %{"name" => "侨园镇", "code" => "445224115"},
      %{"name" => "东埔农场", "code" => "445224401"},
      %{"name" => "葵潭农场", "code" => "445224403"},
      %{"name" => "青坑林场", "code" => "445224404"},
      %{"name" => "揭阳（惠来）沿海经济开发试验区", "code" => "445224450"}
    ]

  def next(input) when input == "普宁市" or input == "445281",
    do: [
      %{"name" => "流沙东街道", "code" => "445281001"},
      %{"name" => "流沙南街道", "code" => "445281002"},
      %{"name" => "流沙西街道", "code" => "445281003"},
      %{"name" => "流沙北街道", "code" => "445281004"},
      %{"name" => "池尾街道", "code" => "445281005"},
      %{"name" => "燎原街道", "code" => "445281006"},
      %{"name" => "大南山街道", "code" => "445281007"},
      %{"name" => "赤岗镇", "code" => "445281102"},
      %{"name" => "大坝镇", "code" => "445281103"},
      %{"name" => "洪阳镇", "code" => "445281104"},
      %{"name" => "南溪镇", "code" => "445281105"},
      %{"name" => "广太镇", "code" => "445281106"},
      %{"name" => "麒麟镇", "code" => "445281107"},
      %{"name" => "南径镇", "code" => "445281108"},
      %{"name" => "占陇镇", "code" => "445281109"},
      %{"name" => "军埠镇", "code" => "445281110"},
      %{"name" => "下架山镇", "code" => "445281111"},
      %{"name" => "高埔镇", "code" => "445281113"},
      %{"name" => "云落镇", "code" => "445281114"},
      %{"name" => "大坪镇", "code" => "445281115"},
      %{"name" => "船埔镇", "code" => "445281116"},
      %{"name" => "梅林镇", "code" => "445281117"},
      %{"name" => "里湖镇", "code" => "445281119"},
      %{"name" => "梅塘镇", "code" => "445281121"},
      %{"name" => "普侨镇", "code" => "445281123"},
      %{"name" => "后溪乡", "code" => "445281201"},
      %{"name" => "大池农场", "code" => "445281401"},
      %{"name" => "马鞍山农场", "code" => "445281402"},
      %{"name" => "大坪农场", "code" => "445281403"},
      %{"name" => "三坑农场", "code" => "445281405"},
      %{"name" => "乌石农场", "code" => "445281406"},
      %{"name" => "科技工业园", "code" => "445281407"},
      %{"name" => "普宁产业转移工业园", "code" => "445281408"}
    ]

  def next(input) when input == "湘桥区" or input == "445102",
    do: [
      %{"name" => "桥东街道", "code" => "445102007"},
      %{"name" => "城西街道", "code" => "445102008"},
      %{"name" => "凤新街道", "code" => "445102009"},
      %{"name" => "太平街道", "code" => "445102010"},
      %{"name" => "西新街道", "code" => "445102011"},
      %{"name" => "意溪镇", "code" => "445102100"},
      %{"name" => "磷溪镇", "code" => "445102111"},
      %{"name" => "铁铺镇", "code" => "445102112"},
      %{"name" => "官塘镇", "code" => "445102113"},
      %{"name" => "红山林场", "code" => "445102400"},
      %{"name" => "开发区", "code" => "445102401"},
      %{"name" => "潮州市凤泉湖高新技术产业开发区", "code" => "445102402"}
    ]

  def next(input) when input == "潮安区" or input == "445103",
    do: [
      %{"name" => "古巷镇", "code" => "445103100"},
      %{"name" => "登塘镇", "code" => "445103101"},
      %{"name" => "凤塘镇", "code" => "445103103"},
      %{"name" => "浮洋镇", "code" => "445103104"},
      %{"name" => "龙湖镇", "code" => "445103105"},
      %{"name" => "金石镇", "code" => "445103106"},
      %{"name" => "沙溪镇", "code" => "445103107"},
      %{"name" => "彩塘镇", "code" => "445103108"},
      %{"name" => "东凤镇", "code" => "445103109"},
      %{"name" => "庵埠镇", "code" => "445103110"},
      %{"name" => "江东镇", "code" => "445103114"},
      %{"name" => "归湖镇", "code" => "445103115"},
      %{"name" => "文祠镇", "code" => "445103116"},
      %{"name" => "凤凰镇", "code" => "445103117"},
      %{"name" => "赤凤镇", "code" => "445103120"},
      %{"name" => "枫溪镇", "code" => "445103121"},
      %{"name" => "万峰林场", "code" => "445103400"},
      %{"name" => "广东潮安经济开发区", "code" => "445103450"}
    ]

  def next(input) when input == "饶平县" or input == "445122",
    do: [
      %{"name" => "黄冈镇", "code" => "445122100"},
      %{"name" => "上饶镇", "code" => "445122102"},
      %{"name" => "饶洋镇", "code" => "445122103"},
      %{"name" => "新丰镇", "code" => "445122104"},
      %{"name" => "建饶镇", "code" => "445122106"},
      %{"name" => "三饶镇", "code" => "445122107"},
      %{"name" => "新塘镇", "code" => "445122108"},
      %{"name" => "汤溪镇", "code" => "445122109"},
      %{"name" => "浮滨镇", "code" => "445122110"},
      %{"name" => "浮山镇", "code" => "445122112"},
      %{"name" => "东山镇", "code" => "445122113"},
      %{"name" => "新圩镇", "code" => "445122114"},
      %{"name" => "樟溪镇", "code" => "445122116"},
      %{"name" => "钱东镇", "code" => "445122117"},
      %{"name" => "高堂镇", "code" => "445122118"},
      %{"name" => "联饶镇", "code" => "445122119"},
      %{"name" => "所城镇", "code" => "445122120"},
      %{"name" => "大埕镇", "code" => "445122121"},
      %{"name" => "柘林镇", "code" => "445122122"},
      %{"name" => "汫洲镇", "code" => "445122123"},
      %{"name" => "海山镇", "code" => "445122124"}
    ]

  def next(input) when input == "中山市" or input == "442000",
    do: [
      %{"name" => "石岐街道", "code" => "442000001"},
      %{"name" => "东区街道", "code" => "442000002"},
      %{"name" => "中山港街道", "code" => "442000003"},
      %{"name" => "西区街道", "code" => "442000004"},
      %{"name" => "南区街道", "code" => "442000005"},
      %{"name" => "五桂山街道", "code" => "442000006"},
      %{"name" => "民众街道", "code" => "442000007"},
      %{"name" => "南朗街道", "code" => "442000008"},
      %{"name" => "黄圃镇", "code" => "442000101"},
      %{"name" => "东凤镇", "code" => "442000103"},
      %{"name" => "古镇镇", "code" => "442000105"},
      %{"name" => "沙溪镇", "code" => "442000106"},
      %{"name" => "坦洲镇", "code" => "442000107"},
      %{"name" => "港口镇", "code" => "442000108"},
      %{"name" => "三角镇", "code" => "442000109"},
      %{"name" => "横栏镇", "code" => "442000110"},
      %{"name" => "南头镇", "code" => "442000111"},
      %{"name" => "阜沙镇", "code" => "442000112"},
      %{"name" => "三乡镇", "code" => "442000114"},
      %{"name" => "板芙镇", "code" => "442000115"},
      %{"name" => "大涌镇", "code" => "442000116"},
      %{"name" => "神湾镇", "code" => "442000117"},
      %{"name" => "小榄镇", "code" => "442000118"}
    ]

  def next(input) when input == "东莞市" or input == "441900",
    do: [
      %{"name" => "东城街道", "code" => "441900003"},
      %{"name" => "南城街道", "code" => "441900004"},
      %{"name" => "万江街道", "code" => "441900005"},
      %{"name" => "莞城街道", "code" => "441900006"},
      %{"name" => "石碣镇", "code" => "441900101"},
      %{"name" => "石龙镇", "code" => "441900102"},
      %{"name" => "茶山镇", "code" => "441900103"},
      %{"name" => "石排镇", "code" => "441900104"},
      %{"name" => "企石镇", "code" => "441900105"},
      %{"name" => "横沥镇", "code" => "441900106"},
      %{"name" => "桥头镇", "code" => "441900107"},
      %{"name" => "谢岗镇", "code" => "441900108"},
      %{"name" => "东坑镇", "code" => "441900109"},
      %{"name" => "常平镇", "code" => "441900110"},
      %{"name" => "寮步镇", "code" => "441900111"},
      %{"name" => "樟木头镇", "code" => "441900112"},
      %{"name" => "大朗镇", "code" => "441900113"},
      %{"name" => "黄江镇", "code" => "441900114"},
      %{"name" => "清溪镇", "code" => "441900115"},
      %{"name" => "塘厦镇", "code" => "441900116"},
      %{"name" => "凤岗镇", "code" => "441900117"},
      %{"name" => "大岭山镇", "code" => "441900118"},
      %{"name" => "长安镇", "code" => "441900119"},
      %{"name" => "虎门镇", "code" => "441900121"},
      %{"name" => "厚街镇", "code" => "441900122"},
      %{"name" => "沙田镇", "code" => "441900123"},
      %{"name" => "道滘镇", "code" => "441900124"},
      %{"name" => "洪梅镇", "code" => "441900125"},
      %{"name" => "麻涌镇", "code" => "441900126"},
      %{"name" => "望牛墩镇", "code" => "441900127"},
      %{"name" => "中堂镇", "code" => "441900128"},
      %{"name" => "高埗镇", "code" => "441900129"},
      %{"name" => "松山湖", "code" => "441900401"},
      %{"name" => "东莞港", "code" => "441900402"},
      %{"name" => "东莞生态园", "code" => "441900403"},
      %{"name" => "东莞滨海湾新区", "code" => "441900404"}
    ]

  def next(input) when input == "清城区" or input == "441802",
    do: [
      %{"name" => "凤城街道", "code" => "441802006"},
      %{"name" => "东城街道", "code" => "441802007"},
      %{"name" => "洲心街道", "code" => "441802008"},
      %{"name" => "横荷街道", "code" => "441802009"},
      %{"name" => "源潭镇", "code" => "441802103"},
      %{"name" => "龙塘镇", "code" => "441802105"},
      %{"name" => "石角镇", "code" => "441802106"},
      %{"name" => "飞来峡镇", "code" => "441802107"},
      %{"name" => "清远市高新技术产业开发区", "code" => "441802400"},
      %{"name" => "清远市国营银盏林场", "code" => "441802450"}
    ]

  def next(input) when input == "清新区" or input == "441803",
    do: [
      %{"name" => "太和镇", "code" => "441803102"},
      %{"name" => "太平镇", "code" => "441803104"},
      %{"name" => "山塘镇", "code" => "441803105"},
      %{"name" => "三坑镇", "code" => "441803106"},
      %{"name" => "龙颈镇", "code" => "441803112"},
      %{"name" => "禾云镇", "code" => "441803113"},
      %{"name" => "浸潭镇", "code" => "441803117"},
      %{"name" => "石潭镇", "code" => "441803118"},
      %{"name" => "笔架林场", "code" => "441803450"}
    ]

  def next(input) when input == "佛冈县" or input == "441821",
    do: [
      %{"name" => "石角镇", "code" => "441821100"},
      %{"name" => "水头镇", "code" => "441821101"},
      %{"name" => "汤塘镇", "code" => "441821102"},
      %{"name" => "龙山镇", "code" => "441821103"},
      %{"name" => "高岗镇", "code" => "441821104"},
      %{"name" => "迳头镇", "code" => "441821107"},
      %{"name" => "清远市羊角山林场", "code" => "441821400"},
      %{"name" => "广东佛冈观音山省级自然保护区", "code" => "441821401"}
    ]

  def next(input) when input == "阳山县" or input == "441823",
    do: [
      %{"name" => "青莲镇", "code" => "441823100"},
      %{"name" => "江英镇", "code" => "441823101"},
      %{"name" => "杜步镇", "code" => "441823104"},
      %{"name" => "七拱镇", "code" => "441823105"},
      %{"name" => "太平镇", "code" => "441823107"},
      %{"name" => "杨梅镇", "code" => "441823108"},
      %{"name" => "大崀镇", "code" => "441823110"},
      %{"name" => "小江镇", "code" => "441823111"},
      %{"name" => "岭背镇", "code" => "441823113"},
      %{"name" => "黄坌镇", "code" => "441823115"},
      %{"name" => "黎埠镇", "code" => "441823116"},
      %{"name" => "阳城镇", "code" => "441823119"},
      %{"name" => "秤架瑶族乡", "code" => "441823201"}
    ]

  def next(input) when input == "连山壮族瑶族自治县" or input == "441825",
    do: [
      %{"name" => "永和镇", "code" => "441825100"},
      %{"name" => "吉田镇", "code" => "441825104"},
      %{"name" => "太保镇", "code" => "441825105"},
      %{"name" => "禾洞镇", "code" => "441825106"},
      %{"name" => "福堂镇", "code" => "441825108"},
      %{"name" => "小三江镇", "code" => "441825109"},
      %{"name" => "上帅镇", "code" => "441825111"},
      %{"name" => "连山林场", "code" => "441825450"},
      %{"name" => "禾洞农林场", "code" => "441825451"}
    ]

  def next(input) when input == "连南瑶族自治县" or input == "441826",
    do: [
      %{"name" => "三江镇", "code" => "441826100"},
      %{"name" => "大麦山镇", "code" => "441826101"},
      %{"name" => "寨岗镇", "code" => "441826102"},
      %{"name" => "三排镇", "code" => "441826105"},
      %{"name" => "涡水镇", "code" => "441826106"},
      %{"name" => "大坪镇", "code" => "441826108"},
      %{"name" => "香坪镇", "code" => "441826109"}
    ]

  def next(input) when input == "英德市" or input == "441881",
    do: [
      %{"name" => "英城街道", "code" => "441881001"},
      %{"name" => "沙口镇", "code" => "441881101"},
      %{"name" => "望埠镇", "code" => "441881102"},
      %{"name" => "横石水镇", "code" => "441881103"},
      %{"name" => "桥头镇", "code" => "441881105"},
      %{"name" => "青塘镇", "code" => "441881106"},
      %{"name" => "白沙镇", "code" => "441881108"},
      %{"name" => "大站镇", "code" => "441881109"},
      %{"name" => "西牛镇", "code" => "441881110"},
      %{"name" => "九龙镇", "code" => "441881111"},
      %{"name" => "浛洸镇", "code" => "441881112"},
      %{"name" => "大湾镇", "code" => "441881114"},
      %{"name" => "石灰铺镇", "code" => "441881115"},
      %{"name" => "石牯塘镇", "code" => "441881116"},
      %{"name" => "下石太镇", "code" => "441881120"},
      %{"name" => "波罗镇", "code" => "441881124"},
      %{"name" => "横石塘镇", "code" => "441881125"},
      %{"name" => "大洞镇", "code" => "441881126"},
      %{"name" => "连江口镇", "code" => "441881129"},
      %{"name" => "黎溪镇", "code" => "441881130"},
      %{"name" => "水边镇", "code" => "441881131"},
      %{"name" => "英红镇", "code" => "441881136"},
      %{"name" => "东华镇", "code" => "441881137"},
      %{"name" => "黄花镇", "code" => "441881138"}
    ]

  def next(input) when input == "连州市" or input == "441882",
    do: [
      %{"name" => "连州镇", "code" => "441882100"},
      %{"name" => "星子镇", "code" => "441882101"},
      %{"name" => "大路边镇", "code" => "441882102"},
      %{"name" => "龙坪镇", "code" => "441882103"},
      %{"name" => "西岸镇", "code" => "441882104"},
      %{"name" => "保安镇", "code" => "441882105"},
      %{"name" => "丰阳镇", "code" => "441882106"},
      %{"name" => "东陂镇", "code" => "441882107"},
      %{"name" => "九陂镇", "code" => "441882109"},
      %{"name" => "西江镇", "code" => "441882118"},
      %{"name" => "瑶安瑶族乡", "code" => "441882200"},
      %{"name" => "三水瑶族乡", "code" => "441882201"}
    ]

  def next(input) when input == "江城区" or input == "441702",
    do: [
      %{"name" => "南恩街道", "code" => "441702001"},
      %{"name" => "城南街道", "code" => "441702002"},
      %{"name" => "城北街道", "code" => "441702003"},
      %{"name" => "中洲街道", "code" => "441702004"},
      %{"name" => "城东街道", "code" => "441702006"},
      %{"name" => "岗列街道", "code" => "441702008"},
      %{"name" => "城西街道", "code" => "441702009"},
      %{"name" => "白沙街道", "code" => "441702011"},
      %{"name" => "埠场镇", "code" => "441702102"},
      %{"name" => "平冈镇", "code" => "441702103"},
      %{"name" => "闸坡镇", "code" => "441702105"},
      %{"name" => "双捷镇", "code" => "441702106"},
      %{"name" => "阳江林场罗琴分场", "code" => "441702401"}
    ]

  def next(input) when input == "阳东区" or input == "441704",
    do: [
      %{"name" => "东城镇", "code" => "441704100"},
      %{"name" => "北惯镇", "code" => "441704101"},
      %{"name" => "那龙镇", "code" => "441704102"},
      %{"name" => "东平镇", "code" => "441704103"},
      %{"name" => "雅韶镇", "code" => "441704104"},
      %{"name" => "大沟镇", "code" => "441704105"},
      %{"name" => "新洲镇", "code" => "441704106"},
      %{"name" => "合山镇", "code" => "441704107"},
      %{"name" => "塘坪镇", "code" => "441704108"},
      %{"name" => "大八镇", "code" => "441704109"},
      %{"name" => "红丰镇", "code" => "441704110"},
      %{"name" => "阳江监狱", "code" => "441704400"},
      %{"name" => "阳江林场宝山分场", "code" => "441704501"},
      %{"name" => "阳江林场田畔分场", "code" => "441704502"},
      %{"name" => "阳东原种场", "code" => "441704503"},
      %{"name" => "阳东林场", "code" => "441704504"},
      %{"name" => "阳江林场东岸分场", "code" => "441704505"}
    ]

  def next(input) when input == "阳西县" or input == "441721",
    do: [
      %{"name" => "织篢镇", "code" => "441721100"},
      %{"name" => "程村镇", "code" => "441721101"},
      %{"name" => "塘口镇", "code" => "441721102"},
      %{"name" => "上洋镇", "code" => "441721103"},
      %{"name" => "溪头镇", "code" => "441721104"},
      %{"name" => "沙扒镇", "code" => "441721105"},
      %{"name" => "儒洞镇", "code" => "441721106"},
      %{"name" => "新圩镇", "code" => "441721107"},
      %{"name" => "阳江林场儒洞分场", "code" => "441721502"}
    ]

  def next(input) when input == "阳春市" or input == "441781",
    do: [
      %{"name" => "春城街道", "code" => "441781001"},
      %{"name" => "河西街道", "code" => "441781002"},
      %{"name" => "河朗镇", "code" => "441781101"},
      %{"name" => "松柏镇", "code" => "441781102"},
      %{"name" => "石望镇", "code" => "441781103"},
      %{"name" => "春湾镇", "code" => "441781105"},
      %{"name" => "合水镇", "code" => "441781106"},
      %{"name" => "陂面镇", "code" => "441781107"},
      %{"name" => "圭岗镇", "code" => "441781108"},
      %{"name" => "永宁镇", "code" => "441781109"},
      %{"name" => "马水镇", "code" => "441781110"},
      %{"name" => "岗美镇", "code" => "441781111"},
      %{"name" => "河口镇", "code" => "441781112"},
      %{"name" => "潭水镇", "code" => "441781113"},
      %{"name" => "三甲镇", "code" => "441781114"},
      %{"name" => "双窖镇", "code" => "441781116"},
      %{"name" => "八甲镇", "code" => "441781117"},
      %{"name" => "石录矿区", "code" => "441781403"},
      %{"name" => "花滩林场", "code" => "441781404"},
      %{"name" => "东湖林场", "code" => "441781405"},
      %{"name" => "河尾山林场", "code" => "441781406"},
      %{"name" => "南山矿", "code" => "441781407"},
      %{"name" => "阳春监狱", "code" => "441781408"},
      %{"name" => "硫铁矿", "code" => "441781410"}
    ]

  def next(input) when input == "源城区" or input == "441602",
    do: [
      %{"name" => "上城街道", "code" => "441602001"},
      %{"name" => "新江街道", "code" => "441602002"},
      %{"name" => "东埔街道", "code" => "441602003"},
      %{"name" => "源西街道", "code" => "441602004"},
      %{"name" => "高埔岗街道", "code" => "441602005"},
      %{"name" => "城东街道", "code" => "441602006"},
      %{"name" => "源南镇", "code" => "441602100"},
      %{"name" => "埔前镇", "code" => "441602101"}
    ]

  def next(input) when input == "紫金县" or input == "441621",
    do: [
      %{"name" => "紫城镇", "code" => "441621100"},
      %{"name" => "龙窝镇", "code" => "441621102"},
      %{"name" => "九和镇", "code" => "441621103"},
      %{"name" => "上义镇", "code" => "441621104"},
      %{"name" => "蓝塘镇", "code" => "441621105"},
      %{"name" => "凤安镇", "code" => "441621106"},
      %{"name" => "义容镇", "code" => "441621107"},
      %{"name" => "古竹镇", "code" => "441621108"},
      %{"name" => "临江镇", "code" => "441621109"},
      %{"name" => "柏埔镇", "code" => "441621110"},
      %{"name" => "黄塘镇", "code" => "441621111"},
      %{"name" => "敬梓镇", "code" => "441621112"},
      %{"name" => "水墩镇", "code" => "441621114"},
      %{"name" => "南岭镇", "code" => "441621115"},
      %{"name" => "苏区镇", "code" => "441621116"},
      %{"name" => "瓦溪镇", "code" => "441621117"},
      %{"name" => "好义镇", "code" => "441621118"},
      %{"name" => "中坝镇", "code" => "441621119"}
    ]

  def next(input) when input == "龙川县" or input == "441622",
    do: [
      %{"name" => "老隆镇", "code" => "441622100"},
      %{"name" => "义都镇", "code" => "441622102"},
      %{"name" => "佗城镇", "code" => "441622103"},
      %{"name" => "鹤市镇", "code" => "441622104"},
      %{"name" => "黄布镇", "code" => "441622105"},
      %{"name" => "紫市镇", "code" => "441622106"},
      %{"name" => "通衢镇", "code" => "441622107"},
      %{"name" => "登云镇", "code" => "441622109"},
      %{"name" => "丰稔镇", "code" => "441622110"},
      %{"name" => "四都镇", "code" => "441622111"},
      %{"name" => "铁场镇", "code" => "441622112"},
      %{"name" => "龙母镇", "code" => "441622114"},
      %{"name" => "田心镇", "code" => "441622115"},
      %{"name" => "黎咀镇", "code" => "441622116"},
      %{"name" => "黄石镇", "code" => "441622117"},
      %{"name" => "赤光镇", "code" => "441622118"},
      %{"name" => "廻龙镇", "code" => "441622119"},
      %{"name" => "新田镇", "code" => "441622120"},
      %{"name" => "车田镇", "code" => "441622121"},
      %{"name" => "岩镇镇", "code" => "441622123"},
      %{"name" => "麻布岗镇", "code" => "441622124"},
      %{"name" => "贝岭镇", "code" => "441622125"},
      %{"name" => "细坳镇", "code" => "441622126"},
      %{"name" => "上坪镇", "code" => "441622127"}
    ]

  def next(input) when input == "连平县" or input == "441623",
    do: [
      %{"name" => "元善镇", "code" => "441623100"},
      %{"name" => "上坪镇", "code" => "441623101"},
      %{"name" => "内莞镇", "code" => "441623102"},
      %{"name" => "陂头镇", "code" => "441623104"},
      %{"name" => "溪山镇", "code" => "441623105"},
      %{"name" => "隆街镇", "code" => "441623107"},
      %{"name" => "田源镇", "code" => "441623108"},
      %{"name" => "油溪镇", "code" => "441623109"},
      %{"name" => "忠信镇", "code" => "441623110"},
      %{"name" => "高莞镇", "code" => "441623111"},
      %{"name" => "大湖镇", "code" => "441623113"},
      %{"name" => "三角镇", "code" => "441623114"},
      %{"name" => "绣缎镇", "code" => "441623115"}
    ]

  def next(input) when input == "和平县" or input == "441624",
    do: [
      %{"name" => "阳明镇", "code" => "441624100"},
      %{"name" => "大坝镇", "code" => "441624101"},
      %{"name" => "长塘镇", "code" => "441624102"},
      %{"name" => "下车镇", "code" => "441624103"},
      %{"name" => "上陵镇", "code" => "441624104"},
      %{"name" => "优胜镇", "code" => "441624105"},
      %{"name" => "贝墩镇", "code" => "441624106"},
      %{"name" => "古寨镇", "code" => "441624107"},
      %{"name" => "彭寨镇", "code" => "441624108"},
      %{"name" => "合水镇", "code" => "441624109"},
      %{"name" => "公白镇", "code" => "441624110"},
      %{"name" => "青州镇", "code" => "441624111"},
      %{"name" => "浰源镇", "code" => "441624112"},
      %{"name" => "热水镇", "code" => "441624113"},
      %{"name" => "东水镇", "code" => "441624114"},
      %{"name" => "礼士镇", "code" => "441624115"},
      %{"name" => "林寨镇", "code" => "441624116"}
    ]

  def next(input) when input == "东源县" or input == "441625",
    do: [
      %{"name" => "仙塘镇", "code" => "441625100"},
      %{"name" => "灯塔镇", "code" => "441625101"},
      %{"name" => "骆湖镇", "code" => "441625102"},
      %{"name" => "船塘镇", "code" => "441625103"},
      %{"name" => "顺天镇", "code" => "441625104"},
      %{"name" => "上莞镇", "code" => "441625105"},
      %{"name" => "曾田镇", "code" => "441625106"},
      %{"name" => "柳城镇", "code" => "441625107"},
      %{"name" => "义合镇", "code" => "441625108"},
      %{"name" => "蓝口镇", "code" => "441625109"},
      %{"name" => "黄田镇", "code" => "441625110"},
      %{"name" => "叶潭镇", "code" => "441625111"},
      %{"name" => "黄村镇", "code" => "441625112"},
      %{"name" => "康禾镇", "code" => "441625113"},
      %{"name" => "锡场镇", "code" => "441625114"},
      %{"name" => "新港镇", "code" => "441625115"},
      %{"name" => "双江镇", "code" => "441625116"},
      %{"name" => "涧头镇", "code" => "441625117"},
      %{"name" => "新回龙镇", "code" => "441625121"},
      %{"name" => "半江镇", "code" => "441625122"},
      %{"name" => "漳溪乡", "code" => "441625200"}
    ]

  def next(input) when input == "城区" or input == "441502",
    do: [
      %{"name" => "新港街道", "code" => "441502001"},
      %{"name" => "香洲街道", "code" => "441502002"},
      %{"name" => "凤山街道", "code" => "441502003"},
      %{"name" => "田墘街道", "code" => "441502004"},
      %{"name" => "东洲街道", "code" => "441502005"},
      %{"name" => "遮浪街道", "code" => "441502006"},
      %{"name" => "马宫街道", "code" => "441502007"},
      %{"name" => "红草镇", "code" => "441502100"},
      %{"name" => "东涌镇", "code" => "441502102"},
      %{"name" => "捷胜镇", "code" => "441502103"}
    ]

  def next(input) when input == "海丰县" or input == "441521",
    do: [
      %{"name" => "梅陇镇", "code" => "441521101"},
      %{"name" => "小漠镇", "code" => "441521102"},
      %{"name" => "鹅埠镇", "code" => "441521103"},
      %{"name" => "赤石镇", "code" => "441521104"},
      %{"name" => "鮜门镇", "code" => "441521105"},
      %{"name" => "联安镇", "code" => "441521106"},
      %{"name" => "陶河镇", "code" => "441521107"},
      %{"name" => "赤坑镇", "code" => "441521108"},
      %{"name" => "大湖镇", "code" => "441521109"},
      %{"name" => "可塘镇", "code" => "441521110"},
      %{"name" => "黄羌镇", "code" => "441521112"},
      %{"name" => "平东镇", "code" => "441521113"},
      %{"name" => "海城镇", "code" => "441521115"},
      %{"name" => "公平镇", "code" => "441521118"},
      %{"name" => "附城镇", "code" => "441521119"},
      %{"name" => "城东镇", "code" => "441521120"}
    ]

  def next(input) when input == "陆河县" or input == "441523",
    do: [
      %{"name" => "河田镇", "code" => "441523100"},
      %{"name" => "水唇镇", "code" => "441523101"},
      %{"name" => "河口镇", "code" => "441523102"},
      %{"name" => "新田镇", "code" => "441523103"},
      %{"name" => "上护镇", "code" => "441523104"},
      %{"name" => "螺溪镇", "code" => "441523105"},
      %{"name" => "东坑镇", "code" => "441523106"},
      %{"name" => "南万镇", "code" => "441523107"}
    ]

  def next(input) when input == "陆丰市" or input == "441581",
    do: [
      %{"name" => "东海街道", "code" => "441581001"},
      %{"name" => "河西街道", "code" => "441581002"},
      %{"name" => "城东街道", "code" => "441581003"},
      %{"name" => "甲子镇", "code" => "441581101"},
      %{"name" => "碣石镇", "code" => "441581102"},
      %{"name" => "湖东镇", "code" => "441581103"},
      %{"name" => "大安镇", "code" => "441581104"},
      %{"name" => "博美镇", "code" => "441581105"},
      %{"name" => "内湖镇", "code" => "441581106"},
      %{"name" => "南塘镇", "code" => "441581107"},
      %{"name" => "陂洋镇", "code" => "441581108"},
      %{"name" => "八万镇", "code" => "441581109"},
      %{"name" => "金厢镇", "code" => "441581110"},
      %{"name" => "潭西镇", "code" => "441581111"},
      %{"name" => "甲东镇", "code" => "441581112"},
      %{"name" => "河东镇", "code" => "441581115"},
      %{"name" => "上英镇", "code" => "441581116"},
      %{"name" => "桥冲镇", "code" => "441581117"},
      %{"name" => "甲西镇", "code" => "441581118"},
      %{"name" => "西南镇", "code" => "441581119"},
      %{"name" => "华侨管理区", "code" => "441581400"},
      %{"name" => "铜锣湖农场", "code" => "441581450"},
      %{"name" => "星都经济开发试验区", "code" => "441581451"},
      %{"name" => "大安农场", "code" => "441581452"},
      %{"name" => "罗经嶂林场", "code" => "441581453"},
      %{"name" => "湖东林场", "code" => "441581454"},
      %{"name" => "东海岸林场", "code" => "441581455"},
      %{"name" => "红岭林场", "code" => "441581456"},
      %{"name" => "畜牧果林场", "code" => "441581457"}
    ]

  def next(input) when input == "梅江区" or input == "441402",
    do: [
      %{"name" => "江南街道", "code" => "441402004"},
      %{"name" => "金山街道", "code" => "441402006"},
      %{"name" => "西郊街道", "code" => "441402007"},
      %{"name" => "三角镇", "code" => "441402102"},
      %{"name" => "长沙镇", "code" => "441402103"},
      %{"name" => "城北镇", "code" => "441402105"},
      %{"name" => "西阳镇", "code" => "441402106"}
    ]

  def next(input) when input == "梅县区" or input == "441403",
    do: [
      %{"name" => "新城街道", "code" => "441403001"},
      %{"name" => "松口镇", "code" => "441403100"},
      %{"name" => "城东镇", "code" => "441403101"},
      %{"name" => "石扇镇", "code" => "441403102"},
      %{"name" => "梅西镇", "code" => "441403103"},
      %{"name" => "大坪镇", "code" => "441403104"},
      %{"name" => "石坑镇", "code" => "441403105"},
      %{"name" => "南口镇", "code" => "441403106"},
      %{"name" => "畲江镇", "code" => "441403107"},
      %{"name" => "水车镇", "code" => "441403108"},
      %{"name" => "梅南镇", "code" => "441403110"},
      %{"name" => "雁洋镇", "code" => "441403111"},
      %{"name" => "白渡镇", "code" => "441403112"},
      %{"name" => "丙村镇", "code" => "441403113"},
      %{"name" => "隆文镇", "code" => "441403114"},
      %{"name" => "松源镇", "code" => "441403116"},
      %{"name" => "桃尧镇", "code" => "441403118"},
      %{"name" => "程江镇", "code" => "441403132"},
      %{"name" => "扶大镇", "code" => "441403133"},
      %{"name" => "梅西水库", "code" => "441403500"}
    ]

  def next(input) when input == "大埔县" or input == "441422",
    do: [
      %{"name" => "湖寮镇", "code" => "441422100"},
      %{"name" => "茶阳镇", "code" => "441422101"},
      %{"name" => "高陂镇", "code" => "441422102"},
      %{"name" => "青溪镇", "code" => "441422103"},
      %{"name" => "三河镇", "code" => "441422105"},
      %{"name" => "大麻镇", "code" => "441422107"},
      %{"name" => "银江镇", "code" => "441422108"},
      %{"name" => "洲瑞镇", "code" => "441422109"},
      %{"name" => "光德镇", "code" => "441422112"},
      %{"name" => "桃源镇", "code" => "441422113"},
      %{"name" => "枫朗镇", "code" => "441422114"},
      %{"name" => "百侯镇", "code" => "441422116"},
      %{"name" => "大东镇", "code" => "441422117"},
      %{"name" => "西河镇", "code" => "441422118"},
      %{"name" => "丰溪林场", "code" => "441422400"},
      %{"name" => "洲瑞林场", "code" => "441422401"},
      %{"name" => "大埔林场", "code" => "441422402"}
    ]

  def next(input) when input == "丰顺县" or input == "441423",
    do: [
      %{"name" => "汤坑镇", "code" => "441423100"},
      %{"name" => "北斗镇", "code" => "441423103"},
      %{"name" => "汤西镇", "code" => "441423104"},
      %{"name" => "汤南镇", "code" => "441423105"},
      %{"name" => "埔寨镇", "code" => "441423106"},
      %{"name" => "八乡山镇", "code" => "441423108"},
      %{"name" => "丰良镇", "code" => "441423109"},
      %{"name" => "建桥镇", "code" => "441423110"},
      %{"name" => "龙岗镇", "code" => "441423111"},
      %{"name" => "潘田镇", "code" => "441423112"},
      %{"name" => "黄金镇", "code" => "441423114"},
      %{"name" => "留隍镇", "code" => "441423115"},
      %{"name" => "大龙华镇", "code" => "441423118"},
      %{"name" => "潭江镇", "code" => "441423120"},
      %{"name" => "小胜镇", "code" => "441423122"},
      %{"name" => "砂田镇", "code" => "441423123"},
      %{"name" => "埔寨农场", "code" => "441423450"}
    ]

  def next(input) when input == "五华县" or input == "441424",
    do: [
      %{"name" => "水寨镇", "code" => "441424100"},
      %{"name" => "河东镇", "code" => "441424101"},
      %{"name" => "转水镇", "code" => "441424103"},
      %{"name" => "华城镇", "code" => "441424104"},
      %{"name" => "岐岭镇", "code" => "441424106"},
      %{"name" => "潭下镇", "code" => "441424108"},
      %{"name" => "长布镇", "code" => "441424109"},
      %{"name" => "周江镇", "code" => "441424111"},
      %{"name" => "横陂镇", "code" => "441424113"},
      %{"name" => "郭田镇", "code" => "441424117"},
      %{"name" => "双华镇", "code" => "441424118"},
      %{"name" => "安流镇", "code" => "441424120"},
      %{"name" => "棉洋镇", "code" => "441424123"},
      %{"name" => "梅林镇", "code" => "441424125"},
      %{"name" => "华阳镇", "code" => "441424126"},
      %{"name" => "龙村镇", "code" => "441424127"}
    ]

  def next(input) when input == "平远县" or input == "441426",
    do: [
      %{"name" => "大柘镇", "code" => "441426100"},
      %{"name" => "石正镇", "code" => "441426101"},
      %{"name" => "东石镇", "code" => "441426102"},
      %{"name" => "仁居镇", "code" => "441426103"},
      %{"name" => "八尺镇", "code" => "441426104"},
      %{"name" => "差干镇", "code" => "441426105"},
      %{"name" => "河头镇", "code" => "441426107"},
      %{"name" => "中行镇", "code" => "441426108"},
      %{"name" => "上举镇", "code" => "441426109"},
      %{"name" => "泗水镇", "code" => "441426110"},
      %{"name" => "长田镇", "code" => "441426114"},
      %{"name" => "热柘镇", "code" => "441426115"}
    ]

  def next(input) when input == "蕉岭县" or input == "441427",
    do: [
      %{"name" => "蕉城镇", "code" => "441427100"},
      %{"name" => "长潭镇", "code" => "441427102"},
      %{"name" => "三圳镇", "code" => "441427103"},
      %{"name" => "新铺镇", "code" => "441427104"},
      %{"name" => "文福镇", "code" => "441427106"},
      %{"name" => "广福镇", "code" => "441427107"},
      %{"name" => "蓝坊镇", "code" => "441427108"},
      %{"name" => "南礤镇", "code" => "441427110"}
    ]

  def next(input) when input == "兴宁市" or input == "441481",
    do: [
      %{"name" => "兴田街道", "code" => "441481001"},
      %{"name" => "福兴街道", "code" => "441481002"},
      %{"name" => "宁新街道", "code" => "441481003"},
      %{"name" => "宁中镇", "code" => "441481102"},
      %{"name" => "新陂镇", "code" => "441481104"},
      %{"name" => "刁坊镇", "code" => "441481105"},
      %{"name" => "永和镇", "code" => "441481107"},
      %{"name" => "径南镇", "code" => "441481108"},
      %{"name" => "坭陂镇", "code" => "441481110"},
      %{"name" => "新圩镇", "code" => "441481111"},
      %{"name" => "水口镇", "code" => "441481112"},
      %{"name" => "罗浮镇", "code" => "441481115"},
      %{"name" => "罗岗镇", "code" => "441481116"},
      %{"name" => "黄槐镇", "code" => "441481117"},
      %{"name" => "黄陂镇", "code" => "441481118"},
      %{"name" => "合水镇", "code" => "441481122"},
      %{"name" => "龙田镇", "code" => "441481123"},
      %{"name" => "石马镇", "code" => "441481124"},
      %{"name" => "大坪镇", "code" => "441481125"},
      %{"name" => "叶塘镇", "code" => "441481126"}
    ]

  def next(input) when input == "惠城区" or input == "441302",
    do: [
      %{"name" => "桥东街道", "code" => "441302001"},
      %{"name" => "桥西街道", "code" => "441302002"},
      %{"name" => "江南街道", "code" => "441302003"},
      %{"name" => "江北街道", "code" => "441302004"},
      %{"name" => "龙丰街道", "code" => "441302005"},
      %{"name" => "河南岸街道", "code" => "441302006"},
      %{"name" => "惠环街道", "code" => "441302007"},
      %{"name" => "陈江街道", "code" => "441302008"},
      %{"name" => "水口街道", "code" => "441302009"},
      %{"name" => "小金口街道", "code" => "441302010"},
      %{"name" => "汝湖镇", "code" => "441302100"},
      %{"name" => "三栋镇", "code" => "441302103"},
      %{"name" => "潼湖镇", "code" => "441302106"},
      %{"name" => "沥林镇", "code" => "441302107"},
      %{"name" => "马安镇", "code" => "441302109"},
      %{"name" => "横沥镇", "code" => "441302110"},
      %{"name" => "芦洲镇", "code" => "441302112"},
      %{"name" => "潼侨镇", "code" => "441302114"},
      %{"name" => "东江高新科技产业园", "code" => "441302401"},
      %{"name" => "惠南高新科技产业园", "code" => "441302402"},
      %{"name" => "惠州市林场", "code" => "441302450"}
    ]

  def next(input) when input == "惠阳区" or input == "441303",
    do: [
      %{"name" => "淡水街道", "code" => "441303001"},
      %{"name" => "秋长街道", "code" => "441303002"},
      %{"name" => "三和街道", "code" => "441303003"},
      %{"name" => "大亚湾澳头街道", "code" => "441303006"},
      %{"name" => "大亚湾霞涌街道", "code" => "441303007"},
      %{"name" => "大亚湾西区街道", "code" => "441303008"},
      %{"name" => "沙田镇", "code" => "441303101"},
      %{"name" => "新圩镇", "code" => "441303103"},
      %{"name" => "镇隆镇", "code" => "441303104"},
      %{"name" => "永湖镇", "code" => "441303108"},
      %{"name" => "良井镇", "code" => "441303109"},
      %{"name" => "平潭镇", "code" => "441303110"}
    ]

  def next(input) when input == "博罗县" or input == "441322",
    do: [
      %{"name" => "罗阳街道", "code" => "441322001"},
      %{"name" => "龙溪街道", "code" => "441322002"},
      %{"name" => "石坝镇", "code" => "441322100"},
      %{"name" => "麻陂镇", "code" => "441322102"},
      %{"name" => "观音阁镇", "code" => "441322103"},
      %{"name" => "公庄镇", "code" => "441322104"},
      %{"name" => "杨村镇", "code" => "441322105"},
      %{"name" => "柏塘镇", "code" => "441322106"},
      %{"name" => "泰美镇", "code" => "441322108"},
      %{"name" => "湖镇镇", "code" => "441322113"},
      %{"name" => "长宁镇", "code" => "441322115"},
      %{"name" => "福田镇", "code" => "441322116"},
      %{"name" => "龙华镇", "code" => "441322117"},
      %{"name" => "园洲镇", "code" => "441322119"},
      %{"name" => "石湾镇", "code" => "441322121"},
      %{"name" => "杨侨镇", "code" => "441322122"},
      %{"name" => "横河镇", "code" => "441322123"},
      %{"name" => "罗浮山管理区", "code" => "441322570"}
    ]

  def next(input) when input == "惠东县" or input == "441323",
    do: [
      %{"name" => "平山街道", "code" => "441323001"},
      %{"name" => "大岭街道", "code" => "441323002"},
      %{"name" => "白花镇", "code" => "441323102"},
      %{"name" => "梁化镇", "code" => "441323103"},
      %{"name" => "稔山镇", "code" => "441323104"},
      %{"name" => "铁涌镇", "code" => "441323105"},
      %{"name" => "平海镇", "code" => "441323106"},
      %{"name" => "吉隆镇", "code" => "441323109"},
      %{"name" => "黄埠镇", "code" => "441323110"},
      %{"name" => "多祝镇", "code" => "441323113"},
      %{"name" => "安墩镇", "code" => "441323115"},
      %{"name" => "高潭镇", "code" => "441323118"},
      %{"name" => "宝口镇", "code" => "441323120"},
      %{"name" => "白盆珠镇", "code" => "441323121"},
      %{"name" => "广东省惠州市国营惠东梁化林场", "code" => "441323450"},
      %{"name" => "广东省惠州市国营惠东九龙峰林场", "code" => "441323451"},
      %{"name" => "惠东县港口海龟湾自然保护区", "code" => "441323452"},
      %{"name" => "莲花山白盆珠省级自然保护区", "code" => "441323453"},
      %{"name" => "广东惠东古田省级自然保护区", "code" => "441323454"},
      %{"name" => "惠东县珠三角产业转移园", "code" => "441323455"},
      %{"name" => "巺寮滨海旅游度假区", "code" => "441323570"}
    ]

  def next(input) when input == "龙门县" or input == "441324",
    do: [
      %{"name" => "龙城街道", "code" => "441324001"},
      %{"name" => "平陵街道", "code" => "441324002"},
      %{"name" => "麻榨镇", "code" => "441324100"},
      %{"name" => "永汉镇", "code" => "441324101"},
      %{"name" => "龙田镇", "code" => "441324115"},
      %{"name" => "龙潭镇", "code" => "441324116"},
      %{"name" => "地派镇", "code" => "441324117"},
      %{"name" => "龙华镇", "code" => "441324118"},
      %{"name" => "龙江镇", "code" => "441324119"},
      %{"name" => "蓝田瑶族乡", "code" => "441324200"},
      %{"name" => "龙门县密溪林场", "code" => "441324453"},
      %{"name" => "南昆山生态旅游区", "code" => "441324570"}
    ]

  def next(input) when input == "端州区" or input == "441202",
    do: [
      %{"name" => "端州区城东街道", "code" => "441202001"},
      %{"name" => "端州区城西街道", "code" => "441202003"},
      %{"name" => "端州区黄岗街道", "code" => "441202005"},
      %{"name" => "端州区睦岗街道", "code" => "441202006"}
    ]

  def next(input) when input == "鼎湖区" or input == "441203",
    do: [
      %{"name" => "坑口街道", "code" => "441203001"},
      %{"name" => "桂城街道", "code" => "441203002"},
      %{"name" => "广利街道", "code" => "441203003"},
      %{"name" => "永安镇", "code" => "441203101"},
      %{"name" => "沙浦镇", "code" => "441203102"},
      %{"name" => "凤凰镇", "code" => "441203103"},
      %{"name" => "莲花镇", "code" => "441203104"}
    ]

  def next(input) when input == "高要区" or input == "441204",
    do: [
      %{"name" => "南岸街道", "code" => "441204001"},
      %{"name" => "河台镇", "code" => "441204100"},
      %{"name" => "乐城镇", "code" => "441204101"},
      %{"name" => "水南镇", "code" => "441204102"},
      %{"name" => "禄步镇", "code" => "441204103"},
      %{"name" => "小湘镇", "code" => "441204105"},
      %{"name" => "大湾镇", "code" => "441204106"},
      %{"name" => "新桥镇", "code" => "441204107"},
      %{"name" => "白诸镇", "code" => "441204108"},
      %{"name" => "莲塘镇", "code" => "441204109"},
      %{"name" => "活道镇", "code" => "441204110"},
      %{"name" => "蛟塘镇", "code" => "441204111"},
      %{"name" => "回龙镇", "code" => "441204112"},
      %{"name" => "白土镇", "code" => "441204113"},
      %{"name" => "金渡镇", "code" => "441204114"},
      %{"name" => "金利镇", "code" => "441204115"},
      %{"name" => "蚬岗镇", "code" => "441204116"}
    ]

  def next(input) when input == "广宁县" or input == "441223",
    do: [
      %{"name" => "南街街道", "code" => "441223001"},
      %{"name" => "排沙镇", "code" => "441223100"},
      %{"name" => "潭布镇", "code" => "441223102"},
      %{"name" => "江屯镇", "code" => "441223103"},
      %{"name" => "螺岗镇", "code" => "441223105"},
      %{"name" => "北市镇", "code" => "441223106"},
      %{"name" => "坑口镇", "code" => "441223107"},
      %{"name" => "赤坑镇", "code" => "441223108"},
      %{"name" => "宾亨镇", "code" => "441223110"},
      %{"name" => "五和镇", "code" => "441223111"},
      %{"name" => "横山镇", "code" => "441223112"},
      %{"name" => "木格镇", "code" => "441223113"},
      %{"name" => "石咀镇", "code" => "441223114"},
      %{"name" => "古水镇", "code" => "441223115"},
      %{"name" => "洲仔镇", "code" => "441223116"}
    ]

  def next(input) when input == "怀集县" or input == "441224",
    do: [
      %{"name" => "怀城街道", "code" => "441224001"},
      %{"name" => "幸福街道", "code" => "441224002"},
      %{"name" => "坳仔镇", "code" => "441224102"},
      %{"name" => "汶朗镇", "code" => "441224103"},
      %{"name" => "甘洒镇", "code" => "441224104"},
      %{"name" => "凤岗镇", "code" => "441224105"},
      %{"name" => "洽水镇", "code" => "441224106"},
      %{"name" => "梁村镇", "code" => "441224107"},
      %{"name" => "大岗镇", "code" => "441224108"},
      %{"name" => "岗坪镇", "code" => "441224109"},
      %{"name" => "冷坑镇", "code" => "441224110"},
      %{"name" => "马宁镇", "code" => "441224111"},
      %{"name" => "蓝钟镇", "code" => "441224112"},
      %{"name" => "永固镇", "code" => "441224113"},
      %{"name" => "诗洞镇", "code" => "441224114"},
      %{"name" => "桥头镇", "code" => "441224115"},
      %{"name" => "中洲镇", "code" => "441224116"},
      %{"name" => "连麦镇", "code" => "441224118"},
      %{"name" => "下帅壮族瑶族乡", "code" => "441224200"}
    ]

  def next(input) when input == "封开县" or input == "441225",
    do: [
      %{"name" => "江口街道", "code" => "441225001"},
      %{"name" => "江川镇", "code" => "441225101"},
      %{"name" => "白垢镇", "code" => "441225102"},
      %{"name" => "大洲镇", "code" => "441225103"},
      %{"name" => "渔涝镇", "code" => "441225104"},
      %{"name" => "河儿口镇", "code" => "441225105"},
      %{"name" => "莲都镇", "code" => "441225106"},
      %{"name" => "杏花镇", "code" => "441225107"},
      %{"name" => "罗董镇", "code" => "441225108"},
      %{"name" => "长岗镇", "code" => "441225109"},
      %{"name" => "平凤镇", "code" => "441225110"},
      %{"name" => "南丰镇", "code" => "441225111"},
      %{"name" => "大玉口镇", "code" => "441225112"},
      %{"name" => "都平镇", "code" => "441225113"},
      %{"name" => "金装镇", "code" => "441225114"},
      %{"name" => "长安镇", "code" => "441225115"}
    ]

  def next(input) when input == "德庆县" or input == "441226",
    do: [
      %{"name" => "德城街道", "code" => "441226001"},
      %{"name" => "新圩镇", "code" => "441226101"},
      %{"name" => "回龙镇", "code" => "441226102"},
      %{"name" => "官圩镇", "code" => "441226103"},
      %{"name" => "马圩镇", "code" => "441226105"},
      %{"name" => "高良镇", "code" => "441226106"},
      %{"name" => "莫村镇", "code" => "441226107"},
      %{"name" => "永丰镇", "code" => "441226109"},
      %{"name" => "武垄镇", "code" => "441226110"},
      %{"name" => "播植镇", "code" => "441226111"},
      %{"name" => "凤村镇", "code" => "441226112"},
      %{"name" => "悦城镇", "code" => "441226113"},
      %{"name" => "九市镇", "code" => "441226114"}
    ]

  def next(input) when input == "四会市" or input == "441284",
    do: [
      %{"name" => "城中街道", "code" => "441284001"},
      %{"name" => "东城街道", "code" => "441284002"},
      %{"name" => "贞山街道", "code" => "441284003"},
      %{"name" => "龙甫镇", "code" => "441284100"},
      %{"name" => "地豆镇", "code" => "441284101"},
      %{"name" => "威整镇", "code" => "441284102"},
      %{"name" => "罗源镇", "code" => "441284103"},
      %{"name" => "迳口镇", "code" => "441284104"},
      %{"name" => "大沙镇", "code" => "441284105"},
      %{"name" => "石狗镇", "code" => "441284107"},
      %{"name" => "黄田镇", "code" => "441284108"},
      %{"name" => "江谷镇", "code" => "441284110"},
      %{"name" => "下茆镇", "code" => "441284113"},
      %{"name" => "广东省济广监狱", "code" => "441284400"},
      %{"name" => "肇庆高新技术产业开发区", "code" => "441284450"}
    ]

  def next(input) when input == "茂南区" or input == "440902",
    do: [
      %{"name" => "红旗街道", "code" => "440902001"},
      %{"name" => "河西街道", "code" => "440902002"},
      %{"name" => "河东街道", "code" => "440902003"},
      %{"name" => "露天矿街道", "code" => "440902004"},
      %{"name" => "新华街道", "code" => "440902005"},
      %{"name" => "官渡街道", "code" => "440902006"},
      %{"name" => "站前街道", "code" => "440902007"},
      %{"name" => "城南街道", "code" => "440902008"},
      %{"name" => "金塘镇", "code" => "440902100"},
      %{"name" => "公馆镇", "code" => "440902101"},
      %{"name" => "新坡镇", "code" => "440902102"},
      %{"name" => "镇盛镇", "code" => "440902103"},
      %{"name" => "鳌头镇", "code" => "440902104"},
      %{"name" => "袂花镇", "code" => "440902105"},
      %{"name" => "高山镇", "code" => "440902106"},
      %{"name" => "山阁镇", "code" => "440902107"},
      %{"name" => "羊角镇", "code" => "440902108"}
    ]

  def next(input) when input == "电白区" or input == "440904",
    do: [
      %{"name" => "南海街道", "code" => "440904001"},
      %{"name" => "高地街道", "code" => "440904002"},
      %{"name" => "水东街道", "code" => "440904003"},
      %{"name" => "电海街道", "code" => "440904004"},
      %{"name" => "陈村街道", "code" => "440904005"},
      %{"name" => "马踏镇", "code" => "440904100"},
      %{"name" => "岭门镇", "code" => "440904101"},
      %{"name" => "坡心镇", "code" => "440904102"},
      %{"name" => "七迳镇", "code" => "440904103"},
      %{"name" => "树仔镇", "code" => "440904104"},
      %{"name" => "沙院镇", "code" => "440904105"},
      %{"name" => "麻岗镇", "code" => "440904106"},
      %{"name" => "旦场镇", "code" => "440904107"},
      %{"name" => "小良镇", "code" => "440904109"},
      %{"name" => "霞洞镇", "code" => "440904115"},
      %{"name" => "观珠镇", "code" => "440904116"},
      %{"name" => "沙琅镇", "code" => "440904117"},
      %{"name" => "黄岭镇", "code" => "440904118"},
      %{"name" => "望夫镇", "code" => "440904119"},
      %{"name" => "罗坑镇", "code" => "440904120"},
      %{"name" => "那霍镇", "code" => "440904121"},
      %{"name" => "博贺镇", "code" => "440904125"},
      %{"name" => "林头镇", "code" => "440904126"},
      %{"name" => "电城镇", "code" => "440904127"},
      %{"name" => "曙光农场", "code" => "440904451"},
      %{"name" => "水丰农场", "code" => "440904452"},
      %{"name" => "新华农场", "code" => "440904453"},
      %{"name" => "电白盐场", "code" => "440904454"}
    ]

  def next(input) when input == "高州市" or input == "440981",
    do: [
      %{"name" => "石仔岭街道", "code" => "440981002"},
      %{"name" => "山美街道", "code" => "440981003"},
      %{"name" => "金山街道", "code" => "440981006"},
      %{"name" => "潘州街道", "code" => "440981007"},
      %{"name" => "宝光街道", "code" => "440981008"},
      %{"name" => "谢鸡镇", "code" => "440981100"},
      %{"name" => "新垌镇", "code" => "440981101"},
      %{"name" => "云潭镇", "code" => "440981102"},
      %{"name" => "分界镇", "code" => "440981103"},
      %{"name" => "根子镇", "code" => "440981104"},
      %{"name" => "泗水镇", "code" => "440981105"},
      %{"name" => "镇江镇", "code" => "440981107"},
      %{"name" => "沙田镇", "code" => "440981109"},
      %{"name" => "南塘镇", "code" => "440981110"},
      %{"name" => "荷花镇", "code" => "440981111"},
      %{"name" => "石板镇", "code" => "440981112"},
      %{"name" => "大井镇", "code" => "440981115"},
      %{"name" => "潭头镇", "code" => "440981116"},
      %{"name" => "大坡镇", "code" => "440981119"},
      %{"name" => "平山镇", "code" => "440981120"},
      %{"name" => "深镇镇", "code" => "440981121"},
      %{"name" => "马贵镇", "code" => "440981122"},
      %{"name" => "古丁镇", "code" => "440981123"},
      %{"name" => "曹江镇", "code" => "440981124"},
      %{"name" => "荷塘镇", "code" => "440981126"},
      %{"name" => "石鼓镇", "code" => "440981127"},
      %{"name" => "东岸镇", "code" => "440981128"},
      %{"name" => "长坡镇", "code" => "440981129"},
      %{"name" => "团结农场", "code" => "440981450"},
      %{"name" => "胜利农场", "code" => "440981451"},
      %{"name" => "火星农场", "code" => "440981452"}
    ]

  def next(input) when input == "化州市" or input == "440982",
    do: [
      %{"name" => "河西街道", "code" => "440982001"},
      %{"name" => "东山街道", "code" => "440982002"},
      %{"name" => "下郭街道", "code" => "440982003"},
      %{"name" => "南盛街道", "code" => "440982004"},
      %{"name" => "石湾街道", "code" => "440982005"},
      %{"name" => "鉴江街道", "code" => "440982006"},
      %{"name" => "长岐镇", "code" => "440982100"},
      %{"name" => "同庆镇", "code" => "440982101"},
      %{"name" => "杨梅镇", "code" => "440982102"},
      %{"name" => "良光镇", "code" => "440982103"},
      %{"name" => "笪桥镇", "code" => "440982104"},
      %{"name" => "丽岗镇", "code" => "440982106"},
      %{"name" => "新安镇", "code" => "440982107"},
      %{"name" => "官桥镇", "code" => "440982108"},
      %{"name" => "林尘镇", "code" => "440982110"},
      %{"name" => "合江镇", "code" => "440982112"},
      %{"name" => "那务镇", "code" => "440982113"},
      %{"name" => "播扬镇", "code" => "440982114"},
      %{"name" => "宝圩镇", "code" => "440982115"},
      %{"name" => "平定镇", "code" => "440982116"},
      %{"name" => "文楼镇", "code" => "440982117"},
      %{"name" => "江湖镇", "code" => "440982118"},
      %{"name" => "中垌镇", "code" => "440982120"},
      %{"name" => "新时代农场", "code" => "440982401"},
      %{"name" => "新华农场", "code" => "440982402"},
      %{"name" => "和平农场", "code" => "440982403"},
      %{"name" => "红阳农场", "code" => "440982404"},
      %{"name" => "红峰农场", "code" => "440982405"},
      %{"name" => "建设农场", "code" => "440982406"},
      %{"name" => "石滩农场", "code" => "440982407"}
    ]

  def next(input) when input == "信宜市" or input == "440983",
    do: [
      %{"name" => "东镇街道", "code" => "440983001"},
      %{"name" => "玉都街道", "code" => "440983002"},
      %{"name" => "镇隆镇", "code" => "440983101"},
      %{"name" => "水口镇", "code" => "440983102"},
      %{"name" => "丁堡镇", "code" => "440983105"},
      %{"name" => "池洞镇", "code" => "440983106"},
      %{"name" => "贵子镇", "code" => "440983112"},
      %{"name" => "怀乡镇", "code" => "440983113"},
      %{"name" => "茶山镇", "code" => "440983114"},
      %{"name" => "洪冠镇", "code" => "440983115"},
      %{"name" => "白石镇", "code" => "440983116"},
      %{"name" => "大成镇", "code" => "440983117"},
      %{"name" => "钱排镇", "code" => "440983118"},
      %{"name" => "合水镇", "code" => "440983119"},
      %{"name" => "新宝镇", "code" => "440983120"},
      %{"name" => "平塘镇", "code" => "440983121"},
      %{"name" => "思贺镇", "code" => "440983122"},
      %{"name" => "金垌镇", "code" => "440983123"},
      %{"name" => "朱砂镇", "code" => "440983124"},
      %{"name" => "北界镇", "code" => "440983125"},
      %{"name" => "信宜市国营红旗农场", "code" => "440983400"}
    ]

  def next(input) when input == "赤坎区" or input == "440802",
    do: [
      %{"name" => "中华街道", "code" => "440802001"},
      %{"name" => "寸金街道", "code" => "440802002"},
      %{"name" => "民主街道", "code" => "440802003"},
      %{"name" => "中山街道", "code" => "440802004"},
      %{"name" => "沙湾街道", "code" => "440802005"},
      %{"name" => "调顺街道", "code" => "440802006"},
      %{"name" => "南桥街道", "code" => "440802007"},
      %{"name" => "北桥街道", "code" => "440802008"}
    ]

  def next(input) when input == "霞山区" or input == "440803",
    do: [
      %{"name" => "解放街道", "code" => "440803001"},
      %{"name" => "爱国街道", "code" => "440803002"},
      %{"name" => "工农街道", "code" => "440803003"},
      %{"name" => "友谊街道", "code" => "440803004"},
      %{"name" => "新兴街道", "code" => "440803005"},
      %{"name" => "海滨街道", "code" => "440803006"},
      %{"name" => "建设街道", "code" => "440803009"},
      %{"name" => "东新街道", "code" => "440803010"},
      %{"name" => "新园街道", "code" => "440803011"},
      %{"name" => "海头街道", "code" => "440803012"},
      %{"name" => "泉庄街道", "code" => "440803070"},
      %{"name" => "乐华街道", "code" => "440803071"}
    ]

  def next(input) when input == "坡头区" or input == "440804",
    do: [
      %{"name" => "南调街道", "code" => "440804001"},
      %{"name" => "麻斜街道", "code" => "440804002"},
      %{"name" => "南三镇", "code" => "440804100"},
      %{"name" => "坡头镇", "code" => "440804101"},
      %{"name" => "乾塘镇", "code" => "440804102"},
      %{"name" => "龙头镇", "code" => "440804103"},
      %{"name" => "官渡镇", "code" => "440804104"},
      %{"name" => "湛江市坡头区官渡工业园", "code" => "440804401"}
    ]

  def next(input) when input == "麻章区" or input == "440811",
    do: [
      %{"name" => "东山街道", "code" => "440811070"},
      %{"name" => "东简街道", "code" => "440811071"},
      %{"name" => "民安街道", "code" => "440811072"},
      %{"name" => "麻章镇", "code" => "440811100"},
      %{"name" => "太平镇", "code" => "440811101"},
      %{"name" => "湖光镇", "code" => "440811102"},
      %{"name" => "硇洲镇", "code" => "440811173"}
    ]

  def next(input) when input == "遂溪县" or input == "440823",
    do: [
      %{"name" => "遂城街道", "code" => "440823001"},
      %{"name" => "黄略镇", "code" => "440823101"},
      %{"name" => "洋青镇", "code" => "440823102"},
      %{"name" => "界炮镇", "code" => "440823103"},
      %{"name" => "乐民镇", "code" => "440823104"},
      %{"name" => "江洪镇", "code" => "440823105"},
      %{"name" => "杨柑镇", "code" => "440823106"},
      %{"name" => "城月镇", "code" => "440823107"},
      %{"name" => "乌塘镇", "code" => "440823108"},
      %{"name" => "建新镇", "code" => "440823109"},
      %{"name" => "岭北镇", "code" => "440823110"},
      %{"name" => "北坡镇", "code" => "440823111"},
      %{"name" => "港门镇", "code" => "440823112"},
      %{"name" => "草潭镇", "code" => "440823113"},
      %{"name" => "河头镇", "code" => "440823114"},
      %{"name" => "附城镇", "code" => "440823115"}
    ]

  def next(input) when input == "徐闻县" or input == "440825",
    do: [
      %{"name" => "徐城街道", "code" => "440825001"},
      %{"name" => "迈陈镇", "code" => "440825102"},
      %{"name" => "海安镇", "code" => "440825103"},
      %{"name" => "曲界镇", "code" => "440825104"},
      %{"name" => "前山镇", "code" => "440825105"},
      %{"name" => "西连镇", "code" => "440825106"},
      %{"name" => "下桥镇", "code" => "440825107"},
      %{"name" => "龙塘镇", "code" => "440825108"},
      %{"name" => "下洋镇", "code" => "440825109"},
      %{"name" => "锦和镇", "code" => "440825110"},
      %{"name" => "和安镇", "code" => "440825111"},
      %{"name" => "新寮镇", "code" => "440825112"},
      %{"name" => "南山镇", "code" => "440825113"},
      %{"name" => "城北乡", "code" => "440825201"},
      %{"name" => "角尾乡", "code" => "440825204"}
    ]

  def next(input) when input == "廉江市" or input == "440881",
    do: [
      %{"name" => "罗州街道", "code" => "440881001"},
      %{"name" => "城南街道", "code" => "440881002"},
      %{"name" => "城北街道", "code" => "440881003"},
      %{"name" => "石城镇", "code" => "440881101"},
      %{"name" => "新民镇", "code" => "440881102"},
      %{"name" => "吉水镇", "code" => "440881103"},
      %{"name" => "河唇镇", "code" => "440881104"},
      %{"name" => "石角镇", "code" => "440881105"},
      %{"name" => "良垌镇", "code" => "440881106"},
      %{"name" => "横山镇", "code" => "440881107"},
      %{"name" => "安铺镇", "code" => "440881108"},
      %{"name" => "营仔镇", "code" => "440881109"},
      %{"name" => "青平镇", "code" => "440881110"},
      %{"name" => "车板镇", "code" => "440881111"},
      %{"name" => "高桥镇", "code" => "440881112"},
      %{"name" => "石岭镇", "code" => "440881113"},
      %{"name" => "雅塘镇", "code" => "440881114"},
      %{"name" => "石颈镇", "code" => "440881115"},
      %{"name" => "长山镇", "code" => "440881116"},
      %{"name" => "塘蓬镇", "code" => "440881117"},
      %{"name" => "和寮镇", "code" => "440881118"},
      %{"name" => "九洲江开发区", "code" => "440881401"}
    ]

  def next(input) when input == "雷州市" or input == "440882",
    do: [
      %{"name" => "雷城街道", "code" => "440882001"},
      %{"name" => "西湖街道", "code" => "440882002"},
      %{"name" => "新城街道", "code" => "440882003"},
      %{"name" => "白沙镇", "code" => "440882100"},
      %{"name" => "沈塘镇", "code" => "440882101"},
      %{"name" => "客路镇", "code" => "440882102"},
      %{"name" => "杨家镇", "code" => "440882103"},
      %{"name" => "唐家镇", "code" => "440882104"},
      %{"name" => "企水镇", "code" => "440882105"},
      %{"name" => "纪家镇", "code" => "440882106"},
      %{"name" => "松竹镇", "code" => "440882107"},
      %{"name" => "南兴镇", "code" => "440882108"},
      %{"name" => "雷高镇", "code" => "440882109"},
      %{"name" => "东里镇", "code" => "440882110"},
      %{"name" => "调风镇", "code" => "440882111"},
      %{"name" => "龙门镇", "code" => "440882112"},
      %{"name" => "英利镇", "code" => "440882113"},
      %{"name" => "北和镇", "code" => "440882114"},
      %{"name" => "乌石镇", "code" => "440882115"},
      %{"name" => "覃斗镇", "code" => "440882116"},
      %{"name" => "附城镇", "code" => "440882117"},
      %{"name" => "湛江奋勇高新技术产业开发区", "code" => "440882450"}
    ]

  def next(input) when input == "吴川市" or input == "440883",
    do: [
      %{"name" => "梅菉街道", "code" => "440883001"},
      %{"name" => "塘尾街道", "code" => "440883002"},
      %{"name" => "大山江街道", "code" => "440883003"},
      %{"name" => "博铺街道", "code" => "440883004"},
      %{"name" => "海滨街道", "code" => "440883005"},
      %{"name" => "浅水镇", "code" => "440883100"},
      %{"name" => "长岐镇", "code" => "440883101"},
      %{"name" => "覃巴镇", "code" => "440883102"},
      %{"name" => "王村港镇", "code" => "440883103"},
      %{"name" => "振文镇", "code" => "440883104"},
      %{"name" => "樟铺镇", "code" => "440883105"},
      %{"name" => "吴阳镇", "code" => "440883106"},
      %{"name" => "塘㙍镇", "code" => "440883107"},
      %{"name" => "黄坡镇", "code" => "440883109"},
      %{"name" => "兰石镇", "code" => "440883111"}
    ]

  def next(input) when input == "蓬江区" or input == "440703",
    do: [
      %{"name" => "白沙街道", "code" => "440703002"},
      %{"name" => "潮连街道", "code" => "440703005"},
      %{"name" => "环市街道", "code" => "440703006"},
      %{"name" => "棠下镇", "code" => "440703101"},
      %{"name" => "荷塘镇", "code" => "440703102"},
      %{"name" => "杜阮镇", "code" => "440703103"}
    ]

  def next(input) when input == "江海区" or input == "440704",
    do: [
      %{"name" => "江南街道", "code" => "440704001"},
      %{"name" => "外海街道", "code" => "440704004"},
      %{"name" => "礼乐街道", "code" => "440704005"}
    ]

  def next(input) when input == "新会区" or input == "440705",
    do: [
      %{"name" => "会城街道", "code" => "440705001"},
      %{"name" => "大泽镇", "code" => "440705101"},
      %{"name" => "司前镇", "code" => "440705102"},
      %{"name" => "罗坑镇", "code" => "440705103"},
      %{"name" => "双水镇", "code" => "440705104"},
      %{"name" => "崖门镇", "code" => "440705105"},
      %{"name" => "沙堆镇", "code" => "440705106"},
      %{"name" => "古井镇", "code" => "440705107"},
      %{"name" => "三江镇", "code" => "440705108"},
      %{"name" => "睦洲镇", "code" => "440705109"},
      %{"name" => "大鳌镇", "code" => "440705110"},
      %{"name" => "圭峰区", "code" => "440705450"},
      %{"name" => "银湖湾", "code" => "440705451"},
      %{"name" => "银湖湾滨海新区", "code" => "440705452"},
      %{"name" => "工业园区", "code" => "440705453"},
      %{"name" => "新会经济开发区", "code" => "440705470"}
    ]

  def next(input) when input == "台山市" or input == "440781",
    do: [
      %{"name" => "台城街道", "code" => "440781001"},
      %{"name" => "大江镇", "code" => "440781100"},
      %{"name" => "水步镇", "code" => "440781101"},
      %{"name" => "四九镇", "code" => "440781102"},
      %{"name" => "白沙镇", "code" => "440781103"},
      %{"name" => "三合镇", "code" => "440781104"},
      %{"name" => "冲蒌镇", "code" => "440781105"},
      %{"name" => "斗山镇", "code" => "440781106"},
      %{"name" => "都斛镇", "code" => "440781107"},
      %{"name" => "赤溪镇", "code" => "440781108"},
      %{"name" => "端芬镇", "code" => "440781109"},
      %{"name" => "广海镇", "code" => "440781110"},
      %{"name" => "海宴镇", "code" => "440781111"},
      %{"name" => "汶村镇", "code" => "440781112"},
      %{"name" => "深井镇", "code" => "440781113"},
      %{"name" => "北陡镇", "code" => "440781114"},
      %{"name" => "川岛镇", "code" => "440781115"}
    ]

  def next(input) when input == "开平市" or input == "440783",
    do: [
      %{"name" => "三埠街道", "code" => "440783001"},
      %{"name" => "长沙街道", "code" => "440783002"},
      %{"name" => "沙塘镇", "code" => "440783103"},
      %{"name" => "苍城镇", "code" => "440783104"},
      %{"name" => "龙胜镇", "code" => "440783105"},
      %{"name" => "大沙镇", "code" => "440783106"},
      %{"name" => "马冈镇", "code" => "440783107"},
      %{"name" => "塘口镇", "code" => "440783108"},
      %{"name" => "赤坎镇", "code" => "440783109"},
      %{"name" => "百合镇", "code" => "440783110"},
      %{"name" => "蚬冈镇", "code" => "440783111"},
      %{"name" => "金鸡镇", "code" => "440783112"},
      %{"name" => "月山镇", "code" => "440783115"},
      %{"name" => "赤水镇", "code" => "440783116"},
      %{"name" => "水口镇", "code" => "440783117"},
      %{"name" => "翠山湖新区", "code" => "440783400"}
    ]

  def next(input) when input == "鹤山市" or input == "440784",
    do: [
      %{"name" => "沙坪街道", "code" => "440784001"},
      %{"name" => "龙口镇", "code" => "440784101"},
      %{"name" => "雅瑶镇", "code" => "440784102"},
      %{"name" => "古劳镇", "code" => "440784103"},
      %{"name" => "桃源镇", "code" => "440784104"},
      %{"name" => "鹤城镇", "code" => "440784105"},
      %{"name" => "共和镇", "code" => "440784106"},
      %{"name" => "址山镇", "code" => "440784107"},
      %{"name" => "宅梧镇", "code" => "440784108"},
      %{"name" => "双合镇", "code" => "440784112"},
      %{"name" => "广东省江门监狱", "code" => "440784401"},
      %{"name" => "江门市四堡林场", "code" => "440784402"}
    ]

  def next(input) when input == "恩平市" or input == "440785",
    do: [
      %{"name" => "恩城街道", "code" => "440785001"},
      %{"name" => "横陂镇", "code" => "440785100"},
      %{"name" => "圣堂镇", "code" => "440785101"},
      %{"name" => "良西镇", "code" => "440785102"},
      %{"name" => "沙湖镇", "code" => "440785103"},
      %{"name" => "牛江镇", "code" => "440785104"},
      %{"name" => "君堂镇", "code" => "440785105"},
      %{"name" => "大田镇", "code" => "440785106"},
      %{"name" => "那吉镇", "code" => "440785107"},
      %{"name" => "大槐镇", "code" => "440785108"},
      %{"name" => "东成镇", "code" => "440785109"},
      %{"name" => "恩平园区", "code" => "440785400"}
    ]

  def next(input) when input == "禅城区" or input == "440604",
    do: [
      %{"name" => "石湾镇街道", "code" => "440604010"},
      %{"name" => "张槎街道", "code" => "440604011"},
      %{"name" => "祖庙街道", "code" => "440604012"},
      %{"name" => "南庄镇", "code" => "440604100"}
    ]

  def next(input) when input == "南海区" or input == "440605",
    do: [
      %{"name" => "桂城街道", "code" => "440605011"},
      %{"name" => "九江镇", "code" => "440605121"},
      %{"name" => "西樵镇", "code" => "440605122"},
      %{"name" => "丹灶镇", "code" => "440605123"},
      %{"name" => "狮山镇", "code" => "440605124"},
      %{"name" => "大沥镇", "code" => "440605125"},
      %{"name" => "里水镇", "code" => "440605126"}
    ]

  def next(input) when input == "顺德区" or input == "440606",
    do: [
      %{"name" => "伦教街道", "code" => "440606003"},
      %{"name" => "勒流街道", "code" => "440606004"},
      %{"name" => "大良街道", "code" => "440606005"},
      %{"name" => "容桂街道", "code" => "440606006"},
      %{"name" => "陈村镇", "code" => "440606101"},
      %{"name" => "北滘镇", "code" => "440606102"},
      %{"name" => "乐从镇", "code" => "440606103"},
      %{"name" => "龙江镇", "code" => "440606104"},
      %{"name" => "杏坛镇", "code" => "440606105"},
      %{"name" => "均安镇", "code" => "440606106"}
    ]

  def next(input) when input == "三水区" or input == "440607",
    do: [
      %{"name" => "西南街道", "code" => "440607001"},
      %{"name" => "云东海街道", "code" => "440607004"},
      %{"name" => "大塘镇", "code" => "440607101"},
      %{"name" => "乐平镇", "code" => "440607103"},
      %{"name" => "白坭镇", "code" => "440607104"},
      %{"name" => "芦苞镇", "code" => "440607105"},
      %{"name" => "南山镇", "code" => "440607106"},
      %{"name" => "省三水劳教所", "code" => "440607400"},
      %{"name" => "省南丰劳教所", "code" => "440607401"},
      %{"name" => "省女子劳教所", "code" => "440607402"},
      %{"name" => "省第二戒毒劳教所", "code" => "440607403"},
      %{"name" => "广州军区三水农场", "code" => "440607404"}
    ]

  def next(input) when input == "高明区" or input == "440608",
    do: [
      %{"name" => "荷城街道", "code" => "440608004"},
      %{"name" => "杨和镇", "code" => "440608106"},
      %{"name" => "明城镇", "code" => "440608107"},
      %{"name" => "更合镇", "code" => "440608108"},
      %{"name" => "高明监狱", "code" => "440608400"},
      %{"name" => "云勇林场", "code" => "440608401"},
      %{"name" => "对川茶场", "code" => "440608402"},
      %{"name" => "佛山监狱", "code" => "440608403"}
    ]

  def next(input) when input == "龙湖区" or input == "440507",
    do: [
      %{"name" => "金霞街道", "code" => "440507001"},
      %{"name" => "珠池街道", "code" => "440507003"},
      %{"name" => "新津街道", "code" => "440507004"},
      %{"name" => "鸥汀街道", "code" => "440507005"},
      %{"name" => "龙祥街道", "code" => "440507008"},
      %{"name" => "外砂街道", "code" => "440507009"},
      %{"name" => "龙华街道", "code" => "440507010"},
      %{"name" => "新溪街道", "code" => "440507011"},
      %{"name" => "新海街道", "code" => "440507012"},
      %{"name" => "龙腾街道", "code" => "440507013"}
    ]

  def next(input) when input == "金平区" or input == "440511",
    do: [
      %{"name" => "石炮台街道", "code" => "440511001"},
      %{"name" => "金砂街道", "code" => "440511002"},
      %{"name" => "东方街道", "code" => "440511004"},
      %{"name" => "大华街道", "code" => "440511005"},
      %{"name" => "光华街道", "code" => "440511007"},
      %{"name" => "广厦街道", "code" => "440511009"},
      %{"name" => "岐山街道", "code" => "440511013"},
      %{"name" => "鮀莲街道", "code" => "440511015"},
      %{"name" => "鮀江街道", "code" => "440511016"},
      %{"name" => "月浦街道", "code" => "440511017"},
      %{"name" => "小公园街道", "code" => "440511018"},
      %{"name" => "金东街道", "code" => "440511019"}
    ]

  def next(input) when input == "濠江区" or input == "440512",
    do: [
      %{"name" => "达濠街道", "code" => "440512001"},
      %{"name" => "马窖街道", "code" => "440512002"},
      %{"name" => "礐石街道", "code" => "440512003"},
      %{"name" => "广澳街道", "code" => "440512004"},
      %{"name" => "滨海街道", "code" => "440512005"},
      %{"name" => "河浦街道", "code" => "440512006"},
      %{"name" => "玉新街道", "code" => "440512007"}
    ]

  def next(input) when input == "潮阳区" or input == "440513",
    do: [
      %{"name" => "文光街道", "code" => "440513001"},
      %{"name" => "棉北街道", "code" => "440513002"},
      %{"name" => "城南街道", "code" => "440513003"},
      %{"name" => "金浦街道", "code" => "440513004"},
      %{"name" => "海门镇", "code" => "440513100"},
      %{"name" => "河溪镇", "code" => "440513101"},
      %{"name" => "和平镇", "code" => "440513102"},
      %{"name" => "西胪镇", "code" => "440513103"},
      %{"name" => "关埠镇", "code" => "440513104"},
      %{"name" => "谷饶镇", "code" => "440513106"},
      %{"name" => "贵屿镇", "code" => "440513107"},
      %{"name" => "铜盂镇", "code" => "440513108"},
      %{"name" => "金灶镇", "code" => "440513110"}
    ]

  def next(input) when input == "潮南区" or input == "440514",
    do: [
      %{"name" => "峡山街道", "code" => "440514001"},
      %{"name" => "井都镇", "code" => "440514101"},
      %{"name" => "成田镇", "code" => "440514103"},
      %{"name" => "司马浦镇", "code" => "440514104"},
      %{"name" => "陈店镇", "code" => "440514105"},
      %{"name" => "两英镇", "code" => "440514106"},
      %{"name" => "仙城镇", "code" => "440514107"},
      %{"name" => "胪岗镇", "code" => "440514108"},
      %{"name" => "红场镇", "code" => "440514109"},
      %{"name" => "雷岭镇", "code" => "440514110"},
      %{"name" => "陇田镇", "code" => "440514112"}
    ]

  def next(input) when input == "澄海区" or input == "440515",
    do: [
      %{"name" => "凤翔街道", "code" => "440515001"},
      %{"name" => "广益街道", "code" => "440515002"},
      %{"name" => "澄华街道", "code" => "440515003"},
      %{"name" => "上华镇", "code" => "440515100"},
      %{"name" => "隆都镇", "code" => "440515101"},
      %{"name" => "莲下镇", "code" => "440515102"},
      %{"name" => "莲上镇", "code" => "440515103"},
      %{"name" => "溪南镇", "code" => "440515104"},
      %{"name" => "东里镇", "code" => "440515105"},
      %{"name" => "盐鸿镇", "code" => "440515106"},
      %{"name" => "莲华镇", "code" => "440515107"}
    ]

  def next(input) when input == "南澳县" or input == "440523",
    do: [
      %{"name" => "后宅镇", "code" => "440523100"},
      %{"name" => "云澳镇", "code" => "440523101"},
      %{"name" => "深澳镇", "code" => "440523102"}
    ]

  def next(input) when input == "香洲区" or input == "440402",
    do: [
      %{"name" => "翠香街道", "code" => "440402001"},
      %{"name" => "梅华街道", "code" => "440402002"},
      %{"name" => "前山街道", "code" => "440402003"},
      %{"name" => "吉大街道", "code" => "440402004"},
      %{"name" => "拱北街道", "code" => "440402005"},
      %{"name" => "香湾街道", "code" => "440402006"},
      %{"name" => "狮山街道", "code" => "440402007"},
      %{"name" => "湾仔街道", "code" => "440402008"},
      %{"name" => "凤山街道", "code" => "440402009"},
      %{"name" => "唐家湾镇", "code" => "440402100"},
      %{"name" => "南屏镇", "code" => "440402102"},
      %{"name" => "横琴镇", "code" => "440402104"},
      %{"name" => "桂山镇", "code" => "440402105"},
      %{"name" => "万山镇", "code" => "440402106"},
      %{"name" => "担杆镇", "code" => "440402107"},
      %{"name" => "南屏科技园", "code" => "440402401"},
      %{"name" => "保税区", "code" => "440402402"},
      %{"name" => "三溪科创小镇发展中心", "code" => "440402403"},
      %{"name" => "洪湾商贸物流中心", "code" => "440402404"}
    ]

  def next(input) when input == "斗门区" or input == "440403",
    do: [
      %{"name" => "白藤街道", "code" => "440403001"},
      %{"name" => "莲洲镇", "code" => "440403100"},
      %{"name" => "斗门镇", "code" => "440403103"},
      %{"name" => "乾务镇", "code" => "440403105"},
      %{"name" => "白蕉镇", "code" => "440403106"},
      %{"name" => "井岸镇", "code" => "440403107"}
    ]

  def next(input) when input == "金湾区" or input == "440404",
    do: [
      %{"name" => "三灶镇", "code" => "440404100"},
      %{"name" => "南水镇", "code" => "440404101"},
      %{"name" => "红旗镇", "code" => "440404103"},
      %{"name" => "平沙镇", "code" => "440404104"},
      %{"name" => "联港工业区", "code" => "440404400"},
      %{"name" => "航空产业园", "code" => "440404401"}
    ]

  def next(input) when input == "罗湖区" or input == "440303",
    do: [
      %{"name" => "桂园街道", "code" => "440303001"},
      %{"name" => "黄贝街道", "code" => "440303002"},
      %{"name" => "东门街道", "code" => "440303003"},
      %{"name" => "翠竹街道", "code" => "440303004"},
      %{"name" => "南湖街道", "code" => "440303005"},
      %{"name" => "笋岗街道", "code" => "440303006"},
      %{"name" => "东湖街道", "code" => "440303007"},
      %{"name" => "莲塘街道", "code" => "440303008"},
      %{"name" => "东晓街道", "code" => "440303009"},
      %{"name" => "清水河街道", "code" => "440303010"}
    ]

  def next(input) when input == "福田区" or input == "440304",
    do: [
      %{"name" => "南园街道", "code" => "440304001"},
      %{"name" => "园岭街道", "code" => "440304002"},
      %{"name" => "福田街道", "code" => "440304004"},
      %{"name" => "沙头街道", "code" => "440304005"},
      %{"name" => "香蜜湖街道", "code" => "440304006"},
      %{"name" => "梅林街道", "code" => "440304007"},
      %{"name" => "莲花街道", "code" => "440304008"},
      %{"name" => "华富街道", "code" => "440304009"},
      %{"name" => "福保街道", "code" => "440304010"},
      %{"name" => "华强北街道", "code" => "440304011"},
      %{"name" => "福田保税区", "code" => "440304400"}
    ]

  def next(input) when input == "南山区" or input == "440305",
    do: [
      %{"name" => "南头街道", "code" => "440305001"},
      %{"name" => "南山街道", "code" => "440305002"},
      %{"name" => "沙河街道", "code" => "440305003"},
      %{"name" => "蛇口街道", "code" => "440305005"},
      %{"name" => "招商街道", "code" => "440305006"},
      %{"name" => "粤海街道", "code" => "440305007"},
      %{"name" => "桃源街道", "code" => "440305008"},
      %{"name" => "西丽街道", "code" => "440305009"},
      %{"name" => "前海合作区", "code" => "440305400"}
    ]

  def next(input) when input == "宝安区" or input == "440306",
    do: [
      %{"name" => "新安街道", "code" => "440306017"},
      %{"name" => "西乡街道", "code" => "440306018"},
      %{"name" => "航城街道", "code" => "440306019"},
      %{"name" => "福永街道", "code" => "440306020"},
      %{"name" => "福海街道", "code" => "440306021"},
      %{"name" => "沙井街道", "code" => "440306022"},
      %{"name" => "新桥街道", "code" => "440306023"},
      %{"name" => "松岗街道", "code" => "440306024"},
      %{"name" => "燕罗街道", "code" => "440306025"},
      %{"name" => "石岩街道", "code" => "440306026"},
      %{"name" => "深圳市宝安国际机场", "code" => "440306400"}
    ]

  def next(input) when input == "龙岗区" or input == "440307",
    do: [
      %{"name" => "平湖街道", "code" => "440307003"},
      %{"name" => "坪地街道", "code" => "440307006"},
      %{"name" => "葵涌街道", "code" => "440307009"},
      %{"name" => "大鹏街道", "code" => "440307010"},
      %{"name" => "南澳街道", "code" => "440307011"},
      %{"name" => "南湾街道", "code" => "440307012"},
      %{"name" => "坂田街道", "code" => "440307013"},
      %{"name" => "布吉街道", "code" => "440307014"},
      %{"name" => "龙城街道", "code" => "440307015"},
      %{"name" => "龙岗街道", "code" => "440307016"},
      %{"name" => "横岗街道", "code" => "440307017"},
      %{"name" => "吉华街道", "code" => "440307018"},
      %{"name" => "宝龙街道", "code" => "440307019"},
      %{"name" => "园山街道", "code" => "440307020"}
    ]

  def next(input) when input == "盐田区" or input == "440308",
    do: [
      %{"name" => "梅沙街道", "code" => "440308001"},
      %{"name" => "盐田街道", "code" => "440308002"},
      %{"name" => "沙头角街道", "code" => "440308003"},
      %{"name" => "海山街道", "code" => "440308004"},
      %{"name" => "深圳盐田综合保税区", "code" => "440308403"}
    ]

  def next(input) when input == "龙华区" or input == "440309",
    do: [
      %{"name" => "观湖街道", "code" => "440309001"},
      %{"name" => "民治街道", "code" => "440309002"},
      %{"name" => "龙华街道", "code" => "440309003"},
      %{"name" => "大浪街道", "code" => "440309004"},
      %{"name" => "福城街道", "code" => "440309005"},
      %{"name" => "观澜街道", "code" => "440309006"}
    ]

  def next(input) when input == "坪山区" or input == "440310",
    do: [
      %{"name" => "坪山街道", "code" => "440310001"},
      %{"name" => "马峦街道", "code" => "440310002"},
      %{"name" => "碧岭街道", "code" => "440310003"},
      %{"name" => "石井街道", "code" => "440310004"},
      %{"name" => "坑梓街道", "code" => "440310005"},
      %{"name" => "龙田街道", "code" => "440310006"},
      %{"name" => "深圳坪山综合保税区", "code" => "440310401"}
    ]

  def next(input) when input == "光明区" or input == "440311",
    do: [
      %{"name" => "光明街道", "code" => "440311001"},
      %{"name" => "公明街道", "code" => "440311002"},
      %{"name" => "新湖街道", "code" => "440311003"},
      %{"name" => "凤凰街道", "code" => "440311004"},
      %{"name" => "玉塘街道", "code" => "440311005"},
      %{"name" => "马田街道", "code" => "440311006"}
    ]

  def next(input) when input == "武江区" or input == "440203",
    do: [
      %{"name" => "新华街道", "code" => "440203001"},
      %{"name" => "惠民街道", "code" => "440203002"},
      %{"name" => "西联镇", "code" => "440203100"},
      %{"name" => "西河镇", "code" => "440203101"},
      %{"name" => "龙归镇", "code" => "440203102"},
      %{"name" => "江湾镇", "code" => "440203103"},
      %{"name" => "重阳镇", "code" => "440203104"}
    ]

  def next(input) when input == "浈江区" or input == "440204",
    do: [
      %{"name" => "东河街道", "code" => "440204001"},
      %{"name" => "车站街道", "code" => "440204002"},
      %{"name" => "风采街道", "code" => "440204008"},
      %{"name" => "新韶镇", "code" => "440204100"},
      %{"name" => "乐园镇", "code" => "440204101"},
      %{"name" => "十里亭镇", "code" => "440204102"},
      %{"name" => "犁市镇", "code" => "440204103"},
      %{"name" => "花坪镇", "code" => "440204104"},
      %{"name" => "曲仁矿务局田螺冲管理区", "code" => "440204401"},
      %{"name" => "曲仁矿务局曲仁管理区", "code" => "440204402"}
    ]

  def next(input) when input == "曲江区" or input == "440205",
    do: [
      %{"name" => "松山街道", "code" => "440205001"},
      %{"name" => "马坝镇", "code" => "440205100"},
      %{"name" => "大塘镇", "code" => "440205101"},
      %{"name" => "枫湾镇", "code" => "440205102"},
      %{"name" => "小坑镇", "code" => "440205103"},
      %{"name" => "沙溪镇", "code" => "440205104"},
      %{"name" => "乌石镇", "code" => "440205106"},
      %{"name" => "樟市镇", "code" => "440205107"},
      %{"name" => "白土镇", "code" => "440205108"},
      %{"name" => "罗坑镇", "code" => "440205109"}
    ]

  def next(input) when input == "始兴县" or input == "440222",
    do: [
      %{"name" => "太平镇", "code" => "440222100"},
      %{"name" => "马市镇", "code" => "440222101"},
      %{"name" => "澄江镇", "code" => "440222102"},
      %{"name" => "顿岗镇", "code" => "440222103"},
      %{"name" => "罗坝镇", "code" => "440222104"},
      %{"name" => "司前镇", "code" => "440222105"},
      %{"name" => "隘子镇", "code" => "440222106"},
      %{"name" => "城南镇", "code" => "440222107"},
      %{"name" => "沈所镇", "code" => "440222108"},
      %{"name" => "深渡水乡", "code" => "440222204"}
    ]

  def next(input) when input == "仁化县" or input == "440224",
    do: [
      %{"name" => "丹霞街道", "code" => "440224001"},
      %{"name" => "闻韶镇", "code" => "440224102"},
      %{"name" => "扶溪镇", "code" => "440224103"},
      %{"name" => "长江镇", "code" => "440224104"},
      %{"name" => "城口镇", "code" => "440224105"},
      %{"name" => "红山镇", "code" => "440224106"},
      %{"name" => "石塘镇", "code" => "440224107"},
      %{"name" => "董塘镇", "code" => "440224108"},
      %{"name" => "大桥镇", "code" => "440224109"},
      %{"name" => "周田镇", "code" => "440224110"},
      %{"name" => "黄坑镇", "code" => "440224111"}
    ]

  def next(input) when input == "翁源县" or input == "440229",
    do: [
      %{"name" => "龙仙镇", "code" => "440229100"},
      %{"name" => "坝仔镇", "code" => "440229104"},
      %{"name" => "江尾镇", "code" => "440229106"},
      %{"name" => "官渡镇", "code" => "440229109"},
      %{"name" => "周陂镇", "code" => "440229111"},
      %{"name" => "翁城镇", "code" => "440229113"},
      %{"name" => "新江镇", "code" => "440229114"},
      %{"name" => "铁龙镇", "code" => "440229115"}
    ]

  def next(input) when input == "乳源瑶族自治县" or input == "440232",
    do: [
      %{"name" => "乳城镇", "code" => "440232100"},
      %{"name" => "一六镇", "code" => "440232103"},
      %{"name" => "桂头镇", "code" => "440232104"},
      %{"name" => "洛阳镇", "code" => "440232106"},
      %{"name" => "大布镇", "code" => "440232108"},
      %{"name" => "大桥镇", "code" => "440232109"},
      %{"name" => "东坪镇", "code" => "440232111"},
      %{"name" => "游溪镇", "code" => "440232112"},
      %{"name" => "必背镇", "code" => "440232113"},
      %{"name" => "天井山林场", "code" => "440232450"},
      %{"name" => "乳阳林场", "code" => "440232451"}
    ]

  def next(input) when input == "新丰县" or input == "440233",
    do: [
      %{"name" => "丰城街道", "code" => "440233001"},
      %{"name" => "黄磜镇", "code" => "440233100"},
      %{"name" => "马头镇", "code" => "440233101"},
      %{"name" => "梅坑镇", "code" => "440233102"},
      %{"name" => "沙田镇", "code" => "440233103"},
      %{"name" => "遥田镇", "code" => "440233104"},
      %{"name" => "回龙镇", "code" => "440233105"}
    ]

  def next(input) when input == "乐昌市" or input == "440281",
    do: [
      %{"name" => "乐城街道", "code" => "440281001"},
      %{"name" => "北乡镇", "code" => "440281102"},
      %{"name" => "九峰镇", "code" => "440281103"},
      %{"name" => "廊田镇", "code" => "440281104"},
      %{"name" => "长来镇", "code" => "440281105"},
      %{"name" => "梅花镇", "code" => "440281106"},
      %{"name" => "三溪镇", "code" => "440281107"},
      %{"name" => "坪石镇", "code" => "440281108"},
      %{"name" => "黄圃镇", "code" => "440281110"},
      %{"name" => "五山镇", "code" => "440281111"},
      %{"name" => "两江镇", "code" => "440281112"},
      %{"name" => "沙坪镇", "code" => "440281113"},
      %{"name" => "云岩镇", "code" => "440281114"},
      %{"name" => "秀水镇", "code" => "440281115"},
      %{"name" => "大源镇", "code" => "440281117"},
      %{"name" => "庆云镇", "code" => "440281118"},
      %{"name" => "白石镇", "code" => "440281119"},
      %{"name" => "坪梅矿务局坪石管理区", "code" => "440281451"},
      %{"name" => "坪梅矿务局梅田管理区", "code" => "440281452"}
    ]

  def next(input) when input == "南雄市" or input == "440282",
    do: [
      %{"name" => "雄州街道", "code" => "440282001"},
      %{"name" => "乌迳镇", "code" => "440282100"},
      %{"name" => "界址镇", "code" => "440282103"},
      %{"name" => "坪田镇", "code" => "440282104"},
      %{"name" => "黄坑镇", "code" => "440282105"},
      %{"name" => "邓坊镇", "code" => "440282106"},
      %{"name" => "油山镇", "code" => "440282107"},
      %{"name" => "南亩镇", "code" => "440282109"},
      %{"name" => "水口镇", "code" => "440282110"},
      %{"name" => "江头镇", "code" => "440282111"},
      %{"name" => "湖口镇", "code" => "440282112"},
      %{"name" => "珠玑镇", "code" => "440282113"},
      %{"name" => "主田镇", "code" => "440282115"},
      %{"name" => "古市镇", "code" => "440282116"},
      %{"name" => "全安镇", "code" => "440282118"},
      %{"name" => "百顺镇", "code" => "440282120"},
      %{"name" => "澜河镇", "code" => "440282121"},
      %{"name" => "帽子峰镇", "code" => "440282122"},
      %{"name" => "东莞大岭山（南雄）产业转移工业园", "code" => "440282400"}
    ]

  def next(input) when input == "荔湾区" or input == "440103",
    do: [
      %{"name" => "沙面街道", "code" => "440103001"},
      %{"name" => "岭南街道", "code" => "440103002"},
      %{"name" => "华林街道", "code" => "440103003"},
      %{"name" => "多宝街道", "code" => "440103004"},
      %{"name" => "昌华街道", "code" => "440103005"},
      %{"name" => "逢源街道", "code" => "440103006"},
      %{"name" => "龙津街道", "code" => "440103007"},
      %{"name" => "金花街道", "code" => "440103008"},
      %{"name" => "彩虹街道", "code" => "440103009"},
      %{"name" => "南源街道", "code" => "440103010"},
      %{"name" => "西村街道", "code" => "440103011"},
      %{"name" => "站前街道", "code" => "440103012"},
      %{"name" => "桥中街道", "code" => "440103013"},
      %{"name" => "白鹤洞街道", "code" => "440103014"},
      %{"name" => "冲口街道", "code" => "440103015"},
      %{"name" => "花地街道", "code" => "440103016"},
      %{"name" => "石围塘街道", "code" => "440103017"},
      %{"name" => "茶滘街道", "code" => "440103018"},
      %{"name" => "东漖街道", "code" => "440103019"},
      %{"name" => "海龙街道", "code" => "440103020"},
      %{"name" => "东沙街道", "code" => "440103021"},
      %{"name" => "中南街道", "code" => "440103022"}
    ]

  def next(input) when input == "越秀区" or input == "440104",
    do: [
      %{"name" => "洪桥街道", "code" => "440104001"},
      %{"name" => "北京街道", "code" => "440104003"},
      %{"name" => "六榕街道", "code" => "440104004"},
      %{"name" => "流花街道", "code" => "440104005"},
      %{"name" => "光塔街道", "code" => "440104007"},
      %{"name" => "人民街道", "code" => "440104010"},
      %{"name" => "东山街道", "code" => "440104011"},
      %{"name" => "农林街道", "code" => "440104012"},
      %{"name" => "梅花村街道", "code" => "440104013"},
      %{"name" => "黄花岗街道", "code" => "440104014"},
      %{"name" => "华乐街道", "code" => "440104015"},
      %{"name" => "建设街道", "code" => "440104016"},
      %{"name" => "大塘街道", "code" => "440104017"},
      %{"name" => "珠光街道", "code" => "440104018"},
      %{"name" => "大东街道", "code" => "440104019"},
      %{"name" => "白云街道", "code" => "440104020"},
      %{"name" => "登峰街道", "code" => "440104021"},
      %{"name" => "矿泉街道", "code" => "440104022"}
    ]

  def next(input) when input == "海珠区" or input == "440105",
    do: [
      %{"name" => "赤岗街道", "code" => "440105001"},
      %{"name" => "新港街道", "code" => "440105002"},
      %{"name" => "昌岗街道", "code" => "440105003"},
      %{"name" => "江南中街道", "code" => "440105004"},
      %{"name" => "滨江街道", "code" => "440105005"},
      %{"name" => "素社街道", "code" => "440105006"},
      %{"name" => "海幢街道", "code" => "440105007"},
      %{"name" => "南华西街道", "code" => "440105008"},
      %{"name" => "龙凤街道", "code" => "440105009"},
      %{"name" => "沙园街道", "code" => "440105010"},
      %{"name" => "南石头街道", "code" => "440105011"},
      %{"name" => "凤阳街道", "code" => "440105012"},
      %{"name" => "瑞宝街道", "code" => "440105013"},
      %{"name" => "江海街道", "code" => "440105014"},
      %{"name" => "琶洲街道", "code" => "440105015"},
      %{"name" => "南洲街道", "code" => "440105016"},
      %{"name" => "华洲街道", "code" => "440105017"},
      %{"name" => "官洲街道", "code" => "440105018"}
    ]

  def next(input) when input == "天河区" or input == "440106",
    do: [
      %{"name" => "五山街道", "code" => "440106001"},
      %{"name" => "员村街道", "code" => "440106002"},
      %{"name" => "车陂街道", "code" => "440106003"},
      %{"name" => "沙河街道", "code" => "440106004"},
      %{"name" => "石牌街道", "code" => "440106006"},
      %{"name" => "沙东街道", "code" => "440106007"},
      %{"name" => "天河南街道", "code" => "440106008"},
      %{"name" => "林和街道", "code" => "440106009"},
      %{"name" => "兴华街道", "code" => "440106010"},
      %{"name" => "棠下街道", "code" => "440106011"},
      %{"name" => "天园街道", "code" => "440106012"},
      %{"name" => "猎德街道", "code" => "440106013"},
      %{"name" => "冼村街道", "code" => "440106014"},
      %{"name" => "元岗街道", "code" => "440106015"},
      %{"name" => "黄村街道", "code" => "440106016"},
      %{"name" => "长兴街道", "code" => "440106017"},
      %{"name" => "龙洞街道", "code" => "440106018"},
      %{"name" => "凤凰街道", "code" => "440106019"},
      %{"name" => "前进街道", "code" => "440106020"},
      %{"name" => "珠吉街道", "code" => "440106021"},
      %{"name" => "新塘街道", "code" => "440106022"}
    ]

  def next(input) when input == "白云区" or input == "440111",
    do: [
      %{"name" => "三元里街道", "code" => "440111002"},
      %{"name" => "松洲街道", "code" => "440111003"},
      %{"name" => "景泰街道", "code" => "440111004"},
      %{"name" => "同德街道", "code" => "440111005"},
      %{"name" => "黄石街道", "code" => "440111006"},
      %{"name" => "棠景街道", "code" => "440111007"},
      %{"name" => "新市街道", "code" => "440111008"},
      %{"name" => "同和街道", "code" => "440111009"},
      %{"name" => "京溪街道", "code" => "440111010"},
      %{"name" => "永平街道", "code" => "440111011"},
      %{"name" => "嘉禾街道", "code" => "440111012"},
      %{"name" => "均禾街道", "code" => "440111013"},
      %{"name" => "石井街道", "code" => "440111014"},
      %{"name" => "金沙街道", "code" => "440111015"},
      %{"name" => "云城街道", "code" => "440111016"},
      %{"name" => "鹤龙街道", "code" => "440111017"},
      %{"name" => "白云湖街道", "code" => "440111018"},
      %{"name" => "石门街道", "code" => "440111019"},
      %{"name" => "龙归街道", "code" => "440111020"},
      %{"name" => "大源街道", "code" => "440111021"},
      %{"name" => "人和镇", "code" => "440111103"},
      %{"name" => "太和镇", "code" => "440111107"},
      %{"name" => "钟落潭镇", "code" => "440111108"},
      %{"name" => "江高镇", "code" => "440111113"}
    ]

  def next(input) when input == "黄埔区" or input == "440112",
    do: [
      %{"name" => "黄埔街道", "code" => "440112001"},
      %{"name" => "红山街道", "code" => "440112002"},
      %{"name" => "鱼珠街道", "code" => "440112003"},
      %{"name" => "大沙街道", "code" => "440112005"},
      %{"name" => "文冲街道", "code" => "440112006"},
      %{"name" => "穗东街道", "code" => "440112007"},
      %{"name" => "南岗街道", "code" => "440112008"},
      %{"name" => "长洲街道", "code" => "440112010"},
      %{"name" => "夏港街道", "code" => "440112011"},
      %{"name" => "萝岗街道", "code" => "440112012"},
      %{"name" => "云埔街道", "code" => "440112013"},
      %{"name" => "联和街道", "code" => "440112014"},
      %{"name" => "永和街道", "code" => "440112015"},
      %{"name" => "长岭街道", "code" => "440112016"},
      %{"name" => "九佛街道", "code" => "440112017"},
      %{"name" => "龙湖街道", "code" => "440112018"},
      %{"name" => "新龙镇", "code" => "440112101"}
    ]

  def next(input) when input == "番禺区" or input == "440113",
    do: [
      %{"name" => "市桥街道", "code" => "440113007"},
      %{"name" => "沙头街道", "code" => "440113008"},
      %{"name" => "东环街道", "code" => "440113009"},
      %{"name" => "桥南街道", "code" => "440113010"},
      %{"name" => "小谷围街道", "code" => "440113011"},
      %{"name" => "大石街道", "code" => "440113012"},
      %{"name" => "洛浦街道", "code" => "440113013"},
      %{"name" => "石壁街道", "code" => "440113014"},
      %{"name" => "钟村街道", "code" => "440113015"},
      %{"name" => "大龙街道", "code" => "440113016"},
      %{"name" => "沙湾街道", "code" => "440113017"},
      %{"name" => "南村镇", "code" => "440113102"},
      %{"name" => "新造镇", "code" => "440113103"},
      %{"name" => "化龙镇", "code" => "440113104"},
      %{"name" => "石楼镇", "code" => "440113105"},
      %{"name" => "石碁镇", "code" => "440113120"}
    ]

  def next(input) when input == "花都区" or input == "440114",
    do: [
      %{"name" => "新华街道", "code" => "440114001"},
      %{"name" => "花城街道", "code" => "440114002"},
      %{"name" => "秀全街道", "code" => "440114003"},
      %{"name" => "新雅街道", "code" => "440114004"},
      %{"name" => "梯面镇", "code" => "440114103"},
      %{"name" => "花山镇", "code" => "440114104"},
      %{"name" => "花东镇", "code" => "440114105"},
      %{"name" => "炭步镇", "code" => "440114107"},
      %{"name" => "赤坭镇", "code" => "440114108"},
      %{"name" => "狮岭镇", "code" => "440114109"}
    ]

  def next(input) when input == "南沙区" or input == "440115",
    do: [
      %{"name" => "南沙街道", "code" => "440115001"},
      %{"name" => "珠江街道", "code" => "440115002"},
      %{"name" => "龙穴街道", "code" => "440115003"},
      %{"name" => "万顷沙镇", "code" => "440115100"},
      %{"name" => "横沥镇", "code" => "440115101"},
      %{"name" => "黄阁镇", "code" => "440115102"},
      %{"name" => "东涌镇", "code" => "440115103"},
      %{"name" => "大岗镇", "code" => "440115104"},
      %{"name" => "榄核镇", "code" => "440115105"}
    ]

  def next(input) when input == "从化区" or input == "440117",
    do: [
      %{"name" => "街口街道", "code" => "440117001"},
      %{"name" => "江埔街道", "code" => "440117002"},
      %{"name" => "城郊街道", "code" => "440117003"},
      %{"name" => "温泉镇", "code" => "440117103"},
      %{"name" => "良口镇", "code" => "440117104"},
      %{"name" => "吕田镇", "code" => "440117107"},
      %{"name" => "太平镇", "code" => "440117111"},
      %{"name" => "鳌头镇", "code" => "440117113"},
      %{"name" => "黄龙带水库", "code" => "440117404"},
      %{"name" => "大岭山林场", "code" => "440117405"}
    ]

  def next(input) when input == "增城区" or input == "440118",
    do: [
      %{"name" => "荔城街道", "code" => "440118001"},
      %{"name" => "增江街道", "code" => "440118002"},
      %{"name" => "朱村街道", "code" => "440118003"},
      %{"name" => "永宁街道", "code" => "440118004"},
      %{"name" => "荔湖街道", "code" => "440118005"},
      %{"name" => "宁西街道", "code" => "440118006"},
      %{"name" => "新塘镇", "code" => "440118101"},
      %{"name" => "石滩镇", "code" => "440118102"},
      %{"name" => "中新镇", "code" => "440118103"},
      %{"name" => "正果镇", "code" => "440118104"},
      %{"name" => "派潭镇", "code" => "440118105"},
      %{"name" => "小楼镇", "code" => "440118106"},
      %{"name" => "仙村镇", "code" => "440118107"}
    ]

  def next(_), do: nil
end