defmodule ChinaAdminDivisions.Gen.Lv3x.M46 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "琼中黎族苗族自治县" or input == "469030",
    do: [
      %{"name" => "营根镇", "code" => "469030100000"},
      %{"name" => "湾岭镇", "code" => "469030101000"},
      %{"name" => "黎母山镇", "code" => "469030102000"},
      %{"name" => "和平镇", "code" => "469030103000"},
      %{"name" => "长征镇", "code" => "469030104000"},
      %{"name" => "红毛镇", "code" => "469030105000"},
      %{"name" => "中平镇", "code" => "469030106000"},
      %{"name" => "吊罗山乡", "code" => "469030200000"},
      %{"name" => "上安乡", "code" => "469030201000"},
      %{"name" => "什运乡", "code" => "469030202000"},
      %{"name" => "海南热带雨林国家公园管理局黎母山分局", "code" => "469030500000"}
    ]

  def next(input) when input == "保亭黎族苗族自治县" or input == "469029",
    do: [
      %{"name" => "保城镇", "code" => "469029100000"},
      %{"name" => "什玲镇", "code" => "469029101000"},
      %{"name" => "加茂镇", "code" => "469029102000"},
      %{"name" => "响水镇", "code" => "469029103000"},
      %{"name" => "新政镇", "code" => "469029104000"},
      %{"name" => "三道镇", "code" => "469029105000"},
      %{"name" => "县直辖村级区划", "code" => "469029198000"},
      %{"name" => "六弓乡", "code" => "469029200000"},
      %{"name" => "南林乡", "code" => "469029201000"},
      %{"name" => "毛感乡", "code" => "469029202000"}
    ]

  def next(input) when input == "陵水黎族自治县" or input == "469028",
    do: [
      %{"name" => "椰林镇", "code" => "469028100000"},
      %{"name" => "光坡镇", "code" => "469028101000"},
      %{"name" => "三才镇", "code" => "469028102000"},
      %{"name" => "英州镇", "code" => "469028103000"},
      %{"name" => "隆广镇", "code" => "469028104000"},
      %{"name" => "文罗镇", "code" => "469028105000"},
      %{"name" => "本号镇", "code" => "469028106000"},
      %{"name" => "新村镇", "code" => "469028107000"},
      %{"name" => "黎安镇", "code" => "469028108000"},
      %{"name" => "提蒙乡", "code" => "469028200000"},
      %{"name" => "群英乡", "code" => "469028201000"},
      %{"name" => "国营吊罗山林业公司", "code" => "469028500000"}
    ]

  def next(input) when input == "乐东黎族自治县" or input == "469027",
    do: [
      %{"name" => "抱由镇", "code" => "469027100000"},
      %{"name" => "万冲镇", "code" => "469027101000"},
      %{"name" => "大安镇", "code" => "469027102000"},
      %{"name" => "志仲镇", "code" => "469027103000"},
      %{"name" => "千家镇", "code" => "469027104000"},
      %{"name" => "九所镇", "code" => "469027105000"},
      %{"name" => "利国镇", "code" => "469027106000"},
      %{"name" => "黄流镇", "code" => "469027107000"},
      %{"name" => "佛罗镇", "code" => "469027108000"},
      %{"name" => "尖峰镇", "code" => "469027109000"},
      %{"name" => "莺歌海镇", "code" => "469027110000"},
      %{"name" => "国营尖峰岭林业公司", "code" => "469027500000"},
      %{"name" => "国营莺歌海盐场", "code" => "469027501000"}
    ]

  def next(input) when input == "昌江黎族自治县" or input == "469026",
    do: [
      %{"name" => "石碌镇", "code" => "469026100000"},
      %{"name" => "叉河镇", "code" => "469026101000"},
      %{"name" => "十月田镇", "code" => "469026102000"},
      %{"name" => "乌烈镇", "code" => "469026103000"},
      %{"name" => "昌化镇", "code" => "469026104000"},
      %{"name" => "海尾镇", "code" => "469026105000"},
      %{"name" => "七叉镇", "code" => "469026106000"},
      %{"name" => "王下乡", "code" => "469026200000"},
      %{"name" => "国营霸王岭林场", "code" => "469026500000"}
    ]

  def next(input) when input == "白沙黎族自治县" or input == "469025",
    do: [
      %{"name" => "牙叉镇", "code" => "469025100000"},
      %{"name" => "七坊镇", "code" => "469025101000"},
      %{"name" => "邦溪镇", "code" => "469025102000"},
      %{"name" => "打安镇", "code" => "469025103000"},
      %{"name" => "细水乡", "code" => "469025200000"},
      %{"name" => "元门乡", "code" => "469025201000"},
      %{"name" => "南开乡", "code" => "469025202000"},
      %{"name" => "阜龙乡", "code" => "469025203000"},
      %{"name" => "青松乡", "code" => "469025204000"},
      %{"name" => "金波乡", "code" => "469025205000"},
      %{"name" => "荣邦乡", "code" => "469025206000"}
    ]

  def next(input) when input == "临高县" or input == "469024",
    do: [
      %{"name" => "临城镇", "code" => "469024100000"},
      %{"name" => "波莲镇", "code" => "469024101000"},
      %{"name" => "东英镇", "code" => "469024102000"},
      %{"name" => "博厚镇", "code" => "469024103000"},
      %{"name" => "皇桐镇", "code" => "469024104000"},
      %{"name" => "多文镇", "code" => "469024105000"},
      %{"name" => "和舍镇", "code" => "469024106000"},
      %{"name" => "南宝镇", "code" => "469024107000"},
      %{"name" => "新盈镇", "code" => "469024108000"},
      %{"name" => "调楼镇", "code" => "469024109000"},
      %{"name" => "加来镇", "code" => "469024401000"}
    ]

  def next(input) when input == "澄迈县" or input == "469023",
    do: [
      %{"name" => "金江镇", "code" => "469023100000"},
      %{"name" => "老城镇", "code" => "469023101000"},
      %{"name" => "瑞溪镇", "code" => "469023102000"},
      %{"name" => "永发镇", "code" => "469023103000"},
      %{"name" => "加乐镇", "code" => "469023104000"},
      %{"name" => "文儒镇", "code" => "469023105000"},
      %{"name" => "中兴镇", "code" => "469023106000"},
      %{"name" => "仁兴镇", "code" => "469023107000"},
      %{"name" => "福山镇", "code" => "469023108000"},
      %{"name" => "桥头镇", "code" => "469023109000"},
      %{"name" => "大丰镇", "code" => "469023110000"},
      %{"name" => "国营金安农场", "code" => "469023405000"}
    ]

  def next(input) when input == "屯昌县" or input == "469022",
    do: [
      %{"name" => "屯城镇", "code" => "469022100000"},
      %{"name" => "新兴镇", "code" => "469022101000"},
      %{"name" => "枫木镇", "code" => "469022102000"},
      %{"name" => "乌坡镇", "code" => "469022103000"},
      %{"name" => "南吕镇", "code" => "469022104000"},
      %{"name" => "南坤镇", "code" => "469022105000"},
      %{"name" => "坡心镇", "code" => "469022106000"},
      %{"name" => "西昌镇", "code" => "469022107000"}
    ]

  def next(input) when input == "定安县" or input == "469021",
    do: [
      %{"name" => "定城镇", "code" => "469021100000"},
      %{"name" => "新竹镇", "code" => "469021101000"},
      %{"name" => "龙湖镇", "code" => "469021102000"},
      %{"name" => "黄竹镇", "code" => "469021103000"},
      %{"name" => "雷鸣镇", "code" => "469021104000"},
      %{"name" => "龙门镇", "code" => "469021105000"},
      %{"name" => "龙河镇", "code" => "469021106000"},
      %{"name" => "岭口镇", "code" => "469021107000"},
      %{"name" => "翰林镇", "code" => "469021108000"},
      %{"name" => "富文镇", "code" => "469021109000"}
    ]

  def next(input) when input == "东方市" or input == "469007",
    do: [
      %{"name" => "八所镇", "code" => "469007100000"},
      %{"name" => "东河镇", "code" => "469007101000"},
      %{"name" => "大田镇", "code" => "469007102000"},
      %{"name" => "感城镇", "code" => "469007103000"},
      %{"name" => "板桥镇", "code" => "469007104000"},
      %{"name" => "三家镇", "code" => "469007105000"},
      %{"name" => "四更镇", "code" => "469007106000"},
      %{"name" => "新龙镇", "code" => "469007107000"},
      %{"name" => "天安乡", "code" => "469007200000"},
      %{"name" => "江边乡", "code" => "469007201000"},
      %{"name" => "东方华侨农场", "code" => "469007500000"}
    ]

  def next(input) when input == "万宁市" or input == "469006",
    do: [
      %{"name" => "万城镇", "code" => "469006100000"},
      %{"name" => "龙滚镇", "code" => "469006101000"},
      %{"name" => "和乐镇", "code" => "469006102000"},
      %{"name" => "后安镇", "code" => "469006103000"},
      %{"name" => "大茂镇", "code" => "469006104000"},
      %{"name" => "东澳镇", "code" => "469006105000"},
      %{"name" => "礼纪镇", "code" => "469006106000"},
      %{"name" => "长丰镇", "code" => "469006107000"},
      %{"name" => "山根镇", "code" => "469006108000"},
      %{"name" => "北大镇", "code" => "469006109000"},
      %{"name" => "南桥镇", "code" => "469006110000"},
      %{"name" => "三更罗镇", "code" => "469006111000"},
      %{"name" => "兴隆华侨农场", "code" => "469006500000"},
      %{"name" => "地方国营六连林场", "code" => "469006501000"}
    ]

  def next(input) when input == "文昌市" or input == "469005",
    do: [
      %{"name" => "文城镇", "code" => "469005100000"},
      %{"name" => "重兴镇", "code" => "469005101000"},
      %{"name" => "蓬莱镇", "code" => "469005102000"},
      %{"name" => "会文镇", "code" => "469005103000"},
      %{"name" => "东路镇", "code" => "469005104000"},
      %{"name" => "潭牛镇", "code" => "469005105000"},
      %{"name" => "东阁镇", "code" => "469005106000"},
      %{"name" => "文教镇", "code" => "469005107000"},
      %{"name" => "东郊镇", "code" => "469005108000"},
      %{"name" => "龙楼镇", "code" => "469005109000"},
      %{"name" => "昌洒镇", "code" => "469005110000"},
      %{"name" => "翁田镇", "code" => "469005111000"},
      %{"name" => "抱罗镇", "code" => "469005112000"},
      %{"name" => "冯坡镇", "code" => "469005113000"},
      %{"name" => "锦山镇", "code" => "469005114000"},
      %{"name" => "铺前镇", "code" => "469005115000"},
      %{"name" => "公坡镇", "code" => "469005116000"}
    ]

  def next(input) when input == "琼海市" or input == "469002",
    do: [
      %{"name" => "嘉积镇", "code" => "469002100000"},
      %{"name" => "万泉镇", "code" => "469002101000"},
      %{"name" => "石壁镇", "code" => "469002102000"},
      %{"name" => "中原镇", "code" => "469002103000"},
      %{"name" => "博鳌镇", "code" => "469002104000"},
      %{"name" => "阳江镇", "code" => "469002105000"},
      %{"name" => "龙江镇", "code" => "469002106000"},
      %{"name" => "潭门镇", "code" => "469002107000"},
      %{"name" => "塔洋镇", "code" => "469002108000"},
      %{"name" => "长坡镇", "code" => "469002109000"},
      %{"name" => "大路镇", "code" => "469002110000"},
      %{"name" => "会山镇", "code" => "469002111000"},
      %{"name" => "彬村山华侨农场", "code" => "469002500000"}
    ]

  def next(input) when input == "五指山市" or input == "469001",
    do: [
      %{"name" => "通什镇", "code" => "469001100000"},
      %{"name" => "南圣镇", "code" => "469001101000"},
      %{"name" => "毛阳镇", "code" => "469001102000"},
      %{"name" => "番阳镇", "code" => "469001103000"},
      %{"name" => "县直辖村级区划", "code" => "469001198000"},
      %{"name" => "畅好乡", "code" => "469001200000"},
      %{"name" => "毛道乡", "code" => "469001201000"},
      %{"name" => "水满乡", "code" => "469001202000"}
    ]

  def next(input) when input == "儋州市" or input == "460400",
    do: [
      %{"name" => "那大镇", "code" => "460400100000"},
      %{"name" => "和庆镇", "code" => "460400101000"},
      %{"name" => "南丰镇", "code" => "460400102000"},
      %{"name" => "大成镇", "code" => "460400103000"},
      %{"name" => "雅星镇", "code" => "460400104000"},
      %{"name" => "兰洋镇", "code" => "460400105000"},
      %{"name" => "光村镇", "code" => "460400106000"},
      %{"name" => "木棠镇", "code" => "460400107000"},
      %{"name" => "海头镇", "code" => "460400108000"},
      %{"name" => "峨蔓镇", "code" => "460400109000"},
      %{"name" => "王五镇", "code" => "460400111000"},
      %{"name" => "白马井镇", "code" => "460400112000"},
      %{"name" => "中和镇", "code" => "460400113000"},
      %{"name" => "排浦镇", "code" => "460400114000"},
      %{"name" => "东成镇", "code" => "460400115000"},
      %{"name" => "新州镇", "code" => "460400116000"},
      %{"name" => "洋浦经济开发区", "code" => "460400499000"},
      %{"name" => "华南热作学院", "code" => "460400500000"}
    ]

  def next(input) when input == "中沙群岛的岛礁及其海域" or input == "460323",
    do: [%{"name" => "中沙岛礁", "code" => "460323451000"}]

  def next(input) when input == "南沙群岛" or input == "460322",
    do: [%{"name" => "永暑岛", "code" => "460322451000"}]

  def next(input) when input == "西沙群岛" or input == "460321",
    do: [
      %{"name" => "永兴", "code" => "460321451000"},
      %{"name" => "永乐", "code" => "460321452000"},
      %{"name" => "七连屿", "code" => "460321453000"}
    ]

  def next(input) when input == "崖州区" or input == "460205",
    do: [%{"name" => "崖州区直辖村级区划", "code" => "460205198000"}]

  def next(input) when input == "天涯区" or input == "460204",
    do: [%{"name" => "天涯区直辖村级区划", "code" => "460204198000"}]

  def next(input) when input == "吉阳区" or input == "460203",
    do: [%{"name" => "吉阳区直辖村级区划", "code" => "460203198000"}]

  def next(input) when input == "海棠区" or input == "460202",
    do: [%{"name" => "海棠区直辖村级区划", "code" => "460202198000"}]

  def next(input) when input == "美兰区" or input == "460108",
    do: [
      %{"name" => "海府街道", "code" => "460108001000"},
      %{"name" => "蓝天街道", "code" => "460108002000"},
      %{"name" => "博爱街道", "code" => "460108003000"},
      %{"name" => "海甸街道", "code" => "460108004000"},
      %{"name" => "人民街道", "code" => "460108005000"},
      %{"name" => "白龙街道", "code" => "460108006000"},
      %{"name" => "和平南街道", "code" => "460108007000"},
      %{"name" => "白沙街道", "code" => "460108008000"},
      %{"name" => "新埠街道", "code" => "460108009000"},
      %{"name" => "灵山镇", "code" => "460108101000"},
      %{"name" => "演丰镇", "code" => "460108102000"},
      %{"name" => "三江镇", "code" => "460108103000"},
      %{"name" => "大致坡镇", "code" => "460108104000"},
      %{"name" => "海口桂林洋经济开发区（农场）", "code" => "460108400000"},
      %{"name" => "罗牛山农场", "code" => "460108500000"}
    ]

  def next(input) when input == "琼山区" or input == "460107",
    do: [
      %{"name" => "国兴街道", "code" => "460107001000"},
      %{"name" => "府城街道", "code" => "460107002000"},
      %{"name" => "滨江街道", "code" => "460107003000"},
      %{"name" => "凤翔街道", "code" => "460107004000"},
      %{"name" => "龙塘镇", "code" => "460107101000"},
      %{"name" => "云龙镇", "code" => "460107102000"},
      %{"name" => "红旗镇", "code" => "460107103000"},
      %{"name" => "三门坡镇", "code" => "460107104000"},
      %{"name" => "大坡镇", "code" => "460107105000"},
      %{"name" => "甲子镇", "code" => "460107106000"},
      %{"name" => "旧州镇", "code" => "460107107000"},
      %{"name" => "省岭脚热带作物场", "code" => "460107500000"}
    ]

  def next(input) when input == "龙华区" or input == "460106",
    do: [
      %{"name" => "中山街道", "code" => "460106001000"},
      %{"name" => "滨海街道", "code" => "460106002000"},
      %{"name" => "金贸街道", "code" => "460106003000"},
      %{"name" => "大同街道", "code" => "460106004000"},
      %{"name" => "海垦街道", "code" => "460106005000"},
      %{"name" => "金宇街道", "code" => "460106006000"},
      %{"name" => "城西镇", "code" => "460106100000"},
      %{"name" => "龙桥镇", "code" => "460106101000"},
      %{"name" => "新坡镇", "code" => "460106102000"},
      %{"name" => "遵谭镇", "code" => "460106103000"},
      %{"name" => "龙泉镇", "code" => "460106104000"}
    ]

  def next(input) when input == "秀英区" or input == "460105",
    do: [
      %{"name" => "秀英街道", "code" => "460105001000"},
      %{"name" => "海秀街道", "code" => "460105002000"},
      %{"name" => "长流镇", "code" => "460105100000"},
      %{"name" => "西秀镇", "code" => "460105101000"},
      %{"name" => "海秀镇", "code" => "460105102000"},
      %{"name" => "石山镇", "code" => "460105103000"},
      %{"name" => "永兴镇", "code" => "460105104000"},
      %{"name" => "东山镇", "code" => "460105105000"}
    ]

  def next(_), do: nil
end