defmodule ChinaAdminDivisions.Gen.Lv3x.M53 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "维西傈僳族自治县" or input == "533423",
    do: [
      %{"name" => "保和镇", "code" => "533423101000"},
      %{"name" => "叶枝镇", "code" => "533423102000"},
      %{"name" => "塔城镇", "code" => "533423103000"},
      %{"name" => "永春乡", "code" => "533423201000"},
      %{"name" => "攀天阁乡", "code" => "533423202000"},
      %{"name" => "白济汛乡", "code" => "533423203000"},
      %{"name" => "康普乡", "code" => "533423204000"},
      %{"name" => "巴迪乡", "code" => "533423205000"},
      %{"name" => "中路乡", "code" => "533423206000"},
      %{"name" => "维登乡", "code" => "533423207000"}
    ]

  def next(input) when input == "德钦县" or input == "533422",
    do: [
      %{"name" => "升平镇", "code" => "533422101000"},
      %{"name" => "奔子栏镇", "code" => "533422102000"},
      %{"name" => "佛山乡", "code" => "533422201000"},
      %{"name" => "云岭乡", "code" => "533422202000"},
      %{"name" => "燕门乡", "code" => "533422203000"},
      %{"name" => "拖顶傈僳族乡", "code" => "533422204000"},
      %{"name" => "霞若傈僳族乡", "code" => "533422205000"},
      %{"name" => "羊拉乡", "code" => "533422206000"}
    ]

  def next(input) when input == "香格里拉市" or input == "533401",
    do: [
      %{"name" => "建塘镇", "code" => "533401101000"},
      %{"name" => "小中甸镇", "code" => "533401102000"},
      %{"name" => "虎跳峡镇", "code" => "533401103000"},
      %{"name" => "金江镇", "code" => "533401104000"},
      %{"name" => "上江乡", "code" => "533401201000"},
      %{"name" => "三坝纳西族乡", "code" => "533401202000"},
      %{"name" => "洛吉乡", "code" => "533401203000"},
      %{"name" => "尼西乡", "code" => "533401204000"},
      %{"name" => "格咱乡", "code" => "533401205000"},
      %{"name" => "东旺乡", "code" => "533401206000"},
      %{"name" => "五境乡", "code" => "533401207000"},
      %{"name" => "迪庆扶贫民族经济开发区", "code" => "533401501000"}
    ]

  def next(input) when input == "兰坪白族普米族自治县" or input == "533325",
    do: [
      %{"name" => "翠屏街道", "code" => "533325001000"},
      %{"name" => "金顶街道", "code" => "533325002000"},
      %{"name" => "啦井镇", "code" => "533325102000"},
      %{"name" => "营盘镇", "code" => "533325103000"},
      %{"name" => "通甸镇", "code" => "533325104000"},
      %{"name" => "河西乡", "code" => "533325201000"},
      %{"name" => "中排乡", "code" => "533325202000"},
      %{"name" => "石登乡", "code" => "533325203000"},
      %{"name" => "兔峨乡", "code" => "533325204000"}
    ]

  def next(input) when input == "贡山独龙族怒族自治县" or input == "533324",
    do: [
      %{"name" => "茨开镇", "code" => "533324101000"},
      %{"name" => "丙中洛镇", "code" => "533324102000"},
      %{"name" => "捧当乡", "code" => "533324202000"},
      %{"name" => "普拉底乡", "code" => "533324203000"},
      %{"name" => "独龙江乡", "code" => "533324204000"}
    ]

  def next(input) when input == "福贡县" or input == "533323",
    do: [
      %{"name" => "上帕镇", "code" => "533323101000"},
      %{"name" => "匹河怒族乡", "code" => "533323201000"},
      %{"name" => "子里甲乡", "code" => "533323202000"},
      %{"name" => "架科底乡", "code" => "533323203000"},
      %{"name" => "鹿马登乡", "code" => "533323204000"},
      %{"name" => "石月亮乡", "code" => "533323205000"},
      %{"name" => "马吉乡", "code" => "533323206000"}
    ]

  def next(input) when input == "泸水市" or input == "533301",
    do: [
      %{"name" => "大练地街道", "code" => "533301001000"},
      %{"name" => "六库街道", "code" => "533301002000"},
      %{"name" => "鲁掌镇", "code" => "533301102000"},
      %{"name" => "片马镇", "code" => "533301103000"},
      %{"name" => "上江镇", "code" => "533301104000"},
      %{"name" => "老窝镇", "code" => "533301105000"},
      %{"name" => "大兴地镇", "code" => "533301106000"},
      %{"name" => "称杆乡", "code" => "533301204000"},
      %{"name" => "古登乡", "code" => "533301205000"},
      %{"name" => "洛本卓白族乡", "code" => "533301206000"}
    ]

  def next(input) when input == "陇川县" or input == "533124",
    do: [
      %{"name" => "章凤镇", "code" => "533124101000"},
      %{"name" => "陇把镇", "code" => "533124102000"},
      %{"name" => "景罕镇", "code" => "533124103000"},
      %{"name" => "城子镇", "code" => "533124104000"},
      %{"name" => "户撒阿昌族乡", "code" => "533124201000"},
      %{"name" => "护国乡", "code" => "533124202000"},
      %{"name" => "清平乡", "code" => "533124203000"},
      %{"name" => "王子树乡", "code" => "533124204000"},
      %{"name" => "勐约乡", "code" => "533124205000"},
      %{"name" => "陇川农场", "code" => "533124400000"}
    ]

  def next(input) when input == "盈江县" or input == "533123",
    do: [
      %{"name" => "平原镇", "code" => "533123101000"},
      %{"name" => "旧城镇", "code" => "533123102000"},
      %{"name" => "那邦镇", "code" => "533123103000"},
      %{"name" => "弄璋镇", "code" => "533123104000"},
      %{"name" => "盏西镇", "code" => "533123105000"},
      %{"name" => "卡场镇", "code" => "533123106000"},
      %{"name" => "昔马镇", "code" => "533123107000"},
      %{"name" => "太平镇", "code" => "533123108000"},
      %{"name" => "新城乡", "code" => "533123201000"},
      %{"name" => "油松岭乡", "code" => "533123202000"},
      %{"name" => "芒章乡", "code" => "533123203000"},
      %{"name" => "支那乡", "code" => "533123204000"},
      %{"name" => "苏典傈僳族乡", "code" => "533123205000"},
      %{"name" => "勐弄乡", "code" => "533123206000"},
      %{"name" => "铜壁关乡", "code" => "533123207000"},
      %{"name" => "盈江农场", "code" => "533123400000"}
    ]

  def next(input) when input == "梁河县" or input == "533122",
    do: [
      %{"name" => "遮岛镇", "code" => "533122101000"},
      %{"name" => "芒东镇", "code" => "533122102000"},
      %{"name" => "勐养镇", "code" => "533122103000"},
      %{"name" => "平山乡", "code" => "533122201000"},
      %{"name" => "小厂乡", "code" => "533122202000"},
      %{"name" => "大厂乡", "code" => "533122203000"},
      %{"name" => "九保阿昌族乡", "code" => "533122204000"},
      %{"name" => "曩宋阿昌族乡", "code" => "533122205000"},
      %{"name" => "河西乡", "code" => "533122206000"}
    ]

  def next(input) when input == "芒市" or input == "533103",
    do: [
      %{"name" => "芒市勐焕街道", "code" => "533103001000"},
      %{"name" => "芒市镇", "code" => "533103101000"},
      %{"name" => "遮放镇", "code" => "533103102000"},
      %{"name" => "勐戛镇", "code" => "533103103000"},
      %{"name" => "芒海镇", "code" => "533103104000"},
      %{"name" => "风平镇", "code" => "533103105000"},
      %{"name" => "轩岗乡", "code" => "533103201000"},
      %{"name" => "江东乡", "code" => "533103202000"},
      %{"name" => "西山乡", "code" => "533103203000"},
      %{"name" => "中山乡", "code" => "533103204000"},
      %{"name" => "三台山德昂族乡", "code" => "533103205000"},
      %{"name" => "五岔路乡", "code" => "533103206000"},
      %{"name" => "芒市遮放农场", "code" => "533103400000"}
    ]

  def next(input) when input == "瑞丽市" or input == "533102",
    do: [
      %{"name" => "勐卯街道", "code" => "533102001000"},
      %{"name" => "畹町镇", "code" => "533102102000"},
      %{"name" => "弄岛镇", "code" => "533102103000"},
      %{"name" => "姐相镇", "code" => "533102104000"},
      %{"name" => "户育乡", "code" => "533102202000"},
      %{"name" => "勐秀乡", "code" => "533102203000"},
      %{"name" => "瑞丽农场", "code" => "533102400000"},
      %{"name" => "畹町农场", "code" => "533102401000"}
    ]

  def next(input) when input == "鹤庆县" or input == "532932",
    do: [
      %{"name" => "云鹤镇", "code" => "532932101000"},
      %{"name" => "辛屯镇", "code" => "532932102000"},
      %{"name" => "松桂镇", "code" => "532932103000"},
      %{"name" => "黄坪镇", "code" => "532932104000"},
      %{"name" => "草海镇", "code" => "532932105000"},
      %{"name" => "西邑镇", "code" => "532932106000"},
      %{"name" => "龙开口镇", "code" => "532932107000"},
      %{"name" => "金墩乡", "code" => "532932201000"},
      %{"name" => "六合彝族乡", "code" => "532932203000"}
    ]

  def next(input) when input == "剑川县" or input == "532931",
    do: [
      %{"name" => "金华镇", "code" => "532931101000"},
      %{"name" => "老君山镇", "code" => "532931102000"},
      %{"name" => "甸南镇", "code" => "532931103000"},
      %{"name" => "沙溪镇", "code" => "532931104000"},
      %{"name" => "马登镇", "code" => "532931105000"},
      %{"name" => "羊岑乡", "code" => "532931201000"},
      %{"name" => "弥沙乡", "code" => "532931202000"},
      %{"name" => "象图乡", "code" => "532931203000"}
    ]

  def next(input) when input == "洱源县" or input == "532930",
    do: [
      %{"name" => "茈碧湖镇", "code" => "532930101000"},
      %{"name" => "邓川镇", "code" => "532930102000"},
      %{"name" => "右所镇", "code" => "532930103000"},
      %{"name" => "三营镇", "code" => "532930104000"},
      %{"name" => "凤羽镇", "code" => "532930105000"},
      %{"name" => "乔后镇", "code" => "532930106000"},
      %{"name" => "牛街乡", "code" => "532930201000"},
      %{"name" => "炼铁乡", "code" => "532930202000"},
      %{"name" => "西山乡", "code" => "532930203000"}
    ]

  def next(input) when input == "云龙县" or input == "532929",
    do: [
      %{"name" => "诺邓镇", "code" => "532929101000"},
      %{"name" => "功果桥镇", "code" => "532929102000"},
      %{"name" => "漕涧镇", "code" => "532929103000"},
      %{"name" => "白石镇", "code" => "532929104000"},
      %{"name" => "宝丰乡", "code" => "532929201000"},
      %{"name" => "关坪乡", "code" => "532929202000"},
      %{"name" => "团结彝族乡", "code" => "532929203000"},
      %{"name" => "长新乡", "code" => "532929204000"},
      %{"name" => "检槽乡", "code" => "532929205000"},
      %{"name" => "苗尾傈僳族乡", "code" => "532929206000"},
      %{"name" => "民建乡", "code" => "532929207000"}
    ]

  def next(input) when input == "永平县" or input == "532928",
    do: [
      %{"name" => "博南镇", "code" => "532928101000"},
      %{"name" => "杉阳镇", "code" => "532928102000"},
      %{"name" => "龙街镇", "code" => "532928103000"},
      %{"name" => "龙门乡", "code" => "532928201000"},
      %{"name" => "北斗彝族乡", "code" => "532928202000"},
      %{"name" => "厂街彝族乡", "code" => "532928203000"},
      %{"name" => "水泄彝族乡", "code" => "532928204000"}
    ]

  def next(input) when input == "巍山彝族回族自治县" or input == "532927",
    do: [
      %{"name" => "南诏镇", "code" => "532927101000"},
      %{"name" => "庙街镇", "code" => "532927102000"},
      %{"name" => "大仓镇", "code" => "532927103000"},
      %{"name" => "永建镇", "code" => "532927104000"},
      %{"name" => "巍宝山乡", "code" => "532927201000"},
      %{"name" => "马鞍山乡", "code" => "532927202000"},
      %{"name" => "紫金乡", "code" => "532927203000"},
      %{"name" => "五印乡", "code" => "532927204000"},
      %{"name" => "牛街乡", "code" => "532927205000"},
      %{"name" => "青华乡", "code" => "532927206000"}
    ]

  def next(input) when input == "南涧彝族自治县" or input == "532926",
    do: [
      %{"name" => "南涧镇", "code" => "532926101000"},
      %{"name" => "小湾东镇", "code" => "532926102000"},
      %{"name" => "公郎镇", "code" => "532926103000"},
      %{"name" => "宝华镇", "code" => "532926104000"},
      %{"name" => "无量山镇", "code" => "532926105000"},
      %{"name" => "拥翠乡", "code" => "532926201000"},
      %{"name" => "乐秋乡", "code" => "532926202000"},
      %{"name" => "碧溪乡", "code" => "532926203000"}
    ]

  def next(input) when input == "弥渡县" or input == "532925",
    do: [
      %{"name" => "弥城镇", "code" => "532925101000"},
      %{"name" => "红岩镇", "code" => "532925102000"},
      %{"name" => "新街镇", "code" => "532925103000"},
      %{"name" => "寅街镇", "code" => "532925104000"},
      %{"name" => "苴力镇", "code" => "532925105000"},
      %{"name" => "密祉镇", "code" => "532925106000"},
      %{"name" => "德苴乡", "code" => "532925203000"},
      %{"name" => "牛街彝族乡", "code" => "532925204000"}
    ]

  def next(input) when input == "宾川县" or input == "532924",
    do: [
      %{"name" => "金牛镇", "code" => "532924101000"},
      %{"name" => "宾居镇", "code" => "532924102000"},
      %{"name" => "州城镇", "code" => "532924103000"},
      %{"name" => "大营镇", "code" => "532924104000"},
      %{"name" => "鸡足山镇", "code" => "532924105000"},
      %{"name" => "力角镇", "code" => "532924106000"},
      %{"name" => "平川镇", "code" => "532924107000"},
      %{"name" => "乔甸镇", "code" => "532924108000"},
      %{"name" => "钟英傈僳族彝族乡", "code" => "532924201000"},
      %{"name" => "拉乌彝族乡", "code" => "532924202000"}
    ]

  def next(input) when input == "祥云县" or input == "532923",
    do: [
      %{"name" => "祥城镇", "code" => "532923101000"},
      %{"name" => "沙龙镇", "code" => "532923102000"},
      %{"name" => "云南驿镇", "code" => "532923103000"},
      %{"name" => "下庄镇", "code" => "532923104000"},
      %{"name" => "普棚镇", "code" => "532923105000"},
      %{"name" => "刘厂镇", "code" => "532923106000"},
      %{"name" => "禾甸镇", "code" => "532923107000"},
      %{"name" => "米甸镇", "code" => "532923108000"},
      %{"name" => "鹿鸣乡", "code" => "532923201000"},
      %{"name" => "东山彝族乡", "code" => "532923202000"}
    ]

  def next(input) when input == "漾濞彝族自治县" or input == "532922",
    do: [
      %{"name" => "苍山西镇", "code" => "532922101000"},
      %{"name" => "漾江镇", "code" => "532922102000"},
      %{"name" => "平坡镇", "code" => "532922103000"},
      %{"name" => "顺濞镇", "code" => "532922104000"},
      %{"name" => "富恒乡", "code" => "532922201000"},
      %{"name" => "太平乡", "code" => "532922202000"},
      %{"name" => "瓦厂乡", "code" => "532922204000"},
      %{"name" => "龙潭乡", "code" => "532922205000"},
      %{"name" => "鸡街乡", "code" => "532922206000"}
    ]

  def next(input) when input == "大理市" or input == "532901",
    do: [
      %{"name" => "下关街道", "code" => "532901003000"},
      %{"name" => "太和街道", "code" => "532901004000"},
      %{"name" => "满江街道", "code" => "532901005000"},
      %{"name" => "大理镇", "code" => "532901102000"},
      %{"name" => "凤仪镇", "code" => "532901103000"},
      %{"name" => "喜洲镇", "code" => "532901104000"},
      %{"name" => "海东镇", "code" => "532901105000"},
      %{"name" => "挖色镇", "code" => "532901106000"},
      %{"name" => "湾桥镇", "code" => "532901107000"},
      %{"name" => "银桥镇", "code" => "532901108000"},
      %{"name" => "双廊镇", "code" => "532901109000"},
      %{"name" => "上关镇", "code" => "532901110000"},
      %{"name" => "太邑彝族乡", "code" => "532901201000"}
    ]

  def next(input) when input == "勐腊县" or input == "532823",
    do: [
      %{"name" => "勐腊镇", "code" => "532823101000"},
      %{"name" => "勐捧镇", "code" => "532823102000"},
      %{"name" => "勐满镇", "code" => "532823103000"},
      %{"name" => "勐仑镇", "code" => "532823104000"},
      %{"name" => "磨憨镇", "code" => "532823105000"},
      %{"name" => "勐伴镇", "code" => "532823106000"},
      %{"name" => "关累镇", "code" => "532823107000"},
      %{"name" => "易武镇", "code" => "532823108000"},
      %{"name" => "象明彝族乡", "code" => "532823202000"},
      %{"name" => "瑶区瑶族乡", "code" => "532823203000"},
      %{"name" => "勐腊农场", "code" => "532823401000"},
      %{"name" => "勐捧农场", "code" => "532823402000"},
      %{"name" => "勐满农场", "code" => "532823403000"},
      %{"name" => "勐醒农场", "code" => "532823404000"}
    ]

  def next(input) when input == "勐海县" or input == "532822",
    do: [
      %{"name" => "勐海镇", "code" => "532822101000"},
      %{"name" => "打洛镇", "code" => "532822102000"},
      %{"name" => "勐混镇", "code" => "532822103000"},
      %{"name" => "勐遮镇", "code" => "532822104000"},
      %{"name" => "勐满镇", "code" => "532822105000"},
      %{"name" => "勐阿镇", "code" => "532822106000"},
      %{"name" => "勐宋乡", "code" => "532822201000"},
      %{"name" => "勐往乡", "code" => "532822202000"},
      %{"name" => "格朗和哈尼族乡", "code" => "532822203000"},
      %{"name" => "布朗山布朗族乡", "code" => "532822204000"},
      %{"name" => "西定哈尼族布朗族乡", "code" => "532822205000"}
    ]

  def next(input) when input == "景洪市" or input == "532801",
    do: [
      %{"name" => "允景洪街道", "code" => "532801001000"},
      %{"name" => "江北街道", "code" => "532801002000"},
      %{"name" => "嘎洒街道", "code" => "532801003000"},
      %{"name" => "嘎栋街道", "code" => "532801004000"},
      %{"name" => "曼弄枫街道", "code" => "532801005000"},
      %{"name" => "勐龙镇", "code" => "532801103000"},
      %{"name" => "勐罕镇", "code" => "532801104000"},
      %{"name" => "勐养镇", "code" => "532801105000"},
      %{"name" => "普文镇", "code" => "532801106000"},
      %{"name" => "景哈哈尼族乡", "code" => "532801202000"},
      %{"name" => "景讷乡", "code" => "532801203000"},
      %{"name" => "大渡岗乡", "code" => "532801204000"},
      %{"name" => "勐旺乡", "code" => "532801205000"},
      %{"name" => "基诺山基诺族乡", "code" => "532801206000"},
      %{"name" => "东风农场", "code" => "532801402000"},
      %{"name" => "橄榄坝农场", "code" => "532801403000"},
      %{"name" => "西双版纳监狱", "code" => "532801408000"}
    ]

  def next(input) when input == "富宁县" or input == "532628",
    do: [
      %{"name" => "新华镇", "code" => "532628101000"},
      %{"name" => "归朝镇", "code" => "532628102000"},
      %{"name" => "剥隘镇", "code" => "532628103000"},
      %{"name" => "里达镇", "code" => "532628104000"},
      %{"name" => "田蓬镇", "code" => "532628105000"},
      %{"name" => "木央镇", "code" => "532628106000"},
      %{"name" => "板仑乡", "code" => "532628201000"},
      %{"name" => "谷拉乡", "code" => "532628202000"},
      %{"name" => "者桑乡", "code" => "532628203000"},
      %{"name" => "那能乡", "code" => "532628204000"},
      %{"name" => "洞波瑶族乡", "code" => "532628205000"},
      %{"name" => "阿用乡", "code" => "532628206000"},
      %{"name" => "花甲乡", "code" => "532628207000"}
    ]

  def next(input) when input == "广南县" or input == "532627",
    do: [
      %{"name" => "莲城镇", "code" => "532627101000"},
      %{"name" => "八宝镇", "code" => "532627102000"},
      %{"name" => "南屏镇", "code" => "532627103000"},
      %{"name" => "珠街镇", "code" => "532627104000"},
      %{"name" => "那洒镇", "code" => "532627105000"},
      %{"name" => "珠琳镇", "code" => "532627106000"},
      %{"name" => "坝美镇", "code" => "532627107000"},
      %{"name" => "董堡乡", "code" => "532627201000"},
      %{"name" => "旧莫乡", "code" => "532627202000"},
      %{"name" => "杨柳井乡", "code" => "532627203000"},
      %{"name" => "板蚌乡", "code" => "532627204000"},
      %{"name" => "曙光乡", "code" => "532627205000"},
      %{"name" => "黑支果乡", "code" => "532627206000"},
      %{"name" => "篆角乡", "code" => "532627207000"},
      %{"name" => "五珠乡", "code" => "532627208000"},
      %{"name" => "者兔乡", "code" => "532627209000"},
      %{"name" => "者太乡", "code" => "532627210000"},
      %{"name" => "底圩乡", "code" => "532627211000"}
    ]

  def next(input) when input == "丘北县" or input == "532626",
    do: [
      %{"name" => "锦屏镇", "code" => "532626101000"},
      %{"name" => "曰者镇", "code" => "532626102000"},
      %{"name" => "双龙营镇", "code" => "532626103000"},
      %{"name" => "八道哨彝族乡", "code" => "532626201000"},
      %{"name" => "天星乡", "code" => "532626202000"},
      %{"name" => "平寨乡", "code" => "532626203000"},
      %{"name" => "树皮彝族乡", "code" => "532626204000"},
      %{"name" => "腻脚彝族乡", "code" => "532626205000"},
      %{"name" => "新店彝族乡", "code" => "532626206000"},
      %{"name" => "舍得彝族乡", "code" => "532626207000"},
      %{"name" => "官寨乡", "code" => "532626208000"},
      %{"name" => "温浏乡", "code" => "532626209000"}
    ]

  def next(input) when input == "马关县" or input == "532625",
    do: [
      %{"name" => "马白镇", "code" => "532625101000"},
      %{"name" => "八寨镇", "code" => "532625102000"},
      %{"name" => "仁和镇", "code" => "532625103000"},
      %{"name" => "木厂镇", "code" => "532625104000"},
      %{"name" => "夹寒箐镇", "code" => "532625105000"},
      %{"name" => "小坝子镇", "code" => "532625106000"},
      %{"name" => "都龙镇", "code" => "532625107000"},
      %{"name" => "金厂镇", "code" => "532625108000"},
      %{"name" => "坡脚镇", "code" => "532625109000"},
      %{"name" => "南捞乡", "code" => "532625201000"},
      %{"name" => "大栗树乡", "code" => "532625202000"},
      %{"name" => "篾厂乡", "code" => "532625203000"},
      %{"name" => "古林箐乡", "code" => "532625204000"},
      %{"name" => "健康农场", "code" => "532625501000"}
    ]

  def next(input) when input == "麻栗坡县" or input == "532624",
    do: [
      %{"name" => "麻栗镇", "code" => "532624101000"},
      %{"name" => "大坪镇", "code" => "532624102000"},
      %{"name" => "董干镇", "code" => "532624103000"},
      %{"name" => "天保镇", "code" => "532624104000"},
      %{"name" => "猛硐瑶族乡", "code" => "532624201000"},
      %{"name" => "下金厂乡", "code" => "532624202000"},
      %{"name" => "八布乡", "code" => "532624203000"},
      %{"name" => "六河乡", "code" => "532624204000"},
      %{"name" => "杨万乡", "code" => "532624205000"},
      %{"name" => "铁厂乡", "code" => "532624206000"},
      %{"name" => "马街乡", "code" => "532624207000"}
    ]

  def next(input) when input == "西畴县" or input == "532623",
    do: [
      %{"name" => "西洒镇", "code" => "532623101000"},
      %{"name" => "兴街镇", "code" => "532623102000"},
      %{"name" => "蚌谷乡", "code" => "532623201000"},
      %{"name" => "莲花塘乡", "code" => "532623202000"},
      %{"name" => "新马街乡", "code" => "532623203000"},
      %{"name" => "柏林乡", "code" => "532623204000"},
      %{"name" => "法斗乡", "code" => "532623205000"},
      %{"name" => "董马乡", "code" => "532623206000"},
      %{"name" => "鸡街乡", "code" => "532623207000"}
    ]

  def next(input) when input == "砚山县" or input == "532622",
    do: [
      %{"name" => "江那镇", "code" => "532622101000"},
      %{"name" => "平远镇", "code" => "532622102000"},
      %{"name" => "稼依镇", "code" => "532622103000"},
      %{"name" => "阿猛镇", "code" => "532622104000"},
      %{"name" => "阿舍彝族乡", "code" => "532622201000"},
      %{"name" => "维摩彝族乡", "code" => "532622202000"},
      %{"name" => "盘龙彝族乡", "code" => "532622203000"},
      %{"name" => "八嘎乡", "code" => "532622204000"},
      %{"name" => "者腊乡", "code" => "532622205000"},
      %{"name" => "蚌峨乡", "code" => "532622206000"},
      %{"name" => "干河彝族乡", "code" => "532622207000"}
    ]

  def next(input) when input == "文山市" or input == "532601",
    do: [
      %{"name" => "开化街道", "code" => "532601001000"},
      %{"name" => "卧龙街道", "code" => "532601002000"},
      %{"name" => "新平街道", "code" => "532601003000"},
      %{"name" => "古木镇", "code" => "532601102000"},
      %{"name" => "平坝镇", "code" => "532601103000"},
      %{"name" => "马塘镇", "code" => "532601104000"},
      %{"name" => "德厚镇", "code" => "532601105000"},
      %{"name" => "小街镇", "code" => "532601106000"},
      %{"name" => "薄竹镇", "code" => "532601107000"},
      %{"name" => "追栗街镇", "code" => "532601108000"},
      %{"name" => "东山彝族乡", "code" => "532601201000"},
      %{"name" => "柳井彝族乡", "code" => "532601202000"},
      %{"name" => "新街乡", "code" => "532601203000"},
      %{"name" => "喜古乡", "code" => "532601204000"},
      %{"name" => "坝心彝族乡", "code" => "532601205000"},
      %{"name" => "秉烈彝族乡", "code" => "532601206000"},
      %{"name" => "红甸回族乡", "code" => "532601207000"},
      %{"name" => "文山高新技术产业开发区", "code" => "532601403000"}
    ]

  def next(input) when input == "河口瑶族自治县" or input == "532532",
    do: [
      %{"name" => "河口镇", "code" => "532532101000"},
      %{"name" => "南溪镇", "code" => "532532102000"},
      %{"name" => "老范寨乡", "code" => "532532201000"},
      %{"name" => "桥头苗族壮族乡", "code" => "532532202000"},
      %{"name" => "瑶山乡", "code" => "532532203000"},
      %{"name" => "莲花滩乡", "code" => "532532204000"}
    ]

  def next(input) when input == "绿春县" or input == "532531",
    do: [
      %{"name" => "大兴镇", "code" => "532531101000"},
      %{"name" => "牛孔镇", "code" => "532531102000"},
      %{"name" => "大黑山镇", "code" => "532531103000"},
      %{"name" => "平河镇", "code" => "532531104000"},
      %{"name" => "戈奎乡", "code" => "532531201000"},
      %{"name" => "大水沟乡", "code" => "532531203000"},
      %{"name" => "半坡乡", "code" => "532531205000"},
      %{"name" => "骑马坝乡", "code" => "532531206000"},
      %{"name" => "三猛乡", "code" => "532531207000"}
    ]

  def next(input) when input == "金平苗族瑶族傣族自治县" or input == "532530",
    do: [
      %{"name" => "金河镇", "code" => "532530101000"},
      %{"name" => "金水河镇", "code" => "532530102000"},
      %{"name" => "勐拉镇", "code" => "532530103000"},
      %{"name" => "老勐镇", "code" => "532530104000"},
      %{"name" => "铜厂乡", "code" => "532530202000"},
      %{"name" => "老集寨乡", "code" => "532530204000"},
      %{"name" => "者米拉祜族乡", "code" => "532530205000"},
      %{"name" => "阿得博乡", "code" => "532530206000"},
      %{"name" => "沙依坡乡", "code" => "532530207000"},
      %{"name" => "大寨乡", "code" => "532530208000"},
      %{"name" => "马鞍底乡", "code" => "532530209000"},
      %{"name" => "勐桥乡", "code" => "532530210000"},
      %{"name" => "营盘乡", "code" => "532530211000"},
      %{"name" => "金平县农场", "code" => "532530401000"}
    ]

  def next(input) when input == "红河县" or input == "532529",
    do: [
      %{"name" => "迤萨镇", "code" => "532529101000"},
      %{"name" => "甲寅镇", "code" => "532529102000"},
      %{"name" => "宝华镇", "code" => "532529103000"},
      %{"name" => "乐育镇", "code" => "532529104000"},
      %{"name" => "浪堤镇", "code" => "532529105000"},
      %{"name" => "洛恩乡", "code" => "532529203000"},
      %{"name" => "石头寨乡", "code" => "532529204000"},
      %{"name" => "阿扎河乡", "code" => "532529205000"},
      %{"name" => "大羊街乡", "code" => "532529208000"},
      %{"name" => "车古乡", "code" => "532529209000"},
      %{"name" => "架车乡", "code" => "532529210000"},
      %{"name" => "垤玛乡", "code" => "532529211000"},
      %{"name" => "三村乡", "code" => "532529212000"}
    ]

  def next(input) when input == "元阳县" or input == "532528",
    do: [
      %{"name" => "南沙镇", "code" => "532528101000"},
      %{"name" => "新街镇", "code" => "532528102000"},
      %{"name" => "牛角寨镇", "code" => "532528103000"},
      %{"name" => "沙拉托乡", "code" => "532528203000"},
      %{"name" => "嘎娘乡", "code" => "532528204000"},
      %{"name" => "上新城乡", "code" => "532528205000"},
      %{"name" => "小新街乡", "code" => "532528206000"},
      %{"name" => "逢春岭乡", "code" => "532528207000"},
      %{"name" => "大坪乡", "code" => "532528208000"},
      %{"name" => "攀枝花乡", "code" => "532528209000"},
      %{"name" => "黄茅岭乡", "code" => "532528210000"},
      %{"name" => "黄草岭乡", "code" => "532528211000"},
      %{"name" => "俄扎乡", "code" => "532528212000"},
      %{"name" => "马街乡", "code" => "532528213000"}
    ]

  def next(input) when input == "泸西县" or input == "532527",
    do: [
      %{"name" => "中枢镇", "code" => "532527101000"},
      %{"name" => "金马镇", "code" => "532527102000"},
      %{"name" => "旧城镇", "code" => "532527104000"},
      %{"name" => "午街铺镇", "code" => "532527106000"},
      %{"name" => "白水镇", "code" => "532527107000"},
      %{"name" => "向阳乡", "code" => "532527201000"},
      %{"name" => "三塘乡", "code" => "532527202000"},
      %{"name" => "永宁乡", "code" => "532527203000"}
    ]

  def next(input) when input == "石屏县" or input == "532525",
    do: [
      %{"name" => "异龙镇", "code" => "532525101000"},
      %{"name" => "宝秀镇", "code" => "532525102000"},
      %{"name" => "坝心镇", "code" => "532525103000"},
      %{"name" => "龙朋镇", "code" => "532525104000"},
      %{"name" => "龙武镇", "code" => "532525105000"},
      %{"name" => "哨冲镇", "code" => "532525106000"},
      %{"name" => "牛街镇", "code" => "532525107000"},
      %{"name" => "新城乡", "code" => "532525201000"},
      %{"name" => "大桥乡", "code" => "532525202000"}
    ]

  def next(input) when input == "建水县" or input == "532524",
    do: [
      %{"name" => "临安镇", "code" => "532524101000"},
      %{"name" => "官厅镇", "code" => "532524102000"},
      %{"name" => "西庄镇", "code" => "532524103000"},
      %{"name" => "青龙镇", "code" => "532524104000"},
      %{"name" => "南庄镇", "code" => "532524105000"},
      %{"name" => "岔科镇", "code" => "532524106000"},
      %{"name" => "曲江镇", "code" => "532524107000"},
      %{"name" => "面甸镇", "code" => "532524108000"},
      %{"name" => "普雄乡", "code" => "532524201000"},
      %{"name" => "李浩寨乡", "code" => "532524202000"},
      %{"name" => "坡头乡", "code" => "532524203000"},
      %{"name" => "盘江乡", "code" => "532524204000"},
      %{"name" => "利民乡", "code" => "532524205000"},
      %{"name" => "甸尾乡", "code" => "532524206000"}
    ]

  def next(input) when input == "屏边苗族自治县" or input == "532523",
    do: [
      %{"name" => "玉屏镇", "code" => "532523101000"},
      %{"name" => "新现镇", "code" => "532523102000"},
      %{"name" => "和平镇", "code" => "532523103000"},
      %{"name" => "白河镇", "code" => "532523104000"},
      %{"name" => "白云乡", "code" => "532523204000"},
      %{"name" => "新华乡", "code" => "532523205000"},
      %{"name" => "湾塘乡", "code" => "532523206000"}
    ]

  def next(input) when input == "弥勒市" or input == "532504",
    do: [
      %{"name" => "弥阳街道", "code" => "532504001000"},
      %{"name" => "太平街道", "code" => "532504002000"},
      %{"name" => "福城街道", "code" => "532504003000"},
      %{"name" => "新哨镇", "code" => "532504102000"},
      %{"name" => "虹溪镇", "code" => "532504103000"},
      %{"name" => "竹园镇", "code" => "532504104000"},
      %{"name" => "朋普镇", "code" => "532504105000"},
      %{"name" => "巡检司镇", "code" => "532504106000"},
      %{"name" => "西一镇", "code" => "532504107000"},
      %{"name" => "西二镇", "code" => "532504108000"},
      %{"name" => "西三镇", "code" => "532504109000"},
      %{"name" => "东山镇", "code" => "532504110000"},
      %{"name" => "五山乡", "code" => "532504202000"},
      %{"name" => "江边乡", "code" => "532504203000"}
    ]

  def next(input) when input == "蒙自市" or input == "532503",
    do: [
      %{"name" => "文澜街道", "code" => "532503001000"},
      %{"name" => "雨过铺街道", "code" => "532503002000"},
      %{"name" => "观澜街道", "code" => "532503003000"},
      %{"name" => "文萃街道", "code" => "532503004000"},
      %{"name" => "新安所街道", "code" => "532503005000"},
      %{"name" => "草坝镇", "code" => "532503102000"},
      %{"name" => "芷村镇", "code" => "532503105000"},
      %{"name" => "鸣鹫镇", "code" => "532503106000"},
      %{"name" => "冷泉镇", "code" => "532503107000"},
      %{"name" => "期路白苗族乡", "code" => "532503201000"},
      %{"name" => "老寨苗族乡", "code" => "532503202000"},
      %{"name" => "水田乡", "code" => "532503203000"},
      %{"name" => "西北勒乡", "code" => "532503204000"}
    ]

  def next(input) when input == "开远市" or input == "532502",
    do: [
      %{"name" => "乐白道街道", "code" => "532502001000"},
      %{"name" => "灵泉街道", "code" => "532502002000"},
      %{"name" => "中和营镇", "code" => "532502101000"},
      %{"name" => "小龙潭镇", "code" => "532502102000"},
      %{"name" => "大庄回族乡", "code" => "532502201000"},
      %{"name" => "羊街乡", "code" => "532502202000"},
      %{"name" => "碑格乡", "code" => "532502203000"}
    ]

  def next(input) when input == "个旧市" or input == "532501",
    do: [
      %{"name" => "宝华街道", "code" => "532501001000"},
      %{"name" => "沙甸街道", "code" => "532501002000"},
      %{"name" => "大屯街道", "code" => "532501003000"},
      %{"name" => "锡城街道", "code" => "532501004000"},
      %{"name" => "金湖街道", "code" => "532501005000"},
      %{"name" => "鸡街镇", "code" => "532501103000"},
      %{"name" => "老厂镇", "code" => "532501106000"},
      %{"name" => "卡房镇", "code" => "532501107000"},
      %{"name" => "蔓耗镇", "code" => "532501108000"},
      %{"name" => "贾沙乡", "code" => "532501202000"},
      %{"name" => "保和乡", "code" => "532501203000"}
    ]

  def next(input) when input == "武定县" or input == "532329",
    do: [
      %{"name" => "狮山镇", "code" => "532329101000"},
      %{"name" => "高桥镇", "code" => "532329102000"},
      %{"name" => "猫街镇", "code" => "532329103000"},
      %{"name" => "插甸镇", "code" => "532329104000"},
      %{"name" => "白路镇", "code" => "532329105000"},
      %{"name" => "万德镇", "code" => "532329106000"},
      %{"name" => "己衣镇", "code" => "532329107000"},
      %{"name" => "田心乡", "code" => "532329202000"},
      %{"name" => "发窝乡", "code" => "532329203000"},
      %{"name" => "环州乡", "code" => "532329207000"},
      %{"name" => "东坡傣族乡", "code" => "532329208000"}
    ]

  def next(input) when input == "元谋县" or input == "532328",
    do: [
      %{"name" => "元马镇", "code" => "532328101000"},
      %{"name" => "黄瓜园镇", "code" => "532328103000"},
      %{"name" => "羊街镇", "code" => "532328104000"},
      %{"name" => "老城乡", "code" => "532328202000"},
      %{"name" => "物茂乡", "code" => "532328203000"},
      %{"name" => "江边乡", "code" => "532328204000"},
      %{"name" => "新华乡", "code" => "532328205000"},
      %{"name" => "平田乡", "code" => "532328206000"},
      %{"name" => "凉山乡", "code" => "532328209000"},
      %{"name" => "姜驿乡", "code" => "532328210000"}
    ]

  def next(input) when input == "永仁县" or input == "532327",
    do: [
      %{"name" => "永定镇", "code" => "532327101000"},
      %{"name" => "宜就镇", "code" => "532327102000"},
      %{"name" => "中和镇", "code" => "532327103000"},
      %{"name" => "莲池乡", "code" => "532327201000"},
      %{"name" => "维的乡", "code" => "532327202000"},
      %{"name" => "猛虎乡", "code" => "532327203000"},
      %{"name" => "永兴傣族乡", "code" => "532327204000"}
    ]

  def next(input) when input == "大姚县" or input == "532326",
    do: [
      %{"name" => "金碧镇", "code" => "532326101000"},
      %{"name" => "石羊镇", "code" => "532326102000"},
      %{"name" => "六苴镇", "code" => "532326103000"},
      %{"name" => "龙街镇", "code" => "532326104000"},
      %{"name" => "新街镇", "code" => "532326105000"},
      %{"name" => "赵家店镇", "code" => "532326106000"},
      %{"name" => "三岔河镇", "code" => "532326107000"},
      %{"name" => "桂花镇", "code" => "532326108000"},
      %{"name" => "昙华乡", "code" => "532326204000"},
      %{"name" => "湾碧傣族傈僳族乡", "code" => "532326206000"},
      %{"name" => "铁锁乡", "code" => "532326207000"},
      %{"name" => "三台乡", "code" => "532326208000"}
    ]

  def next(input) when input == "姚安县" or input == "532325",
    do: [
      %{"name" => "栋川镇", "code" => "532325101000"},
      %{"name" => "光禄镇", "code" => "532325102000"},
      %{"name" => "前场镇", "code" => "532325103000"},
      %{"name" => "弥兴镇", "code" => "532325104000"},
      %{"name" => "太平镇", "code" => "532325105000"},
      %{"name" => "官屯镇", "code" => "532325106000"},
      %{"name" => "适中乡", "code" => "532325201000"},
      %{"name" => "左门乡", "code" => "532325202000"},
      %{"name" => "大河口乡", "code" => "532325204000"}
    ]

  def next(input) when input == "南华县" or input == "532324",
    do: [
      %{"name" => "龙川镇", "code" => "532324101000"},
      %{"name" => "沙桥镇", "code" => "532324102000"},
      %{"name" => "五街镇", "code" => "532324103000"},
      %{"name" => "红土坡镇", "code" => "532324104000"},
      %{"name" => "马街镇", "code" => "532324105000"},
      %{"name" => "兔街镇", "code" => "532324106000"},
      %{"name" => "雨露白族乡", "code" => "532324201000"},
      %{"name" => "一街乡", "code" => "532324202000"},
      %{"name" => "罗武庄乡", "code" => "532324203000"},
      %{"name" => "五顶山乡", "code" => "532324204000"}
    ]

  def next(input) when input == "牟定县" or input == "532323",
    do: [
      %{"name" => "共和镇", "code" => "532323101000"},
      %{"name" => "新桥镇", "code" => "532323102000"},
      %{"name" => "江坡镇", "code" => "532323103000"},
      %{"name" => "凤屯镇", "code" => "532323104000"},
      %{"name" => "蟠猫乡", "code" => "532323201000"},
      %{"name" => "戌街乡", "code" => "532323202000"},
      %{"name" => "安乐乡", "code" => "532323203000"}
    ]

  def next(input) when input == "双柏县" or input == "532322",
    do: [
      %{"name" => "妥甸镇", "code" => "532322101000"},
      %{"name" => "大庄镇", "code" => "532322102000"},
      %{"name" => "法脿镇", "code" => "532322103000"},
      %{"name" => "鄂嘉镇", "code" => "532322104000"},
      %{"name" => "大麦地镇", "code" => "532322105000"},
      %{"name" => "安龙堡乡", "code" => "532322201000"},
      %{"name" => "爱尼山乡", "code" => "532322202000"},
      %{"name" => "独田乡", "code" => "532322203000"}
    ]

  def next(input) when input == "禄丰市" or input == "532302",
    do: [
      %{"name" => "金山镇", "code" => "532302101000"},
      %{"name" => "仁兴镇", "code" => "532302102000"},
      %{"name" => "碧城镇", "code" => "532302103000"},
      %{"name" => "勤丰镇", "code" => "532302104000"},
      %{"name" => "一平浪镇", "code" => "532302105000"},
      %{"name" => "广通镇", "code" => "532302106000"},
      %{"name" => "黑井镇", "code" => "532302107000"},
      %{"name" => "土官镇", "code" => "532302108000"},
      %{"name" => "彩云镇", "code" => "532302109000"},
      %{"name" => "和平镇", "code" => "532302110000"},
      %{"name" => "恐龙山镇", "code" => "532302111000"},
      %{"name" => "中村乡", "code" => "532302201000"},
      %{"name" => "高峰乡", "code" => "532302202000"},
      %{"name" => "妥安乡", "code" => "532302203000"}
    ]

  def next(input) when input == "楚雄市" or input == "532301",
    do: [
      %{"name" => "鹿城镇", "code" => "532301101000"},
      %{"name" => "东瓜镇", "code" => "532301102000"},
      %{"name" => "吕合镇", "code" => "532301103000"},
      %{"name" => "紫溪镇", "code" => "532301104000"},
      %{"name" => "东华镇", "code" => "532301105000"},
      %{"name" => "子午镇", "code" => "532301106000"},
      %{"name" => "苍岭镇", "code" => "532301107000"},
      %{"name" => "三街镇", "code" => "532301108000"},
      %{"name" => "八角镇", "code" => "532301109000"},
      %{"name" => "中山镇", "code" => "532301110000"},
      %{"name" => "新村镇", "code" => "532301111000"},
      %{"name" => "西舍路镇", "code" => "532301112000"},
      %{"name" => "树苴乡", "code" => "532301201000"},
      %{"name" => "大过口乡", "code" => "532301202000"},
      %{"name" => "大地基乡", "code" => "532301203000"}
    ]

  def next(input) when input == "沧源佤族自治县" or input == "530927",
    do: [
      %{"name" => "勐董镇", "code" => "530927101000"},
      %{"name" => "岩帅镇", "code" => "530927102000"},
      %{"name" => "勐省镇", "code" => "530927103000"},
      %{"name" => "芒卡镇", "code" => "530927104000"},
      %{"name" => "单甲乡", "code" => "530927202000"},
      %{"name" => "糯良乡", "code" => "530927203000"},
      %{"name" => "勐来乡", "code" => "530927204000"},
      %{"name" => "勐角傣族彝族拉祜族乡", "code" => "530927205000"},
      %{"name" => "班洪乡", "code" => "530927206000"},
      %{"name" => "班老乡", "code" => "530927207000"},
      %{"name" => "勐省农场", "code" => "530927401000"}
    ]

  def next(input) when input == "耿马傣族佤族自治县" or input == "530926",
    do: [
      %{"name" => "耿马镇", "code" => "530926100000"},
      %{"name" => "勐永镇", "code" => "530926101000"},
      %{"name" => "勐撒镇", "code" => "530926102000"},
      %{"name" => "孟定镇", "code" => "530926103000"},
      %{"name" => "大兴乡", "code" => "530926200000"},
      %{"name" => "芒洪拉祜族布朗族乡", "code" => "530926201000"},
      %{"name" => "四排山乡", "code" => "530926202000"},
      %{"name" => "贺派乡", "code" => "530926203000"},
      %{"name" => "勐简乡", "code" => "530926204000"},
      %{"name" => "耿马华侨农场", "code" => "530926401000"},
      %{"name" => "勐撒农场", "code" => "530926402000"},
      %{"name" => "孟定农场", "code" => "530926403000"}
    ]

  def next(input) when input == "双江拉祜族佤族布朗族傣族自治县" or input == "530925",
    do: [
      %{"name" => "勐勐镇", "code" => "530925101000"},
      %{"name" => "勐库镇", "code" => "530925102000"},
      %{"name" => "沙河乡", "code" => "530925201000"},
      %{"name" => "大文乡", "code" => "530925202000"},
      %{"name" => "忙糯乡", "code" => "530925203000"},
      %{"name" => "邦丙乡", "code" => "530925205000"}
    ]

  def next(input) when input == "镇康县" or input == "530924",
    do: [
      %{"name" => "凤尾镇", "code" => "530924101000"},
      %{"name" => "勐捧镇", "code" => "530924102000"},
      %{"name" => "南伞镇", "code" => "530924103000"},
      %{"name" => "忙丙乡", "code" => "530924201000"},
      %{"name" => "勐堆乡", "code" => "530924202000"},
      %{"name" => "木场乡", "code" => "530924204000"},
      %{"name" => "军赛佤族拉祜族傈僳族德昂族乡", "code" => "530924205000"}
    ]

  def next(input) when input == "永德县" or input == "530923",
    do: [
      %{"name" => "德党镇", "code" => "530923101000"},
      %{"name" => "小勐统镇", "code" => "530923102000"},
      %{"name" => "永康镇", "code" => "530923103000"},
      %{"name" => "勐板乡", "code" => "530923203000"},
      %{"name" => "亚练乡", "code" => "530923204000"},
      %{"name" => "乌木龙彝族乡", "code" => "530923205000"},
      %{"name" => "大雪山彝族拉祜族傣族乡", "code" => "530923206000"},
      %{"name" => "班卡乡", "code" => "530923207000"},
      %{"name" => "崇岗乡", "code" => "530923208000"},
      %{"name" => "大山乡", "code" => "530923209000"},
      %{"name" => "勐底农场", "code" => "530923401000"}
    ]

  def next(input) when input == "云县" or input == "530922",
    do: [
      %{"name" => "爱华镇", "code" => "530922101000"},
      %{"name" => "漫湾镇", "code" => "530922102000"},
      %{"name" => "大朝山西镇", "code" => "530922103000"},
      %{"name" => "涌宝镇", "code" => "530922104000"},
      %{"name" => "茂兰镇", "code" => "530922105000"},
      %{"name" => "幸福镇", "code" => "530922106000"},
      %{"name" => "大寨镇", "code" => "530922107000"},
      %{"name" => "忙怀彝族布朗族乡", "code" => "530922201000"},
      %{"name" => "晓街乡", "code" => "530922202000"},
      %{"name" => "茶房乡", "code" => "530922203000"},
      %{"name" => "栗树彝族傣族乡", "code" => "530922204000"},
      %{"name" => "后箐彝族乡", "code" => "530922205000"},
      %{"name" => "临沧监狱", "code" => "530922401000"},
      %{"name" => "幸福农场", "code" => "530922501000"}
    ]

  def next(input) when input == "凤庆县" or input == "530921",
    do: [
      %{"name" => "凤山镇", "code" => "530921101000"},
      %{"name" => "鲁史镇", "code" => "530921102000"},
      %{"name" => "小湾镇", "code" => "530921103000"},
      %{"name" => "营盘镇", "code" => "530921104000"},
      %{"name" => "三岔河镇", "code" => "530921105000"},
      %{"name" => "勐佑镇", "code" => "530921106000"},
      %{"name" => "雪山镇", "code" => "530921107000"},
      %{"name" => "洛党镇", "code" => "530921108000"},
      %{"name" => "诗礼乡", "code" => "530921201000"},
      %{"name" => "新华彝族苗族乡", "code" => "530921202000"},
      %{"name" => "大寺乡", "code" => "530921204000"},
      %{"name" => "腰街彝族乡", "code" => "530921206000"},
      %{"name" => "郭大寨彝族白族乡", "code" => "530921207000"}
    ]

  def next(input) when input == "临翔区" or input == "530902",
    do: [
      %{"name" => "凤翔街道", "code" => "530902001000"},
      %{"name" => "忙畔街道", "code" => "530902002000"},
      %{"name" => "博尚镇", "code" => "530902102000"},
      %{"name" => "南美拉祜族乡", "code" => "530902202000"},
      %{"name" => "蚂蚁堆乡", "code" => "530902203000"},
      %{"name" => "章驮乡", "code" => "530902204000"},
      %{"name" => "圈内乡", "code" => "530902206000"},
      %{"name" => "马台乡", "code" => "530902207000"},
      %{"name" => "邦东乡", "code" => "530902208000"},
      %{"name" => "平村彝族傣族乡", "code" => "530902209000"}
    ]

  def next(input) when input == "西盟佤族自治县" or input == "530829",
    do: [
      %{"name" => "勐梭镇", "code" => "530829101000"},
      %{"name" => "勐卡镇", "code" => "530829102000"},
      %{"name" => "翁嘎科镇", "code" => "530829103000"},
      %{"name" => "中课镇", "code" => "530829104000"},
      %{"name" => "新厂镇", "code" => "530829105000"},
      %{"name" => "力所拉祜族乡", "code" => "530829202000"},
      %{"name" => "岳宋乡", "code" => "530829203000"}
    ]

  def next(input) when input == "澜沧拉祜族自治县" or input == "530828",
    do: [
      %{"name" => "勐朗镇", "code" => "530828101000"},
      %{"name" => "上允镇", "code" => "530828102000"},
      %{"name" => "糯扎渡镇", "code" => "530828103000"},
      %{"name" => "惠民镇", "code" => "530828104000"},
      %{"name" => "东回镇", "code" => "530828105000"},
      %{"name" => "发展河哈尼族乡", "code" => "530828201000"},
      %{"name" => "谦六彝族乡", "code" => "530828202000"},
      %{"name" => "糯福乡", "code" => "530828203000"},
      %{"name" => "东河乡", "code" => "530828204000"},
      %{"name" => "大山乡", "code" => "530828205000"},
      %{"name" => "南岭乡", "code" => "530828206000"},
      %{"name" => "雪林佤族乡", "code" => "530828207000"},
      %{"name" => "木戛乡", "code" => "530828208000"},
      %{"name" => "酒井哈尼族乡", "code" => "530828209000"},
      %{"name" => "拉巴乡", "code" => "530828212000"},
      %{"name" => "竹塘乡", "code" => "530828213000"},
      %{"name" => "富邦乡", "code" => "530828214000"},
      %{"name" => "安康佤族乡", "code" => "530828215000"},
      %{"name" => "文东佤族乡", "code" => "530828216000"},
      %{"name" => "富东乡", "code" => "530828217000"}
    ]

  def next(input) when input == "孟连傣族拉祜族佤族自治县" or input == "530827",
    do: [
      %{"name" => "娜允镇", "code" => "530827101000"},
      %{"name" => "勐马镇", "code" => "530827102000"},
      %{"name" => "芒信镇", "code" => "530827103000"},
      %{"name" => "富岩镇", "code" => "530827104000"},
      %{"name" => "景信乡", "code" => "530827201000"},
      %{"name" => "公信乡", "code" => "530827202000"}
    ]

  def next(input) when input == "江城哈尼族彝族自治县" or input == "530826",
    do: [
      %{"name" => "勐烈镇", "code" => "530826101000"},
      %{"name" => "整董镇", "code" => "530826102000"},
      %{"name" => "曲水镇", "code" => "530826103000"},
      %{"name" => "宝藏镇", "code" => "530826104000"},
      %{"name" => "康平镇", "code" => "530826105000"},
      %{"name" => "国庆乡", "code" => "530826202000"},
      %{"name" => "嘉禾乡", "code" => "530826203000"}
    ]

  def next(input) when input == "镇沅彝族哈尼族拉祜族自治县" or input == "530825",
    do: [
      %{"name" => "恩乐镇", "code" => "530825101000"},
      %{"name" => "按板镇", "code" => "530825102000"},
      %{"name" => "勐大镇", "code" => "530825103000"},
      %{"name" => "者东镇", "code" => "530825104000"},
      %{"name" => "九甲镇", "code" => "530825105000"},
      %{"name" => "古城镇", "code" => "530825106000"},
      %{"name" => "振太镇", "code" => "530825107000"},
      %{"name" => "和平镇", "code" => "530825108000"},
      %{"name" => "田坝乡", "code" => "530825201000"}
    ]

  def next(input) when input == "景谷傣族彝族自治县" or input == "530824",
    do: [
      %{"name" => "威远镇", "code" => "530824101000"},
      %{"name" => "永平镇", "code" => "530824102000"},
      %{"name" => "正兴镇", "code" => "530824103000"},
      %{"name" => "民乐镇", "code" => "530824104000"},
      %{"name" => "凤山镇", "code" => "530824105000"},
      %{"name" => "景谷镇", "code" => "530824106000"},
      %{"name" => "碧安乡", "code" => "530824201000"},
      %{"name" => "益智乡", "code" => "530824204000"},
      %{"name" => "半坡乡", "code" => "530824205000"},
      %{"name" => "勐班乡", "code" => "530824206000"}
    ]

  def next(input) when input == "景东彝族自治县" or input == "530823",
    do: [
      %{"name" => "锦屏镇", "code" => "530823101000"},
      %{"name" => "文井镇", "code" => "530823102000"},
      %{"name" => "漫湾镇", "code" => "530823103000"},
      %{"name" => "大朝山东镇", "code" => "530823104000"},
      %{"name" => "花山镇", "code" => "530823105000"},
      %{"name" => "大街镇", "code" => "530823106000"},
      %{"name" => "太忠镇", "code" => "530823107000"},
      %{"name" => "文龙镇", "code" => "530823108000"},
      %{"name" => "安定镇", "code" => "530823109000"},
      %{"name" => "景福镇", "code" => "530823110000"},
      %{"name" => "曼等乡", "code" => "530823201000"},
      %{"name" => "龙街乡", "code" => "530823205000"},
      %{"name" => "林街乡", "code" => "530823208000"}
    ]

  def next(input) when input == "墨江哈尼族自治县" or input == "530822",
    do: [
      %{"name" => "联珠镇", "code" => "530822101000"},
      %{"name" => "通关镇", "code" => "530822102000"},
      %{"name" => "龙坝镇", "code" => "530822103000"},
      %{"name" => "新安镇", "code" => "530822104000"},
      %{"name" => "团田镇", "code" => "530822105000"},
      %{"name" => "新抚镇", "code" => "530822106000"},
      %{"name" => "景星镇", "code" => "530822107000"},
      %{"name" => "鱼塘镇", "code" => "530822108000"},
      %{"name" => "文武镇", "code" => "530822109000"},
      %{"name" => "坝溜镇", "code" => "530822110000"},
      %{"name" => "泗南江镇", "code" => "530822111000"},
      %{"name" => "雅邑镇", "code" => "530822112000"},
      %{"name" => "孟弄彝族乡", "code" => "530822203000"},
      %{"name" => "龙潭乡", "code" => "530822208000"},
      %{"name" => "那哈乡", "code" => "530822212000"}
    ]

  def next(input) when input == "宁洱哈尼族彝族自治县" or input == "530821",
    do: [
      %{"name" => "宁洱镇", "code" => "530821101000"},
      %{"name" => "磨黑镇", "code" => "530821102000"},
      %{"name" => "德化镇", "code" => "530821103000"},
      %{"name" => "同心镇", "code" => "530821104000"},
      %{"name" => "勐先镇", "code" => "530821105000"},
      %{"name" => "梅子镇", "code" => "530821106000"},
      %{"name" => "德安乡", "code" => "530821201000"},
      %{"name" => "普义乡", "code" => "530821205000"},
      %{"name" => "黎明乡", "code" => "530821206000"}
    ]

  def next(input) when input == "思茅区" or input == "530802",
    do: [
      %{"name" => "思茅街道", "code" => "530802001000"},
      %{"name" => "南屏镇", "code" => "530802102000"},
      %{"name" => "倚象镇", "code" => "530802103000"},
      %{"name" => "思茅港镇", "code" => "530802104000"},
      %{"name" => "六顺镇", "code" => "530802105000"},
      %{"name" => "龙潭彝族傣族乡", "code" => "530802201000"},
      %{"name" => "云仙彝族乡", "code" => "530802202000"}
    ]

  def next(input) when input == "宁蒗彝族自治县" or input == "530724",
    do: [
      %{"name" => "大兴街道", "code" => "530724001000"},
      %{"name" => "紫玛街道", "code" => "530724002000"},
      %{"name" => "永宁镇", "code" => "530724102000"},
      %{"name" => "红桥镇", "code" => "530724103000"},
      %{"name" => "战河镇", "code" => "530724104000"},
      %{"name" => "拉伯乡", "code" => "530724201000"},
      %{"name" => "翠玉傈僳族普米族乡", "code" => "530724203000"},
      %{"name" => "宁利乡", "code" => "530724205000"},
      %{"name" => "金棉乡", "code" => "530724206000"},
      %{"name" => "西川乡", "code" => "530724207000"},
      %{"name" => "西布河乡", "code" => "530724208000"},
      %{"name" => "永宁坪乡", "code" => "530724210000"},
      %{"name" => "跑马坪乡", "code" => "530724211000"},
      %{"name" => "蝉战河乡", "code" => "530724212000"},
      %{"name" => "新营盘乡", "code" => "530724213000"},
      %{"name" => "烂泥箐乡", "code" => "530724214000"}
    ]

  def next(input) when input == "华坪县" or input == "530723",
    do: [
      %{"name" => "中心镇", "code" => "530723101000"},
      %{"name" => "荣将镇", "code" => "530723102000"},
      %{"name" => "兴泉镇", "code" => "530723103000"},
      %{"name" => "石龙坝镇", "code" => "530723104000"},
      %{"name" => "新庄傈僳族傣族乡", "code" => "530723202000"},
      %{"name" => "通达傈僳族乡", "code" => "530723203000"},
      %{"name" => "永兴傈僳族乡", "code" => "530723204000"},
      %{"name" => "船房傈僳族傣族乡", "code" => "530723205000"}
    ]

  def next(input) when input == "永胜县" or input == "530722",
    do: [
      %{"name" => "永北镇", "code" => "530722101000"},
      %{"name" => "仁和镇", "code" => "530722102000"},
      %{"name" => "期纳镇", "code" => "530722103000"},
      %{"name" => "三川镇", "code" => "530722104000"},
      %{"name" => "程海镇", "code" => "530722105000"},
      %{"name" => "涛源镇", "code" => "530722106000"},
      %{"name" => "鲁地拉镇", "code" => "530722107000"},
      %{"name" => "片角镇", "code" => "530722108000"},
      %{"name" => "顺州镇", "code" => "530722109000"},
      %{"name" => "羊坪彝族乡", "code" => "530722201000"},
      %{"name" => "六德傈僳族彝族乡", "code" => "530722202000"},
      %{"name" => "东山傈僳族彝族乡", "code" => "530722203000"},
      %{"name" => "光华傈僳族彝族乡", "code" => "530722207000"},
      %{"name" => "松坪傈僳族彝族乡", "code" => "530722208000"},
      %{"name" => "大安彝族纳西族乡", "code" => "530722209000"}
    ]

  def next(input) when input == "玉龙纳西族自治县" or input == "530721",
    do: [
      %{"name" => "黄山街道", "code" => "530721001000"},
      %{"name" => "石鼓镇", "code" => "530721102000"},
      %{"name" => "巨甸镇", "code" => "530721103000"},
      %{"name" => "白沙镇", "code" => "530721104000"},
      %{"name" => "拉市镇", "code" => "530721105000"},
      %{"name" => "奉科镇", "code" => "530721106000"},
      %{"name" => "鸣音镇", "code" => "530721107000"},
      %{"name" => "太安乡", "code" => "530721203000"},
      %{"name" => "龙蟠乡", "code" => "530721204000"},
      %{"name" => "黎明傈僳族乡", "code" => "530721205000"},
      %{"name" => "鲁甸乡", "code" => "530721206000"},
      %{"name" => "塔城乡", "code" => "530721207000"},
      %{"name" => "大具乡", "code" => "530721208000"},
      %{"name" => "宝山乡", "code" => "530721209000"},
      %{"name" => "石头白族乡", "code" => "530721212000"},
      %{"name" => "九河白族乡", "code" => "530721213000"}
    ]

  def next(input) when input == "古城区" or input == "530702",
    do: [
      %{"name" => "西安街道", "code" => "530702001000"},
      %{"name" => "大研街道", "code" => "530702002000"},
      %{"name" => "祥和街道", "code" => "530702003000"},
      %{"name" => "束河街道", "code" => "530702004000"},
      %{"name" => "金山街道", "code" => "530702005000"},
      %{"name" => "开南街道", "code" => "530702006000"},
      %{"name" => "文化街道", "code" => "530702007000"},
      %{"name" => "金安镇", "code" => "530702101000"},
      %{"name" => "七河镇", "code" => "530702102000"},
      %{"name" => "大东乡", "code" => "530702203000"},
      %{"name" => "金江白族乡", "code" => "530702205000"}
    ]

  def next(input) when input == "水富市" or input == "530681",
    do: [
      %{"name" => "云富街道", "code" => "530681001000"},
      %{"name" => "向家坝镇", "code" => "530681101000"},
      %{"name" => "太平镇", "code" => "530681102000"},
      %{"name" => "两碗镇", "code" => "530681103000"}
    ]

  def next(input) when input == "威信县" or input == "530629",
    do: [
      %{"name" => "扎西镇", "code" => "530629101000"},
      %{"name" => "旧城镇", "code" => "530629102000"},
      %{"name" => "罗布镇", "code" => "530629103000"},
      %{"name" => "麟凤镇", "code" => "530629104000"},
      %{"name" => "长安镇", "code" => "530629105000"},
      %{"name" => "庙沟镇", "code" => "530629106000"},
      %{"name" => "水田镇", "code" => "530629107000"},
      %{"name" => "双河苗族彝族乡", "code" => "530629201000"},
      %{"name" => "高田乡", "code" => "530629202000"},
      %{"name" => "三桃乡", "code" => "530629207000"}
    ]

  def next(input) when input == "彝良县" or input == "530628",
    do: [
      %{"name" => "角奎街道", "code" => "530628001000"},
      %{"name" => "发界街道", "code" => "530628002000"},
      %{"name" => "洛泽河镇", "code" => "530628102000"},
      %{"name" => "牛街镇", "code" => "530628103000"},
      %{"name" => "海子镇", "code" => "530628104000"},
      %{"name" => "荞山镇", "code" => "530628105000"},
      %{"name" => "龙安镇", "code" => "530628106000"},
      %{"name" => "钟鸣镇", "code" => "530628107000"},
      %{"name" => "两河镇", "code" => "530628108000"},
      %{"name" => "小草坝镇", "code" => "530628109000"},
      %{"name" => "龙海镇", "code" => "530628110000"},
      %{"name" => "龙街苗族彝族乡", "code" => "530628201000"},
      %{"name" => "奎香苗族彝族乡", "code" => "530628202000"},
      %{"name" => "树林彝族苗族乡", "code" => "530628203000"},
      %{"name" => "柳溪苗族乡", "code" => "530628211000"},
      %{"name" => "洛旺苗族乡", "code" => "530628212000"}
    ]

  def next(input) when input == "镇雄县" or input == "530627",
    do: [
      %{"name" => "乌峰街道", "code" => "530627001000"},
      %{"name" => "南台街道", "code" => "530627002000"},
      %{"name" => "旧府街道", "code" => "530627003000"},
      %{"name" => "泼机镇", "code" => "530627102000"},
      %{"name" => "黑树镇", "code" => "530627103000"},
      %{"name" => "母享镇", "code" => "530627104000"},
      %{"name" => "大湾镇", "code" => "530627105000"},
      %{"name" => "以勒镇", "code" => "530627106000"},
      %{"name" => "赤水源镇", "code" => "530627107000"},
      %{"name" => "芒部镇", "code" => "530627108000"},
      %{"name" => "雨河镇", "code" => "530627109000"},
      %{"name" => "罗坎镇", "code" => "530627110000"},
      %{"name" => "牛场镇", "code" => "530627111000"},
      %{"name" => "五德镇", "code" => "530627112000"},
      %{"name" => "坡头镇", "code" => "530627113000"},
      %{"name" => "以古镇", "code" => "530627114000"},
      %{"name" => "场坝镇", "code" => "530627115000"},
      %{"name" => "塘房镇", "code" => "530627116000"},
      %{"name" => "中屯镇", "code" => "530627117000"},
      %{"name" => "木卓镇", "code" => "530627118000"},
      %{"name" => "盐源镇", "code" => "530627119000"},
      %{"name" => "碗厂镇", "code" => "530627120000"},
      %{"name" => "坪上镇", "code" => "530627121000"},
      %{"name" => "鱼洞乡", "code" => "530627202000"},
      %{"name" => "花朗乡", "code" => "530627203000"},
      %{"name" => "尖山乡", "code" => "530627204000"},
      %{"name" => "杉树乡", "code" => "530627208000"},
      %{"name" => "花山乡", "code" => "530627209000"},
      %{"name" => "果珠彝族乡", "code" => "530627211000"},
      %{"name" => "林口彝族苗族乡", "code" => "530627212000"}
    ]

  def next(input) when input == "绥江县" or input == "530626",
    do: [
      %{"name" => "中城镇", "code" => "530626101000"},
      %{"name" => "南岸镇", "code" => "530626102000"},
      %{"name" => "新滩镇", "code" => "530626103000"},
      %{"name" => "会仪镇", "code" => "530626104000"},
      %{"name" => "板栗镇", "code" => "530626105000"}
    ]

  def next(input) when input == "永善县" or input == "530625",
    do: [
      %{"name" => "溪洛渡街道", "code" => "530625001000"},
      %{"name" => "永兴街道", "code" => "530625002000"},
      %{"name" => "桧溪镇", "code" => "530625102000"},
      %{"name" => "黄华镇", "code" => "530625103000"},
      %{"name" => "茂林镇", "code" => "530625104000"},
      %{"name" => "大兴镇", "code" => "530625105000"},
      %{"name" => "莲峰镇", "code" => "530625106000"},
      %{"name" => "务基镇", "code" => "530625107000"},
      %{"name" => "码口镇", "code" => "530625108000"},
      %{"name" => "团结乡", "code" => "530625201000"},
      %{"name" => "细沙乡", "code" => "530625202000"},
      %{"name" => "青胜乡", "code" => "530625203000"},
      %{"name" => "马楠苗族彝族乡", "code" => "530625205000"},
      %{"name" => "水竹乡", "code" => "530625206000"},
      %{"name" => "墨翰乡", "code" => "530625207000"},
      %{"name" => "伍寨彝族苗族乡", "code" => "530625208000"}
    ]

  def next(input) when input == "大关县" or input == "530624",
    do: [
      %{"name" => "翠华镇", "code" => "530624101000"},
      %{"name" => "玉碗镇", "code" => "530624102000"},
      %{"name" => "吉利镇", "code" => "530624103000"},
      %{"name" => "天星镇", "code" => "530624104000"},
      %{"name" => "木杆镇", "code" => "530624105000"},
      %{"name" => "悦乐镇", "code" => "530624106000"},
      %{"name" => "寿山镇", "code" => "530624107000"},
      %{"name" => "高桥镇", "code" => "530624108000"},
      %{"name" => "上高桥回族彝族苗族乡", "code" => "530624201000"}
    ]

  def next(input) when input == "盐津县" or input == "530623",
    do: [
      %{"name" => "盐井镇", "code" => "530623101000"},
      %{"name" => "普洱镇", "code" => "530623102000"},
      %{"name" => "豆沙镇", "code" => "530623103000"},
      %{"name" => "中和镇", "code" => "530623104000"},
      %{"name" => "庙坝镇", "code" => "530623105000"},
      %{"name" => "柿子镇", "code" => "530623106000"},
      %{"name" => "兴隆乡", "code" => "530623201000"},
      %{"name" => "落雁乡", "code" => "530623202000"},
      %{"name" => "滩头乡", "code" => "530623203000"},
      %{"name" => "牛寨乡", "code" => "530623204000"}
    ]

  def next(input) when input == "巧家县" or input == "530622",
    do: [
      %{"name" => "玉屏街道", "code" => "530622001000"},
      %{"name" => "白鹤滩街道", "code" => "530622002000"},
      %{"name" => "大寨镇", "code" => "530622102000"},
      %{"name" => "小河镇", "code" => "530622103000"},
      %{"name" => "药山镇", "code" => "530622104000"},
      %{"name" => "马树镇", "code" => "530622105000"},
      %{"name" => "老店镇", "code" => "530622106000"},
      %{"name" => "茂租镇", "code" => "530622107000"},
      %{"name" => "东坪镇", "code" => "530622108000"},
      %{"name" => "新店镇", "code" => "530622109000"},
      %{"name" => "崇溪镇", "code" => "530622110000"},
      %{"name" => "金塘镇", "code" => "530622111000"},
      %{"name" => "蒙姑镇", "code" => "530622112000"},
      %{"name" => "红山乡", "code" => "530622203000"},
      %{"name" => "包谷垴乡", "code" => "530622205000"},
      %{"name" => "中寨乡", "code" => "530622206000"},
      %{"name" => "炉房乡", "code" => "530622209000"}
    ]

  def next(input) when input == "鲁甸县" or input == "530621",
    do: [
      %{"name" => "文屏街道", "code" => "530621001000"},
      %{"name" => "砚池街道", "code" => "530621002000"},
      %{"name" => "水磨镇", "code" => "530621102000"},
      %{"name" => "龙头山镇", "code" => "530621103000"},
      %{"name" => "小寨镇", "code" => "530621104000"},
      %{"name" => "江底镇", "code" => "530621105000"},
      %{"name" => "火德红镇", "code" => "530621106000"},
      %{"name" => "龙树镇", "code" => "530621107000"},
      %{"name" => "新街镇", "code" => "530621108000"},
      %{"name" => "梭山镇", "code" => "530621109000"},
      %{"name" => "乐红镇", "code" => "530621110000"},
      %{"name" => "桃源回族乡", "code" => "530621201000"},
      %{"name" => "茨院回族乡", "code" => "530621202000"}
    ]

  def next(input) when input == "昭阳区" or input == "530602",
    do: [
      %{"name" => "凤凰街道", "code" => "530602001000"},
      %{"name" => "龙泉街道", "code" => "530602002000"},
      %{"name" => "太平街道", "code" => "530602003000"},
      %{"name" => "北闸街道", "code" => "530602004000"},
      %{"name" => "旧圃镇", "code" => "530602101000"},
      %{"name" => "永丰镇", "code" => "530602102000"},
      %{"name" => "盘河镇", "code" => "530602104000"},
      %{"name" => "靖安镇", "code" => "530602105000"},
      %{"name" => "洒渔镇", "code" => "530602106000"},
      %{"name" => "乐居镇", "code" => "530602107000"},
      %{"name" => "苏家院镇", "code" => "530602108000"},
      %{"name" => "大山包镇", "code" => "530602109000"},
      %{"name" => "炎山镇", "code" => "530602110000"},
      %{"name" => "布嘎回族乡", "code" => "530602201000"},
      %{"name" => "守望回族乡", "code" => "530602202000"},
      %{"name" => "小龙洞回族彝族乡", "code" => "530602203000"},
      %{"name" => "青岗岭回族彝族乡", "code" => "530602206000"},
      %{"name" => "苏甲乡", "code" => "530602210000"},
      %{"name" => "大寨子乡", "code" => "530602212000"},
      %{"name" => "田坝乡", "code" => "530602214000"}
    ]

  def next(input) when input == "腾冲市" or input == "530581",
    do: [
      %{"name" => "腾越街道", "code" => "530581001000"},
      %{"name" => "西源街道", "code" => "530581002000"},
      %{"name" => "固东镇", "code" => "530581102000"},
      %{"name" => "滇滩镇", "code" => "530581103000"},
      %{"name" => "猴桥镇", "code" => "530581104000"},
      %{"name" => "和顺镇", "code" => "530581105000"},
      %{"name" => "界头镇", "code" => "530581106000"},
      %{"name" => "曲石镇", "code" => "530581107000"},
      %{"name" => "明光镇", "code" => "530581108000"},
      %{"name" => "中和镇", "code" => "530581109000"},
      %{"name" => "芒棒镇", "code" => "530581110000"},
      %{"name" => "荷花镇", "code" => "530581111000"},
      %{"name" => "北海镇", "code" => "530581112000"},
      %{"name" => "清水镇", "code" => "530581113000"},
      %{"name" => "马站乡", "code" => "530581201000"},
      %{"name" => "五合乡", "code" => "530581204000"},
      %{"name" => "新华乡", "code" => "530581205000"},
      %{"name" => "蒲川乡", "code" => "530581206000"},
      %{"name" => "团田乡", "code" => "530581207000"}
    ]

  def next(input) when input == "昌宁县" or input == "530524",
    do: [
      %{"name" => "田园镇", "code" => "530524101000"},
      %{"name" => "漭水镇", "code" => "530524102000"},
      %{"name" => "柯街镇", "code" => "530524103000"},
      %{"name" => "卡斯镇", "code" => "530524104000"},
      %{"name" => "勐统镇", "code" => "530524105000"},
      %{"name" => "温泉镇", "code" => "530524106000"},
      %{"name" => "大田坝镇", "code" => "530524107000"},
      %{"name" => "鸡飞镇", "code" => "530524108000"},
      %{"name" => "翁堵镇", "code" => "530524109000"},
      %{"name" => "湾甸傣族乡", "code" => "530524205000"},
      %{"name" => "更戛乡", "code" => "530524206000"},
      %{"name" => "珠街彝族乡", "code" => "530524207000"},
      %{"name" => "耈街彝族苗族乡", "code" => "530524208000"}
    ]

  def next(input) when input == "龙陵县" or input == "530523",
    do: [
      %{"name" => "龙山镇", "code" => "530523101000"},
      %{"name" => "镇安镇", "code" => "530523102000"},
      %{"name" => "勐糯镇", "code" => "530523103000"},
      %{"name" => "腊勐镇", "code" => "530523104000"},
      %{"name" => "象达镇", "code" => "530523105000"},
      %{"name" => "龙江乡", "code" => "530523201000"},
      %{"name" => "碧寨乡", "code" => "530523203000"},
      %{"name" => "龙新乡", "code" => "530523204000"},
      %{"name" => "平达乡", "code" => "530523206000"},
      %{"name" => "木城彝族傈僳族乡", "code" => "530523207000"}
    ]

  def next(input) when input == "施甸县" or input == "530521",
    do: [
      %{"name" => "甸阳镇", "code" => "530521101000"},
      %{"name" => "由旺镇", "code" => "530521102000"},
      %{"name" => "姚关镇", "code" => "530521103000"},
      %{"name" => "仁和镇", "code" => "530521104000"},
      %{"name" => "太平镇", "code" => "530521105000"},
      %{"name" => "万兴乡", "code" => "530521201000"},
      %{"name" => "摆榔彝族布朗族乡", "code" => "530521202000"},
      %{"name" => "酒房乡", "code" => "530521203000"},
      %{"name" => "旧城乡", "code" => "530521204000"},
      %{"name" => "木老元布朗族彝族乡", "code" => "530521205000"},
      %{"name" => "老麦乡", "code" => "530521206000"},
      %{"name" => "何元乡", "code" => "530521207000"},
      %{"name" => "水长乡", "code" => "530521208000"}
    ]

  def next(input) when input == "隆阳区" or input == "530502",
    do: [
      %{"name" => "兰城街道", "code" => "530502001000"},
      %{"name" => "永昌街道", "code" => "530502002000"},
      %{"name" => "九隆街道", "code" => "530502003000"},
      %{"name" => "青华街道", "code" => "530502004000"},
      %{"name" => "河图街道", "code" => "530502005000"},
      %{"name" => "永盛街道", "code" => "530502006000"},
      %{"name" => "板桥镇", "code" => "530502101000"},
      %{"name" => "汉庄镇", "code" => "530502103000"},
      %{"name" => "蒲缥镇", "code" => "530502104000"},
      %{"name" => "瓦窑镇", "code" => "530502105000"},
      %{"name" => "潞江镇", "code" => "530502106000"},
      %{"name" => "金鸡乡", "code" => "530502201000"},
      %{"name" => "辛街乡", "code" => "530502202000"},
      %{"name" => "西邑乡", "code" => "530502203000"},
      %{"name" => "丙麻乡", "code" => "530502204000"},
      %{"name" => "瓦渡乡", "code" => "530502205000"},
      %{"name" => "水寨乡", "code" => "530502206000"},
      %{"name" => "瓦马彝族白族乡", "code" => "530502207000"},
      %{"name" => "瓦房彝族苗族乡", "code" => "530502208000"},
      %{"name" => "杨柳白族彝族乡", "code" => "530502209000"},
      %{"name" => "芒宽彝族傣族乡", "code" => "530502210000"}
    ]

  def next(input) when input == "澄江市" or input == "530481",
    do: [
      %{"name" => "凤麓街道", "code" => "530481001000"},
      %{"name" => "龙街街道", "code" => "530481002000"},
      %{"name" => "右所镇", "code" => "530481101000"},
      %{"name" => "阳宗镇", "code" => "530481102000"},
      %{"name" => "海口镇", "code" => "530481103000"},
      %{"name" => "九村镇", "code" => "530481104000"}
    ]

  def next(input) when input == "元江哈尼族彝族傣族自治县" or input == "530428",
    do: [
      %{"name" => "红河街道", "code" => "530428001000"},
      %{"name" => "澧江街道", "code" => "530428002000"},
      %{"name" => "甘庄街道", "code" => "530428003000"},
      %{"name" => "曼来镇", "code" => "530428101000"},
      %{"name" => "因远镇", "code" => "530428102000"},
      %{"name" => "龙潭乡", "code" => "530428201000"},
      %{"name" => "羊街乡", "code" => "530428202000"},
      %{"name" => "那诺乡", "code" => "530428203000"},
      %{"name" => "洼垤乡", "code" => "530428204000"},
      %{"name" => "咪哩乡", "code" => "530428205000"}
    ]

  def next(input) when input == "新平彝族傣族自治县" or input == "530427",
    do: [
      %{"name" => "桂山街道", "code" => "530427001000"},
      %{"name" => "古城街道", "code" => "530427002000"},
      %{"name" => "扬武镇", "code" => "530427100000"},
      %{"name" => "漠沙镇", "code" => "530427101000"},
      %{"name" => "戛洒镇", "code" => "530427102000"},
      %{"name" => "水塘镇", "code" => "530427103000"},
      %{"name" => "平甸乡", "code" => "530427200000"},
      %{"name" => "新化乡", "code" => "530427201000"},
      %{"name" => "建兴乡", "code" => "530427202000"},
      %{"name" => "老厂乡", "code" => "530427203000"},
      %{"name" => "者竜乡", "code" => "530427204000"},
      %{"name" => "平掌乡", "code" => "530427205000"}
    ]

  def next(input) when input == "峨山彝族自治县" or input == "530426",
    do: [
      %{"name" => "双江街道", "code" => "530426001000"},
      %{"name" => "小街街道", "code" => "530426002000"},
      %{"name" => "甸中镇", "code" => "530426103000"},
      %{"name" => "化念镇", "code" => "530426104000"},
      %{"name" => "塔甸镇", "code" => "530426105000"},
      %{"name" => "岔河乡", "code" => "530426201000"},
      %{"name" => "大龙潭乡", "code" => "530426202000"},
      %{"name" => "富良棚乡", "code" => "530426203000"}
    ]

  def next(input) when input == "易门县" or input == "530425",
    do: [
      %{"name" => "龙泉街道", "code" => "530425001000"},
      %{"name" => "六街街道", "code" => "530425002000"},
      %{"name" => "绿汁镇", "code" => "530425100000"},
      %{"name" => "浦贝彝族乡", "code" => "530425201000"},
      %{"name" => "十街彝族乡", "code" => "530425202000"},
      %{"name" => "铜厂彝族乡", "code" => "530425203000"},
      %{"name" => "小街乡", "code" => "530425204000"}
    ]

  def next(input) when input == "华宁县" or input == "530424",
    do: [
      %{"name" => "宁州街道", "code" => "530424001000"},
      %{"name" => "盘溪镇", "code" => "530424102000"},
      %{"name" => "华溪镇", "code" => "530424103000"},
      %{"name" => "青龙镇", "code" => "530424104000"},
      %{"name" => "通红甸彝族苗族乡", "code" => "530424201000"}
    ]

  def next(input) when input == "通海县" or input == "530423",
    do: [
      %{"name" => "秀山街道", "code" => "530423001000"},
      %{"name" => "九龙街道", "code" => "530423002000"},
      %{"name" => "杨广镇", "code" => "530423101000"},
      %{"name" => "河西镇", "code" => "530423102000"},
      %{"name" => "四街镇", "code" => "530423103000"},
      %{"name" => "纳古镇", "code" => "530423104000"},
      %{"name" => "里山彝族乡", "code" => "530423201000"},
      %{"name" => "高大傣族彝族乡", "code" => "530423202000"},
      %{"name" => "兴蒙蒙古族乡", "code" => "530423203000"}
    ]

  def next(input) when input == "江川区" or input == "530403",
    do: [
      %{"name" => "星云街道", "code" => "530403001000"},
      %{"name" => "宁海街道", "code" => "530403002000"},
      %{"name" => "江城镇", "code" => "530403101000"},
      %{"name" => "前卫镇", "code" => "530403102000"},
      %{"name" => "九溪镇", "code" => "530403103000"},
      %{"name" => "路居镇", "code" => "530403104000"},
      %{"name" => "安化彝族乡", "code" => "530403201000"},
      %{"name" => "雄关乡", "code" => "530403202000"}
    ]

  def next(input) when input == "红塔区" or input == "530402",
    do: [
      %{"name" => "玉兴街道", "code" => "530402001000"},
      %{"name" => "凤凰街道", "code" => "530402002000"},
      %{"name" => "玉带街道", "code" => "530402003000"},
      %{"name" => "北城街道", "code" => "530402004000"},
      %{"name" => "春和街道", "code" => "530402005000"},
      %{"name" => "李棋街道", "code" => "530402006000"},
      %{"name" => "大营街街道", "code" => "530402007000"},
      %{"name" => "研和街道", "code" => "530402008000"},
      %{"name" => "高仓街道", "code" => "530402009000"},
      %{"name" => "小石桥彝族乡", "code" => "530402201000"},
      %{"name" => "洛河彝族乡", "code" => "530402202000"}
    ]

  def next(input) when input == "宣威市" or input == "530381",
    do: [
      %{"name" => "宛水街道", "code" => "530381001000"},
      %{"name" => "西宁街道", "code" => "530381002000"},
      %{"name" => "双龙街道", "code" => "530381003000"},
      %{"name" => "虹桥街道", "code" => "530381004000"},
      %{"name" => "丰华街道", "code" => "530381005000"},
      %{"name" => "板桥街道", "code" => "530381006000"},
      %{"name" => "来宾街道", "code" => "530381007000"},
      %{"name" => "凤凰街道", "code" => "530381008000"},
      %{"name" => "复兴街道", "code" => "530381009000"},
      %{"name" => "格宜镇", "code" => "530381102000"},
      %{"name" => "田坝镇", "code" => "530381103000"},
      %{"name" => "羊场镇", "code" => "530381104000"},
      %{"name" => "倘塘镇", "code" => "530381106000"},
      %{"name" => "落水镇", "code" => "530381107000"},
      %{"name" => "务德镇", "code" => "530381108000"},
      %{"name" => "海岱镇", "code" => "530381109000"},
      %{"name" => "龙场镇", "code" => "530381110000"},
      %{"name" => "龙潭镇", "code" => "530381111000"},
      %{"name" => "热水镇", "code" => "530381112000"},
      %{"name" => "宝山镇", "code" => "530381113000"},
      %{"name" => "东山镇", "code" => "530381114000"},
      %{"name" => "杨柳镇", "code" => "530381115000"},
      %{"name" => "普立乡", "code" => "530381201000"},
      %{"name" => "西泽乡", "code" => "530381202000"},
      %{"name" => "得禄乡", "code" => "530381203000"},
      %{"name" => "双河乡", "code" => "530381205000"},
      %{"name" => "乐丰乡", "code" => "530381206000"},
      %{"name" => "文兴乡", "code" => "530381207000"},
      %{"name" => "阿都乡", "code" => "530381208000"}
    ]

  def next(input) when input == "会泽县" or input == "530326",
    do: [
      %{"name" => "古城街道", "code" => "530326001000"},
      %{"name" => "宝云街道", "code" => "530326002000"},
      %{"name" => "金钟街道", "code" => "530326003000"},
      %{"name" => "以礼街道", "code" => "530326004000"},
      %{"name" => "钟屏街道", "code" => "530326005000"},
      %{"name" => "娜姑镇", "code" => "530326102000"},
      %{"name" => "迤车镇", "code" => "530326103000"},
      %{"name" => "乐业镇", "code" => "530326104000"},
      %{"name" => "矿山镇", "code" => "530326105000"},
      %{"name" => "者海镇", "code" => "530326106000"},
      %{"name" => "大井镇", "code" => "530326107000"},
      %{"name" => "待补镇", "code" => "530326108000"},
      %{"name" => "大海乡", "code" => "530326201000"},
      %{"name" => "老厂乡", "code" => "530326202000"},
      %{"name" => "五星乡", "code" => "530326203000"},
      %{"name" => "大桥乡", "code" => "530326204000"},
      %{"name" => "纸厂乡", "code" => "530326205000"},
      %{"name" => "马路乡", "code" => "530326206000"},
      %{"name" => "火红乡", "code" => "530326207000"},
      %{"name" => "新街回族乡", "code" => "530326208000"},
      %{"name" => "雨碌乡", "code" => "530326209000"},
      %{"name" => "鲁纳乡", "code" => "530326210000"},
      %{"name" => "上村乡", "code" => "530326211000"},
      %{"name" => "驾车乡", "code" => "530326212000"},
      %{"name" => "田坝乡", "code" => "530326213000"}
    ]

  def next(input) when input == "富源县" or input == "530325",
    do: [
      %{"name" => "中安街道", "code" => "530325001000"},
      %{"name" => "胜境街道", "code" => "530325002000"},
      %{"name" => "营上镇", "code" => "530325102000"},
      %{"name" => "黄泥河镇", "code" => "530325103000"},
      %{"name" => "竹园镇", "code" => "530325104000"},
      %{"name" => "后所镇", "code" => "530325105000"},
      %{"name" => "大河镇", "code" => "530325106000"},
      %{"name" => "墨红镇", "code" => "530325107000"},
      %{"name" => "富村镇", "code" => "530325108000"},
      %{"name" => "十八连山镇", "code" => "530325109000"},
      %{"name" => "老厂镇", "code" => "530325110000"},
      %{"name" => "古敢水族乡", "code" => "530325201000"}
    ]

  def next(input) when input == "罗平县" or input == "530324",
    do: [
      %{"name" => "罗雄街道", "code" => "530324001000"},
      %{"name" => "腊山街道", "code" => "530324002000"},
      %{"name" => "九龙街道", "code" => "530324003000"},
      %{"name" => "板桥镇", "code" => "530324102000"},
      %{"name" => "马街镇", "code" => "530324103000"},
      %{"name" => "富乐镇", "code" => "530324104000"},
      %{"name" => "阿岗镇", "code" => "530324106000"},
      %{"name" => "大水井乡", "code" => "530324201000"},
      %{"name" => "鲁布革布依族苗族乡", "code" => "530324202000"},
      %{"name" => "旧屋基彝族乡", "code" => "530324203000"},
      %{"name" => "钟山乡", "code" => "530324204000"},
      %{"name" => "长底布依族乡", "code" => "530324205000"},
      %{"name" => "老厂乡", "code" => "530324206000"}
    ]

  def next(input) when input == "师宗县" or input == "530323",
    do: [
      %{"name" => "丹凤街道", "code" => "530323001000"},
      %{"name" => "漾月街道", "code" => "530323002000"},
      %{"name" => "大同街道", "code" => "530323003000"},
      %{"name" => "雄壁镇", "code" => "530323102000"},
      %{"name" => "葵山镇", "code" => "530323103000"},
      %{"name" => "彩云镇", "code" => "530323104000"},
      %{"name" => "竹基镇", "code" => "530323105000"},
      %{"name" => "龙庆彝族壮族乡", "code" => "530323202000"},
      %{"name" => "五龙壮族乡", "code" => "530323203000"},
      %{"name" => "高良壮族苗族瑶族乡", "code" => "530323204000"}
    ]

  def next(input) when input == "陆良县" or input == "530322",
    do: [
      %{"name" => "中枢街道", "code" => "530322001000"},
      %{"name" => "同乐街道", "code" => "530322002000"},
      %{"name" => "板桥镇", "code" => "530322102000"},
      %{"name" => "三岔河镇", "code" => "530322103000"},
      %{"name" => "马街镇", "code" => "530322104000"},
      %{"name" => "召夸镇", "code" => "530322105000"},
      %{"name" => "大莫古镇", "code" => "530322106000"},
      %{"name" => "芳华镇", "code" => "530322107000"},
      %{"name" => "小百户镇", "code" => "530322108000"},
      %{"name" => "活水乡", "code" => "530322201000"},
      %{"name" => "龙海乡", "code" => "530322202000"}
    ]

  def next(input) when input == "马龙区" or input == "530304",
    do: [
      %{"name" => "通泉街道", "code" => "530304001000"},
      %{"name" => "鸡头村街道", "code" => "530304002000"},
      %{"name" => "王家庄街道", "code" => "530304003000"},
      %{"name" => "张安屯街道", "code" => "530304004000"},
      %{"name" => "旧县街道", "code" => "530304005000"},
      %{"name" => "马过河镇", "code" => "530304100000"},
      %{"name" => "纳章镇", "code" => "530304101000"},
      %{"name" => "马鸣乡", "code" => "530304200000"},
      %{"name" => "大庄乡", "code" => "530304201000"},
      %{"name" => "月望乡", "code" => "530304202000"}
    ]

  def next(input) when input == "沾益区" or input == "530303",
    do: [
      %{"name" => "西平街道", "code" => "530303001000"},
      %{"name" => "龙华街道", "code" => "530303002000"},
      %{"name" => "金龙街道", "code" => "530303003000"},
      %{"name" => "花山街道", "code" => "530303004000"},
      %{"name" => "白水镇", "code" => "530303101000"},
      %{"name" => "盘江镇", "code" => "530303102000"},
      %{"name" => "炎方乡", "code" => "530303201000"},
      %{"name" => "播乐乡", "code" => "530303202000"},
      %{"name" => "大坡乡", "code" => "530303203000"},
      %{"name" => "菱角乡", "code" => "530303204000"},
      %{"name" => "德泽乡", "code" => "530303205000"}
    ]

  def next(input) when input == "麒麟区" or input == "530302",
    do: [
      %{"name" => "南宁街道", "code" => "530302001000"},
      %{"name" => "建宁街道", "code" => "530302002000"},
      %{"name" => "白石江街道", "code" => "530302003000"},
      %{"name" => "寥廓街道", "code" => "530302004000"},
      %{"name" => "西城街道", "code" => "530302005000"},
      %{"name" => "益宁街道", "code" => "530302006000"},
      %{"name" => "文华街道", "code" => "530302007000"},
      %{"name" => "太和街道", "code" => "530302008000"},
      %{"name" => "潇湘街道", "code" => "530302009000"},
      %{"name" => "翠峰街道", "code" => "530302010000"},
      %{"name" => "三宝街道", "code" => "530302011000"},
      %{"name" => "沿江街道", "code" => "530302012000"},
      %{"name" => "珠街街道", "code" => "530302013000"},
      %{"name" => "越州镇", "code" => "530302102000"},
      %{"name" => "东山镇", "code" => "530302103000"},
      %{"name" => "茨营镇", "code" => "530302104000"}
    ]

  def next(input) when input == "安宁市" or input == "530181",
    do: [
      %{"name" => "连然街道", "code" => "530181001000"},
      %{"name" => "金方街道", "code" => "530181002000"},
      %{"name" => "八街街道", "code" => "530181003000"},
      %{"name" => "温泉街道", "code" => "530181004000"},
      %{"name" => "青龙街道", "code" => "530181005000"},
      %{"name" => "禄脿街道", "code" => "530181006000"},
      %{"name" => "草铺街道", "code" => "530181007000"},
      %{"name" => "太平新城街道", "code" => "530181008000"},
      %{"name" => "县街街道", "code" => "530181009000"}
    ]

  def next(input) when input == "寻甸回族彝族自治县" or input == "530129",
    do: [
      %{"name" => "仁德街道", "code" => "530129001000"},
      %{"name" => "塘子街道", "code" => "530129002000"},
      %{"name" => "金所街道", "code" => "530129003000"},
      %{"name" => "羊街镇", "code" => "530129103000"},
      %{"name" => "柯渡镇", "code" => "530129104000"},
      %{"name" => "倘甸镇", "code" => "530129105000"},
      %{"name" => "功山镇", "code" => "530129106000"},
      %{"name" => "河口镇", "code" => "530129107000"},
      %{"name" => "七星镇", "code" => "530129108000"},
      %{"name" => "先锋镇", "code" => "530129109000"},
      %{"name" => "鸡街镇", "code" => "530129110000"},
      %{"name" => "凤合镇", "code" => "530129111000"},
      %{"name" => "六哨乡", "code" => "530129205000"},
      %{"name" => "联合乡", "code" => "530129208000"},
      %{"name" => "金源乡", "code" => "530129209000"},
      %{"name" => "甸沙乡", "code" => "530129210000"},
      %{"name" => "昆明倘甸产业园区轿子山旅游开发区", "code" => "530129405000"}
    ]

  def next(input) when input == "禄劝彝族苗族自治县" or input == "530128",
    do: [
      %{"name" => "屏山街道", "code" => "530128001000"},
      %{"name" => "崇德街道", "code" => "530128002000"},
      %{"name" => "撒营盘镇", "code" => "530128102000"},
      %{"name" => "转龙镇", "code" => "530128103000"},
      %{"name" => "茂山镇", "code" => "530128104000"},
      %{"name" => "团街镇", "code" => "530128105000"},
      %{"name" => "中屏镇", "code" => "530128106000"},
      %{"name" => "皎平渡镇", "code" => "530128107000"},
      %{"name" => "乌东德镇", "code" => "530128108000"},
      %{"name" => "翠华镇", "code" => "530128109000"},
      %{"name" => "九龙镇", "code" => "530128110000"},
      %{"name" => "云龙乡", "code" => "530128204000"},
      %{"name" => "汤郎乡", "code" => "530128207000"},
      %{"name" => "马鹿塘乡", "code" => "530128208000"},
      %{"name" => "则黑乡", "code" => "530128211000"},
      %{"name" => "乌蒙乡", "code" => "530128212000"},
      %{"name" => "雪山乡", "code" => "530128213000"},
      %{"name" => "禄劝工业园区", "code" => "530128401000"}
    ]

  def next(input) when input == "嵩明县" or input == "530127",
    do: [
      %{"name" => "嵩阳街道", "code" => "530127001000"},
      %{"name" => "杨桥街道", "code" => "530127002000"},
      %{"name" => "小街镇", "code" => "530127102000"},
      %{"name" => "杨林镇", "code" => "530127103000"},
      %{"name" => "牛栏江镇", "code" => "530127104000"},
      %{"name" => "嵩明杨林经济技术开发区", "code" => "530127401000"},
      %{"name" => "云南省嵩明职业教育基地", "code" => "530127402000"},
      %{"name" => "云南省花卉示范园区", "code" => "530127403000"}
    ]

  def next(input) when input == "石林彝族自治县" or input == "530126",
    do: [
      %{"name" => "鹿阜街道", "code" => "530126001000"},
      %{"name" => "石林街道", "code" => "530126002000"},
      %{"name" => "板桥街道", "code" => "530126003000"},
      %{"name" => "西街口镇", "code" => "530126105000"},
      %{"name" => "长湖镇", "code" => "530126106000"},
      %{"name" => "圭山镇", "code" => "530126107000"},
      %{"name" => "大可乡", "code" => "530126201000"}
    ]

  def next(input) when input == "宜良县" or input == "530125",
    do: [
      %{"name" => "匡远街道", "code" => "530125001000"},
      %{"name" => "汤池街道", "code" => "530125002000"},
      %{"name" => "南羊街道", "code" => "530125003000"},
      %{"name" => "北古城镇", "code" => "530125102000"},
      %{"name" => "狗街镇", "code" => "530125103000"},
      %{"name" => "竹山镇", "code" => "530125105000"},
      %{"name" => "马街镇", "code" => "530125106000"},
      %{"name" => "耿家营彝族苗族乡", "code" => "530125201000"},
      %{"name" => "九乡彝族回族乡", "code" => "530125202000"},
      %{"name" => "昆明阳宗海风景名胜区", "code" => "530125404000"}
    ]

  def next(input) when input == "富民县" or input == "530124",
    do: [
      %{"name" => "永定街道", "code" => "530124001000"},
      %{"name" => "大营街道", "code" => "530124002000"},
      %{"name" => "罗免镇", "code" => "530124103000"},
      %{"name" => "赤鹫镇", "code" => "530124104000"},
      %{"name" => "东村镇", "code" => "530124105000"},
      %{"name" => "款庄镇", "code" => "530124106000"},
      %{"name" => "散旦镇", "code" => "530124107000"}
    ]

  def next(input) when input == "晋宁区" or input == "530115",
    do: [
      %{"name" => "昆阳街道", "code" => "530115001000"},
      %{"name" => "宝峰街道", "code" => "530115002000"},
      %{"name" => "晋城街道", "code" => "530115003000"},
      %{"name" => "二街镇", "code" => "530115101000"},
      %{"name" => "上蒜镇", "code" => "530115102000"},
      %{"name" => "六街镇", "code" => "530115103000"},
      %{"name" => "双河彝族乡", "code" => "530115200000"},
      %{"name" => "夕阳彝族乡", "code" => "530115201000"}
    ]

  def next(input) when input == "呈贡区" or input == "530114",
    do: [
      %{"name" => "龙城街道", "code" => "530114001000"},
      %{"name" => "洛龙街道", "code" => "530114002000"},
      %{"name" => "斗南街道", "code" => "530114003000"},
      %{"name" => "乌龙街道", "code" => "530114004000"},
      %{"name" => "吴家营街道", "code" => "530114005000"},
      %{"name" => "雨花街道", "code" => "530114006000"},
      %{"name" => "七甸街道", "code" => "530114007000"},
      %{"name" => "洛羊街道", "code" => "530114008000"},
      %{"name" => "大渔街道", "code" => "530114009000"},
      %{"name" => "马金铺街道", "code" => "530114010000"}
    ]

  def next(input) when input == "东川区" or input == "530113",
    do: [
      %{"name" => "铜都街道", "code" => "530113001000"},
      %{"name" => "碧谷街道", "code" => "530113002000"},
      %{"name" => "汤丹镇", "code" => "530113102000"},
      %{"name" => "因民镇", "code" => "530113103000"},
      %{"name" => "阿旺镇", "code" => "530113104000"},
      %{"name" => "乌龙镇", "code" => "530113105000"},
      %{"name" => "红土地镇", "code" => "530113106000"},
      %{"name" => "拖布卡镇", "code" => "530113107000"},
      %{"name" => "舍块乡", "code" => "530113201000"}
    ]

  def next(input) when input == "西山区" or input == "530112",
    do: [
      %{"name" => "西苑街道", "code" => "530112001000"},
      %{"name" => "马街街道", "code" => "530112002000"},
      %{"name" => "金碧街道", "code" => "530112003000"},
      %{"name" => "永昌街道", "code" => "530112004000"},
      %{"name" => "前卫街道", "code" => "530112005000"},
      %{"name" => "福海街道", "code" => "530112006000"},
      %{"name" => "棕树营街道", "code" => "530112007000"},
      %{"name" => "碧鸡街道", "code" => "530112008000"},
      %{"name" => "海口街道", "code" => "530112009000"},
      %{"name" => "团结街道", "code" => "530112010000"},
      %{"name" => "昆明滇池国家旅游度假区", "code" => "530112403000"}
    ]

  def next(input) when input == "官渡区" or input == "530111",
    do: [
      %{"name" => "关上街道", "code" => "530111001000"},
      %{"name" => "太和街道", "code" => "530111002000"},
      %{"name" => "吴井街道", "code" => "530111003000"},
      %{"name" => "金马街道", "code" => "530111004000"},
      %{"name" => "小板桥街道", "code" => "530111005000"},
      %{"name" => "官渡街道", "code" => "530111006000"},
      %{"name" => "矣六街道", "code" => "530111007000"},
      %{"name" => "六甲街道", "code" => "530111008000"},
      %{"name" => "大板桥街道", "code" => "530111009000"},
      %{"name" => "阿拉街道", "code" => "530111010000"},
      %{"name" => "长水街道", "code" => "530111011000"},
      %{"name" => "小哨街道", "code" => "530111012000"},
      %{"name" => "昆明经济技术开发区", "code" => "530111402000"}
    ]

  def next(input) when input == "盘龙区" or input == "530103",
    do: [
      %{"name" => "拓东街道", "code" => "530103001000"},
      %{"name" => "鼓楼街道", "code" => "530103002000"},
      %{"name" => "东华街道", "code" => "530103003000"},
      %{"name" => "联盟街道", "code" => "530103004000"},
      %{"name" => "金辰街道", "code" => "530103005000"},
      %{"name" => "青云街道", "code" => "530103006000"},
      %{"name" => "龙泉街道", "code" => "530103007000"},
      %{"name" => "茨坝街道", "code" => "530103008000"},
      %{"name" => "双龙街道", "code" => "530103009000"},
      %{"name" => "松华街道", "code" => "530103010000"},
      %{"name" => "滇源街道", "code" => "530103011000"},
      %{"name" => "阿子营街道", "code" => "530103012000"}
    ]

  def next(input) when input == "五华区" or input == "530102",
    do: [
      %{"name" => "华山街道", "code" => "530102001000"},
      %{"name" => "护国街道", "code" => "530102002000"},
      %{"name" => "大观街道", "code" => "530102003000"},
      %{"name" => "龙翔街道", "code" => "530102004000"},
      %{"name" => "丰宁街道", "code" => "530102005000"},
      %{"name" => "莲华街道", "code" => "530102006000"},
      %{"name" => "红云街道", "code" => "530102007000"},
      %{"name" => "黑林铺街道", "code" => "530102008000"},
      %{"name" => "普吉街道", "code" => "530102009000"},
      %{"name" => "西翥街道", "code" => "530102010000"},
      %{"name" => "昆明国家高新技术产业开发区", "code" => "530102401000"}
    ]

  def next(_), do: nil
end