defmodule ChinaAdminDivisions.Gen.Lv3x.M54 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "措勤县" or input == "542527",
    do: [
      %{"name" => "措勤镇", "code" => "542527100000"},
      %{"name" => "磁石乡", "code" => "542527200000"},
      %{"name" => "曲洛乡", "code" => "542527201000"},
      %{"name" => "江让乡", "code" => "542527202000"},
      %{"name" => "达雄乡", "code" => "542527203000"}
    ]

  def next(input) when input == "改则县" or input == "542526",
    do: [
      %{"name" => "改则镇", "code" => "542526100000"},
      %{"name" => "物玛乡", "code" => "542526200000"},
      %{"name" => "先遣乡", "code" => "542526201000"},
      %{"name" => "麻米乡", "code" => "542526202000"},
      %{"name" => "洞措乡", "code" => "542526203000"},
      %{"name" => "古姆乡", "code" => "542526204000"},
      %{"name" => "察布乡", "code" => "542526205000"}
    ]

  def next(input) when input == "革吉县" or input == "542525",
    do: [
      %{"name" => "革吉镇", "code" => "542525100000"},
      %{"name" => "雄巴乡", "code" => "542525200000"},
      %{"name" => "亚热乡", "code" => "542525201000"},
      %{"name" => "盐湖乡", "code" => "542525202000"},
      %{"name" => "文布当桑乡", "code" => "542525203000"}
    ]

  def next(input) when input == "日土县" or input == "542524",
    do: [
      %{"name" => "日土镇", "code" => "542524100000"},
      %{"name" => "热帮乡", "code" => "542524200000"},
      %{"name" => "日松乡", "code" => "542524201000"},
      %{"name" => "东汝乡", "code" => "542524202000"},
      %{"name" => "多玛乡", "code" => "542524203000"}
    ]

  def next(input) when input == "噶尔县" or input == "542523",
    do: [
      %{"name" => "狮泉河镇", "code" => "542523100000"},
      %{"name" => "昆莎乡", "code" => "542523200000"},
      %{"name" => "左左乡", "code" => "542523201000"},
      %{"name" => "门士乡", "code" => "542523202000"},
      %{"name" => "扎西岗乡", "code" => "542523203000"}
    ]

  def next(input) when input == "札达县" or input == "542522",
    do: [
      %{"name" => "托林镇", "code" => "542522100000"},
      %{"name" => "萨让乡", "code" => "542522200000"},
      %{"name" => "达巴乡", "code" => "542522201000"},
      %{"name" => "底雅乡", "code" => "542522202000"},
      %{"name" => "香孜乡", "code" => "542522203000"},
      %{"name" => "曲松乡", "code" => "542522204000"},
      %{"name" => "楚鲁松杰乡", "code" => "542522205000"}
    ]

  def next(input) when input == "普兰县" or input == "542521",
    do: [
      %{"name" => "普兰镇", "code" => "542521100000"},
      %{"name" => "巴嘎乡", "code" => "542521200000"},
      %{"name" => "霍尔乡", "code" => "542521201000"}
    ]

  def next(input) when input == "双湖县" or input == "540630",
    do: [
      %{"name" => "措折罗玛镇", "code" => "540630101000"},
      %{"name" => "协德乡", "code" => "540630200000"},
      %{"name" => "雅曲乡", "code" => "540630201000"},
      %{"name" => "嘎措乡", "code" => "540630202000"},
      %{"name" => "措折强玛乡", "code" => "540630203000"},
      %{"name" => "多玛乡", "code" => "540630204000"},
      %{"name" => "巴岭乡", "code" => "540630205000"}
    ]

  def next(input) when input == "尼玛县" or input == "540629",
    do: [
      %{"name" => "尼玛镇", "code" => "540629100000"},
      %{"name" => "卓尼乡", "code" => "540629201000"},
      %{"name" => "达果乡", "code" => "540629202000"},
      %{"name" => "阿索乡", "code" => "540629203000"},
      %{"name" => "荣玛乡", "code" => "540629204000"},
      %{"name" => "中仓乡", "code" => "540629205000"},
      %{"name" => "来多乡", "code" => "540629206000"},
      %{"name" => "申亚乡", "code" => "540629207000"},
      %{"name" => "卓瓦乡", "code" => "540629208000"},
      %{"name" => "俄久乡", "code" => "540629209000"},
      %{"name" => "文部乡", "code" => "540629210000"},
      %{"name" => "甲谷乡", "code" => "540629211000"},
      %{"name" => "军仓乡", "code" => "540629212000"},
      %{"name" => "吉瓦乡", "code" => "540629219000"}
    ]

  def next(input) when input == "巴青县" or input == "540628",
    do: [
      %{"name" => "拉西镇", "code" => "540628100000"},
      %{"name" => "杂色镇", "code" => "540628101000"},
      %{"name" => "雅安镇", "code" => "540628102000"},
      %{"name" => "江绵乡", "code" => "540628201000"},
      %{"name" => "玛如乡", "code" => "540628202000"},
      %{"name" => "阿秀乡", "code" => "540628204000"},
      %{"name" => "贡日乡", "code" => "540628205000"},
      %{"name" => "岗切乡", "code" => "540628206000"},
      %{"name" => "巴青乡", "code" => "540628210000"},
      %{"name" => "本塔乡", "code" => "540628211000"}
    ]

  def next(input) when input == "班戈县" or input == "540627",
    do: [
      %{"name" => "普保镇", "code" => "540627100000"},
      %{"name" => "北拉镇", "code" => "540627101000"},
      %{"name" => "德庆镇", "code" => "540627102000"},
      %{"name" => "佳琼镇", "code" => "540627103000"},
      %{"name" => "尼玛乡", "code" => "540627205000"},
      %{"name" => "保吉乡", "code" => "540627207000"},
      %{"name" => "青龙乡", "code" => "540627209000"},
      %{"name" => "马前乡", "code" => "540627211000"},
      %{"name" => "门当乡", "code" => "540627215000"},
      %{"name" => "新吉乡", "code" => "540627216000"}
    ]

  def next(input) when input == "索县" or input == "540626",
    do: [
      %{"name" => "亚拉镇", "code" => "540626100000"},
      %{"name" => "荣布镇", "code" => "540626101000"},
      %{"name" => "若达乡", "code" => "540626201000"},
      %{"name" => "加勤乡", "code" => "540626202000"},
      %{"name" => "赤多乡", "code" => "540626203000"},
      %{"name" => "西昌乡", "code" => "540626205000"},
      %{"name" => "江达乡", "code" => "540626206000"},
      %{"name" => "热瓦乡", "code" => "540626208000"},
      %{"name" => "嘎美乡", "code" => "540626209000"},
      %{"name" => "嘎木乡", "code" => "540626210000"}
    ]

  def next(input) when input == "申扎县" or input == "540625",
    do: [
      %{"name" => "申扎镇", "code" => "540625100000"},
      %{"name" => "雄梅镇", "code" => "540625101000"},
      %{"name" => "下过乡", "code" => "540625201000"},
      %{"name" => "卡乡", "code" => "540625202000"},
      %{"name" => "巴扎乡", "code" => "540625203000"},
      %{"name" => "塔尔玛乡", "code" => "540625204000"},
      %{"name" => "买巴乡", "code" => "540625206000"},
      %{"name" => "马跃乡", "code" => "540625207000"}
    ]

  def next(input) when input == "安多县" or input == "540624",
    do: [
      %{"name" => "帕那镇", "code" => "540624100000"},
      %{"name" => "强玛镇", "code" => "540624101000"},
      %{"name" => "扎仁镇", "code" => "540624102000"},
      %{"name" => "雁石坪镇", "code" => "540624103000"},
      %{"name" => "多玛乡", "code" => "540624201000"},
      %{"name" => "玛曲乡", "code" => "540624202000"},
      %{"name" => "滩堆乡", "code" => "540624205000"},
      %{"name" => "帮爱乡", "code" => "540624207000"},
      %{"name" => "玛荣乡", "code" => "540624209000"},
      %{"name" => "扎曲乡", "code" => "540624210000"},
      %{"name" => "色务乡", "code" => "540624211000"},
      %{"name" => "措玛乡", "code" => "540624212000"},
      %{"name" => "岗尼乡", "code" => "540624213000"}
    ]

  def next(input) when input == "聂荣县" or input == "540623",
    do: [
      %{"name" => "聂荣镇", "code" => "540623100000"},
      %{"name" => "尼玛乡", "code" => "540623201000"},
      %{"name" => "色庆乡", "code" => "540623203000"},
      %{"name" => "桑荣乡", "code" => "540623205000"},
      %{"name" => "下曲乡", "code" => "540623206000"},
      %{"name" => "白雄乡", "code" => "540623207000"},
      %{"name" => "索雄乡", "code" => "540623208000"},
      %{"name" => "当木江乡", "code" => "540623210000"},
      %{"name" => "查当乡", "code" => "540623211000"},
      %{"name" => "永曲乡", "code" => "540623212000"}
    ]

  def next(input) when input == "比如县" or input == "540622",
    do: [
      %{"name" => "比如镇", "code" => "540622100000"},
      %{"name" => "夏曲镇", "code" => "540622101000"},
      %{"name" => "白嘎乡", "code" => "540622201000"},
      %{"name" => "达塘乡", "code" => "540622202000"},
      %{"name" => "恰则乡", "code" => "540622203000"},
      %{"name" => "扎拉乡", "code" => "540622204000"},
      %{"name" => "羊秀乡", "code" => "540622207000"},
      %{"name" => "香曲乡", "code" => "540622208000"},
      %{"name" => "良曲乡", "code" => "540622209000"},
      %{"name" => "茶曲乡", "code" => "540622210000"}
    ]

  def next(input) when input == "嘉黎县" or input == "540621",
    do: [
      %{"name" => "阿扎镇", "code" => "540621100000"},
      %{"name" => "嘉黎镇", "code" => "540621101000"},
      %{"name" => "尼屋乡", "code" => "540621201000"},
      %{"name" => "藏比乡", "code" => "540621202000"},
      %{"name" => "措多乡", "code" => "540621203000"},
      %{"name" => "夏玛乡", "code" => "540621204000"},
      %{"name" => "林堤乡", "code" => "540621206000"},
      %{"name" => "麦地卡乡", "code" => "540621207000"},
      %{"name" => "绒多乡", "code" => "540621209000"},
      %{"name" => "鸽群乡", "code" => "540621210000"}
    ]

  def next(input) when input == "色尼区" or input == "540602",
    do: [
      %{"name" => "那曲镇", "code" => "540602100000"},
      %{"name" => "罗玛镇", "code" => "540602101000"},
      %{"name" => "古露镇", "code" => "540602102000"},
      %{"name" => "达萨乡", "code" => "540602200000"},
      %{"name" => "油恰乡", "code" => "540602202000"},
      %{"name" => "香茂乡", "code" => "540602203000"},
      %{"name" => "那玛切乡", "code" => "540602205000"},
      %{"name" => "达前乡", "code" => "540602209000"},
      %{"name" => "洛麦乡", "code" => "540602210000"},
      %{"name" => "孔玛乡", "code" => "540602211000"},
      %{"name" => "尼玛乡", "code" => "540602213000"},
      %{"name" => "色雄乡", "code" => "540602217000"}
    ]

  def next(input) when input == "错那市" or input == "540581",
    do: [
      %{"name" => "错那镇", "code" => "540581100000"},
      %{"name" => "卡达乡", "code" => "540581200000"},
      %{"name" => "觉拉乡", "code" => "540581201000"},
      %{"name" => "浪坡乡", "code" => "540581202000"},
      %{"name" => "曲卓木乡", "code" => "540581203000"},
      %{"name" => "库局乡", "code" => "540581204000"},
      %{"name" => "麻麻门巴民族乡", "code" => "540581205000"},
      %{"name" => "贡日门巴民族乡", "code" => "540581206000"},
      %{"name" => "吉巴门巴民族乡", "code" => "540581207000"},
      %{"name" => "勒门巴民族乡", "code" => "540581208000"}
    ]

  def next(input) when input == "浪卡子县" or input == "540531",
    do: [
      %{"name" => "浪卡子镇", "code" => "540531100000"},
      %{"name" => "打隆镇", "code" => "540531101000"},
      %{"name" => "张达乡", "code" => "540531200000"},
      %{"name" => "伦布雪乡", "code" => "540531201000"},
      %{"name" => "多却乡", "code" => "540531202000"},
      %{"name" => "普玛江塘乡", "code" => "540531203000"},
      %{"name" => "阿扎乡", "code" => "540531204000"},
      %{"name" => "卡龙乡", "code" => "540531205000"},
      %{"name" => "白地乡", "code" => "540531206000"},
      %{"name" => "卡热乡", "code" => "540531207000"}
    ]

  def next(input) when input == "隆子县" or input == "540529",
    do: [
      %{"name" => "隆子镇", "code" => "540529100000"},
      %{"name" => "日当镇", "code" => "540529101000"},
      %{"name" => "列麦乡", "code" => "540529200000"},
      %{"name" => "热荣乡", "code" => "540529201000"},
      %{"name" => "三安曲林乡", "code" => "540529202000"},
      %{"name" => "准巴乡", "code" => "540529203000"},
      %{"name" => "雪萨乡", "code" => "540529204000"},
      %{"name" => "扎日乡", "code" => "540529205000"},
      %{"name" => "玉麦乡", "code" => "540529206000"},
      %{"name" => "加玉乡", "code" => "540529207000"},
      %{"name" => "斗玉珞巴民族乡", "code" => "540529208000"}
    ]

  def next(input) when input == "加查县" or input == "540528",
    do: [
      %{"name" => "加查镇", "code" => "540528100000"},
      %{"name" => "安绕镇", "code" => "540528101000"},
      %{"name" => "拉绥乡", "code" => "540528200000"},
      %{"name" => "崔久乡", "code" => "540528201000"},
      %{"name" => "坝乡", "code" => "540528202000"},
      %{"name" => "冷达乡", "code" => "540528203000"},
      %{"name" => "洛林乡", "code" => "540528204000"}
    ]

  def next(input) when input == "洛扎县" or input == "540527",
    do: [
      %{"name" => "洛扎镇", "code" => "540527100000"},
      %{"name" => "拉康镇", "code" => "540527101000"},
      %{"name" => "扎日乡", "code" => "540527201000"},
      %{"name" => "色乡", "code" => "540527202000"},
      %{"name" => "生格乡", "code" => "540527203000"},
      %{"name" => "边巴乡", "code" => "540527204000"},
      %{"name" => "拉郊乡", "code" => "540527205000"}
    ]

  def next(input) when input == "措美县" or input == "540526",
    do: [
      %{"name" => "措美镇", "code" => "540526100000"},
      %{"name" => "哲古镇", "code" => "540526101000"},
      %{"name" => "乃西乡", "code" => "540526200000"},
      %{"name" => "古堆乡", "code" => "540526201000"}
    ]

  def next(input) when input == "曲松县" or input == "540525",
    do: [
      %{"name" => "曲松镇", "code" => "540525100000"},
      %{"name" => "罗布沙镇", "code" => "540525101000"},
      %{"name" => "下江乡", "code" => "540525200000"},
      %{"name" => "邱多江乡", "code" => "540525201000"},
      %{"name" => "堆随乡", "code" => "540525202000"}
    ]

  def next(input) when input == "琼结县" or input == "540524",
    do: [
      %{"name" => "琼结镇", "code" => "540524100000"},
      %{"name" => "加麻乡", "code" => "540524200000"},
      %{"name" => "下水乡", "code" => "540524201000"},
      %{"name" => "拉玉乡", "code" => "540524202000"}
    ]

  def next(input) when input == "桑日县" or input == "540523",
    do: [
      %{"name" => "桑日镇", "code" => "540523100000"},
      %{"name" => "增期乡", "code" => "540523200000"},
      %{"name" => "白堆乡", "code" => "540523201000"},
      %{"name" => "绒乡", "code" => "540523202000"}
    ]

  def next(input) when input == "贡嘎县" or input == "540522",
    do: [
      %{"name" => "吉雄镇", "code" => "540522100000"},
      %{"name" => "甲竹林镇", "code" => "540522101000"},
      %{"name" => "杰德秀镇", "code" => "540522102000"},
      %{"name" => "岗堆镇", "code" => "540522103000"},
      %{"name" => "江塘镇", "code" => "540522104000"},
      %{"name" => "朗杰学乡", "code" => "540522200000"},
      %{"name" => "昌果乡", "code" => "540522201000"},
      %{"name" => "东拉乡", "code" => "540522205000"},
      %{"name" => "克西乡", "code" => "540522206000"}
    ]

  def next(input) when input == "扎囊县" or input == "540521",
    do: [
      %{"name" => "扎塘镇", "code" => "540521100000"},
      %{"name" => "桑耶镇", "code" => "540521101000"},
      %{"name" => "扎其乡", "code" => "540521200000"},
      %{"name" => "阿扎乡", "code" => "540521201000"},
      %{"name" => "吉汝乡", "code" => "540521202000"}
    ]

  def next(input) when input == "乃东区" or input == "540502",
    do: [
      %{"name" => "泽当街道", "code" => "540502001000"},
      %{"name" => "乃东街道", "code" => "540502002000"},
      %{"name" => "结莎街道", "code" => "540502003000"},
      %{"name" => "昌珠镇", "code" => "540502101000"},
      %{"name" => "亚堆乡", "code" => "540502200000"},
      %{"name" => "索珠乡", "code" => "540502201000"},
      %{"name" => "多颇章乡", "code" => "540502202000"},
      %{"name" => "结巴乡", "code" => "540502203000"},
      %{"name" => "颇章乡", "code" => "540502204000"}
    ]

  def next(input) when input == "米林市" or input == "540481",
    do: [
      %{"name" => "米林镇", "code" => "540481100000"},
      %{"name" => "派镇", "code" => "540481101000"},
      %{"name" => "卧龙镇", "code" => "540481102000"},
      %{"name" => "丹娘乡", "code" => "540481200000"},
      %{"name" => "南伊珞巴民族乡", "code" => "540481201000"},
      %{"name" => "扎西绕登乡", "code" => "540481202000"},
      %{"name" => "里龙乡", "code" => "540481203000"},
      %{"name" => "羌纳乡", "code" => "540481204000"}
    ]

  def next(input) when input == "朗县" or input == "540426",
    do: [
      %{"name" => "朗镇", "code" => "540426100000"},
      %{"name" => "仲达镇", "code" => "540426101000"},
      %{"name" => "洞嘎镇", "code" => "540426102000"},
      %{"name" => "拉多乡", "code" => "540426200000"},
      %{"name" => "金东乡", "code" => "540426201000"},
      %{"name" => "登木乡", "code" => "540426202000"}
    ]

  def next(input) when input == "察隅县" or input == "540425",
    do: [
      %{"name" => "竹瓦根镇", "code" => "540425100000"},
      %{"name" => "上察隅镇", "code" => "540425101000"},
      %{"name" => "下察隅镇", "code" => "540425102000"},
      %{"name" => "察瓦龙乡", "code" => "540425200000"},
      %{"name" => "古拉乡", "code" => "540425201000"},
      %{"name" => "古玉乡", "code" => "540425202000"}
    ]

  def next(input) when input == "波密县" or input == "540424",
    do: [
      %{"name" => "扎木镇", "code" => "540424100000"},
      %{"name" => "倾多镇", "code" => "540424101000"},
      %{"name" => "松宗镇", "code" => "540424102000"},
      %{"name" => "易贡乡", "code" => "540424200000"},
      %{"name" => "玉普乡", "code" => "540424201000"},
      %{"name" => "康玉乡", "code" => "540424202000"},
      %{"name" => "多吉乡", "code" => "540424203000"},
      %{"name" => "玉许乡", "code" => "540424204000"},
      %{"name" => "八盖乡", "code" => "540424205000"},
      %{"name" => "古乡", "code" => "540424207000"}
    ]

  def next(input) when input == "墨脱县" or input == "540423",
    do: [
      %{"name" => "墨脱镇", "code" => "540423100000"},
      %{"name" => "加热萨乡", "code" => "540423200000"},
      %{"name" => "甘登乡", "code" => "540423201000"},
      %{"name" => "达木珞巴民族乡", "code" => "540423202000"},
      %{"name" => "帮辛乡", "code" => "540423203000"},
      %{"name" => "格当乡", "code" => "540423204000"},
      %{"name" => "德兴乡", "code" => "540423205000"},
      %{"name" => "背崩乡", "code" => "540423206000"}
    ]

  def next(input) when input == "工布江达县" or input == "540421",
    do: [
      %{"name" => "工布江达镇", "code" => "540421100000"},
      %{"name" => "金达镇", "code" => "540421101000"},
      %{"name" => "巴河镇", "code" => "540421102000"},
      %{"name" => "朱拉乡", "code" => "540421200000"},
      %{"name" => "错高乡", "code" => "540421201000"},
      %{"name" => "仲萨乡", "code" => "540421202000"},
      %{"name" => "江达乡", "code" => "540421203000"},
      %{"name" => "娘蒲乡", "code" => "540421204000"},
      %{"name" => "加兴乡", "code" => "540421205000"}
    ]

  def next(input) when input == "巴宜区" or input == "540402",
    do: [
      %{"name" => "白玛岗街道", "code" => "540402001000"},
      %{"name" => "觉木街道", "code" => "540402002000"},
      %{"name" => "林芝镇", "code" => "540402100000"},
      %{"name" => "百巴镇", "code" => "540402101000"},
      %{"name" => "八一镇", "code" => "540402102000"},
      %{"name" => "鲁朗镇", "code" => "540402103000"},
      %{"name" => "更章门巴民族乡", "code" => "540402200000"},
      %{"name" => "布久乡", "code" => "540402202000"},
      %{"name" => "米瑞乡", "code" => "540402203000"}
    ]

  def next(input) when input == "边坝县" or input == "540330",
    do: [
      %{"name" => "边坝镇", "code" => "540330100000"},
      %{"name" => "草卡镇", "code" => "540330101000"},
      %{"name" => "沙丁乡", "code" => "540330201000"},
      %{"name" => "金岭乡", "code" => "540330202000"},
      %{"name" => "加贡乡", "code" => "540330203000"},
      %{"name" => "马武乡", "code" => "540330204000"},
      %{"name" => "热玉乡", "code" => "540330205000"},
      %{"name" => "尼木乡", "code" => "540330206000"},
      %{"name" => "马秀乡", "code" => "540330207000"},
      %{"name" => "拉孜乡", "code" => "540330208000"},
      %{"name" => "都瓦乡", "code" => "540330209000"}
    ]

  def next(input) when input == "洛隆县" or input == "540329",
    do: [
      %{"name" => "孜托镇", "code" => "540329100000"},
      %{"name" => "硕督镇", "code" => "540329101000"},
      %{"name" => "康沙镇", "code" => "540329111000"},
      %{"name" => "马利镇", "code" => "540329112000"},
      %{"name" => "达龙乡", "code" => "540329200000"},
      %{"name" => "新荣乡", "code" => "540329201000"},
      %{"name" => "白达乡", "code" => "540329202000"},
      %{"name" => "玉西乡", "code" => "540329203000"},
      %{"name" => "腊久乡", "code" => "540329204000"},
      %{"name" => "俄西乡", "code" => "540329205000"},
      %{"name" => "中亦乡", "code" => "540329206000"}
    ]

  def next(input) when input == "芒康县" or input == "540328",
    do: [
      %{"name" => "嘎托镇", "code" => "540328100000"},
      %{"name" => "如美镇", "code" => "540328101000"},
      %{"name" => "索多西乡", "code" => "540328200000"},
      %{"name" => "莽岭乡", "code" => "540328201000"},
      %{"name" => "宗西乡", "code" => "540328202000"},
      %{"name" => "昂多乡", "code" => "540328203000"},
      %{"name" => "措瓦乡", "code" => "540328204000"},
      %{"name" => "洛尼乡", "code" => "540328205000"},
      %{"name" => "戈波乡", "code" => "540328206000"},
      %{"name" => "帮达乡", "code" => "540328207000"},
      %{"name" => "徐中乡", "code" => "540328208000"},
      %{"name" => "曲登乡", "code" => "540328209000"},
      %{"name" => "木许乡", "code" => "540328210000"},
      %{"name" => "纳西民族乡", "code" => "540328211000"},
      %{"name" => "朱巴龙乡", "code" => "540328212000"},
      %{"name" => "曲孜卡乡", "code" => "540328213000"}
    ]

  def next(input) when input == "左贡县" or input == "540327",
    do: [
      %{"name" => "旺达镇", "code" => "540327100000"},
      %{"name" => "田妥镇", "code" => "540327101000"},
      %{"name" => "扎玉镇", "code" => "540327102000"},
      %{"name" => "东坝乡", "code" => "540327203000"},
      %{"name" => "仁果乡", "code" => "540327204000"},
      %{"name" => "绕金乡", "code" => "540327207000"},
      %{"name" => "碧土乡", "code" => "540327208000"},
      %{"name" => "美玉乡", "code" => "540327210000"},
      %{"name" => "中林卡乡", "code" => "540327211000"},
      %{"name" => "下林卡乡", "code" => "540327212000"}
    ]

  def next(input) when input == "八宿县" or input == "540326",
    do: [
      %{"name" => "白玛镇", "code" => "540326100000"},
      %{"name" => "帮达镇", "code" => "540326101000"},
      %{"name" => "然乌镇", "code" => "540326102000"},
      %{"name" => "同卡镇", "code" => "540326103000"},
      %{"name" => "郭庆乡", "code" => "540326202000"},
      %{"name" => "拉根乡", "code" => "540326203000"},
      %{"name" => "益庆乡", "code" => "540326204000"},
      %{"name" => "吉中乡", "code" => "540326205000"},
      %{"name" => "卡瓦白庆乡", "code" => "540326206000"},
      %{"name" => "吉达乡", "code" => "540326207000"},
      %{"name" => "夏里乡", "code" => "540326208000"},
      %{"name" => "拥巴乡", "code" => "540326209000"},
      %{"name" => "瓦乡", "code" => "540326210000"},
      %{"name" => "林卡乡", "code" => "540326211000"}
    ]

  def next(input) when input == "察雅县" or input == "540325",
    do: [
      %{"name" => "烟多镇", "code" => "540325100000"},
      %{"name" => "香堆镇", "code" => "540325101000"},
      %{"name" => "吉塘镇", "code" => "540325102000"},
      %{"name" => "宗沙乡", "code" => "540325200000"},
      %{"name" => "卡贡乡", "code" => "540325201000"},
      %{"name" => "荣周乡", "code" => "540325202000"},
      %{"name" => "巴日乡", "code" => "540325203000"},
      %{"name" => "阿孜乡", "code" => "540325204000"},
      %{"name" => "王卡乡", "code" => "540325205000"},
      %{"name" => "新卡乡", "code" => "540325206000"},
      %{"name" => "肯通乡", "code" => "540325207000"},
      %{"name" => "扩达乡", "code" => "540325208000"},
      %{"name" => "察拉乡", "code" => "540325209000"}
    ]

  def next(input) when input == "丁青县" or input == "540324",
    do: [
      %{"name" => "丁青镇", "code" => "540324100000"},
      %{"name" => "尺犊镇", "code" => "540324101000"},
      %{"name" => "觉恩乡", "code" => "540324200000"},
      %{"name" => "沙贡乡", "code" => "540324201000"},
      %{"name" => "当堆乡", "code" => "540324202000"},
      %{"name" => "桑多乡", "code" => "540324203000"},
      %{"name" => "木塔乡", "code" => "540324204000"},
      %{"name" => "布塔乡", "code" => "540324205000"},
      %{"name" => "巴达乡", "code" => "540324206000"},
      %{"name" => "甘岩乡", "code" => "540324207000"},
      %{"name" => "嘎塔乡", "code" => "540324208000"},
      %{"name" => "色扎乡", "code" => "540324209000"},
      %{"name" => "协雄乡", "code" => "540324210000"}
    ]

  def next(input) when input == "类乌齐县" or input == "540323",
    do: [
      %{"name" => "类乌齐镇", "code" => "540323100000"},
      %{"name" => "桑多镇", "code" => "540323101000"},
      %{"name" => "加桑卡乡", "code" => "540323200000"},
      %{"name" => "长毛岭乡", "code" => "540323201000"},
      %{"name" => "岗色乡", "code" => "540323202000"},
      %{"name" => "吉多乡", "code" => "540323203000"},
      %{"name" => "滨达乡", "code" => "540323204000"},
      %{"name" => "卡玛多乡", "code" => "540323205000"},
      %{"name" => "尚卡乡", "code" => "540323206000"},
      %{"name" => "伊日乡", "code" => "540323207000"}
    ]

  def next(input) when input == "贡觉县" or input == "540322",
    do: [
      %{"name" => "莫洛镇", "code" => "540322100000"},
      %{"name" => "相皮乡", "code" => "540322200000"},
      %{"name" => "哈加乡", "code" => "540322201000"},
      %{"name" => "雄松乡", "code" => "540322202000"},
      %{"name" => "拉妥乡", "code" => "540322203000"},
      %{"name" => "阿旺乡", "code" => "540322204000"},
      %{"name" => "木协乡", "code" => "540322205000"},
      %{"name" => "罗麦乡", "code" => "540322206000"},
      %{"name" => "沙东乡", "code" => "540322207000"},
      %{"name" => "克日乡", "code" => "540322208000"},
      %{"name" => "则巴乡", "code" => "540322209000"},
      %{"name" => "敏都乡", "code" => "540322210000"}
    ]

  def next(input) when input == "江达县" or input == "540321",
    do: [
      %{"name" => "江达镇", "code" => "540321100000"},
      %{"name" => "岗托镇", "code" => "540321101000"},
      %{"name" => "卡贡乡", "code" => "540321200000"},
      %{"name" => "岩比乡", "code" => "540321201000"},
      %{"name" => "邓柯乡", "code" => "540321202000"},
      %{"name" => "生达乡", "code" => "540321203000"},
      %{"name" => "娘西乡", "code" => "540321204000"},
      %{"name" => "字呷乡", "code" => "540321205000"},
      %{"name" => "青泥洞乡", "code" => "540321206000"},
      %{"name" => "汪布顶乡", "code" => "540321207000"},
      %{"name" => "德登乡", "code" => "540321208000"},
      %{"name" => "同普乡", "code" => "540321209000"},
      %{"name" => "波罗乡", "code" => "540321210000"}
    ]

  def next(input) when input == "卡若区" or input == "540302",
    do: [
      %{"name" => "城关镇", "code" => "540302100000"},
      %{"name" => "俄洛镇", "code" => "540302101000"},
      %{"name" => "卡若镇", "code" => "540302102000"},
      %{"name" => "芒达乡", "code" => "540302200000"},
      %{"name" => "约巴乡", "code" => "540302201000"},
      %{"name" => "妥坝乡", "code" => "540302202000"},
      %{"name" => "拉多乡", "code" => "540302203000"},
      %{"name" => "面达乡", "code" => "540302204000"},
      %{"name" => "嘎玛乡", "code" => "540302205000"},
      %{"name" => "柴维乡", "code" => "540302206000"},
      %{"name" => "日通乡", "code" => "540302207000"},
      %{"name" => "如意乡", "code" => "540302208000"},
      %{"name" => "埃西乡", "code" => "540302209000"},
      %{"name" => "若巴乡", "code" => "540302210000"},
      %{"name" => "沙贡乡", "code" => "540302211000"}
    ]

  def next(input) when input == "岗巴县" or input == "540237",
    do: [
      %{"name" => "岗巴镇", "code" => "540237100000"},
      %{"name" => "昌龙乡", "code" => "540237200000"},
      %{"name" => "直克乡", "code" => "540237201000"},
      %{"name" => "孔玛乡", "code" => "540237202000"},
      %{"name" => "龙中乡", "code" => "540237203000"}
    ]

  def next(input) when input == "萨嘎县" or input == "540236",
    do: [
      %{"name" => "加加镇", "code" => "540236100000"},
      %{"name" => "昌果乡", "code" => "540236200000"},
      %{"name" => "雄如乡", "code" => "540236201000"},
      %{"name" => "拉藏乡", "code" => "540236202000"},
      %{"name" => "如角乡", "code" => "540236203000"},
      %{"name" => "达吉岭乡", "code" => "540236204000"},
      %{"name" => "旦嘎乡", "code" => "540236205000"},
      %{"name" => "夏如乡", "code" => "540236206000"}
    ]

  def next(input) when input == "聂拉木县" or input == "540235",
    do: [
      %{"name" => "聂拉木镇", "code" => "540235100000"},
      %{"name" => "樟木镇", "code" => "540235101000"},
      %{"name" => "亚来乡", "code" => "540235200000"},
      %{"name" => "锁作乡", "code" => "540235201000"},
      %{"name" => "乃龙乡", "code" => "540235202000"},
      %{"name" => "门布乡", "code" => "540235203000"},
      %{"name" => "波绒乡", "code" => "540235204000"}
    ]

  def next(input) when input == "吉隆县" or input == "540234",
    do: [
      %{"name" => "宗嘎镇", "code" => "540234100000"},
      %{"name" => "吉隆镇", "code" => "540234101000"},
      %{"name" => "差那乡", "code" => "540234200000"},
      %{"name" => "折巴乡", "code" => "540234201000"},
      %{"name" => "贡当乡", "code" => "540234202000"},
      %{"name" => "萨勒乡", "code" => "540234203000"}
    ]

  def next(input) when input == "亚东县" or input == "540233",
    do: [
      %{"name" => "下司马镇", "code" => "540233100000"},
      %{"name" => "帕里镇", "code" => "540233101000"},
      %{"name" => "下亚东乡", "code" => "540233200000"},
      %{"name" => "上亚东乡", "code" => "540233201000"},
      %{"name" => "康布乡", "code" => "540233202000"},
      %{"name" => "堆纳乡", "code" => "540233203000"},
      %{"name" => "吉汝乡", "code" => "540233204000"}
    ]

  def next(input) when input == "仲巴县" or input == "540232",
    do: [
      %{"name" => "帕羊镇", "code" => "540232100000"},
      %{"name" => "拉让乡", "code" => "540232200000"},
      %{"name" => "琼果乡", "code" => "540232201000"},
      %{"name" => "亚热乡", "code" => "540232202000"},
      %{"name" => "布多乡", "code" => "540232203000"},
      %{"name" => "偏吉乡", "code" => "540232204000"},
      %{"name" => "纳久乡", "code" => "540232205000"},
      %{"name" => "吉拉乡", "code" => "540232206000"},
      %{"name" => "霍尔巴乡", "code" => "540232207000"},
      %{"name" => "隆格尔乡", "code" => "540232208000"},
      %{"name" => "吉玛乡", "code" => "540232209000"},
      %{"name" => "仁多乡", "code" => "540232210000"},
      %{"name" => "帕江乡", "code" => "540232211000"}
    ]

  def next(input) when input == "定结县" or input == "540231",
    do: [
      %{"name" => "江嘎镇", "code" => "540231100000"},
      %{"name" => "陈塘镇", "code" => "540231101000"},
      %{"name" => "日屋镇", "code" => "540231102000"},
      %{"name" => "确布乡", "code" => "540231201000"},
      %{"name" => "定结乡", "code" => "540231202000"},
      %{"name" => "多布扎乡", "code" => "540231203000"},
      %{"name" => "扎西岗乡", "code" => "540231204000"},
      %{"name" => "琼孜乡", "code" => "540231205000"},
      %{"name" => "萨尔乡", "code" => "540231206000"},
      %{"name" => "郭加乡", "code" => "540231207000"}
    ]

  def next(input) when input == "康马县" or input == "540230",
    do: [
      %{"name" => "康马镇", "code" => "540230100000"},
      %{"name" => "南尼乡", "code" => "540230200000"},
      %{"name" => "少岗乡", "code" => "540230201000"},
      %{"name" => "康如乡", "code" => "540230202000"},
      %{"name" => "萨玛达乡", "code" => "540230203000"},
      %{"name" => "嘎拉乡", "code" => "540230204000"},
      %{"name" => "涅如堆乡", "code" => "540230205000"},
      %{"name" => "涅如麦乡", "code" => "540230206000"},
      %{"name" => "雄章乡", "code" => "540230207000"}
    ]

  def next(input) when input == "仁布县" or input == "540229",
    do: [
      %{"name" => "德吉林镇", "code" => "540229100000"},
      %{"name" => "康雄乡", "code" => "540229200000"},
      %{"name" => "普松乡", "code" => "540229201000"},
      %{"name" => "帕当乡", "code" => "540229202000"},
      %{"name" => "然巴乡", "code" => "540229203000"},
      %{"name" => "查巴乡", "code" => "540229204000"},
      %{"name" => "切娃乡", "code" => "540229205000"},
      %{"name" => "姆乡", "code" => "540229206000"},
      %{"name" => "仁布乡", "code" => "540229207000"}
    ]

  def next(input) when input == "白朗县" or input == "540228",
    do: [
      %{"name" => "洛江镇", "code" => "540228100000"},
      %{"name" => "嘎东镇", "code" => "540228101000"},
      %{"name" => "巴扎乡", "code" => "540228200000"},
      %{"name" => "玛乡", "code" => "540228201000"},
      %{"name" => "旺丹乡", "code" => "540228202000"},
      %{"name" => "曲奴乡", "code" => "540228203000"},
      %{"name" => "杜琼乡", "code" => "540228204000"},
      %{"name" => "强堆乡", "code" => "540228205000"},
      %{"name" => "嘎普乡", "code" => "540228206000"},
      %{"name" => "者下乡", "code" => "540228207000"},
      %{"name" => "东喜乡", "code" => "540228208000"}
    ]

  def next(input) when input == "谢通门县" or input == "540227",
    do: [
      %{"name" => "卡嘎镇", "code" => "540227100000"},
      %{"name" => "达木夏乡", "code" => "540227200000"},
      %{"name" => "查布乡", "code" => "540227201000"},
      %{"name" => "春哲乡", "code" => "540227202000"},
      %{"name" => "则许乡", "code" => "540227203000"},
      %{"name" => "娘热乡", "code" => "540227204000"},
      %{"name" => "措布西乡", "code" => "540227205000"},
      %{"name" => "纳当乡", "code" => "540227206000"},
      %{"name" => "青都乡", "code" => "540227207000"},
      %{"name" => "切琼乡", "code" => "540227208000"},
      %{"name" => "美巴切勤乡", "code" => "540227209000"},
      %{"name" => "列巴乡", "code" => "540227210000"},
      %{"name" => "塔丁乡", "code" => "540227211000"},
      %{"name" => "荣玛乡", "code" => "540227212000"},
      %{"name" => "通门乡", "code" => "540227213000"},
      %{"name" => "达那普乡", "code" => "540227214000"},
      %{"name" => "达那答乡", "code" => "540227215000"},
      %{"name" => "南木切乡", "code" => "540227216000"},
      %{"name" => "仁钦则乡", "code" => "540227217000"}
    ]

  def next(input) when input == "昂仁县" or input == "540226",
    do: [
      %{"name" => "卡嘎镇", "code" => "540226100000"},
      %{"name" => "桑桑镇", "code" => "540226101000"},
      %{"name" => "达若乡", "code" => "540226200000"},
      %{"name" => "贡久布乡", "code" => "540226201000"},
      %{"name" => "措迈乡", "code" => "540226202000"},
      %{"name" => "雄巴乡", "code" => "540226203000"},
      %{"name" => "查孜乡", "code" => "540226204000"},
      %{"name" => "阿木雄乡", "code" => "540226205000"},
      %{"name" => "如萨乡", "code" => "540226206000"},
      %{"name" => "孔隆乡", "code" => "540226207000"},
      %{"name" => "尼果乡", "code" => "540226208000"},
      %{"name" => "日吾其乡", "code" => "540226209000"},
      %{"name" => "多白乡", "code" => "540226210000"},
      %{"name" => "切热乡", "code" => "540226211000"},
      %{"name" => "秋窝乡", "code" => "540226212000"},
      %{"name" => "达居乡", "code" => "540226213000"},
      %{"name" => "亚木乡", "code" => "540226214000"}
    ]

  def next(input) when input == "拉孜县" or input == "540225",
    do: [
      %{"name" => "曲下镇", "code" => "540225100000"},
      %{"name" => "拉孜镇", "code" => "540225101000"},
      %{"name" => "扎西宗乡", "code" => "540225200000"},
      %{"name" => "曲玛乡", "code" => "540225201000"},
      %{"name" => "彭措林乡", "code" => "540225202000"},
      %{"name" => "扎西岗乡", "code" => "540225203000"},
      %{"name" => "柳乡", "code" => "540225204000"},
      %{"name" => "热萨乡", "code" => "540225205000"},
      %{"name" => "锡钦乡", "code" => "540225206000"},
      %{"name" => "芒普乡", "code" => "540225207000"},
      %{"name" => "查务乡", "code" => "540225208000"}
    ]

  def next(input) when input == "萨迦县" or input == "540224",
    do: [
      %{"name" => "萨迦镇", "code" => "540224100000"},
      %{"name" => "吉定镇", "code" => "540224101000"},
      %{"name" => "雄麦乡", "code" => "540224200000"},
      %{"name" => "麻布加乡", "code" => "540224201000"},
      %{"name" => "雄玛乡", "code" => "540224202000"},
      %{"name" => "扎西岗乡", "code" => "540224203000"},
      %{"name" => "扯休乡", "code" => "540224204000"},
      %{"name" => "赛乡", "code" => "540224205000"},
      %{"name" => "拉洛乡", "code" => "540224206000"},
      %{"name" => "查荣乡", "code" => "540224207000"},
      %{"name" => "木拉乡", "code" => "540224208000"}
    ]

  def next(input) when input == "定日县" or input == "540223",
    do: [
      %{"name" => "协格尔镇", "code" => "540223100000"},
      %{"name" => "岗嘎镇", "code" => "540223101000"},
      %{"name" => "扎西宗乡", "code" => "540223200000"},
      %{"name" => "绒辖乡", "code" => "540223201000"},
      %{"name" => "曲当乡", "code" => "540223202000"},
      %{"name" => "措果乡", "code" => "540223203000"},
      %{"name" => "曲洛乡", "code" => "540223204000"},
      %{"name" => "长所乡", "code" => "540223205000"},
      %{"name" => "尼辖乡", "code" => "540223206000"},
      %{"name" => "扎果乡", "code" => "540223207000"},
      %{"name" => "克玛乡", "code" => "540223208000"},
      %{"name" => "盆吉乡", "code" => "540223209000"},
      %{"name" => "加措乡", "code" => "540223210000"}
    ]

  def next(input) when input == "江孜县" or input == "540222",
    do: [
      %{"name" => "江孜镇", "code" => "540222100000"},
      %{"name" => "纳如乡", "code" => "540222200000"},
      %{"name" => "卡麦乡", "code" => "540222201000"},
      %{"name" => "卡堆乡", "code" => "540222202000"},
      %{"name" => "藏改乡", "code" => "540222203000"},
      %{"name" => "日朗乡", "code" => "540222204000"},
      %{"name" => "达孜乡", "code" => "540222205000"},
      %{"name" => "热索乡", "code" => "540222206000"},
      %{"name" => "重孜乡", "code" => "540222207000"},
      %{"name" => "龙马乡", "code" => "540222208000"},
      %{"name" => "加克西乡", "code" => "540222209000"},
      %{"name" => "紫金乡", "code" => "540222210000"},
      %{"name" => "江热乡", "code" => "540222211000"},
      %{"name" => "年堆乡", "code" => "540222212000"},
      %{"name" => "康卓乡", "code" => "540222213000"},
      %{"name" => "金嘎乡", "code" => "540222214000"},
      %{"name" => "日星乡", "code" => "540222215000"},
      %{"name" => "车仁乡", "code" => "540222216000"},
      %{"name" => "热龙乡", "code" => "540222217000"}
    ]

  def next(input) when input == "南木林县" or input == "540221",
    do: [
      %{"name" => "南木林镇", "code" => "540221100000"},
      %{"name" => "达那乡", "code" => "540221200000"},
      %{"name" => "卡孜乡", "code" => "540221201000"},
      %{"name" => "多角乡", "code" => "540221202000"},
      %{"name" => "秋木乡", "code" => "540221203000"},
      %{"name" => "艾玛乡", "code" => "540221204000"},
      %{"name" => "土布加乡", "code" => "540221205000"},
      %{"name" => "茶尔乡", "code" => "540221206000"},
      %{"name" => "索金乡", "code" => "540221207000"},
      %{"name" => "达孜乡", "code" => "540221208000"},
      %{"name" => "奴玛乡", "code" => "540221209000"},
      %{"name" => "热当乡", "code" => "540221210000"},
      %{"name" => "拉布普乡", "code" => "540221211000"},
      %{"name" => "普当乡", "code" => "540221212000"},
      %{"name" => "仁堆乡", "code" => "540221213000"},
      %{"name" => "芒热乡", "code" => "540221214000"},
      %{"name" => "甲措乡", "code" => "540221215000"}
    ]

  def next(input) when input == "桑珠孜区" or input == "540202",
    do: [
      %{"name" => "城南街道", "code" => "540202001000"},
      %{"name" => "城北街道", "code" => "540202002000"},
      %{"name" => "城东街道", "code" => "540202003000"},
      %{"name" => "城西街道", "code" => "540202004000"},
      %{"name" => "曲布雄乡", "code" => "540202200000"},
      %{"name" => "曲美乡", "code" => "540202201000"},
      %{"name" => "聂日雄乡", "code" => "540202202000"},
      %{"name" => "甲措雄乡", "code" => "540202203000"},
      %{"name" => "纳尔乡", "code" => "540202204000"},
      %{"name" => "东嘎乡", "code" => "540202205000"},
      %{"name" => "边雄乡", "code" => "540202206000"},
      %{"name" => "江当乡", "code" => "540202207000"},
      %{"name" => "年木乡", "code" => "540202208000"},
      %{"name" => "联乡", "code" => "540202209000"}
    ]

  def next(input) when input == "达孜工业园区" or input == "540174",
    do: [%{"name" => "达孜县工业园区", "code" => "540174400000"}]

  def next(input) when input == "西藏文化旅游创意园区" or input == "540173",
    do: [%{"name" => "西藏文化旅游创意园区", "code" => "540173400000"}]

  def next(input) when input == "拉萨经济技术开发区" or input == "540172",
    do: [%{"name" => "拉萨市经济技术开发区管委会", "code" => "540172400000"}]

  def next(input) when input == "格尔木藏青工业园区" or input == "540171",
    do: [%{"name" => "藏青工业园乡", "code" => "540171400000"}]

  def next(input) when input == "墨竹工卡县" or input == "540127",
    do: [
      %{"name" => "工卡镇", "code" => "540127100000"},
      %{"name" => "扎雪乡", "code" => "540127200000"},
      %{"name" => "门巴乡", "code" => "540127201000"},
      %{"name" => "扎西岗乡", "code" => "540127202000"},
      %{"name" => "日多乡", "code" => "540127203000"},
      %{"name" => "尼玛江热乡", "code" => "540127204000"},
      %{"name" => "甲玛乡", "code" => "540127205000"},
      %{"name" => "唐加乡", "code" => "540127206000"}
    ]

  def next(input) when input == "曲水县" or input == "540124",
    do: [
      %{"name" => "曲水镇", "code" => "540124100000"},
      %{"name" => "达嘎镇", "code" => "540124101000"},
      %{"name" => "才纳乡", "code" => "540124201000"},
      %{"name" => "南木乡", "code" => "540124202000"},
      %{"name" => "聂当乡", "code" => "540124203000"},
      %{"name" => "茶巴拉乡", "code" => "540124204000"}
    ]

  def next(input) when input == "尼木县" or input == "540123",
    do: [
      %{"name" => "塔荣镇", "code" => "540123100000"},
      %{"name" => "吞巴镇", "code" => "540123101000"},
      %{"name" => "麻江乡", "code" => "540123200000"},
      %{"name" => "普松乡", "code" => "540123201000"},
      %{"name" => "卡如乡", "code" => "540123202000"},
      %{"name" => "尼木乡", "code" => "540123203000"},
      %{"name" => "续迈乡", "code" => "540123204000"},
      %{"name" => "帕古乡", "code" => "540123205000"}
    ]

  def next(input) when input == "当雄县" or input == "540122",
    do: [
      %{"name" => "当曲卡镇", "code" => "540122100000"},
      %{"name" => "羊八井镇", "code" => "540122101000"},
      %{"name" => "格达乡", "code" => "540122200000"},
      %{"name" => "宁中乡", "code" => "540122201000"},
      %{"name" => "公塘乡", "code" => "540122202000"},
      %{"name" => "龙仁乡", "code" => "540122203000"},
      %{"name" => "乌玛塘乡", "code" => "540122204000"},
      %{"name" => "纳木湖乡", "code" => "540122205000"}
    ]

  def next(input) when input == "林周县" or input == "540121",
    do: [
      %{"name" => "甘丹曲果镇", "code" => "540121100000"},
      %{"name" => "春堆乡", "code" => "540121200000"},
      %{"name" => "松盘乡", "code" => "540121201000"},
      %{"name" => "强嘎乡", "code" => "540121202000"},
      %{"name" => "卡孜乡", "code" => "540121203000"},
      %{"name" => "边交林乡", "code" => "540121204000"},
      %{"name" => "江热夏乡", "code" => "540121205000"},
      %{"name" => "阿朗乡", "code" => "540121206000"},
      %{"name" => "唐古乡", "code" => "540121207000"},
      %{"name" => "旁多乡", "code" => "540121208000"}
    ]

  def next(input) when input == "达孜区" or input == "540104",
    do: [
      %{"name" => "德庆镇", "code" => "540104100000"},
      %{"name" => "塔杰乡", "code" => "540104200000"},
      %{"name" => "章多乡", "code" => "540104201000"},
      %{"name" => "唐嘎乡", "code" => "540104202000"},
      %{"name" => "雪乡", "code" => "540104203000"},
      %{"name" => "帮堆乡", "code" => "540104204000"}
    ]

  def next(input) when input == "堆龙德庆区" or input == "540103",
    do: [
      %{"name" => "东嘎街道", "code" => "540103001000"},
      %{"name" => "乃琼街道", "code" => "540103002000"},
      %{"name" => "羊达街道", "code" => "540103003000"},
      %{"name" => "柳梧街道", "code" => "540103004000"},
      %{"name" => "古荣镇", "code" => "540103102000"},
      %{"name" => "马镇", "code" => "540103103000"},
      %{"name" => "德庆镇", "code" => "540103104000"}
    ]

  def next(input) when input == "城关区" or input == "540102",
    do: [
      %{"name" => "八廓街道", "code" => "540102002000"},
      %{"name" => "吉日街道", "code" => "540102003000"},
      %{"name" => "吉崩岗街道", "code" => "540102004000"},
      %{"name" => "扎细街道", "code" => "540102005000"},
      %{"name" => "公德林街道", "code" => "540102006000"},
      %{"name" => "嘎玛贡桑街道", "code" => "540102007000"},
      %{"name" => "两岛街道", "code" => "540102008000"},
      %{"name" => "金珠西路街道", "code" => "540102009000"},
      %{"name" => "蔡公堂街道", "code" => "540102010000"},
      %{"name" => "夺底街道", "code" => "540102011000"},
      %{"name" => "娘热街道", "code" => "540102012000"},
      %{"name" => "纳金街道", "code" => "540102013000"}
    ]

  def next(_), do: nil
end