defmodule ChinaAdminDivisions.Gen.Lv3x.M54 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "普兰县" or input == "542521",
    do: [
      %{"name" => "普兰镇", "code" => "542521100"},
      %{"name" => "巴嘎乡", "code" => "542521200"},
      %{"name" => "霍尔乡", "code" => "542521201"}
    ]

  def next(input) when input == "札达县" or input == "542522",
    do: [
      %{"name" => "托林镇", "code" => "542522100"},
      %{"name" => "萨让乡", "code" => "542522200"},
      %{"name" => "达巴乡", "code" => "542522201"},
      %{"name" => "底雅乡", "code" => "542522202"},
      %{"name" => "香孜乡", "code" => "542522203"},
      %{"name" => "曲松乡", "code" => "542522204"},
      %{"name" => "楚鲁松杰乡", "code" => "542522205"}
    ]

  def next(input) when input == "噶尔县" or input == "542523",
    do: [
      %{"name" => "狮泉河镇", "code" => "542523100"},
      %{"name" => "昆莎乡", "code" => "542523200"},
      %{"name" => "左左乡", "code" => "542523201"},
      %{"name" => "门士乡", "code" => "542523202"},
      %{"name" => "扎西岗乡", "code" => "542523203"}
    ]

  def next(input) when input == "日土县" or input == "542524",
    do: [
      %{"name" => "日土镇", "code" => "542524100"},
      %{"name" => "热帮乡", "code" => "542524200"},
      %{"name" => "日松乡", "code" => "542524201"},
      %{"name" => "东汝乡", "code" => "542524202"},
      %{"name" => "多玛乡", "code" => "542524203"}
    ]

  def next(input) when input == "革吉县" or input == "542525",
    do: [
      %{"name" => "革吉镇", "code" => "542525100"},
      %{"name" => "雄巴乡", "code" => "542525200"},
      %{"name" => "亚热乡", "code" => "542525201"},
      %{"name" => "盐湖乡", "code" => "542525202"},
      %{"name" => "文布当桑乡", "code" => "542525203"}
    ]

  def next(input) when input == "改则县" or input == "542526",
    do: [
      %{"name" => "改则镇", "code" => "542526100"},
      %{"name" => "物玛乡", "code" => "542526200"},
      %{"name" => "先遣乡", "code" => "542526201"},
      %{"name" => "麻米乡", "code" => "542526202"},
      %{"name" => "洞措乡", "code" => "542526203"},
      %{"name" => "古姆乡", "code" => "542526204"},
      %{"name" => "察布乡", "code" => "542526205"}
    ]

  def next(input) when input == "措勤县" or input == "542527",
    do: [
      %{"name" => "措勤镇", "code" => "542527100"},
      %{"name" => "磁石乡", "code" => "542527200"},
      %{"name" => "曲洛乡", "code" => "542527201"},
      %{"name" => "江让乡", "code" => "542527202"},
      %{"name" => "达雄乡", "code" => "542527203"}
    ]

  def next(input) when input == "色尼区" or input == "540602",
    do: [
      %{"name" => "那曲镇", "code" => "540602100"},
      %{"name" => "罗玛镇", "code" => "540602101"},
      %{"name" => "古露镇", "code" => "540602102"},
      %{"name" => "达萨乡", "code" => "540602200"},
      %{"name" => "油恰乡", "code" => "540602202"},
      %{"name" => "香茂乡", "code" => "540602203"},
      %{"name" => "那玛切乡", "code" => "540602205"},
      %{"name" => "达前乡", "code" => "540602209"},
      %{"name" => "洛麦乡", "code" => "540602210"},
      %{"name" => "孔玛乡", "code" => "540602211"},
      %{"name" => "尼玛乡", "code" => "540602213"},
      %{"name" => "色雄乡", "code" => "540602217"}
    ]

  def next(input) when input == "嘉黎县" or input == "540621",
    do: [
      %{"name" => "阿扎镇", "code" => "540621100"},
      %{"name" => "嘉黎镇", "code" => "540621101"},
      %{"name" => "尼屋乡", "code" => "540621201"},
      %{"name" => "藏比乡", "code" => "540621202"},
      %{"name" => "措多乡", "code" => "540621203"},
      %{"name" => "夏玛乡", "code" => "540621204"},
      %{"name" => "林堤乡", "code" => "540621206"},
      %{"name" => "麦地卡乡", "code" => "540621207"},
      %{"name" => "绒多乡", "code" => "540621209"},
      %{"name" => "鸽群乡", "code" => "540621210"}
    ]

  def next(input) when input == "比如县" or input == "540622",
    do: [
      %{"name" => "比如镇", "code" => "540622100"},
      %{"name" => "夏曲镇", "code" => "540622101"},
      %{"name" => "白嘎乡", "code" => "540622201"},
      %{"name" => "达塘乡", "code" => "540622202"},
      %{"name" => "恰则乡", "code" => "540622203"},
      %{"name" => "扎拉乡", "code" => "540622204"},
      %{"name" => "羊秀乡", "code" => "540622207"},
      %{"name" => "香曲乡", "code" => "540622208"},
      %{"name" => "良曲乡", "code" => "540622209"},
      %{"name" => "茶曲乡", "code" => "540622210"}
    ]

  def next(input) when input == "聂荣县" or input == "540623",
    do: [
      %{"name" => "聂荣镇", "code" => "540623100"},
      %{"name" => "尼玛乡", "code" => "540623201"},
      %{"name" => "色庆乡", "code" => "540623203"},
      %{"name" => "桑荣乡", "code" => "540623205"},
      %{"name" => "下曲乡", "code" => "540623206"},
      %{"name" => "白雄乡", "code" => "540623207"},
      %{"name" => "索雄乡", "code" => "540623208"},
      %{"name" => "当木江乡", "code" => "540623210"},
      %{"name" => "查当乡", "code" => "540623211"},
      %{"name" => "永曲乡", "code" => "540623212"}
    ]

  def next(input) when input == "安多县" or input == "540624",
    do: [
      %{"name" => "帕那镇", "code" => "540624100"},
      %{"name" => "强玛镇", "code" => "540624101"},
      %{"name" => "扎仁镇", "code" => "540624102"},
      %{"name" => "雁石坪镇", "code" => "540624103"},
      %{"name" => "多玛乡", "code" => "540624201"},
      %{"name" => "玛曲乡", "code" => "540624202"},
      %{"name" => "滩堆乡", "code" => "540624205"},
      %{"name" => "帮爱乡", "code" => "540624207"},
      %{"name" => "玛荣乡", "code" => "540624209"},
      %{"name" => "扎曲乡", "code" => "540624210"},
      %{"name" => "色务乡", "code" => "540624211"},
      %{"name" => "措玛乡", "code" => "540624212"},
      %{"name" => "岗尼乡", "code" => "540624213"}
    ]

  def next(input) when input == "申扎县" or input == "540625",
    do: [
      %{"name" => "申扎镇", "code" => "540625100"},
      %{"name" => "雄梅镇", "code" => "540625101"},
      %{"name" => "下过乡", "code" => "540625201"},
      %{"name" => "卡乡", "code" => "540625202"},
      %{"name" => "巴扎乡", "code" => "540625203"},
      %{"name" => "塔尔玛乡", "code" => "540625204"},
      %{"name" => "买巴乡", "code" => "540625206"},
      %{"name" => "马跃乡", "code" => "540625207"}
    ]

  def next(input) when input == "索县" or input == "540626",
    do: [
      %{"name" => "亚拉镇", "code" => "540626100"},
      %{"name" => "荣布镇", "code" => "540626101"},
      %{"name" => "若达乡", "code" => "540626201"},
      %{"name" => "加勤乡", "code" => "540626202"},
      %{"name" => "赤多乡", "code" => "540626203"},
      %{"name" => "西昌乡", "code" => "540626205"},
      %{"name" => "江达乡", "code" => "540626206"},
      %{"name" => "热瓦乡", "code" => "540626208"},
      %{"name" => "嘎美乡", "code" => "540626209"},
      %{"name" => "嘎木乡", "code" => "540626210"}
    ]

  def next(input) when input == "班戈县" or input == "540627",
    do: [
      %{"name" => "普保镇", "code" => "540627100"},
      %{"name" => "北拉镇", "code" => "540627101"},
      %{"name" => "德庆镇", "code" => "540627102"},
      %{"name" => "佳琼镇", "code" => "540627103"},
      %{"name" => "尼玛乡", "code" => "540627205"},
      %{"name" => "保吉乡", "code" => "540627207"},
      %{"name" => "青龙乡", "code" => "540627209"},
      %{"name" => "马前乡", "code" => "540627211"},
      %{"name" => "门当乡", "code" => "540627215"},
      %{"name" => "新吉乡", "code" => "540627216"}
    ]

  def next(input) when input == "巴青县" or input == "540628",
    do: [
      %{"name" => "拉西镇", "code" => "540628100"},
      %{"name" => "杂色镇", "code" => "540628101"},
      %{"name" => "雅安镇", "code" => "540628102"},
      %{"name" => "江绵乡", "code" => "540628201"},
      %{"name" => "玛如乡", "code" => "540628202"},
      %{"name" => "阿秀乡", "code" => "540628204"},
      %{"name" => "贡日乡", "code" => "540628205"},
      %{"name" => "岗切乡", "code" => "540628206"},
      %{"name" => "巴青乡", "code" => "540628210"},
      %{"name" => "本塔乡", "code" => "540628211"}
    ]

  def next(input) when input == "尼玛县" or input == "540629",
    do: [
      %{"name" => "尼玛镇", "code" => "540629100"},
      %{"name" => "卓尼乡", "code" => "540629201"},
      %{"name" => "达果乡", "code" => "540629202"},
      %{"name" => "阿索乡", "code" => "540629203"},
      %{"name" => "荣玛乡", "code" => "540629204"},
      %{"name" => "中仓乡", "code" => "540629205"},
      %{"name" => "来多乡", "code" => "540629206"},
      %{"name" => "申亚乡", "code" => "540629207"},
      %{"name" => "卓瓦乡", "code" => "540629208"},
      %{"name" => "俄久乡", "code" => "540629209"},
      %{"name" => "文部乡", "code" => "540629210"},
      %{"name" => "甲谷乡", "code" => "540629211"},
      %{"name" => "军仓乡", "code" => "540629212"},
      %{"name" => "吉瓦乡", "code" => "540629219"}
    ]

  def next(input) when input == "双湖县" or input == "540630",
    do: [
      %{"name" => "措折罗玛镇", "code" => "540630101"},
      %{"name" => "协德乡", "code" => "540630200"},
      %{"name" => "雅曲乡", "code" => "540630201"},
      %{"name" => "嘎措乡", "code" => "540630202"},
      %{"name" => "措折强玛乡", "code" => "540630203"},
      %{"name" => "多玛乡", "code" => "540630204"},
      %{"name" => "巴岭乡", "code" => "540630205"}
    ]

  def next(input) when input == "乃东区" or input == "540502",
    do: [
      %{"name" => "泽当街道", "code" => "540502001"},
      %{"name" => "乃东街道", "code" => "540502002"},
      %{"name" => "结莎街道", "code" => "540502003"},
      %{"name" => "昌珠镇", "code" => "540502101"},
      %{"name" => "亚堆乡", "code" => "540502200"},
      %{"name" => "索珠乡", "code" => "540502201"},
      %{"name" => "多颇章乡", "code" => "540502202"},
      %{"name" => "结巴乡", "code" => "540502203"},
      %{"name" => "颇章乡", "code" => "540502204"}
    ]

  def next(input) when input == "扎囊县" or input == "540521",
    do: [
      %{"name" => "扎塘镇", "code" => "540521100"},
      %{"name" => "桑耶镇", "code" => "540521101"},
      %{"name" => "扎其乡", "code" => "540521200"},
      %{"name" => "阿扎乡", "code" => "540521201"},
      %{"name" => "吉汝乡", "code" => "540521202"}
    ]

  def next(input) when input == "贡嘎县" or input == "540522",
    do: [
      %{"name" => "吉雄镇", "code" => "540522100"},
      %{"name" => "甲竹林镇", "code" => "540522101"},
      %{"name" => "杰德秀镇", "code" => "540522102"},
      %{"name" => "岗堆镇", "code" => "540522103"},
      %{"name" => "江塘镇", "code" => "540522104"},
      %{"name" => "朗杰学乡", "code" => "540522200"},
      %{"name" => "昌果乡", "code" => "540522201"},
      %{"name" => "东拉乡", "code" => "540522205"},
      %{"name" => "克西乡", "code" => "540522206"}
    ]

  def next(input) when input == "桑日县" or input == "540523",
    do: [
      %{"name" => "桑日镇", "code" => "540523100"},
      %{"name" => "增期乡", "code" => "540523200"},
      %{"name" => "白堆乡", "code" => "540523201"},
      %{"name" => "绒乡", "code" => "540523202"}
    ]

  def next(input) when input == "琼结县" or input == "540524",
    do: [
      %{"name" => "琼结镇", "code" => "540524100"},
      %{"name" => "加麻乡", "code" => "540524200"},
      %{"name" => "下水乡", "code" => "540524201"},
      %{"name" => "拉玉乡", "code" => "540524202"}
    ]

  def next(input) when input == "曲松县" or input == "540525",
    do: [
      %{"name" => "曲松镇", "code" => "540525100"},
      %{"name" => "罗布沙镇", "code" => "540525101"},
      %{"name" => "下江乡", "code" => "540525200"},
      %{"name" => "邱多江乡", "code" => "540525201"},
      %{"name" => "堆随乡", "code" => "540525202"}
    ]

  def next(input) when input == "措美县" or input == "540526",
    do: [
      %{"name" => "措美镇", "code" => "540526100"},
      %{"name" => "哲古镇", "code" => "540526101"},
      %{"name" => "乃西乡", "code" => "540526200"},
      %{"name" => "古堆乡", "code" => "540526201"}
    ]

  def next(input) when input == "洛扎县" or input == "540527",
    do: [
      %{"name" => "洛扎镇", "code" => "540527100"},
      %{"name" => "拉康镇", "code" => "540527101"},
      %{"name" => "扎日乡", "code" => "540527201"},
      %{"name" => "色乡", "code" => "540527202"},
      %{"name" => "生格乡", "code" => "540527203"},
      %{"name" => "边巴乡", "code" => "540527204"},
      %{"name" => "拉郊乡", "code" => "540527205"}
    ]

  def next(input) when input == "加查县" or input == "540528",
    do: [
      %{"name" => "加查镇", "code" => "540528100"},
      %{"name" => "安绕镇", "code" => "540528101"},
      %{"name" => "拉绥乡", "code" => "540528200"},
      %{"name" => "崔久乡", "code" => "540528201"},
      %{"name" => "坝乡", "code" => "540528202"},
      %{"name" => "冷达乡", "code" => "540528203"},
      %{"name" => "洛林乡", "code" => "540528204"}
    ]

  def next(input) when input == "隆子县" or input == "540529",
    do: [
      %{"name" => "隆子镇", "code" => "540529100"},
      %{"name" => "日当镇", "code" => "540529101"},
      %{"name" => "列麦乡", "code" => "540529200"},
      %{"name" => "热荣乡", "code" => "540529201"},
      %{"name" => "三安曲林乡", "code" => "540529202"},
      %{"name" => "准巴乡", "code" => "540529203"},
      %{"name" => "雪萨乡", "code" => "540529204"},
      %{"name" => "扎日乡", "code" => "540529205"},
      %{"name" => "玉麦乡", "code" => "540529206"},
      %{"name" => "加玉乡", "code" => "540529207"},
      %{"name" => "斗玉珞巴民族乡", "code" => "540529208"}
    ]

  def next(input) when input == "浪卡子县" or input == "540531",
    do: [
      %{"name" => "浪卡子镇", "code" => "540531100"},
      %{"name" => "打隆镇", "code" => "540531101"},
      %{"name" => "张达乡", "code" => "540531200"},
      %{"name" => "伦布雪乡", "code" => "540531201"},
      %{"name" => "多却乡", "code" => "540531202"},
      %{"name" => "普玛江塘乡", "code" => "540531203"},
      %{"name" => "阿扎乡", "code" => "540531204"},
      %{"name" => "卡龙乡", "code" => "540531205"},
      %{"name" => "白地乡", "code" => "540531206"},
      %{"name" => "卡热乡", "code" => "540531207"}
    ]

  def next(input) when input == "错那市" or input == "540581",
    do: [
      %{"name" => "错那镇", "code" => "540581100"},
      %{"name" => "卡达乡", "code" => "540581200"},
      %{"name" => "觉拉乡", "code" => "540581201"},
      %{"name" => "浪坡乡", "code" => "540581202"},
      %{"name" => "曲卓木乡", "code" => "540581203"},
      %{"name" => "库局乡", "code" => "540581204"},
      %{"name" => "麻麻门巴民族乡", "code" => "540581205"},
      %{"name" => "贡日门巴民族乡", "code" => "540581206"},
      %{"name" => "吉巴门巴民族乡", "code" => "540581207"},
      %{"name" => "勒门巴民族乡", "code" => "540581208"}
    ]

  def next(input) when input == "巴宜区" or input == "540402",
    do: [
      %{"name" => "白玛岗街道", "code" => "540402001"},
      %{"name" => "觉木街道", "code" => "540402002"},
      %{"name" => "林芝镇", "code" => "540402100"},
      %{"name" => "百巴镇", "code" => "540402101"},
      %{"name" => "八一镇", "code" => "540402102"},
      %{"name" => "鲁朗镇", "code" => "540402103"},
      %{"name" => "更章门巴民族乡", "code" => "540402200"},
      %{"name" => "布久乡", "code" => "540402202"},
      %{"name" => "米瑞乡", "code" => "540402203"}
    ]

  def next(input) when input == "工布江达县" or input == "540421",
    do: [
      %{"name" => "工布江达镇", "code" => "540421100"},
      %{"name" => "金达镇", "code" => "540421101"},
      %{"name" => "巴河镇", "code" => "540421102"},
      %{"name" => "朱拉乡", "code" => "540421200"},
      %{"name" => "错高乡", "code" => "540421201"},
      %{"name" => "仲萨乡", "code" => "540421202"},
      %{"name" => "江达乡", "code" => "540421203"},
      %{"name" => "娘蒲乡", "code" => "540421204"},
      %{"name" => "加兴乡", "code" => "540421205"}
    ]

  def next(input) when input == "墨脱县" or input == "540423",
    do: [
      %{"name" => "墨脱镇", "code" => "540423100"},
      %{"name" => "加热萨乡", "code" => "540423200"},
      %{"name" => "甘登乡", "code" => "540423201"},
      %{"name" => "达木珞巴民族乡", "code" => "540423202"},
      %{"name" => "帮辛乡", "code" => "540423203"},
      %{"name" => "格当乡", "code" => "540423204"},
      %{"name" => "德兴乡", "code" => "540423205"},
      %{"name" => "背崩乡", "code" => "540423206"}
    ]

  def next(input) when input == "波密县" or input == "540424",
    do: [
      %{"name" => "扎木镇", "code" => "540424100"},
      %{"name" => "倾多镇", "code" => "540424101"},
      %{"name" => "松宗镇", "code" => "540424102"},
      %{"name" => "易贡乡", "code" => "540424200"},
      %{"name" => "玉普乡", "code" => "540424201"},
      %{"name" => "康玉乡", "code" => "540424202"},
      %{"name" => "多吉乡", "code" => "540424203"},
      %{"name" => "玉许乡", "code" => "540424204"},
      %{"name" => "八盖乡", "code" => "540424205"},
      %{"name" => "古乡", "code" => "540424207"}
    ]

  def next(input) when input == "察隅县" or input == "540425",
    do: [
      %{"name" => "竹瓦根镇", "code" => "540425100"},
      %{"name" => "上察隅镇", "code" => "540425101"},
      %{"name" => "下察隅镇", "code" => "540425102"},
      %{"name" => "察瓦龙乡", "code" => "540425200"},
      %{"name" => "古拉乡", "code" => "540425201"},
      %{"name" => "古玉乡", "code" => "540425202"}
    ]

  def next(input) when input == "朗县" or input == "540426",
    do: [
      %{"name" => "朗镇", "code" => "540426100"},
      %{"name" => "仲达镇", "code" => "540426101"},
      %{"name" => "洞嘎镇", "code" => "540426102"},
      %{"name" => "拉多乡", "code" => "540426200"},
      %{"name" => "金东乡", "code" => "540426201"},
      %{"name" => "登木乡", "code" => "540426202"}
    ]

  def next(input) when input == "米林市" or input == "540481",
    do: [
      %{"name" => "米林镇", "code" => "540481100"},
      %{"name" => "派镇", "code" => "540481101"},
      %{"name" => "卧龙镇", "code" => "540481102"},
      %{"name" => "丹娘乡", "code" => "540481200"},
      %{"name" => "南伊珞巴民族乡", "code" => "540481201"},
      %{"name" => "扎西绕登乡", "code" => "540481202"},
      %{"name" => "里龙乡", "code" => "540481203"},
      %{"name" => "羌纳乡", "code" => "540481204"}
    ]

  def next(input) when input == "卡若区" or input == "540302",
    do: [
      %{"name" => "城关镇", "code" => "540302100"},
      %{"name" => "俄洛镇", "code" => "540302101"},
      %{"name" => "卡若镇", "code" => "540302102"},
      %{"name" => "芒达乡", "code" => "540302200"},
      %{"name" => "约巴乡", "code" => "540302201"},
      %{"name" => "妥坝乡", "code" => "540302202"},
      %{"name" => "拉多乡", "code" => "540302203"},
      %{"name" => "面达乡", "code" => "540302204"},
      %{"name" => "嘎玛乡", "code" => "540302205"},
      %{"name" => "柴维乡", "code" => "540302206"},
      %{"name" => "日通乡", "code" => "540302207"},
      %{"name" => "如意乡", "code" => "540302208"},
      %{"name" => "埃西乡", "code" => "540302209"},
      %{"name" => "若巴乡", "code" => "540302210"},
      %{"name" => "沙贡乡", "code" => "540302211"}
    ]

  def next(input) when input == "江达县" or input == "540321",
    do: [
      %{"name" => "江达镇", "code" => "540321100"},
      %{"name" => "岗托镇", "code" => "540321101"},
      %{"name" => "卡贡乡", "code" => "540321200"},
      %{"name" => "岩比乡", "code" => "540321201"},
      %{"name" => "邓柯乡", "code" => "540321202"},
      %{"name" => "生达乡", "code" => "540321203"},
      %{"name" => "娘西乡", "code" => "540321204"},
      %{"name" => "字呷乡", "code" => "540321205"},
      %{"name" => "青泥洞乡", "code" => "540321206"},
      %{"name" => "汪布顶乡", "code" => "540321207"},
      %{"name" => "德登乡", "code" => "540321208"},
      %{"name" => "同普乡", "code" => "540321209"},
      %{"name" => "波罗乡", "code" => "540321210"}
    ]

  def next(input) when input == "贡觉县" or input == "540322",
    do: [
      %{"name" => "莫洛镇", "code" => "540322100"},
      %{"name" => "相皮乡", "code" => "540322200"},
      %{"name" => "哈加乡", "code" => "540322201"},
      %{"name" => "雄松乡", "code" => "540322202"},
      %{"name" => "拉妥乡", "code" => "540322203"},
      %{"name" => "阿旺乡", "code" => "540322204"},
      %{"name" => "木协乡", "code" => "540322205"},
      %{"name" => "罗麦乡", "code" => "540322206"},
      %{"name" => "沙东乡", "code" => "540322207"},
      %{"name" => "克日乡", "code" => "540322208"},
      %{"name" => "则巴乡", "code" => "540322209"},
      %{"name" => "敏都乡", "code" => "540322210"}
    ]

  def next(input) when input == "类乌齐县" or input == "540323",
    do: [
      %{"name" => "类乌齐镇", "code" => "540323100"},
      %{"name" => "桑多镇", "code" => "540323101"},
      %{"name" => "加桑卡乡", "code" => "540323200"},
      %{"name" => "长毛岭乡", "code" => "540323201"},
      %{"name" => "岗色乡", "code" => "540323202"},
      %{"name" => "吉多乡", "code" => "540323203"},
      %{"name" => "滨达乡", "code" => "540323204"},
      %{"name" => "卡玛多乡", "code" => "540323205"},
      %{"name" => "尚卡乡", "code" => "540323206"},
      %{"name" => "伊日乡", "code" => "540323207"}
    ]

  def next(input) when input == "丁青县" or input == "540324",
    do: [
      %{"name" => "丁青镇", "code" => "540324100"},
      %{"name" => "尺犊镇", "code" => "540324101"},
      %{"name" => "觉恩乡", "code" => "540324200"},
      %{"name" => "沙贡乡", "code" => "540324201"},
      %{"name" => "当堆乡", "code" => "540324202"},
      %{"name" => "桑多乡", "code" => "540324203"},
      %{"name" => "木塔乡", "code" => "540324204"},
      %{"name" => "布塔乡", "code" => "540324205"},
      %{"name" => "巴达乡", "code" => "540324206"},
      %{"name" => "甘岩乡", "code" => "540324207"},
      %{"name" => "嘎塔乡", "code" => "540324208"},
      %{"name" => "色扎乡", "code" => "540324209"},
      %{"name" => "协雄乡", "code" => "540324210"}
    ]

  def next(input) when input == "察雅县" or input == "540325",
    do: [
      %{"name" => "烟多镇", "code" => "540325100"},
      %{"name" => "香堆镇", "code" => "540325101"},
      %{"name" => "吉塘镇", "code" => "540325102"},
      %{"name" => "宗沙乡", "code" => "540325200"},
      %{"name" => "卡贡乡", "code" => "540325201"},
      %{"name" => "荣周乡", "code" => "540325202"},
      %{"name" => "巴日乡", "code" => "540325203"},
      %{"name" => "阿孜乡", "code" => "540325204"},
      %{"name" => "王卡乡", "code" => "540325205"},
      %{"name" => "新卡乡", "code" => "540325206"},
      %{"name" => "肯通乡", "code" => "540325207"},
      %{"name" => "扩达乡", "code" => "540325208"},
      %{"name" => "察拉乡", "code" => "540325209"}
    ]

  def next(input) when input == "八宿县" or input == "540326",
    do: [
      %{"name" => "白玛镇", "code" => "540326100"},
      %{"name" => "帮达镇", "code" => "540326101"},
      %{"name" => "然乌镇", "code" => "540326102"},
      %{"name" => "同卡镇", "code" => "540326103"},
      %{"name" => "郭庆乡", "code" => "540326202"},
      %{"name" => "拉根乡", "code" => "540326203"},
      %{"name" => "益庆乡", "code" => "540326204"},
      %{"name" => "吉中乡", "code" => "540326205"},
      %{"name" => "卡瓦白庆乡", "code" => "540326206"},
      %{"name" => "吉达乡", "code" => "540326207"},
      %{"name" => "夏里乡", "code" => "540326208"},
      %{"name" => "拥巴乡", "code" => "540326209"},
      %{"name" => "瓦乡", "code" => "540326210"},
      %{"name" => "林卡乡", "code" => "540326211"}
    ]

  def next(input) when input == "左贡县" or input == "540327",
    do: [
      %{"name" => "旺达镇", "code" => "540327100"},
      %{"name" => "田妥镇", "code" => "540327101"},
      %{"name" => "扎玉镇", "code" => "540327102"},
      %{"name" => "东坝乡", "code" => "540327203"},
      %{"name" => "仁果乡", "code" => "540327204"},
      %{"name" => "绕金乡", "code" => "540327207"},
      %{"name" => "碧土乡", "code" => "540327208"},
      %{"name" => "美玉乡", "code" => "540327210"},
      %{"name" => "中林卡乡", "code" => "540327211"},
      %{"name" => "下林卡乡", "code" => "540327212"}
    ]

  def next(input) when input == "芒康县" or input == "540328",
    do: [
      %{"name" => "嘎托镇", "code" => "540328100"},
      %{"name" => "如美镇", "code" => "540328101"},
      %{"name" => "索多西乡", "code" => "540328200"},
      %{"name" => "莽岭乡", "code" => "540328201"},
      %{"name" => "宗西乡", "code" => "540328202"},
      %{"name" => "昂多乡", "code" => "540328203"},
      %{"name" => "措瓦乡", "code" => "540328204"},
      %{"name" => "洛尼乡", "code" => "540328205"},
      %{"name" => "戈波乡", "code" => "540328206"},
      %{"name" => "帮达乡", "code" => "540328207"},
      %{"name" => "徐中乡", "code" => "540328208"},
      %{"name" => "曲登乡", "code" => "540328209"},
      %{"name" => "木许乡", "code" => "540328210"},
      %{"name" => "纳西民族乡", "code" => "540328211"},
      %{"name" => "朱巴龙乡", "code" => "540328212"},
      %{"name" => "曲孜卡乡", "code" => "540328213"}
    ]

  def next(input) when input == "洛隆县" or input == "540329",
    do: [
      %{"name" => "孜托镇", "code" => "540329100"},
      %{"name" => "硕督镇", "code" => "540329101"},
      %{"name" => "康沙镇", "code" => "540329111"},
      %{"name" => "马利镇", "code" => "540329112"},
      %{"name" => "达龙乡", "code" => "540329200"},
      %{"name" => "新荣乡", "code" => "540329201"},
      %{"name" => "白达乡", "code" => "540329202"},
      %{"name" => "玉西乡", "code" => "540329203"},
      %{"name" => "腊久乡", "code" => "540329204"},
      %{"name" => "俄西乡", "code" => "540329205"},
      %{"name" => "中亦乡", "code" => "540329206"}
    ]

  def next(input) when input == "边坝县" or input == "540330",
    do: [
      %{"name" => "边坝镇", "code" => "540330100"},
      %{"name" => "草卡镇", "code" => "540330101"},
      %{"name" => "沙丁乡", "code" => "540330201"},
      %{"name" => "金岭乡", "code" => "540330202"},
      %{"name" => "加贡乡", "code" => "540330203"},
      %{"name" => "马武乡", "code" => "540330204"},
      %{"name" => "热玉乡", "code" => "540330205"},
      %{"name" => "尼木乡", "code" => "540330206"},
      %{"name" => "马秀乡", "code" => "540330207"},
      %{"name" => "拉孜乡", "code" => "540330208"},
      %{"name" => "都瓦乡", "code" => "540330209"}
    ]

  def next(input) when input == "桑珠孜区" or input == "540202",
    do: [
      %{"name" => "城南街道", "code" => "540202001"},
      %{"name" => "城北街道", "code" => "540202002"},
      %{"name" => "城东街道", "code" => "540202003"},
      %{"name" => "城西街道", "code" => "540202004"},
      %{"name" => "曲布雄乡", "code" => "540202200"},
      %{"name" => "曲美乡", "code" => "540202201"},
      %{"name" => "聂日雄乡", "code" => "540202202"},
      %{"name" => "甲措雄乡", "code" => "540202203"},
      %{"name" => "纳尔乡", "code" => "540202204"},
      %{"name" => "东嘎乡", "code" => "540202205"},
      %{"name" => "边雄乡", "code" => "540202206"},
      %{"name" => "江当乡", "code" => "540202207"},
      %{"name" => "年木乡", "code" => "540202208"},
      %{"name" => "联乡", "code" => "540202209"}
    ]

  def next(input) when input == "南木林县" or input == "540221",
    do: [
      %{"name" => "南木林镇", "code" => "540221100"},
      %{"name" => "达那乡", "code" => "540221200"},
      %{"name" => "卡孜乡", "code" => "540221201"},
      %{"name" => "多角乡", "code" => "540221202"},
      %{"name" => "秋木乡", "code" => "540221203"},
      %{"name" => "艾玛乡", "code" => "540221204"},
      %{"name" => "土布加乡", "code" => "540221205"},
      %{"name" => "茶尔乡", "code" => "540221206"},
      %{"name" => "索金乡", "code" => "540221207"},
      %{"name" => "达孜乡", "code" => "540221208"},
      %{"name" => "奴玛乡", "code" => "540221209"},
      %{"name" => "热当乡", "code" => "540221210"},
      %{"name" => "拉布普乡", "code" => "540221211"},
      %{"name" => "普当乡", "code" => "540221212"},
      %{"name" => "仁堆乡", "code" => "540221213"},
      %{"name" => "芒热乡", "code" => "540221214"},
      %{"name" => "甲措乡", "code" => "540221215"}
    ]

  def next(input) when input == "江孜县" or input == "540222",
    do: [
      %{"name" => "江孜镇", "code" => "540222100"},
      %{"name" => "纳如乡", "code" => "540222200"},
      %{"name" => "卡麦乡", "code" => "540222201"},
      %{"name" => "卡堆乡", "code" => "540222202"},
      %{"name" => "藏改乡", "code" => "540222203"},
      %{"name" => "日朗乡", "code" => "540222204"},
      %{"name" => "达孜乡", "code" => "540222205"},
      %{"name" => "热索乡", "code" => "540222206"},
      %{"name" => "重孜乡", "code" => "540222207"},
      %{"name" => "龙马乡", "code" => "540222208"},
      %{"name" => "加克西乡", "code" => "540222209"},
      %{"name" => "紫金乡", "code" => "540222210"},
      %{"name" => "江热乡", "code" => "540222211"},
      %{"name" => "年堆乡", "code" => "540222212"},
      %{"name" => "康卓乡", "code" => "540222213"},
      %{"name" => "金嘎乡", "code" => "540222214"},
      %{"name" => "日星乡", "code" => "540222215"},
      %{"name" => "车仁乡", "code" => "540222216"},
      %{"name" => "热龙乡", "code" => "540222217"}
    ]

  def next(input) when input == "定日县" or input == "540223",
    do: [
      %{"name" => "协格尔镇", "code" => "540223100"},
      %{"name" => "岗嘎镇", "code" => "540223101"},
      %{"name" => "扎西宗乡", "code" => "540223200"},
      %{"name" => "绒辖乡", "code" => "540223201"},
      %{"name" => "曲当乡", "code" => "540223202"},
      %{"name" => "措果乡", "code" => "540223203"},
      %{"name" => "曲洛乡", "code" => "540223204"},
      %{"name" => "长所乡", "code" => "540223205"},
      %{"name" => "尼辖乡", "code" => "540223206"},
      %{"name" => "扎果乡", "code" => "540223207"},
      %{"name" => "克玛乡", "code" => "540223208"},
      %{"name" => "盆吉乡", "code" => "540223209"},
      %{"name" => "加措乡", "code" => "540223210"}
    ]

  def next(input) when input == "萨迦县" or input == "540224",
    do: [
      %{"name" => "萨迦镇", "code" => "540224100"},
      %{"name" => "吉定镇", "code" => "540224101"},
      %{"name" => "雄麦乡", "code" => "540224200"},
      %{"name" => "麻布加乡", "code" => "540224201"},
      %{"name" => "雄玛乡", "code" => "540224202"},
      %{"name" => "扎西岗乡", "code" => "540224203"},
      %{"name" => "扯休乡", "code" => "540224204"},
      %{"name" => "赛乡", "code" => "540224205"},
      %{"name" => "拉洛乡", "code" => "540224206"},
      %{"name" => "查荣乡", "code" => "540224207"},
      %{"name" => "木拉乡", "code" => "540224208"}
    ]

  def next(input) when input == "拉孜县" or input == "540225",
    do: [
      %{"name" => "曲下镇", "code" => "540225100"},
      %{"name" => "拉孜镇", "code" => "540225101"},
      %{"name" => "扎西宗乡", "code" => "540225200"},
      %{"name" => "曲玛乡", "code" => "540225201"},
      %{"name" => "彭措林乡", "code" => "540225202"},
      %{"name" => "扎西岗乡", "code" => "540225203"},
      %{"name" => "柳乡", "code" => "540225204"},
      %{"name" => "热萨乡", "code" => "540225205"},
      %{"name" => "锡钦乡", "code" => "540225206"},
      %{"name" => "芒普乡", "code" => "540225207"},
      %{"name" => "查务乡", "code" => "540225208"}
    ]

  def next(input) when input == "昂仁县" or input == "540226",
    do: [
      %{"name" => "卡嘎镇", "code" => "540226100"},
      %{"name" => "桑桑镇", "code" => "540226101"},
      %{"name" => "达若乡", "code" => "540226200"},
      %{"name" => "贡久布乡", "code" => "540226201"},
      %{"name" => "措迈乡", "code" => "540226202"},
      %{"name" => "雄巴乡", "code" => "540226203"},
      %{"name" => "查孜乡", "code" => "540226204"},
      %{"name" => "阿木雄乡", "code" => "540226205"},
      %{"name" => "如萨乡", "code" => "540226206"},
      %{"name" => "孔隆乡", "code" => "540226207"},
      %{"name" => "尼果乡", "code" => "540226208"},
      %{"name" => "日吾其乡", "code" => "540226209"},
      %{"name" => "多白乡", "code" => "540226210"},
      %{"name" => "切热乡", "code" => "540226211"},
      %{"name" => "秋窝乡", "code" => "540226212"},
      %{"name" => "达居乡", "code" => "540226213"},
      %{"name" => "亚木乡", "code" => "540226214"}
    ]

  def next(input) when input == "谢通门县" or input == "540227",
    do: [
      %{"name" => "卡嘎镇", "code" => "540227100"},
      %{"name" => "达木夏乡", "code" => "540227200"},
      %{"name" => "查布乡", "code" => "540227201"},
      %{"name" => "春哲乡", "code" => "540227202"},
      %{"name" => "则许乡", "code" => "540227203"},
      %{"name" => "娘热乡", "code" => "540227204"},
      %{"name" => "措布西乡", "code" => "540227205"},
      %{"name" => "纳当乡", "code" => "540227206"},
      %{"name" => "青都乡", "code" => "540227207"},
      %{"name" => "切琼乡", "code" => "540227208"},
      %{"name" => "美巴切勤乡", "code" => "540227209"},
      %{"name" => "列巴乡", "code" => "540227210"},
      %{"name" => "塔丁乡", "code" => "540227211"},
      %{"name" => "荣玛乡", "code" => "540227212"},
      %{"name" => "通门乡", "code" => "540227213"},
      %{"name" => "达那普乡", "code" => "540227214"},
      %{"name" => "达那答乡", "code" => "540227215"},
      %{"name" => "南木切乡", "code" => "540227216"},
      %{"name" => "仁钦则乡", "code" => "540227217"}
    ]

  def next(input) when input == "白朗县" or input == "540228",
    do: [
      %{"name" => "洛江镇", "code" => "540228100"},
      %{"name" => "嘎东镇", "code" => "540228101"},
      %{"name" => "巴扎乡", "code" => "540228200"},
      %{"name" => "玛乡", "code" => "540228201"},
      %{"name" => "旺丹乡", "code" => "540228202"},
      %{"name" => "曲奴乡", "code" => "540228203"},
      %{"name" => "杜琼乡", "code" => "540228204"},
      %{"name" => "强堆乡", "code" => "540228205"},
      %{"name" => "嘎普乡", "code" => "540228206"},
      %{"name" => "者下乡", "code" => "540228207"},
      %{"name" => "东喜乡", "code" => "540228208"}
    ]

  def next(input) when input == "仁布县" or input == "540229",
    do: [
      %{"name" => "德吉林镇", "code" => "540229100"},
      %{"name" => "康雄乡", "code" => "540229200"},
      %{"name" => "普松乡", "code" => "540229201"},
      %{"name" => "帕当乡", "code" => "540229202"},
      %{"name" => "然巴乡", "code" => "540229203"},
      %{"name" => "查巴乡", "code" => "540229204"},
      %{"name" => "切娃乡", "code" => "540229205"},
      %{"name" => "姆乡", "code" => "540229206"},
      %{"name" => "仁布乡", "code" => "540229207"}
    ]

  def next(input) when input == "康马县" or input == "540230",
    do: [
      %{"name" => "康马镇", "code" => "540230100"},
      %{"name" => "南尼乡", "code" => "540230200"},
      %{"name" => "少岗乡", "code" => "540230201"},
      %{"name" => "康如乡", "code" => "540230202"},
      %{"name" => "萨玛达乡", "code" => "540230203"},
      %{"name" => "嘎拉乡", "code" => "540230204"},
      %{"name" => "涅如堆乡", "code" => "540230205"},
      %{"name" => "涅如麦乡", "code" => "540230206"},
      %{"name" => "雄章乡", "code" => "540230207"}
    ]

  def next(input) when input == "定结县" or input == "540231",
    do: [
      %{"name" => "江嘎镇", "code" => "540231100"},
      %{"name" => "陈塘镇", "code" => "540231101"},
      %{"name" => "日屋镇", "code" => "540231102"},
      %{"name" => "确布乡", "code" => "540231201"},
      %{"name" => "定结乡", "code" => "540231202"},
      %{"name" => "多布扎乡", "code" => "540231203"},
      %{"name" => "扎西岗乡", "code" => "540231204"},
      %{"name" => "琼孜乡", "code" => "540231205"},
      %{"name" => "萨尔乡", "code" => "540231206"},
      %{"name" => "郭加乡", "code" => "540231207"}
    ]

  def next(input) when input == "仲巴县" or input == "540232",
    do: [
      %{"name" => "帕羊镇", "code" => "540232100"},
      %{"name" => "拉让乡", "code" => "540232200"},
      %{"name" => "琼果乡", "code" => "540232201"},
      %{"name" => "亚热乡", "code" => "540232202"},
      %{"name" => "布多乡", "code" => "540232203"},
      %{"name" => "偏吉乡", "code" => "540232204"},
      %{"name" => "纳久乡", "code" => "540232205"},
      %{"name" => "吉拉乡", "code" => "540232206"},
      %{"name" => "霍尔巴乡", "code" => "540232207"},
      %{"name" => "隆格尔乡", "code" => "540232208"},
      %{"name" => "吉玛乡", "code" => "540232209"},
      %{"name" => "仁多乡", "code" => "540232210"},
      %{"name" => "帕江乡", "code" => "540232211"}
    ]

  def next(input) when input == "亚东县" or input == "540233",
    do: [
      %{"name" => "下司马镇", "code" => "540233100"},
      %{"name" => "帕里镇", "code" => "540233101"},
      %{"name" => "下亚东乡", "code" => "540233200"},
      %{"name" => "上亚东乡", "code" => "540233201"},
      %{"name" => "康布乡", "code" => "540233202"},
      %{"name" => "堆纳乡", "code" => "540233203"},
      %{"name" => "吉汝乡", "code" => "540233204"}
    ]

  def next(input) when input == "吉隆县" or input == "540234",
    do: [
      %{"name" => "宗嘎镇", "code" => "540234100"},
      %{"name" => "吉隆镇", "code" => "540234101"},
      %{"name" => "差那乡", "code" => "540234200"},
      %{"name" => "折巴乡", "code" => "540234201"},
      %{"name" => "贡当乡", "code" => "540234202"},
      %{"name" => "萨勒乡", "code" => "540234203"}
    ]

  def next(input) when input == "聂拉木县" or input == "540235",
    do: [
      %{"name" => "聂拉木镇", "code" => "540235100"},
      %{"name" => "樟木镇", "code" => "540235101"},
      %{"name" => "亚来乡", "code" => "540235200"},
      %{"name" => "锁作乡", "code" => "540235201"},
      %{"name" => "乃龙乡", "code" => "540235202"},
      %{"name" => "门布乡", "code" => "540235203"},
      %{"name" => "波绒乡", "code" => "540235204"}
    ]

  def next(input) when input == "萨嘎县" or input == "540236",
    do: [
      %{"name" => "加加镇", "code" => "540236100"},
      %{"name" => "昌果乡", "code" => "540236200"},
      %{"name" => "雄如乡", "code" => "540236201"},
      %{"name" => "拉藏乡", "code" => "540236202"},
      %{"name" => "如角乡", "code" => "540236203"},
      %{"name" => "达吉岭乡", "code" => "540236204"},
      %{"name" => "旦嘎乡", "code" => "540236205"},
      %{"name" => "夏如乡", "code" => "540236206"}
    ]

  def next(input) when input == "岗巴县" or input == "540237",
    do: [
      %{"name" => "岗巴镇", "code" => "540237100"},
      %{"name" => "昌龙乡", "code" => "540237200"},
      %{"name" => "直克乡", "code" => "540237201"},
      %{"name" => "孔玛乡", "code" => "540237202"},
      %{"name" => "龙中乡", "code" => "540237203"}
    ]

  def next(input) when input == "城关区" or input == "540102",
    do: [
      %{"name" => "八廓街道", "code" => "540102002"},
      %{"name" => "吉日街道", "code" => "540102003"},
      %{"name" => "吉崩岗街道", "code" => "540102004"},
      %{"name" => "扎细街道", "code" => "540102005"},
      %{"name" => "公德林街道", "code" => "540102006"},
      %{"name" => "嘎玛贡桑街道", "code" => "540102007"},
      %{"name" => "两岛街道", "code" => "540102008"},
      %{"name" => "金珠西路街道", "code" => "540102009"},
      %{"name" => "蔡公堂街道", "code" => "540102010"},
      %{"name" => "夺底街道", "code" => "540102011"},
      %{"name" => "娘热街道", "code" => "540102012"},
      %{"name" => "纳金街道", "code" => "540102013"}
    ]

  def next(input) when input == "堆龙德庆区" or input == "540103",
    do: [
      %{"name" => "东嘎街道", "code" => "540103001"},
      %{"name" => "乃琼街道", "code" => "540103002"},
      %{"name" => "羊达街道", "code" => "540103003"},
      %{"name" => "柳梧街道", "code" => "540103004"},
      %{"name" => "古荣镇", "code" => "540103102"},
      %{"name" => "马镇", "code" => "540103103"},
      %{"name" => "德庆镇", "code" => "540103104"}
    ]

  def next(input) when input == "达孜区" or input == "540104",
    do: [
      %{"name" => "德庆镇", "code" => "540104100"},
      %{"name" => "塔杰乡", "code" => "540104200"},
      %{"name" => "章多乡", "code" => "540104201"},
      %{"name" => "唐嘎乡", "code" => "540104202"},
      %{"name" => "雪乡", "code" => "540104203"},
      %{"name" => "帮堆乡", "code" => "540104204"}
    ]

  def next(input) when input == "林周县" or input == "540121",
    do: [
      %{"name" => "甘丹曲果镇", "code" => "540121100"},
      %{"name" => "春堆乡", "code" => "540121200"},
      %{"name" => "松盘乡", "code" => "540121201"},
      %{"name" => "强嘎乡", "code" => "540121202"},
      %{"name" => "卡孜乡", "code" => "540121203"},
      %{"name" => "边交林乡", "code" => "540121204"},
      %{"name" => "江热夏乡", "code" => "540121205"},
      %{"name" => "阿朗乡", "code" => "540121206"},
      %{"name" => "唐古乡", "code" => "540121207"},
      %{"name" => "旁多乡", "code" => "540121208"}
    ]

  def next(input) when input == "当雄县" or input == "540122",
    do: [
      %{"name" => "当曲卡镇", "code" => "540122100"},
      %{"name" => "羊八井镇", "code" => "540122101"},
      %{"name" => "格达乡", "code" => "540122200"},
      %{"name" => "宁中乡", "code" => "540122201"},
      %{"name" => "公塘乡", "code" => "540122202"},
      %{"name" => "龙仁乡", "code" => "540122203"},
      %{"name" => "乌玛塘乡", "code" => "540122204"},
      %{"name" => "纳木湖乡", "code" => "540122205"}
    ]

  def next(input) when input == "尼木县" or input == "540123",
    do: [
      %{"name" => "塔荣镇", "code" => "540123100"},
      %{"name" => "吞巴镇", "code" => "540123101"},
      %{"name" => "麻江乡", "code" => "540123200"},
      %{"name" => "普松乡", "code" => "540123201"},
      %{"name" => "卡如乡", "code" => "540123202"},
      %{"name" => "尼木乡", "code" => "540123203"},
      %{"name" => "续迈乡", "code" => "540123204"},
      %{"name" => "帕古乡", "code" => "540123205"}
    ]

  def next(input) when input == "曲水县" or input == "540124",
    do: [
      %{"name" => "曲水镇", "code" => "540124100"},
      %{"name" => "达嘎镇", "code" => "540124101"},
      %{"name" => "才纳乡", "code" => "540124201"},
      %{"name" => "南木乡", "code" => "540124202"},
      %{"name" => "聂当乡", "code" => "540124203"},
      %{"name" => "茶巴拉乡", "code" => "540124204"}
    ]

  def next(input) when input == "墨竹工卡县" or input == "540127",
    do: [
      %{"name" => "工卡镇", "code" => "540127100"},
      %{"name" => "扎雪乡", "code" => "540127200"},
      %{"name" => "门巴乡", "code" => "540127201"},
      %{"name" => "扎西岗乡", "code" => "540127202"},
      %{"name" => "日多乡", "code" => "540127203"},
      %{"name" => "尼玛江热乡", "code" => "540127204"},
      %{"name" => "甲玛乡", "code" => "540127205"},
      %{"name" => "唐加乡", "code" => "540127206"}
    ]

  def next(input) when input == "格尔木藏青工业园区" or input == "540171",
    do: [%{"name" => "藏青工业园乡", "code" => "540171400"}]

  def next(input) when input == "拉萨经济技术开发区" or input == "540172",
    do: [%{"name" => "拉萨市经济技术开发区管委会", "code" => "540172400"}]

  def next(input) when input == "西藏文化旅游创意园区" or input == "540173",
    do: [%{"name" => "西藏文化旅游创意园区", "code" => "540173400"}]

  def next(input) when input == "达孜工业园区" or input == "540174",
    do: [%{"name" => "达孜县工业园区", "code" => "540174400"}]

  def next(_), do: nil
end