defmodule ChinaAdminDivisions.Gen.Lv3x.M61 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "商州区" or input == "611002",
    do: [
      %{"name" => "城关街道", "code" => "611002001000"},
      %{"name" => "大赵峪街道", "code" => "611002002000"},
      %{"name" => "陈塬街道", "code" => "611002003000"},
      %{"name" => "刘湾街道", "code" => "611002004000"},
      %{"name" => "夜村镇", "code" => "611002101000"},
      %{"name" => "沙河子镇", "code" => "611002104000"},
      %{"name" => "杨峪河镇", "code" => "611002105000"},
      %{"name" => "金陵寺镇", "code" => "611002106000"},
      %{"name" => "黑山镇", "code" => "611002107000"},
      %{"name" => "杨斜镇", "code" => "611002108000"},
      %{"name" => "麻街镇", "code" => "611002109000"},
      %{"name" => "牧护关镇", "code" => "611002111000"},
      %{"name" => "大荆镇", "code" => "611002112000"},
      %{"name" => "腰市镇", "code" => "611002113000"},
      %{"name" => "板桥镇", "code" => "611002114000"},
      %{"name" => "北宽坪镇", "code" => "611002115000"},
      %{"name" => "三岔河镇", "code" => "611002119000"},
      %{"name" => "闫村镇", "code" => "611002121000"},
      %{"name" => "二龙山水库", "code" => "611002400000"},
      %{"name" => "南秦水库", "code" => "611002401000"},
      %{"name" => "二龙山国营林场", "code" => "611002402000"},
      %{"name" => "商丹循环工业园", "code" => "611002403000"},
      %{"name" => "荆河工业园", "code" => "611002404000"},
      %{"name" => "荆河农业示范园", "code" => "611002405000"},
      %{"name" => "高校园区", "code" => "611002406000"},
      %{"name" => "商洛职业技术学院", "code" => "611002407000"},
      %{"name" => "氟化硅产业业园", "code" => "611002408000"}
    ]

  def next(input) when input == "洛南县" or input == "611021",
    do: [
      %{"name" => "城关街道", "code" => "611021001000"},
      %{"name" => "四皓街道", "code" => "611021002000"},
      %{"name" => "景村镇", "code" => "611021101000"},
      %{"name" => "古城镇", "code" => "611021102000"},
      %{"name" => "三要镇", "code" => "611021103000"},
      %{"name" => "灵口镇", "code" => "611021104000"},
      %{"name" => "寺耳镇", "code" => "611021106000"},
      %{"name" => "巡检镇", "code" => "611021107000"},
      %{"name" => "石坡镇", "code" => "611021108000"},
      %{"name" => "石门镇", "code" => "611021109000"},
      %{"name" => "麻坪镇", "code" => "611021110000"},
      %{"name" => "洛源镇", "code" => "611021111000"},
      %{"name" => "保安镇", "code" => "611021112000"},
      %{"name" => "永丰镇", "code" => "611021114000"},
      %{"name" => "柏峪寺镇", "code" => "611021117000"},
      %{"name" => "高耀镇", "code" => "611021118000"}
    ]

  def next(input) when input == "丹凤县" or input == "611022",
    do: [
      %{"name" => "龙驹寨街道", "code" => "611022001000"},
      %{"name" => "庾岭镇", "code" => "611022101000"},
      %{"name" => "蔡川镇", "code" => "611022102000"},
      %{"name" => "峦庄镇", "code" => "611022103000"},
      %{"name" => "铁峪铺镇", "code" => "611022104000"},
      %{"name" => "武关镇", "code" => "611022105000"},
      %{"name" => "竹林关镇", "code" => "611022106000"},
      %{"name" => "土门镇", "code" => "611022107000"},
      %{"name" => "寺坪镇", "code" => "611022108000"},
      %{"name" => "商镇", "code" => "611022109000"},
      %{"name" => "棣花镇", "code" => "611022110000"},
      %{"name" => "花瓶子镇", "code" => "611022115000"}
    ]

  def next(input) when input == "商南县" or input == "611023",
    do: [
      %{"name" => "城关街道", "code" => "611023001000"},
      %{"name" => "富水镇", "code" => "611023101000"},
      %{"name" => "湘河镇", "code" => "611023102000"},
      %{"name" => "赵川镇", "code" => "611023104000"},
      %{"name" => "过风楼镇", "code" => "611023107000"},
      %{"name" => "试马镇", "code" => "611023108000"},
      %{"name" => "清油河镇", "code" => "611023109000"},
      %{"name" => "十里坪镇", "code" => "611023110000"},
      %{"name" => "金丝峡镇", "code" => "611023111000"},
      %{"name" => "青山镇", "code" => "611023112000"}
    ]

  def next(input) when input == "山阳县" or input == "611024",
    do: [
      %{"name" => "城关街道", "code" => "611024001000"},
      %{"name" => "十里铺街道", "code" => "611024002000"},
      %{"name" => "高坝店镇", "code" => "611024101000"},
      %{"name" => "天竺山镇", "code" => "611024102000"},
      %{"name" => "中村镇", "code" => "611024103000"},
      %{"name" => "银花镇", "code" => "611024104000"},
      %{"name" => "西照川镇", "code" => "611024105000"},
      %{"name" => "漫川关镇", "code" => "611024106000"},
      %{"name" => "南宽坪镇", "code" => "611024107000"},
      %{"name" => "户家塬镇", "code" => "611024108000"},
      %{"name" => "杨地镇", "code" => "611024109000"},
      %{"name" => "小河口镇", "code" => "611024111000"},
      %{"name" => "色河铺镇", "code" => "611024112000"},
      %{"name" => "板岩镇", "code" => "611024113000"},
      %{"name" => "延坪镇", "code" => "611024116000"},
      %{"name" => "两岭镇", "code" => "611024117000"},
      %{"name" => "王阎镇", "code" => "611024118000"},
      %{"name" => "法官镇", "code" => "611024121000"}
    ]

  def next(input) when input == "镇安县" or input == "611025",
    do: [
      %{"name" => "永乐街道", "code" => "611025001000"},
      %{"name" => "回龙镇", "code" => "611025101000"},
      %{"name" => "铁厂镇", "code" => "611025102000"},
      %{"name" => "大坪镇", "code" => "611025103000"},
      %{"name" => "米粮镇", "code" => "611025104000"},
      %{"name" => "茅坪回族镇", "code" => "611025105000"},
      %{"name" => "西口回族镇", "code" => "611025106000"},
      %{"name" => "高峰镇", "code" => "611025107000"},
      %{"name" => "青铜关镇", "code" => "611025108000"},
      %{"name" => "柴坪镇", "code" => "611025109000"},
      %{"name" => "达仁镇", "code" => "611025110000"},
      %{"name" => "木王镇", "code" => "611025111000"},
      %{"name" => "云盖寺镇", "code" => "611025113000"},
      %{"name" => "庙沟镇", "code" => "611025114000"},
      %{"name" => "月河镇", "code" => "611025117000"},
      %{"name" => "黑窑沟林厂", "code" => "611025400000"},
      %{"name" => "木王林厂", "code" => "611025401000"},
      %{"name" => "镇安县苗圃", "code" => "611025402000"}
    ]

  def next(input) when input == "柞水县" or input == "611026",
    do: [
      %{"name" => "乾佑街道", "code" => "611026001000"},
      %{"name" => "营盘镇", "code" => "611026101000"},
      %{"name" => "下梁镇", "code" => "611026102000"},
      %{"name" => "小岭镇", "code" => "611026104000"},
      %{"name" => "凤凰镇", "code" => "611026105000"},
      %{"name" => "红岩寺镇", "code" => "611026106000"},
      %{"name" => "曹坪镇", "code" => "611026107000"},
      %{"name" => "杏坪镇", "code" => "611026109000"},
      %{"name" => "瓦房口镇", "code" => "611026110000"}
    ]

  def next(input) when input == "汉滨区" or input == "610902",
    do: [
      %{"name" => "老城街道", "code" => "610902001000"},
      %{"name" => "新城街道", "code" => "610902002000"},
      %{"name" => "江北街道", "code" => "610902003000"},
      %{"name" => "建民街道", "code" => "610902004000"},
      %{"name" => "关庙镇", "code" => "610902100000"},
      %{"name" => "张滩镇", "code" => "610902101000"},
      %{"name" => "瀛湖镇", "code" => "610902102000"},
      %{"name" => "五里镇", "code" => "610902104000"},
      %{"name" => "恒口镇", "code" => "610902107000"},
      %{"name" => "吉河镇", "code" => "610902109000"},
      %{"name" => "流水镇", "code" => "610902110000"},
      %{"name" => "大竹园镇", "code" => "610902111000"},
      %{"name" => "洪山镇", "code" => "610902112000"},
      %{"name" => "茨沟镇", "code" => "610902114000"},
      %{"name" => "大河镇", "code" => "610902115000"},
      %{"name" => "沈坝镇", "code" => "610902116000"},
      %{"name" => "双龙镇", "code" => "610902117000"},
      %{"name" => "叶坪镇", "code" => "610902118000"},
      %{"name" => "中原镇", "code" => "610902119000"},
      %{"name" => "县河镇", "code" => "610902120000"},
      %{"name" => "紫荆镇", "code" => "610902121000"},
      %{"name" => "早阳镇", "code" => "610902122000"},
      %{"name" => "关家镇", "code" => "610902123000"},
      %{"name" => "石梯镇", "code" => "610902124000"},
      %{"name" => "坝河镇", "code" => "610902125000"},
      %{"name" => "牛蹄镇", "code" => "610902128000"},
      %{"name" => "晏坝镇", "code" => "610902130000"},
      %{"name" => "谭坝镇", "code" => "610902132000"}
    ]

  def next(input) when input == "汉阴县" or input == "610921",
    do: [
      %{"name" => "城关镇", "code" => "610921100000"},
      %{"name" => "涧池镇", "code" => "610921101000"},
      %{"name" => "蒲溪镇", "code" => "610921102000"},
      %{"name" => "平梁镇", "code" => "610921103000"},
      %{"name" => "双乳镇", "code" => "610921104000"},
      %{"name" => "铁佛寺镇", "code" => "610921105000"},
      %{"name" => "漩涡镇", "code" => "610921107000"},
      %{"name" => "汉阳镇", "code" => "610921108000"},
      %{"name" => "双河口镇", "code" => "610921110000"},
      %{"name" => "观音河镇", "code" => "610921112000"}
    ]

  def next(input) when input == "石泉县" or input == "610922",
    do: [
      %{"name" => "城关镇", "code" => "610922100000"},
      %{"name" => "饶峰镇", "code" => "610922101000"},
      %{"name" => "两河镇", "code" => "610922102000"},
      %{"name" => "迎丰镇", "code" => "610922103000"},
      %{"name" => "池河镇", "code" => "610922104000"},
      %{"name" => "后柳镇", "code" => "610922105000"},
      %{"name" => "喜河镇", "code" => "610922106000"},
      %{"name" => "熨斗镇", "code" => "610922107000"},
      %{"name" => "云雾山镇", "code" => "610922108000"},
      %{"name" => "中池镇", "code" => "610922109000"},
      %{"name" => "曾溪镇", "code" => "610922110000"}
    ]

  def next(input) when input == "宁陕县" or input == "610923",
    do: [
      %{"name" => "城关镇", "code" => "610923100000"},
      %{"name" => "四亩地镇", "code" => "610923101000"},
      %{"name" => "江口镇", "code" => "610923102000"},
      %{"name" => "广货街镇", "code" => "610923104000"},
      %{"name" => "龙王镇", "code" => "610923105000"},
      %{"name" => "筒车湾镇", "code" => "610923106000"},
      %{"name" => "金川镇", "code" => "610923108000"},
      %{"name" => "皇冠镇", "code" => "610923109000"},
      %{"name" => "太山庙镇", "code" => "610923110000"},
      %{"name" => "梅子镇", "code" => "610923111000"},
      %{"name" => "新场镇", "code" => "610923113000"}
    ]

  def next(input) when input == "紫阳县" or input == "610924",
    do: [
      %{"name" => "城关镇", "code" => "610924100000"},
      %{"name" => "蒿坪镇", "code" => "610924101000"},
      %{"name" => "汉王镇", "code" => "610924102000"},
      %{"name" => "焕古镇", "code" => "610924103000"},
      %{"name" => "向阳镇", "code" => "610924104000"},
      %{"name" => "洞河镇", "code" => "610924105000"},
      %{"name" => "洄水镇", "code" => "610924106000"},
      %{"name" => "双桥镇", "code" => "610924108000"},
      %{"name" => "高桥镇", "code" => "610924109000"},
      %{"name" => "红椿镇", "code" => "610924110000"},
      %{"name" => "高滩镇", "code" => "610924111000"},
      %{"name" => "毛坝镇", "code" => "610924112000"},
      %{"name" => "瓦庙镇", "code" => "610924113000"},
      %{"name" => "麻柳镇", "code" => "610924114000"},
      %{"name" => "双安镇", "code" => "610924115000"},
      %{"name" => "东木镇", "code" => "610924116000"},
      %{"name" => "界岭镇", "code" => "610924117000"}
    ]

  def next(input) when input == "岚皋县" or input == "610925",
    do: [
      %{"name" => "城关镇", "code" => "610925100000"},
      %{"name" => "佐龙镇", "code" => "610925101000"},
      %{"name" => "滔河镇", "code" => "610925103000"},
      %{"name" => "官元镇", "code" => "610925104000"},
      %{"name" => "石门镇", "code" => "610925105000"},
      %{"name" => "民主镇", "code" => "610925106000"},
      %{"name" => "大道河镇", "code" => "610925107000"},
      %{"name" => "堰门镇", "code" => "610925109000"},
      %{"name" => "蔺河镇", "code" => "610925111000"},
      %{"name" => "四季镇", "code" => "610925112000"},
      %{"name" => "孟石岭镇", "code" => "610925114000"},
      %{"name" => "南宫山镇", "code" => "610925115000"}
    ]

  def next(input) when input == "平利县" or input == "610926",
    do: [
      %{"name" => "城关镇", "code" => "610926100000"},
      %{"name" => "兴隆镇", "code" => "610926101000"},
      %{"name" => "老县镇", "code" => "610926102000"},
      %{"name" => "大贵镇", "code" => "610926103000"},
      %{"name" => "三阳镇", "code" => "610926104000"},
      %{"name" => "洛河镇", "code" => "610926105000"},
      %{"name" => "广佛镇", "code" => "610926106000"},
      %{"name" => "八仙镇", "code" => "610926107000"},
      %{"name" => "长安镇", "code" => "610926108000"},
      %{"name" => "正阳镇", "code" => "610926109000"},
      %{"name" => "西河镇", "code" => "610926110000"}
    ]

  def next(input) when input == "镇坪县" or input == "610927",
    do: [
      %{"name" => "城关镇", "code" => "610927100000"},
      %{"name" => "曾家镇", "code" => "610927101000"},
      %{"name" => "牛头店镇", "code" => "610927102000"},
      %{"name" => "钟宝镇", "code" => "610927103000"},
      %{"name" => "上竹镇", "code" => "610927105000"},
      %{"name" => "华坪镇", "code" => "610927106000"},
      %{"name" => "曙坪镇", "code" => "610927108000"}
    ]

  def next(input) when input == "白河县" or input == "610929",
    do: [
      %{"name" => "城关镇", "code" => "610929100000"},
      %{"name" => "中厂镇", "code" => "610929101000"},
      %{"name" => "构朳镇", "code" => "610929102000"},
      %{"name" => "卡子镇", "code" => "610929103000"},
      %{"name" => "茅坪镇", "code" => "610929104000"},
      %{"name" => "宋家镇", "code" => "610929105000"},
      %{"name" => "西营镇", "code" => "610929106000"},
      %{"name" => "仓上镇", "code" => "610929107000"},
      %{"name" => "冷水镇", "code" => "610929108000"},
      %{"name" => "双丰镇", "code" => "610929109000"},
      %{"name" => "麻虎镇", "code" => "610929110000"}
    ]

  def next(input) when input == "旬阳市" or input == "610981",
    do: [
      %{"name" => "城关镇", "code" => "610981100000"},
      %{"name" => "棕溪镇", "code" => "610981101000"},
      %{"name" => "关口镇", "code" => "610981102000"},
      %{"name" => "蜀河镇", "code" => "610981103000"},
      %{"name" => "双河镇", "code" => "610981104000"},
      %{"name" => "小河镇", "code" => "610981105000"},
      %{"name" => "赵湾镇", "code" => "610981106000"},
      %{"name" => "麻坪镇", "code" => "610981107000"},
      %{"name" => "甘溪镇", "code" => "610981108000"},
      %{"name" => "白柳镇", "code" => "610981109000"},
      %{"name" => "吕河镇", "code" => "610981110000"},
      %{"name" => "神河镇", "code" => "610981111000"},
      %{"name" => "铜钱关镇", "code" => "610981112000"},
      %{"name" => "段家河镇", "code" => "610981113000"},
      %{"name" => "仙河镇", "code" => "610981114000"},
      %{"name" => "金寨镇", "code" => "610981115000"},
      %{"name" => "桐木镇", "code" => "610981116000"},
      %{"name" => "构元镇", "code" => "610981117000"},
      %{"name" => "石门镇", "code" => "610981118000"},
      %{"name" => "红军镇", "code" => "610981119000"},
      %{"name" => "仁河口镇", "code" => "610981120000"}
    ]

  def next(input) when input == "榆阳区" or input == "610802",
    do: [
      %{"name" => "鼓楼街道", "code" => "610802001000"},
      %{"name" => "青山路街道", "code" => "610802002000"},
      %{"name" => "上郡路街道", "code" => "610802003000"},
      %{"name" => "新明楼街道", "code" => "610802004000"},
      %{"name" => "驼峰路街道", "code" => "610802005000"},
      %{"name" => "崇文路街道", "code" => "610802006000"},
      %{"name" => "航宇路街道", "code" => "610802007000"},
      %{"name" => "长城路街道", "code" => "610802008000"},
      %{"name" => "金沙路街道", "code" => "610802009000"},
      %{"name" => "朝阳路街道", "code" => "610802010000"},
      %{"name" => "沙河路街道", "code" => "610802011000"},
      %{"name" => "明珠路街道", "code" => "610802012000"},
      %{"name" => "鱼河镇", "code" => "610802100000"},
      %{"name" => "上盐湾镇", "code" => "610802101000"},
      %{"name" => "镇川镇", "code" => "610802102000"},
      %{"name" => "麻黄梁镇", "code" => "610802105000"},
      %{"name" => "牛家梁镇", "code" => "610802106000"},
      %{"name" => "金鸡滩镇", "code" => "610802107000"},
      %{"name" => "马合镇", "code" => "610802108000"},
      %{"name" => "巴拉素镇", "code" => "610802109000"},
      %{"name" => "鱼河峁镇", "code" => "610802111000"},
      %{"name" => "青云镇", "code" => "610802112000"},
      %{"name" => "古塔镇", "code" => "610802113000"},
      %{"name" => "大河塔镇", "code" => "610802114000"},
      %{"name" => "小纪汗镇", "code" => "610802115000"},
      %{"name" => "芹河镇", "code" => "610802116000"},
      %{"name" => "孟家湾乡", "code" => "610802205000"},
      %{"name" => "小壕兔乡", "code" => "610802206000"},
      %{"name" => "岔河则乡", "code" => "610802207000"},
      %{"name" => "补浪河乡", "code" => "610802208000"},
      %{"name" => "红石桥乡", "code" => "610802209000"}
    ]

  def next(input) when input == "横山区" or input == "610803",
    do: [
      %{"name" => "城关街道", "code" => "610803001000"},
      %{"name" => "怀远街道", "code" => "610803002000"},
      %{"name" => "夏州街道", "code" => "610803003000"},
      %{"name" => "怀仁路街道", "code" => "610803004000"},
      %{"name" => "崇德路街道", "code" => "610803005000"},
      %{"name" => "石湾镇", "code" => "610803101000"},
      %{"name" => "高镇", "code" => "610803102000"},
      %{"name" => "武镇", "code" => "610803103000"},
      %{"name" => "党岔镇", "code" => "610803104000"},
      %{"name" => "响水镇", "code" => "610803105000"},
      %{"name" => "波罗镇", "code" => "610803106000"},
      %{"name" => "殿市镇", "code" => "610803107000"},
      %{"name" => "塔湾镇", "code" => "610803108000"},
      %{"name" => "赵石畔镇", "code" => "610803109000"},
      %{"name" => "魏家楼镇", "code" => "610803110000"},
      %{"name" => "韩岔镇", "code" => "610803111000"},
      %{"name" => "白界镇", "code" => "610803112000"},
      %{"name" => "雷龙湾镇", "code" => "610803113000"}
    ]

  def next(input) when input == "府谷县" or input == "610822",
    do: [
      %{"name" => "府谷镇", "code" => "610822100000"},
      %{"name" => "黄甫镇", "code" => "610822101000"},
      %{"name" => "哈镇", "code" => "610822103000"},
      %{"name" => "庙沟门镇", "code" => "610822104000"},
      %{"name" => "新民镇", "code" => "610822105000"},
      %{"name" => "孤山镇", "code" => "610822106000"},
      %{"name" => "清水镇", "code" => "610822107000"},
      %{"name" => "大昌汗镇", "code" => "610822108000"},
      %{"name" => "古城镇", "code" => "610822109000"},
      %{"name" => "三道沟镇", "code" => "610822110000"},
      %{"name" => "老高川镇", "code" => "610822111000"},
      %{"name" => "武家庄镇", "code" => "610822112000"},
      %{"name" => "木瓜镇", "code" => "610822113000"},
      %{"name" => "田家寨镇", "code" => "610822114000"}
    ]

  def next(input) when input == "靖边县" or input == "610824",
    do: [
      %{"name" => "张家畔街道", "code" => "610824001000"},
      %{"name" => "东坑镇", "code" => "610824101000"},
      %{"name" => "青阳岔镇", "code" => "610824102000"},
      %{"name" => "宁条梁镇", "code" => "610824103000"},
      %{"name" => "周河镇", "code" => "610824104000"},
      %{"name" => "红墩界镇", "code" => "610824105000"},
      %{"name" => "杨桥畔镇", "code" => "610824106000"},
      %{"name" => "王渠则镇", "code" => "610824107000"},
      %{"name" => "中山涧镇", "code" => "610824108000"},
      %{"name" => "杨米涧镇", "code" => "610824109000"},
      %{"name" => "天赐湾镇", "code" => "610824110000"},
      %{"name" => "小河镇", "code" => "610824111000"},
      %{"name" => "龙洲镇", "code" => "610824112000"},
      %{"name" => "黄蒿界镇", "code" => "610824113000"},
      %{"name" => "海则滩镇", "code" => "610824114000"},
      %{"name" => "席麻湾镇", "code" => "610824115000"},
      %{"name" => "镇靖镇", "code" => "610824116000"}
    ]

  def next(input) when input == "定边县" or input == "610825",
    do: [
      %{"name" => "定边街道", "code" => "610825001000"},
      %{"name" => "贺圈镇", "code" => "610825101000"},
      %{"name" => "红柳沟镇", "code" => "610825102000"},
      %{"name" => "砖井镇", "code" => "610825103000"},
      %{"name" => "白泥井镇", "code" => "610825104000"},
      %{"name" => "安边镇", "code" => "610825105000"},
      %{"name" => "堆子梁镇", "code" => "610825106000"},
      %{"name" => "白湾子镇", "code" => "610825107000"},
      %{"name" => "姬塬镇", "code" => "610825108000"},
      %{"name" => "杨井镇", "code" => "610825109000"},
      %{"name" => "新安边镇", "code" => "610825110000"},
      %{"name" => "张崾先镇", "code" => "610825111000"},
      %{"name" => "樊学镇", "code" => "610825112000"},
      %{"name" => "盐场堡镇", "code" => "610825113000"},
      %{"name" => "郝滩镇", "code" => "610825114000"},
      %{"name" => "石洞沟镇", "code" => "610825115000"},
      %{"name" => "冯地坑镇", "code" => "610825116000"},
      %{"name" => "油房庄乡", "code" => "610825204000"},
      %{"name" => "学庄乡", "code" => "610825210000"}
    ]

  def next(input) when input == "绥德县" or input == "610826",
    do: [
      %{"name" => "名州镇", "code" => "610826100000"},
      %{"name" => "薛家峁镇", "code" => "610826101000"},
      %{"name" => "崔家湾镇", "code" => "610826102000"},
      %{"name" => "定仙墕镇", "code" => "610826103000"},
      %{"name" => "枣林坪镇", "code" => "610826104000"},
      %{"name" => "义合镇", "code" => "610826105000"},
      %{"name" => "吉镇", "code" => "610826106000"},
      %{"name" => "薛家河镇", "code" => "610826107000"},
      %{"name" => "四十里铺镇", "code" => "610826108000"},
      %{"name" => "石家湾镇", "code" => "610826109000"},
      %{"name" => "田庄镇", "code" => "610826110000"},
      %{"name" => "中角镇", "code" => "610826111000"},
      %{"name" => "满堂川镇", "code" => "610826112000"},
      %{"name" => "张家砭镇", "code" => "610826113000"},
      %{"name" => "白家硷镇", "code" => "610826114000"}
    ]

  def next(input) when input == "米脂县" or input == "610827",
    do: [
      %{"name" => "银州街道", "code" => "610827001000"},
      %{"name" => "桃镇", "code" => "610827101000"},
      %{"name" => "龙镇", "code" => "610827102000"},
      %{"name" => "杨家沟镇", "code" => "610827103000"},
      %{"name" => "杜家石沟镇", "code" => "610827104000"},
      %{"name" => "沙家店镇", "code" => "610827105000"},
      %{"name" => "印斗镇", "code" => "610827106000"},
      %{"name" => "郭兴庄镇", "code" => "610827107000"},
      %{"name" => "城郊镇", "code" => "610827108000"}
    ]

  def next(input) when input == "佳县" or input == "610828",
    do: [
      %{"name" => "佳州街道", "code" => "610828001000"},
      %{"name" => "坑镇", "code" => "610828101000"},
      %{"name" => "店镇", "code" => "610828102000"},
      %{"name" => "乌镇", "code" => "610828103000"},
      %{"name" => "金明寺镇", "code" => "610828104000"},
      %{"name" => "通镇", "code" => "610828105000"},
      %{"name" => "王家砭镇", "code" => "610828106000"},
      %{"name" => "方塌镇", "code" => "610828107000"},
      %{"name" => "朱家坬镇", "code" => "610828108000"},
      %{"name" => "螅镇", "code" => "610828109000"},
      %{"name" => "朱官寨镇", "code" => "610828110000"},
      %{"name" => "刘国具镇", "code" => "610828111000"},
      %{"name" => "木头峪镇", "code" => "610828112000"}
    ]

  def next(input) when input == "吴堡县" or input == "610829",
    do: [
      %{"name" => "宋家川街道", "code" => "610829001000"},
      %{"name" => "辛家沟镇", "code" => "610829101000"},
      %{"name" => "郭家沟镇", "code" => "610829102000"},
      %{"name" => "寇家塬镇", "code" => "610829103000"},
      %{"name" => "岔上镇", "code" => "610829104000"},
      %{"name" => "张家山镇", "code" => "610829105000"}
    ]

  def next(input) when input == "清涧县" or input == "610830",
    do: [
      %{"name" => "宽州镇", "code" => "610830100000"},
      %{"name" => "石咀驿镇", "code" => "610830101000"},
      %{"name" => "折家坪镇", "code" => "610830102000"},
      %{"name" => "玉家河镇", "code" => "610830103000"},
      %{"name" => "高杰村镇", "code" => "610830104000"},
      %{"name" => "李家塔镇", "code" => "610830105000"},
      %{"name" => "店则沟镇", "code" => "610830106000"},
      %{"name" => "解家沟镇", "code" => "610830107000"},
      %{"name" => "下廿里铺镇", "code" => "610830108000"}
    ]

  def next(input) when input == "子洲县" or input == "610831",
    do: [
      %{"name" => "双湖峪街道", "code" => "610831001000"},
      %{"name" => "何家集镇", "code" => "610831101000"},
      %{"name" => "老君殿镇", "code" => "610831102000"},
      %{"name" => "裴家湾镇", "code" => "610831103000"},
      %{"name" => "苗家坪镇", "code" => "610831104000"},
      %{"name" => "三川口镇", "code" => "610831105000"},
      %{"name" => "马蹄沟镇", "code" => "610831106000"},
      %{"name" => "周家硷镇", "code" => "610831107000"},
      %{"name" => "电市镇", "code" => "610831108000"},
      %{"name" => "砖庙镇", "code" => "610831109000"},
      %{"name" => "淮宁湾镇", "code" => "610831110000"},
      %{"name" => "马岔镇", "code" => "610831111000"},
      %{"name" => "驼耳巷乡", "code" => "610831200000"}
    ]

  def next(input) when input == "神木市" or input == "610881",
    do: [
      %{"name" => "滨河新区街道", "code" => "610881001000"},
      %{"name" => "西沙街道", "code" => "610881002000"},
      %{"name" => "麟州街道", "code" => "610881003000"},
      %{"name" => "迎宾路街道", "code" => "610881004000"},
      %{"name" => "永兴街道", "code" => "610881005000"},
      %{"name" => "西沟街道", "code" => "610881006000"},
      %{"name" => "高家堡镇", "code" => "610881101000"},
      %{"name" => "店塔镇", "code" => "610881102000"},
      %{"name" => "孙家岔镇", "code" => "610881103000"},
      %{"name" => "大柳塔镇", "code" => "610881104000"},
      %{"name" => "花石崖镇", "code" => "610881105000"},
      %{"name" => "中鸡镇", "code" => "610881106000"},
      %{"name" => "贺家川镇", "code" => "610881107000"},
      %{"name" => "尔林兔镇", "code" => "610881108000"},
      %{"name" => "万镇", "code" => "610881109000"},
      %{"name" => "大保当镇", "code" => "610881110000"},
      %{"name" => "马镇", "code" => "610881111000"},
      %{"name" => "栏杆堡镇", "code" => "610881112000"},
      %{"name" => "沙峁镇", "code" => "610881113000"},
      %{"name" => "锦界镇", "code" => "610881114000"}
    ]

  def next(input) when input == "汉台区" or input == "610702",
    do: [
      %{"name" => "北关街道", "code" => "610702001000"},
      %{"name" => "东大街街道", "code" => "610702002000"},
      %{"name" => "汉中路街道", "code" => "610702003000"},
      %{"name" => "中山街街道", "code" => "610702004000"},
      %{"name" => "东关街道", "code" => "610702005000"},
      %{"name" => "鑫源街道", "code" => "610702006000"},
      %{"name" => "七里街道", "code" => "610702008000"},
      %{"name" => "龙江街道", "code" => "610702009000"},
      %{"name" => "铺镇", "code" => "610702100000"},
      %{"name" => "武乡镇", "code" => "610702101000"},
      %{"name" => "河东店镇", "code" => "610702102000"},
      %{"name" => "宗营镇", "code" => "610702104000"},
      %{"name" => "老君镇", "code" => "610702105000"},
      %{"name" => "汉王镇", "code" => "610702106000"},
      %{"name" => "徐望镇", "code" => "610702107000"}
    ]

  def next(input) when input == "南郑区" or input == "610703",
    do: [
      %{"name" => "汉山街道", "code" => "610703001000"},
      %{"name" => "中所营街道", "code" => "610703002000"},
      %{"name" => "圣水镇", "code" => "610703101000"},
      %{"name" => "大河坎镇", "code" => "610703102000"},
      %{"name" => "协税镇", "code" => "610703103000"},
      %{"name" => "梁山镇", "code" => "610703104000"},
      %{"name" => "阳春镇", "code" => "610703105000"},
      %{"name" => "高台镇", "code" => "610703106000"},
      %{"name" => "新集镇", "code" => "610703107000"},
      %{"name" => "濂水镇", "code" => "610703108000"},
      %{"name" => "黄官镇", "code" => "610703109000"},
      %{"name" => "青树镇", "code" => "610703110000"},
      %{"name" => "红庙镇", "code" => "610703111000"},
      %{"name" => "牟家坝镇", "code" => "610703112000"},
      %{"name" => "法镇", "code" => "610703113000"},
      %{"name" => "湘水镇", "code" => "610703114000"},
      %{"name" => "小南海镇", "code" => "610703115000"},
      %{"name" => "碑坝镇", "code" => "610703116000"},
      %{"name" => "黎坪镇", "code" => "610703117000"},
      %{"name" => "福成镇", "code" => "610703118000"},
      %{"name" => "两河镇", "code" => "610703119000"},
      %{"name" => "胡家营镇", "code" => "610703120000"}
    ]

  def next(input) when input == "城固县" or input == "610722",
    do: [
      %{"name" => "博望街道", "code" => "610722001000"},
      %{"name" => "莲花街道", "code" => "610722002000"},
      %{"name" => "龙头镇", "code" => "610722101000"},
      %{"name" => "沙河营镇", "code" => "610722102000"},
      %{"name" => "文川镇", "code" => "610722103000"},
      %{"name" => "柳林镇", "code" => "610722104000"},
      %{"name" => "老庄镇", "code" => "610722105000"},
      %{"name" => "桔园镇", "code" => "610722107000"},
      %{"name" => "原公镇", "code" => "610722108000"},
      %{"name" => "上元观镇", "code" => "610722109000"},
      %{"name" => "天明镇", "code" => "610722110000"},
      %{"name" => "二里镇", "code" => "610722111000"},
      %{"name" => "五堵镇", "code" => "610722112000"},
      %{"name" => "双溪镇", "code" => "610722114000"},
      %{"name" => "小河镇", "code" => "610722116000"},
      %{"name" => "董家营镇", "code" => "610722119000"},
      %{"name" => "三合镇", "code" => "610722120000"}
    ]

  def next(input) when input == "洋县" or input == "610723",
    do: [
      %{"name" => "洋州街道", "code" => "610723001000"},
      %{"name" => "纸坊街道", "code" => "610723002000"},
      %{"name" => "戚氏街道", "code" => "610723003000"},
      %{"name" => "龙亭镇", "code" => "610723103000"},
      %{"name" => "谢村镇", "code" => "610723104000"},
      %{"name" => "马畅镇", "code" => "610723105000"},
      %{"name" => "溢水镇", "code" => "610723107000"},
      %{"name" => "磨子桥镇", "code" => "610723108000"},
      %{"name" => "黄家营镇", "code" => "610723109000"},
      %{"name" => "黄安镇", "code" => "610723110000"},
      %{"name" => "黄金峡镇", "code" => "610723111000"},
      %{"name" => "槐树关镇", "code" => "610723112000"},
      %{"name" => "金水镇", "code" => "610723113000"},
      %{"name" => "华阳镇", "code" => "610723114000"},
      %{"name" => "茅坪镇", "code" => "610723115000"},
      %{"name" => "八里关镇", "code" => "610723119000"},
      %{"name" => "桑溪镇", "code" => "610723120000"},
      %{"name" => "关帝镇", "code" => "610723121000"}
    ]

  def next(input) when input == "西乡县" or input == "610724",
    do: [
      %{"name" => "城北街道", "code" => "610724001000"},
      %{"name" => "城南街道", "code" => "610724002000"},
      %{"name" => "杨河镇", "code" => "610724101000"},
      %{"name" => "柳树镇", "code" => "610724102000"},
      %{"name" => "沙河镇", "code" => "610724103000"},
      %{"name" => "私渡镇", "code" => "610724104000"},
      %{"name" => "桑园镇", "code" => "610724105000"},
      %{"name" => "白龙塘镇", "code" => "610724106000"},
      %{"name" => "峡口镇", "code" => "610724108000"},
      %{"name" => "堰口镇", "code" => "610724109000"},
      %{"name" => "茶镇", "code" => "610724110000"},
      %{"name" => "高川镇", "code" => "610724111000"},
      %{"name" => "两河口镇", "code" => "610724112000"},
      %{"name" => "大河镇", "code" => "610724114000"},
      %{"name" => "骆家坝镇", "code" => "610724116000"},
      %{"name" => "子午镇", "code" => "610724117000"},
      %{"name" => "白勉峡镇", "code" => "610724118000"}
    ]

  def next(input) when input == "勉县" or input == "610725",
    do: [
      %{"name" => "勉阳街道", "code" => "610725001000"},
      %{"name" => "武侯镇", "code" => "610725101000"},
      %{"name" => "周家山镇", "code" => "610725102000"},
      %{"name" => "同沟寺镇", "code" => "610725103000"},
      %{"name" => "新街子镇", "code" => "610725105000"},
      %{"name" => "老道寺镇", "code" => "610725106000"},
      %{"name" => "褒城镇", "code" => "610725107000"},
      %{"name" => "金泉镇", "code" => "610725109000"},
      %{"name" => "定军山镇", "code" => "610725110000"},
      %{"name" => "温泉镇", "code" => "610725111000"},
      %{"name" => "元墩镇", "code" => "610725112000"},
      %{"name" => "阜川镇", "code" => "610725113000"},
      %{"name" => "新铺镇", "code" => "610725114000"},
      %{"name" => "茶店镇", "code" => "610725116000"},
      %{"name" => "镇川镇", "code" => "610725117000"},
      %{"name" => "漆树坝镇", "code" => "610725118000"},
      %{"name" => "张家河镇", "code" => "610725119000"},
      %{"name" => "长沟河镇", "code" => "610725120000"}
    ]

  def next(input) when input == "宁强县" or input == "610726",
    do: [
      %{"name" => "汉源街道", "code" => "610726001000"},
      %{"name" => "高寨子街道", "code" => "610726002000"},
      %{"name" => "大安镇", "code" => "610726102000"},
      %{"name" => "代家坝镇", "code" => "610726103000"},
      %{"name" => "阳平关镇", "code" => "610726104000"},
      %{"name" => "燕子砭镇", "code" => "610726105000"},
      %{"name" => "广坪镇", "code" => "610726106000"},
      %{"name" => "青木川镇", "code" => "610726107000"},
      %{"name" => "毛坝河镇", "code" => "610726108000"},
      %{"name" => "铁锁关镇", "code" => "610726109000"},
      %{"name" => "胡家坝镇", "code" => "610726110000"},
      %{"name" => "巴山镇", "code" => "610726111000"},
      %{"name" => "巨亭镇", "code" => "610726112000"},
      %{"name" => "舒家坝镇", "code" => "610726113000"},
      %{"name" => "太阳岭镇", "code" => "610726117000"},
      %{"name" => "安乐河镇", "code" => "610726118000"},
      %{"name" => "二郎坝镇", "code" => "610726119000"},
      %{"name" => "禅家岩镇", "code" => "610726120000"}
    ]

  def next(input) when input == "略阳县" or input == "610727",
    do: [
      %{"name" => "兴州街道", "code" => "610727001000"},
      %{"name" => "横现河街道", "code" => "610727002000"},
      %{"name" => "接官亭镇", "code" => "610727101000"},
      %{"name" => "西淮坝镇", "code" => "610727102000"},
      %{"name" => "两河口镇", "code" => "610727103000"},
      %{"name" => "金家河镇", "code" => "610727104000"},
      %{"name" => "徐家坪镇", "code" => "610727105000"},
      %{"name" => "白水江镇", "code" => "610727106000"},
      %{"name" => "硖口驿镇", "code" => "610727107000"},
      %{"name" => "马蹄湾镇", "code" => "610727108000"},
      %{"name" => "乐素河镇", "code" => "610727109000"},
      %{"name" => "郭镇", "code" => "610727110000"},
      %{"name" => "黑河镇", "code" => "610727111000"},
      %{"name" => "白雀寺镇", "code" => "610727112000"},
      %{"name" => "仙台坝镇", "code" => "610727113000"},
      %{"name" => "五龙洞镇", "code" => "610727114000"},
      %{"name" => "观音寺镇", "code" => "610727115000"}
    ]

  def next(input) when input == "镇巴县" or input == "610728",
    do: [
      %{"name" => "泾洋街道", "code" => "610728001000"},
      %{"name" => "渔渡镇", "code" => "610728101000"},
      %{"name" => "盐场镇", "code" => "610728102000"},
      %{"name" => "观音镇", "code" => "610728103000"},
      %{"name" => "巴庙镇", "code" => "610728104000"},
      %{"name" => "兴隆镇", "code" => "610728105000"},
      %{"name" => "长岭镇", "code" => "610728106000"},
      %{"name" => "三元镇", "code" => "610728107000"},
      %{"name" => "简池镇", "code" => "610728108000"},
      %{"name" => "碾子镇", "code" => "610728109000"},
      %{"name" => "小洋镇", "code" => "610728110000"},
      %{"name" => "青水镇", "code" => "610728111000"},
      %{"name" => "赤南镇", "code" => "610728112000"},
      %{"name" => "平安镇", "code" => "610728113000"},
      %{"name" => "杨家河镇", "code" => "610728114000"},
      %{"name" => "巴山镇", "code" => "610728115000"},
      %{"name" => "黎坝镇", "code" => "610728116000"},
      %{"name" => "仁村镇", "code" => "610728117000"},
      %{"name" => "大池镇", "code" => "610728118000"},
      %{"name" => "永乐镇", "code" => "610728120000"}
    ]

  def next(input) when input == "留坝县" or input == "610729",
    do: [
      %{"name" => "紫柏街道", "code" => "610729001000"},
      %{"name" => "马道镇", "code" => "610729101000"},
      %{"name" => "武关驿镇", "code" => "610729102000"},
      %{"name" => "留侯镇", "code" => "610729103000"},
      %{"name" => "江口镇", "code" => "610729104000"},
      %{"name" => "玉皇庙镇", "code" => "610729105000"},
      %{"name" => "火烧店镇", "code" => "610729106000"},
      %{"name" => "青桥驿镇", "code" => "610729107000"}
    ]

  def next(input) when input == "佛坪县" or input == "610730",
    do: [
      %{"name" => "袁家庄街道", "code" => "610730001000"},
      %{"name" => "陈家坝镇", "code" => "610730101000"},
      %{"name" => "大河坝镇", "code" => "610730102000"},
      %{"name" => "西岔河镇", "code" => "610730103000"},
      %{"name" => "岳坝镇", "code" => "610730104000"},
      %{"name" => "长角坝镇", "code" => "610730105000"},
      %{"name" => "石墩河镇", "code" => "610730106000"}
    ]

  def next(input) when input == "宝塔区" or input == "610602",
    do: [
      %{"name" => "宝塔山街道", "code" => "610602001000"},
      %{"name" => "南市街道", "code" => "610602002000"},
      %{"name" => "凤凰山街道", "code" => "610602003000"},
      %{"name" => "枣园街道", "code" => "610602004000"},
      %{"name" => "桥沟街道", "code" => "610602005000"},
      %{"name" => "新城街道", "code" => "610602006000"},
      %{"name" => "河庄坪镇", "code" => "610602102000"},
      %{"name" => "李渠镇", "code" => "610602103000"},
      %{"name" => "姚店镇", "code" => "610602104000"},
      %{"name" => "青化砭镇", "code" => "610602105000"},
      %{"name" => "蟠龙镇", "code" => "610602106000"},
      %{"name" => "柳林镇", "code" => "610602107000"},
      %{"name" => "南泥湾镇", "code" => "610602108000"},
      %{"name" => "临镇", "code" => "610602109000"},
      %{"name" => "甘谷驿镇", "code" => "610602110000"},
      %{"name" => "万花山镇", "code" => "610602111000"},
      %{"name" => "川口镇", "code" => "610602112000"},
      %{"name" => "麻洞川镇", "code" => "610602113000"},
      %{"name" => "冯庄乡", "code" => "610602202000"}
    ]

  def next(input) when input == "安塞区" or input == "610603",
    do: [
      %{"name" => "真武洞街道", "code" => "610603001000"},
      %{"name" => "金明街道", "code" => "610603002000"},
      %{"name" => "白坪街道", "code" => "610603003000"},
      %{"name" => "砖窑湾镇", "code" => "610603101000"},
      %{"name" => "沿河湾镇", "code" => "610603102000"},
      %{"name" => "招安镇", "code" => "610603103000"},
      %{"name" => "化子坪镇", "code" => "610603104000"},
      %{"name" => "坪桥镇", "code" => "610603105000"},
      %{"name" => "建华镇", "code" => "610603106000"},
      %{"name" => "高桥镇", "code" => "610603107000"},
      %{"name" => "镰刀湾镇", "code" => "610603108000"}
    ]

  def next(input) when input == "延长县" or input == "610621",
    do: [
      %{"name" => "七里村街道", "code" => "610621001000"},
      %{"name" => "黑家堡镇", "code" => "610621101000"},
      %{"name" => "郑庄镇", "code" => "610621102000"},
      %{"name" => "张家滩镇", "code" => "610621103000"},
      %{"name" => "交口镇", "code" => "610621104000"},
      %{"name" => "雷赤镇", "code" => "610621106000"},
      %{"name" => "罗子山镇", "code" => "610621107000"},
      %{"name" => "安沟镇", "code" => "610621108000"}
    ]

  def next(input) when input == "延川县" or input == "610622",
    do: [
      %{"name" => "大禹街道", "code" => "610622001000"},
      %{"name" => "永坪镇", "code" => "610622101000"},
      %{"name" => "延水关镇", "code" => "610622102000"},
      %{"name" => "文安驿镇", "code" => "610622103000"},
      %{"name" => "杨家圪台镇", "code" => "610622104000"},
      %{"name" => "贾家坪镇", "code" => "610622105000"},
      %{"name" => "关庄镇", "code" => "610622107000"},
      %{"name" => "乾坤湾镇", "code" => "610622108000"}
    ]

  def next(input) when input == "志丹县" or input == "610625",
    do: [
      %{"name" => "保安街道", "code" => "610625001000"},
      %{"name" => "杏河镇", "code" => "610625101000"},
      %{"name" => "顺宁镇", "code" => "610625102000"},
      %{"name" => "旦八镇", "code" => "610625103000"},
      %{"name" => "金丁镇", "code" => "610625104000"},
      %{"name" => "永宁镇", "code" => "610625105000"},
      %{"name" => "义正镇", "code" => "610625106000"},
      %{"name" => "双河镇", "code" => "610625107000"}
    ]

  def next(input) when input == "吴起县" or input == "610626",
    do: [
      %{"name" => "吴起街道", "code" => "610626001000"},
      %{"name" => "铁边城镇", "code" => "610626101000"},
      %{"name" => "周湾镇", "code" => "610626102000"},
      %{"name" => "白豹镇", "code" => "610626103000"},
      %{"name" => "长官庙镇", "code" => "610626104000"},
      %{"name" => "长城镇", "code" => "610626105000"},
      %{"name" => "五谷城镇", "code" => "610626106000"},
      %{"name" => "吴仓堡镇", "code" => "610626107000"},
      %{"name" => "庙沟镇", "code" => "610626108000"}
    ]

  def next(input) when input == "甘泉县" or input == "610627",
    do: [
      %{"name" => "美水街道", "code" => "610627001000"},
      %{"name" => "下寺湾镇", "code" => "610627101000"},
      %{"name" => "道镇", "code" => "610627102000"},
      %{"name" => "石门镇", "code" => "610627103000"},
      %{"name" => "桥镇乡", "code" => "610627200000"},
      %{"name" => "劳山乡", "code" => "610627203000"}
    ]

  def next(input) when input == "富县" or input == "610628",
    do: [
      %{"name" => "茶坊街道", "code" => "610628001000"},
      %{"name" => "羊泉镇", "code" => "610628101000"},
      %{"name" => "张村驿镇", "code" => "610628102000"},
      %{"name" => "张家湾镇", "code" => "610628103000"},
      %{"name" => "直罗镇", "code" => "610628104000"},
      %{"name" => "牛武镇", "code" => "610628106000"},
      %{"name" => "寺仙镇", "code" => "610628109000"},
      %{"name" => "北道德乡", "code" => "610628204000"}
    ]

  def next(input) when input == "洛川县" or input == "610629",
    do: [
      %{"name" => "凤栖街道", "code" => "610629001000"},
      %{"name" => "旧县镇", "code" => "610629101000"},
      %{"name" => "交口河镇", "code" => "610629102000"},
      %{"name" => "老庙镇", "code" => "610629103000"},
      %{"name" => "土基镇", "code" => "610629104000"},
      %{"name" => "石头镇", "code" => "610629105000"},
      %{"name" => "槐柏镇", "code" => "610629106000"},
      %{"name" => "永乡镇", "code" => "610629107000"},
      %{"name" => "菩提镇", "code" => "610629108000"}
    ]

  def next(input) when input == "宜川县" or input == "610630",
    do: [
      %{"name" => "丹州街道", "code" => "610630001000"},
      %{"name" => "秋林镇", "code" => "610630101000"},
      %{"name" => "云岩镇", "code" => "610630102000"},
      %{"name" => "集义镇", "code" => "610630104000"},
      %{"name" => "壶口镇", "code" => "610630105000"},
      %{"name" => "英旺乡", "code" => "610630200000"},
      %{"name" => "交里乡", "code" => "610630201000"}
    ]

  def next(input) when input == "黄龙县" or input == "610631",
    do: [
      %{"name" => "石堡镇", "code" => "610631100000"},
      %{"name" => "白马滩镇", "code" => "610631101000"},
      %{"name" => "瓦子街镇", "code" => "610631102000"},
      %{"name" => "界头庙镇", "code" => "610631106000"},
      %{"name" => "三岔镇", "code" => "610631107000"},
      %{"name" => "圪台乡", "code" => "610631205000"},
      %{"name" => "崾崄乡", "code" => "610631206000"}
    ]

  def next(input) when input == "黄陵县" or input == "610632",
    do: [
      %{"name" => "桥山街道", "code" => "610632001000"},
      %{"name" => "店头镇", "code" => "610632101000"},
      %{"name" => "隆坊镇", "code" => "610632102000"},
      %{"name" => "田庄镇", "code" => "610632103000"},
      %{"name" => "阿党镇", "code" => "610632104000"},
      %{"name" => "双龙镇", "code" => "610632105000"}
    ]

  def next(input) when input == "子长市" or input == "610681",
    do: [
      %{"name" => "瓦窑堡街道", "code" => "610681001000"},
      %{"name" => "秀延街道", "code" => "610681002000"},
      %{"name" => "栾家坪街道", "code" => "610681003000"},
      %{"name" => "杨家园则镇", "code" => "610681101000"},
      %{"name" => "玉家湾镇", "code" => "610681102000"},
      %{"name" => "安定镇", "code" => "610681103000"},
      %{"name" => "马家砭镇", "code" => "610681104000"},
      %{"name" => "南沟岔镇", "code" => "610681105000"},
      %{"name" => "涧峪岔镇", "code" => "610681106000"},
      %{"name" => "李家岔镇", "code" => "610681107000"},
      %{"name" => "余家坪镇", "code" => "610681108000"}
    ]

  def next(input) when input == "临渭区" or input == "610502",
    do: [
      %{"name" => "人民街道", "code" => "610502001000"},
      %{"name" => "杜桥街道", "code" => "610502002000"},
      %{"name" => "解放街道", "code" => "610502003000"},
      %{"name" => "向阳街道", "code" => "610502004000"},
      %{"name" => "站南街道", "code" => "610502005000"},
      %{"name" => "双王街道", "code" => "610502006000"},
      %{"name" => "良田街道", "code" => "610502007000"},
      %{"name" => "崇业路街道", "code" => "610502008000"},
      %{"name" => "辛市街道", "code" => "610502009000"},
      %{"name" => "龙背街道", "code" => "610502010000"},
      %{"name" => "阳曲街道", "code" => "610502011000"},
      %{"name" => "信义街道", "code" => "610502012000"},
      %{"name" => "白杨街道", "code" => "610502013000"},
      %{"name" => "桥南镇", "code" => "610502100000"},
      %{"name" => "阳郭镇", "code" => "610502101000"},
      %{"name" => "故市镇", "code" => "610502102000"},
      %{"name" => "下邽镇", "code" => "610502103000"},
      %{"name" => "三张镇", "code" => "610502104000"},
      %{"name" => "交斜镇", "code" => "610502105000"},
      %{"name" => "崇凝镇", "code" => "610502107000"},
      %{"name" => "孝义镇", "code" => "610502108000"},
      %{"name" => "蔺店镇", "code" => "610502109000"},
      %{"name" => "官底镇", "code" => "610502111000"},
      %{"name" => "官路镇", "code" => "610502112000"},
      %{"name" => "丰原镇", "code" => "610502113000"},
      %{"name" => "阎村镇", "code" => "610502114000"},
      %{"name" => "官道镇", "code" => "610502116000"}
    ]

  def next(input) when input == "华州区" or input == "610503",
    do: [
      %{"name" => "华州街道", "code" => "610503001000"},
      %{"name" => "杏林镇", "code" => "610503101000"},
      %{"name" => "赤水镇", "code" => "610503102000"},
      %{"name" => "高塘镇", "code" => "610503103000"},
      %{"name" => "大明镇", "code" => "610503104000"},
      %{"name" => "瓜坡镇", "code" => "610503105000"},
      %{"name" => "莲花寺镇", "code" => "610503106000"},
      %{"name" => "柳枝镇", "code" => "610503107000"},
      %{"name" => "下庙镇", "code" => "610503108000"},
      %{"name" => "金堆镇", "code" => "610503109000"}
    ]

  def next(input) when input == "潼关县" or input == "610522",
    do: [
      %{"name" => "城关街道", "code" => "610522001000"},
      %{"name" => "秦东镇", "code" => "610522101000"},
      %{"name" => "太要镇", "code" => "610522102000"},
      %{"name" => "桐峪镇", "code" => "610522103000"},
      %{"name" => "代字营镇", "code" => "610522104000"}
    ]

  def next(input) when input == "大荔县" or input == "610523",
    do: [
      %{"name" => "西城街道", "code" => "610523001000"},
      %{"name" => "东城街道", "code" => "610523002000"},
      %{"name" => "许庄镇", "code" => "610523101000"},
      %{"name" => "朝邑镇", "code" => "610523102000"},
      %{"name" => "安仁镇", "code" => "610523103000"},
      %{"name" => "两宜镇", "code" => "610523104000"},
      %{"name" => "羌白镇", "code" => "610523105000"},
      %{"name" => "官池镇", "code" => "610523106000"},
      %{"name" => "冯村镇", "code" => "610523107000"},
      %{"name" => "双泉镇", "code" => "610523108000"},
      %{"name" => "下寨镇", "code" => "610523110000"},
      %{"name" => "韦林镇", "code" => "610523111000"},
      %{"name" => "范家镇", "code" => "610523112000"},
      %{"name" => "苏村镇", "code" => "610523113000"},
      %{"name" => "赵渡镇", "code" => "610523114000"},
      %{"name" => "埝桥镇", "code" => "610523116000"},
      %{"name" => "段家镇", "code" => "610523117000"}
    ]

  def next(input) when input == "合阳县" or input == "610524",
    do: [
      %{"name" => "城关街道", "code" => "610524001000"},
      %{"name" => "甘井镇", "code" => "610524101000"},
      %{"name" => "坊镇", "code" => "610524102000"},
      %{"name" => "洽川镇", "code" => "610524103000"},
      %{"name" => "新池镇", "code" => "610524104000"},
      %{"name" => "黑池镇", "code" => "610524105000"},
      %{"name" => "路井镇", "code" => "610524106000"},
      %{"name" => "和家庄镇", "code" => "610524107000"},
      %{"name" => "王村镇", "code" => "610524108000"},
      %{"name" => "同家庄镇", "code" => "610524110000"},
      %{"name" => "百良镇", "code" => "610524111000"},
      %{"name" => "金峪镇", "code" => "610524112000"}
    ]

  def next(input) when input == "澄城县" or input == "610525",
    do: [
      %{"name" => "城关街道", "code" => "610525001000"},
      %{"name" => "冯原镇", "code" => "610525101000"},
      %{"name" => "王庄镇", "code" => "610525102000"},
      %{"name" => "尧头镇", "code" => "610525103000"},
      %{"name" => "赵庄镇", "code" => "610525104000"},
      %{"name" => "交道镇", "code" => "610525105000"},
      %{"name" => "寺前镇", "code" => "610525106000"},
      %{"name" => "韦庄镇", "code" => "610525107000"},
      %{"name" => "安里镇", "code" => "610525108000"},
      %{"name" => "庄头镇", "code" => "610525109000"}
    ]

  def next(input) when input == "蒲城县" or input == "610526",
    do: [
      %{"name" => "奉先街道", "code" => "610526001000"},
      %{"name" => "紫荆街道", "code" => "610526002000"},
      %{"name" => "罕井镇", "code" => "610526101000"},
      %{"name" => "孙镇", "code" => "610526102000"},
      %{"name" => "兴镇", "code" => "610526103000"},
      %{"name" => "党睦镇", "code" => "610526104000"},
      %{"name" => "高阳镇", "code" => "610526105000"},
      %{"name" => "永丰镇", "code" => "610526106000"},
      %{"name" => "荆姚镇", "code" => "610526107000"},
      %{"name" => "苏坊镇", "code" => "610526108000"},
      %{"name" => "龙阳镇", "code" => "610526109000"},
      %{"name" => "洛滨镇", "code" => "610526112000"},
      %{"name" => "陈庄镇", "code" => "610526113000"},
      %{"name" => "桥陵镇", "code" => "610526114000"},
      %{"name" => "尧山镇", "code" => "610526116000"},
      %{"name" => "椿林镇", "code" => "610526117000"},
      %{"name" => "龙池镇", "code" => "610526118000"}
    ]

  def next(input) when input == "白水县" or input == "610527",
    do: [
      %{"name" => "城关街道", "code" => "610527001000"},
      %{"name" => "尧禾镇", "code" => "610527102000"},
      %{"name" => "杜康镇", "code" => "610527103000"},
      %{"name" => "西固镇", "code" => "610527104000"},
      %{"name" => "林皋镇", "code" => "610527105000"},
      %{"name" => "史官镇", "code" => "610527106000"},
      %{"name" => "北塬镇", "code" => "610527107000"},
      %{"name" => "雷牙镇", "code" => "610527109000"}
    ]

  def next(input) when input == "富平县" or input == "610528",
    do: [
      %{"name" => "城关街道", "code" => "610528001000"},
      %{"name" => "庄里镇", "code" => "610528101000"},
      %{"name" => "张桥镇", "code" => "610528102000"},
      %{"name" => "美原镇", "code" => "610528103000"},
      %{"name" => "流曲镇", "code" => "610528104000"},
      %{"name" => "淡村镇", "code" => "610528105000"},
      %{"name" => "留古镇", "code" => "610528107000"},
      %{"name" => "老庙镇", "code" => "610528108000"},
      %{"name" => "薛镇", "code" => "610528109000"},
      %{"name" => "到贤镇", "code" => "610528110000"},
      %{"name" => "曹村镇", "code" => "610528111000"},
      %{"name" => "宫里镇", "code" => "610528112000"},
      %{"name" => "梅家坪镇", "code" => "610528113000"},
      %{"name" => "刘集镇", "code" => "610528114000"},
      %{"name" => "齐村镇", "code" => "610528115000"}
    ]

  def next(input) when input == "韩城市" or input == "610581",
    do: [
      %{"name" => "新城街道", "code" => "610581001000"},
      %{"name" => "金城街道", "code" => "610581002000"},
      %{"name" => "龙门镇", "code" => "610581100000"},
      %{"name" => "桑树坪镇", "code" => "610581101000"},
      %{"name" => "芝川镇", "code" => "610581103000"},
      %{"name" => "西庄镇", "code" => "610581104000"},
      %{"name" => "芝阳镇", "code" => "610581106000"},
      %{"name" => "板桥镇", "code" => "610581107000"}
    ]

  def next(input) when input == "华阴市" or input == "610582",
    do: [
      %{"name" => "太华路街道", "code" => "610582001000"},
      %{"name" => "岳庙街道", "code" => "610582002000"},
      %{"name" => "孟塬镇", "code" => "610582100000"},
      %{"name" => "华西镇", "code" => "610582103000"},
      %{"name" => "罗敷镇", "code" => "610582104000"},
      %{"name" => "华山镇", "code" => "610582105000"},
      %{"name" => "国营陕西华山企业公司", "code" => "610582400000"}
    ]

  def next(input) when input == "秦都区" or input == "610402",
    do: [
      %{"name" => "人民路街道", "code" => "610402001000"},
      %{"name" => "西兰路街道", "code" => "610402002000"},
      %{"name" => "吴家堡街道", "code" => "610402003000"},
      %{"name" => "渭阳西路街道", "code" => "610402004000"},
      %{"name" => "陈杨寨街道", "code" => "610402005000"},
      %{"name" => "古渡街道", "code" => "610402006000"},
      %{"name" => "上林街道", "code" => "610402007000"},
      %{"name" => "钓台街道", "code" => "610402008000"},
      %{"name" => "马泉街道", "code" => "610402009000"},
      %{"name" => "渭滨街道", "code" => "610402010000"},
      %{"name" => "双照街道", "code" => "610402011000"},
      %{"name" => "马庄街道", "code" => "610402012000"}
    ]

  def next(input) when input == "杨陵区" or input == "610403",
    do: [
      %{"name" => "杨陵街道", "code" => "610403001000"},
      %{"name" => "李台街道", "code" => "610403002000"},
      %{"name" => "大寨街道", "code" => "610403003000"},
      %{"name" => "五泉镇", "code" => "610403100000"},
      %{"name" => "揉谷镇", "code" => "610403102000"}
    ]

  def next(input) when input == "渭城区" or input == "610404",
    do: [
      %{"name" => "中山街街道", "code" => "610404001000"},
      %{"name" => "文汇路街道", "code" => "610404002000"},
      %{"name" => "新兴路街道", "code" => "610404003000"},
      %{"name" => "渭阳街道", "code" => "610404004000"},
      %{"name" => "渭城街道", "code" => "610404005000"},
      %{"name" => "窑店街道", "code" => "610404006000"},
      %{"name" => "正阳街道", "code" => "610404007000"},
      %{"name" => "周陵街道", "code" => "610404008000"},
      %{"name" => "底张街道", "code" => "610404009000"},
      %{"name" => "北杜街道", "code" => "610404010000"}
    ]

  def next(input) when input == "三原县" or input == "610422",
    do: [
      %{"name" => "城关街道", "code" => "610422001000"},
      %{"name" => "陂西镇", "code" => "610422102000"},
      %{"name" => "独李镇", "code" => "610422103000"},
      %{"name" => "大程镇", "code" => "610422104000"},
      %{"name" => "西阳镇", "code" => "610422105000"},
      %{"name" => "鲁桥镇", "code" => "610422106000"},
      %{"name" => "陵前镇", "code" => "610422107000"},
      %{"name" => "新兴镇", "code" => "610422109000"},
      %{"name" => "嵯峨镇", "code" => "610422110000"},
      %{"name" => "渠岸镇", "code" => "610422111000"}
    ]

  def next(input) when input == "泾阳县" or input == "610423",
    do: [
      %{"name" => "泾干街道", "code" => "610423001000"},
      %{"name" => "永乐镇", "code" => "610423101000"},
      %{"name" => "云阳镇", "code" => "610423102000"},
      %{"name" => "桥底镇", "code" => "610423103000"},
      %{"name" => "王桥镇", "code" => "610423104000"},
      %{"name" => "口镇", "code" => "610423105000"},
      %{"name" => "三渠镇", "code" => "610423107000"},
      %{"name" => "高庄镇", "code" => "610423108000"},
      %{"name" => "太平镇", "code" => "610423111000"},
      %{"name" => "崇文镇", "code" => "610423112000"},
      %{"name" => "安吴镇", "code" => "610423113000"},
      %{"name" => "兴隆镇", "code" => "610423114000"},
      %{"name" => "中张镇", "code" => "610423115000"}
    ]

  def next(input) when input == "乾县" or input == "610424",
    do: [
      %{"name" => "城关街道", "code" => "610424001000"},
      %{"name" => "薛录镇", "code" => "610424101000"},
      %{"name" => "梁村镇", "code" => "610424102000"},
      %{"name" => "临平镇", "code" => "610424103000"},
      %{"name" => "姜村镇", "code" => "610424104000"},
      %{"name" => "王村镇", "code" => "610424105000"},
      %{"name" => "马连镇", "code" => "610424106000"},
      %{"name" => "阳峪镇", "code" => "610424107000"},
      %{"name" => "峰阳镇", "code" => "610424108000"},
      %{"name" => "注泔镇", "code" => "610424109000"},
      %{"name" => "灵源镇", "code" => "610424110000"},
      %{"name" => "阳洪镇", "code" => "610424111000"},
      %{"name" => "梁山镇", "code" => "610424112000"},
      %{"name" => "周城镇", "code" => "610424113000"},
      %{"name" => "新阳镇", "code" => "610424114000"},
      %{"name" => "大杨镇", "code" => "610424115000"}
    ]

  def next(input) when input == "礼泉县" or input == "610425",
    do: [
      %{"name" => "城关街道", "code" => "610425001000"},
      %{"name" => "史德镇", "code" => "610425101000"},
      %{"name" => "西张堡镇", "code" => "610425102000"},
      %{"name" => "阡东镇", "code" => "610425103000"},
      %{"name" => "烽火镇", "code" => "610425104000"},
      %{"name" => "烟霞镇", "code" => "610425105000"},
      %{"name" => "赵镇", "code" => "610425106000"},
      %{"name" => "叱干镇", "code" => "610425108000"},
      %{"name" => "南坊镇", "code" => "610425109000"},
      %{"name" => "石潭镇", "code" => "610425110000"},
      %{"name" => "昭陵镇", "code" => "610425111000"},
      %{"name" => "骏马镇", "code" => "610425112000"}
    ]

  def next(input) when input == "永寿县" or input == "610426",
    do: [
      %{"name" => "监军街道", "code" => "610426001000"},
      %{"name" => "店头镇", "code" => "610426101000"},
      %{"name" => "常宁镇", "code" => "610426102000"},
      %{"name" => "甘井镇", "code" => "610426104000"},
      %{"name" => "马坊镇", "code" => "610426105000"},
      %{"name" => "渠子镇", "code" => "610426108000"},
      %{"name" => "永平镇", "code" => "610426110000"}
    ]

  def next(input) when input == "长武县" or input == "610428",
    do: [
      %{"name" => "昭仁街道", "code" => "610428001000"},
      %{"name" => "相公镇", "code" => "610428101000"},
      %{"name" => "巨家镇", "code" => "610428102000"},
      %{"name" => "丁家镇", "code" => "610428103000"},
      %{"name" => "洪家镇", "code" => "610428104000"},
      %{"name" => "亭口镇", "code" => "610428105000"},
      %{"name" => "彭公镇", "code" => "610428106000"},
      %{"name" => "枣园镇", "code" => "610428108000"}
    ]

  def next(input) when input == "旬邑县" or input == "610429",
    do: [
      %{"name" => "城关街道", "code" => "610429001000"},
      %{"name" => "土桥镇", "code" => "610429101000"},
      %{"name" => "职田镇", "code" => "610429102000"},
      %{"name" => "张洪镇", "code" => "610429103000"},
      %{"name" => "太村镇", "code" => "610429104000"},
      %{"name" => "郑家镇", "code" => "610429105000"},
      %{"name" => "湫坡头镇", "code" => "610429106000"},
      %{"name" => "底庙镇", "code" => "610429107000"},
      %{"name" => "马栏镇", "code" => "610429109000"},
      %{"name" => "清塬镇", "code" => "610429110000"}
    ]

  def next(input) when input == "淳化县" or input == "610430",
    do: [
      %{"name" => "城关街道", "code" => "610430001000"},
      %{"name" => "官庄镇", "code" => "610430101000"},
      %{"name" => "方里镇", "code" => "610430103000"},
      %{"name" => "润镇", "code" => "610430104000"},
      %{"name" => "车坞镇", "code" => "610430105000"},
      %{"name" => "铁王镇", "code" => "610430106000"},
      %{"name" => "石桥镇", "code" => "610430107000"},
      %{"name" => "十里塬镇", "code" => "610430109000"}
    ]

  def next(input) when input == "武功县" or input == "610431",
    do: [
      %{"name" => "普集街道", "code" => "610431001000"},
      %{"name" => "苏坊镇", "code" => "610431101000"},
      %{"name" => "武功镇", "code" => "610431102000"},
      %{"name" => "游凤镇", "code" => "610431103000"},
      %{"name" => "贞元镇", "code" => "610431104000"},
      %{"name" => "长宁镇", "code" => "610431105000"},
      %{"name" => "小村镇", "code" => "610431106000"},
      %{"name" => "大庄镇", "code" => "610431107000"}
    ]

  def next(input) when input == "兴平市" or input == "610481",
    do: [
      %{"name" => "东城街道", "code" => "610481001000"},
      %{"name" => "西城街道", "code" => "610481002000"},
      %{"name" => "店张街道", "code" => "610481003000"},
      %{"name" => "西吴街道", "code" => "610481004000"},
      %{"name" => "马嵬街道", "code" => "610481005000"},
      %{"name" => "赵村镇", "code" => "610481101000"},
      %{"name" => "桑镇", "code" => "610481102000"},
      %{"name" => "南市镇", "code" => "610481104000"},
      %{"name" => "庄头镇", "code" => "610481105000"},
      %{"name" => "南位镇", "code" => "610481106000"},
      %{"name" => "阜寨镇", "code" => "610481107000"},
      %{"name" => "丰仪镇", "code" => "610481108000"},
      %{"name" => "汤坊镇", "code" => "610481109000"}
    ]

  def next(input) when input == "彬州市" or input == "610482",
    do: [
      %{"name" => "城关街道", "code" => "610482001000"},
      %{"name" => "豳风街道", "code" => "610482002000"},
      %{"name" => "北极镇", "code" => "610482101000"},
      %{"name" => "新民镇", "code" => "610482102000"},
      %{"name" => "龙高镇", "code" => "610482103000"},
      %{"name" => "永乐镇", "code" => "610482105000"},
      %{"name" => "义门镇", "code" => "610482106000"},
      %{"name" => "水口镇", "code" => "610482107000"},
      %{"name" => "韩家镇", "code" => "610482108000"},
      %{"name" => "太峪镇", "code" => "610482109000"}
    ]

  def next(input) when input == "渭滨区" or input == "610302",
    do: [
      %{"name" => "金陵街道", "code" => "610302001000"},
      %{"name" => "经二路街道", "code" => "610302002000"},
      %{"name" => "清姜街道", "code" => "610302003000"},
      %{"name" => "姜谭街道", "code" => "610302004000"},
      %{"name" => "桥南街道", "code" => "610302005000"},
      %{"name" => "马营镇", "code" => "610302100000"},
      %{"name" => "石鼓镇", "code" => "610302101000"},
      %{"name" => "神农镇", "code" => "610302102000"},
      %{"name" => "高家镇", "code" => "610302103000"},
      %{"name" => "八鱼镇", "code" => "610302104000"}
    ]

  def next(input) when input == "金台区" or input == "610303",
    do: [
      %{"name" => "中山东路街道", "code" => "610303001000"},
      %{"name" => "西关街道", "code" => "610303002000"},
      %{"name" => "中山西路街道", "code" => "610303003000"},
      %{"name" => "群众路街道", "code" => "610303004000"},
      %{"name" => "东风路街道", "code" => "610303006000"},
      %{"name" => "十里铺街道", "code" => "610303007000"},
      %{"name" => "卧龙寺街道", "code" => "610303008000"},
      %{"name" => "陈仓镇", "code" => "610303100000"},
      %{"name" => "蟠龙镇", "code" => "610303101000"},
      %{"name" => "金河镇", "code" => "610303102000"},
      %{"name" => "硖石镇", "code" => "610303103000"}
    ]

  def next(input) when input == "陈仓区" or input == "610304",
    do: [
      %{"name" => "虢镇街道", "code" => "610304001000"},
      %{"name" => "东关街道", "code" => "610304002000"},
      %{"name" => "千渭街道", "code" => "610304003000"},
      %{"name" => "阳平镇", "code" => "610304101000"},
      %{"name" => "千河镇", "code" => "610304102000"},
      %{"name" => "磻溪镇", "code" => "610304103000"},
      %{"name" => "天王镇", "code" => "610304104000"},
      %{"name" => "慕仪镇", "code" => "610304105000"},
      %{"name" => "周原镇", "code" => "610304106000"},
      %{"name" => "贾村镇", "code" => "610304107000"},
      %{"name" => "县功镇", "code" => "610304109000"},
      %{"name" => "新街镇", "code" => "610304110000"},
      %{"name" => "坪头镇", "code" => "610304111000"},
      %{"name" => "香泉镇", "code" => "610304112000"},
      %{"name" => "赤沙镇", "code" => "610304113000"},
      %{"name" => "拓石镇", "code" => "610304114000"},
      %{"name" => "凤阁岭镇", "code" => "610304115000"},
      %{"name" => "钓渭镇", "code" => "610304116000"}
    ]

  def next(input) when input == "凤翔区" or input == "610305",
    do: [
      %{"name" => "城关镇", "code" => "610305100000"},
      %{"name" => "虢王镇", "code" => "610305101000"},
      %{"name" => "彪角镇", "code" => "610305102000"},
      %{"name" => "横水镇", "code" => "610305103000"},
      %{"name" => "田家庄镇", "code" => "610305104000"},
      %{"name" => "糜杆桥镇", "code" => "610305105000"},
      %{"name" => "南指挥镇", "code" => "610305107000"},
      %{"name" => "陈村镇", "code" => "610305108000"},
      %{"name" => "长青镇", "code" => "610305109000"},
      %{"name" => "柳林镇", "code" => "610305110000"},
      %{"name" => "姚家沟镇", "code" => "610305111000"},
      %{"name" => "范家寨镇", "code" => "610305112000"}
    ]

  def next(input) when input == "岐山县" or input == "610323",
    do: [
      %{"name" => "凤鸣镇", "code" => "610323100000"},
      %{"name" => "蔡家坡镇", "code" => "610323101000"},
      %{"name" => "益店镇", "code" => "610323103000"},
      %{"name" => "蒲村镇", "code" => "610323104000"},
      %{"name" => "青化镇", "code" => "610323106000"},
      %{"name" => "枣林镇", "code" => "610323107000"},
      %{"name" => "雍川镇", "code" => "610323108000"},
      %{"name" => "故郡镇", "code" => "610323111000"},
      %{"name" => "京当镇", "code" => "610323112000"}
    ]

  def next(input) when input == "扶风县" or input == "610324",
    do: [
      %{"name" => "城关街道", "code" => "610324001000"},
      %{"name" => "天度镇", "code" => "610324101000"},
      %{"name" => "午井镇", "code" => "610324102000"},
      %{"name" => "绛帐镇", "code" => "610324103000"},
      %{"name" => "段家镇", "code" => "610324104000"},
      %{"name" => "杏林镇", "code" => "610324105000"},
      %{"name" => "召公镇", "code" => "610324106000"},
      %{"name" => "法门镇", "code" => "610324107000"}
    ]

  def next(input) when input == "眉县" or input == "610326",
    do: [
      %{"name" => "首善街道", "code" => "610326001000"},
      %{"name" => "横渠镇", "code" => "610326101000"},
      %{"name" => "槐芽镇", "code" => "610326102000"},
      %{"name" => "汤峪镇", "code" => "610326103000"},
      %{"name" => "常兴镇", "code" => "610326104000"},
      %{"name" => "金渠镇", "code" => "610326105000"},
      %{"name" => "营头镇", "code" => "610326106000"},
      %{"name" => "齐镇", "code" => "610326107000"},
      %{"name" => "陕西省太白山旅游区", "code" => "610326400000"},
      %{"name" => "红河谷森林公园", "code" => "610326401000"}
    ]

  def next(input) when input == "陇县" or input == "610327",
    do: [
      %{"name" => "城关镇", "code" => "610327100000"},
      %{"name" => "东风镇", "code" => "610327101000"},
      %{"name" => "八渡镇", "code" => "610327102000"},
      %{"name" => "东南镇", "code" => "610327104000"},
      %{"name" => "温水镇", "code" => "610327106000"},
      %{"name" => "天成镇", "code" => "610327107000"},
      %{"name" => "曹家湾镇", "code" => "610327108000"},
      %{"name" => "固关镇", "code" => "610327109000"},
      %{"name" => "河北镇", "code" => "610327112000"},
      %{"name" => "新集川镇", "code" => "610327113000"}
    ]

  def next(input) when input == "千阳县" or input == "610328",
    do: [
      %{"name" => "城关镇", "code" => "610328100000"},
      %{"name" => "崔家头镇", "code" => "610328101000"},
      %{"name" => "南寨镇", "code" => "610328102000"},
      %{"name" => "张家塬镇", "code" => "610328103000"},
      %{"name" => "水沟镇", "code" => "610328104000"},
      %{"name" => "草碧镇", "code" => "610328105000"},
      %{"name" => "高崖镇", "code" => "610328107000"}
    ]

  def next(input) when input == "麟游县" or input == "610329",
    do: [
      %{"name" => "九成宫镇", "code" => "610329100000"},
      %{"name" => "崔木镇", "code" => "610329101000"},
      %{"name" => "招贤镇", "code" => "610329102000"},
      %{"name" => "两亭镇", "code" => "610329103000"},
      %{"name" => "常丰镇", "code" => "610329105000"},
      %{"name" => "丈八镇", "code" => "610329106000"},
      %{"name" => "酒房镇", "code" => "610329107000"}
    ]

  def next(input) when input == "凤县" or input == "610330",
    do: [
      %{"name" => "双石铺镇", "code" => "610330100000"},
      %{"name" => "凤州镇", "code" => "610330101000"},
      %{"name" => "黄牛铺镇", "code" => "610330102000"},
      %{"name" => "红花铺镇", "code" => "610330103000"},
      %{"name" => "河口镇", "code" => "610330104000"},
      %{"name" => "唐藏镇", "code" => "610330105000"},
      %{"name" => "平木镇", "code" => "610330106000"},
      %{"name" => "坪坎镇", "code" => "610330107000"},
      %{"name" => "留凤关镇", "code" => "610330110000"},
      %{"name" => "马头滩林业局", "code" => "610330400000"},
      %{"name" => "辛家山林业场", "code" => "610330401000"}
    ]

  def next(input) when input == "太白县" or input == "610331",
    do: [
      %{"name" => "咀头镇", "code" => "610331100000"},
      %{"name" => "桃川镇", "code" => "610331101000"},
      %{"name" => "鹦鸽镇", "code" => "610331102000"},
      %{"name" => "靖口镇", "code" => "610331103000"},
      %{"name" => "太白河镇", "code" => "610331104000"},
      %{"name" => "黄柏塬镇", "code" => "610331105000"},
      %{"name" => "王家堎镇", "code" => "610331106000"}
    ]

  def next(input) when input == "王益区" or input == "610202",
    do: [
      %{"name" => "七一路街道", "code" => "610202001000"},
      %{"name" => "红旗街街道", "code" => "610202002000"},
      %{"name" => "桃园街道", "code" => "610202003000"},
      %{"name" => "青年路街道", "code" => "610202004000"},
      %{"name" => "王家河街道", "code" => "610202005000"},
      %{"name" => "王益街道", "code" => "610202006000"},
      %{"name" => "黄堡镇", "code" => "610202100000"}
    ]

  def next(input) when input == "印台区" or input == "610203",
    do: [
      %{"name" => "城关街道", "code" => "610203001000"},
      %{"name" => "三里洞街道", "code" => "610203002000"},
      %{"name" => "王石凹街道", "code" => "610203003000"},
      %{"name" => "印台街道", "code" => "610203004000"},
      %{"name" => "陈炉镇", "code" => "610203100000"},
      %{"name" => "红土镇", "code" => "610203101000"},
      %{"name" => "广阳镇", "code" => "610203102000"},
      %{"name" => "金锁关镇", "code" => "610203104000"},
      %{"name" => "阿庄镇", "code" => "610203106000"}
    ]

  def next(input) when input == "耀州区" or input == "610204",
    do: [
      %{"name" => "永安路街道", "code" => "610204001000"},
      %{"name" => "天宝路街道", "code" => "610204002000"},
      %{"name" => "咸丰路街道", "code" => "610204003000"},
      %{"name" => "正阳路街道", "code" => "610204004000"},
      %{"name" => "锦阳路街道", "code" => "610204005000"},
      %{"name" => "坡头街道", "code" => "610204006000"},
      %{"name" => "董家河镇", "code" => "610204101000"},
      %{"name" => "庙湾镇", "code" => "610204102000"},
      %{"name" => "瑶曲镇", "code" => "610204103000"},
      %{"name" => "照金镇", "code" => "610204104000"},
      %{"name" => "小丘镇", "code" => "610204107000"},
      %{"name" => "孙原镇", "code" => "610204108000"},
      %{"name" => "关庄镇", "code" => "610204109000"},
      %{"name" => "石柱镇", "code" => "610204111000"}
    ]

  def next(input) when input == "宜君县" or input == "610222",
    do: [
      %{"name" => "宜阳街道", "code" => "610222001000"},
      %{"name" => "彭镇", "code" => "610222101000"},
      %{"name" => "五里镇", "code" => "610222102000"},
      %{"name" => "太安镇", "code" => "610222103000"},
      %{"name" => "棋盘镇", "code" => "610222104000"},
      %{"name" => "尧生镇", "code" => "610222105000"},
      %{"name" => "哭泉镇", "code" => "610222106000"},
      %{"name" => "云梦乡", "code" => "610222201000"}
    ]

  def next(input) when input == "新城区" or input == "610102",
    do: [
      %{"name" => "西一路街道", "code" => "610102001000"},
      %{"name" => "长乐中路街道", "code" => "610102002000"},
      %{"name" => "中山门街道", "code" => "610102003000"},
      %{"name" => "韩森寨街道", "code" => "610102004000"},
      %{"name" => "解放门街道", "code" => "610102005000"},
      %{"name" => "自强路街道", "code" => "610102006000"},
      %{"name" => "太华路街道", "code" => "610102007000"},
      %{"name" => "长乐西路街道", "code" => "610102008000"},
      %{"name" => "胡家庙街道", "code" => "610102009000"}
    ]

  def next(input) when input == "碑林区" or input == "610103",
    do: [
      %{"name" => "南院门街道", "code" => "610103001000"},
      %{"name" => "柏树林街道", "code" => "610103002000"},
      %{"name" => "长乐坊街道", "code" => "610103003000"},
      %{"name" => "东关南街街道", "code" => "610103004000"},
      %{"name" => "太乙路街道", "code" => "610103005000"},
      %{"name" => "文艺路街道", "code" => "610103006000"},
      %{"name" => "长安路街道", "code" => "610103007000"},
      %{"name" => "张家村街道", "code" => "610103008000"}
    ]

  def next(input) when input == "莲湖区" or input == "610104",
    do: [
      %{"name" => "青年路街道", "code" => "610104001000"},
      %{"name" => "北院门街道", "code" => "610104002000"},
      %{"name" => "北关街道", "code" => "610104003000"},
      %{"name" => "红庙坡街道", "code" => "610104004000"},
      %{"name" => "环城西路街道", "code" => "610104005000"},
      %{"name" => "西关街道", "code" => "610104006000"},
      %{"name" => "土门街道", "code" => "610104007000"},
      %{"name" => "桃园路街道", "code" => "610104008000"},
      %{"name" => "枣园街道", "code" => "610104009000"}
    ]

  def next(input) when input == "灞桥区" or input == "610111",
    do: [
      %{"name" => "纺织城街道", "code" => "610111001000"},
      %{"name" => "十里铺街道", "code" => "610111002000"},
      %{"name" => "红旗街道", "code" => "610111003000"},
      %{"name" => "席王街道", "code" => "610111004000"},
      %{"name" => "洪庆街道", "code" => "610111005000"},
      %{"name" => "狄寨街道", "code" => "610111006000"},
      %{"name" => "灞桥街道", "code" => "610111007000"},
      %{"name" => "新筑街道", "code" => "610111008000"},
      %{"name" => "新合街道", "code" => "610111009000"}
    ]

  def next(input) when input == "未央区" or input == "610112",
    do: [
      %{"name" => "张家堡街道", "code" => "610112001000"},
      %{"name" => "三桥街道", "code" => "610112002000"},
      %{"name" => "辛家庙街道", "code" => "610112003000"},
      %{"name" => "徐家湾街道", "code" => "610112004000"},
      %{"name" => "大明宫街道", "code" => "610112005000"},
      %{"name" => "谭家街道", "code" => "610112006000"},
      %{"name" => "草滩街道", "code" => "610112007000"},
      %{"name" => "六村堡街道", "code" => "610112008000"},
      %{"name" => "未央宫街道", "code" => "610112009000"},
      %{"name" => "汉城街道", "code" => "610112010000"},
      %{"name" => "未央湖街道", "code" => "610112011000"},
      %{"name" => "建章路街道", "code" => "610112012000"}
    ]

  def next(input) when input == "雁塔区" or input == "610113",
    do: [
      %{"name" => "小寨路街道", "code" => "610113001000"},
      %{"name" => "大雁塔街道", "code" => "610113002000"},
      %{"name" => "长延堡街道", "code" => "610113003000"},
      %{"name" => "电子城街道", "code" => "610113004000"},
      %{"name" => "等驾坡街道", "code" => "610113005000"},
      %{"name" => "鱼化寨街道", "code" => "610113006000"},
      %{"name" => "丈八沟街道", "code" => "610113007000"},
      %{"name" => "曲江街道", "code" => "610113008000"},
      %{"name" => "杜城街道", "code" => "610113009000"},
      %{"name" => "漳浒寨街道", "code" => "610113010000"}
    ]

  def next(input) when input == "阎良区" or input == "610114",
    do: [
      %{"name" => "凤凰路街道", "code" => "610114001000"},
      %{"name" => "新华路街道", "code" => "610114002000"},
      %{"name" => "振兴街道", "code" => "610114003000"},
      %{"name" => "新兴街道", "code" => "610114004000"},
      %{"name" => "北屯街道", "code" => "610114005000"},
      %{"name" => "武屯街道", "code" => "610114006000"},
      %{"name" => "关山街道", "code" => "610114007000"}
    ]

  def next(input) when input == "临潼区" or input == "610115",
    do: [
      %{"name" => "骊山街道", "code" => "610115001000"},
      %{"name" => "秦陵街道", "code" => "610115002000"},
      %{"name" => "新丰街道", "code" => "610115003000"},
      %{"name" => "代王街道", "code" => "610115004000"},
      %{"name" => "斜口街道", "code" => "610115005000"},
      %{"name" => "行者街道", "code" => "610115006000"},
      %{"name" => "零口街道", "code" => "610115007000"},
      %{"name" => "相桥街道", "code" => "610115008000"},
      %{"name" => "雨金街道", "code" => "610115009000"},
      %{"name" => "新市街道", "code" => "610115010000"},
      %{"name" => "徐杨街道", "code" => "610115011000"},
      %{"name" => "西泉街道", "code" => "610115012000"},
      %{"name" => "栎阳街道", "code" => "610115013000"},
      %{"name" => "马额街道", "code" => "610115014000"},
      %{"name" => "何寨街道", "code" => "610115015000"},
      %{"name" => "交口街道", "code" => "610115016000"},
      %{"name" => "油槐街道", "code" => "610115017000"},
      %{"name" => "北田街道", "code" => "610115018000"},
      %{"name" => "铁炉街道", "code" => "610115019000"},
      %{"name" => "任留街道", "code" => "610115020000"},
      %{"name" => "穆寨街道", "code" => "610115021000"},
      %{"name" => "小金街道", "code" => "610115022000"},
      %{"name" => "仁宗街道", "code" => "610115023000"}
    ]

  def next(input) when input == "长安区" or input == "610116",
    do: [
      %{"name" => "韦曲街道", "code" => "610116001000"},
      %{"name" => "郭杜街道", "code" => "610116002000"},
      %{"name" => "滦镇街道", "code" => "610116003000"},
      %{"name" => "引镇街道", "code" => "610116004000"},
      %{"name" => "王寺街道", "code" => "610116005000"},
      %{"name" => "马王街道", "code" => "610116006000"},
      %{"name" => "太乙宫街道", "code" => "610116007000"},
      %{"name" => "东大街道", "code" => "610116008000"},
      %{"name" => "子午街道", "code" => "610116009000"},
      %{"name" => "斗门街道", "code" => "610116010000"},
      %{"name" => "细柳街道", "code" => "610116011000"},
      %{"name" => "杜曲街道", "code" => "610116012000"},
      %{"name" => "大兆街道", "code" => "610116013000"},
      %{"name" => "黄良街道", "code" => "610116014000"},
      %{"name" => "兴隆街道", "code" => "610116015000"},
      %{"name" => "王曲街道", "code" => "610116016000"},
      %{"name" => "鸣犊街道", "code" => "610116017000"},
      %{"name" => "王莽街道", "code" => "610116018000"},
      %{"name" => "五台街道", "code" => "610116019000"},
      %{"name" => "高桥街道", "code" => "610116020000"},
      %{"name" => "五星街道", "code" => "610116021000"},
      %{"name" => "灵沼街道", "code" => "610116022000"},
      %{"name" => "杨庄街道", "code" => "610116023000"},
      %{"name" => "砲里街道", "code" => "610116024000"},
      %{"name" => "魏寨街道", "code" => "610116025000"}
    ]

  def next(input) when input == "高陵区" or input == "610117",
    do: [
      %{"name" => "鹿苑街道", "code" => "610117001000"},
      %{"name" => "泾渭街道", "code" => "610117002000"},
      %{"name" => "崇皇街道", "code" => "610117003000"},
      %{"name" => "姬家街道", "code" => "610117004000"},
      %{"name" => "耿镇街道", "code" => "610117005000"},
      %{"name" => "张卜街道", "code" => "610117006000"},
      %{"name" => "通远街道", "code" => "610117007000"}
    ]

  def next(input) when input == "鄠邑区" or input == "610118",
    do: [
      %{"name" => "甘亭街道", "code" => "610118001000"},
      %{"name" => "余下街道", "code" => "610118002000"},
      %{"name" => "玉蝉街道", "code" => "610118003000"},
      %{"name" => "五竹街道", "code" => "610118004000"},
      %{"name" => "大王街道", "code" => "610118005000"},
      %{"name" => "秦渡街道", "code" => "610118006000"},
      %{"name" => "草堂街道", "code" => "610118007000"},
      %{"name" => "庞光街道", "code" => "610118008000"},
      %{"name" => "祖庵街道", "code" => "610118009000"},
      %{"name" => "渭丰街道", "code" => "610118010000"},
      %{"name" => "涝店街道", "code" => "610118011000"},
      %{"name" => "甘河街道", "code" => "610118012000"},
      %{"name" => "蒋村街道", "code" => "610118013000"},
      %{"name" => "石井街道", "code" => "610118014000"}
    ]

  def next(input) when input == "蓝田县" or input == "610122",
    do: [
      %{"name" => "蓝关街道", "code" => "610122001000"},
      %{"name" => "洩湖镇", "code" => "610122101000"},
      %{"name" => "华胥镇", "code" => "610122102000"},
      %{"name" => "前卫镇", "code" => "610122103000"},
      %{"name" => "汤峪镇", "code" => "610122104000"},
      %{"name" => "焦岱镇", "code" => "610122105000"},
      %{"name" => "玉山镇", "code" => "610122106000"},
      %{"name" => "三里镇", "code" => "610122107000"},
      %{"name" => "普化镇", "code" => "610122108000"},
      %{"name" => "葛牌镇", "code" => "610122109000"},
      %{"name" => "灞源镇", "code" => "610122110000"},
      %{"name" => "九间房镇", "code" => "610122111000"},
      %{"name" => "蓝桥镇", "code" => "610122112000"},
      %{"name" => "辋川镇", "code" => "610122113000"},
      %{"name" => "厚镇", "code" => "610122115000"},
      %{"name" => "三官庙镇", "code" => "610122116000"},
      %{"name" => "安村镇", "code" => "610122118000"},
      %{"name" => "孟村镇", "code" => "610122119000"},
      %{"name" => "小寨镇", "code" => "610122120000"}
    ]

  def next(input) when input == "周至县" or input == "610124",
    do: [
      %{"name" => "二曲街道", "code" => "610124001000"},
      %{"name" => "哑柏镇", "code" => "610124101000"},
      %{"name" => "终南镇", "code" => "610124102000"},
      %{"name" => "马召镇", "code" => "610124103000"},
      %{"name" => "集贤镇", "code" => "610124104000"},
      %{"name" => "楼观镇", "code" => "610124105000"},
      %{"name" => "尚村镇", "code" => "610124106000"},
      %{"name" => "广济镇", "code" => "610124107000"},
      %{"name" => "厚畛子镇", "code" => "610124108000"},
      %{"name" => "青化镇", "code" => "610124109000"},
      %{"name" => "竹峪镇", "code" => "610124110000"},
      %{"name" => "翠峰镇", "code" => "610124111000"},
      %{"name" => "四屯镇", "code" => "610124112000"},
      %{"name" => "司竹镇", "code" => "610124115000"},
      %{"name" => "九峰镇", "code" => "610124116000"},
      %{"name" => "富仁镇", "code" => "610124117000"},
      %{"name" => "骆峪镇", "code" => "610124118000"},
      %{"name" => "陈河镇", "code" => "610124119000"},
      %{"name" => "板房子镇", "code" => "610124120000"},
      %{"name" => "王家河镇", "code" => "610124121000"}
    ]

  def next(_), do: nil
end