defmodule ChinaAdminDivisions.Gen.Lv3x.M61 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "商州区" or input == "611002",
    do: [
      %{"name" => "城关街道", "code" => "611002001"},
      %{"name" => "大赵峪街道", "code" => "611002002"},
      %{"name" => "陈塬街道", "code" => "611002003"},
      %{"name" => "刘湾街道", "code" => "611002004"},
      %{"name" => "夜村镇", "code" => "611002101"},
      %{"name" => "沙河子镇", "code" => "611002104"},
      %{"name" => "杨峪河镇", "code" => "611002105"},
      %{"name" => "金陵寺镇", "code" => "611002106"},
      %{"name" => "黑山镇", "code" => "611002107"},
      %{"name" => "杨斜镇", "code" => "611002108"},
      %{"name" => "麻街镇", "code" => "611002109"},
      %{"name" => "牧护关镇", "code" => "611002111"},
      %{"name" => "大荆镇", "code" => "611002112"},
      %{"name" => "腰市镇", "code" => "611002113"},
      %{"name" => "板桥镇", "code" => "611002114"},
      %{"name" => "北宽坪镇", "code" => "611002115"},
      %{"name" => "三岔河镇", "code" => "611002119"},
      %{"name" => "闫村镇", "code" => "611002121"},
      %{"name" => "二龙山水库", "code" => "611002400"},
      %{"name" => "南秦水库", "code" => "611002401"},
      %{"name" => "二龙山国营林场", "code" => "611002402"},
      %{"name" => "商丹循环工业园", "code" => "611002403"},
      %{"name" => "荆河工业园", "code" => "611002404"},
      %{"name" => "荆河农业示范园", "code" => "611002405"},
      %{"name" => "高校园区", "code" => "611002406"},
      %{"name" => "商洛职业技术学院", "code" => "611002407"},
      %{"name" => "氟化硅产业业园", "code" => "611002408"}
    ]

  def next(input) when input == "洛南县" or input == "611021",
    do: [
      %{"name" => "城关街道", "code" => "611021001"},
      %{"name" => "四皓街道", "code" => "611021002"},
      %{"name" => "景村镇", "code" => "611021101"},
      %{"name" => "古城镇", "code" => "611021102"},
      %{"name" => "三要镇", "code" => "611021103"},
      %{"name" => "灵口镇", "code" => "611021104"},
      %{"name" => "寺耳镇", "code" => "611021106"},
      %{"name" => "巡检镇", "code" => "611021107"},
      %{"name" => "石坡镇", "code" => "611021108"},
      %{"name" => "石门镇", "code" => "611021109"},
      %{"name" => "麻坪镇", "code" => "611021110"},
      %{"name" => "洛源镇", "code" => "611021111"},
      %{"name" => "保安镇", "code" => "611021112"},
      %{"name" => "永丰镇", "code" => "611021114"},
      %{"name" => "柏峪寺镇", "code" => "611021117"},
      %{"name" => "高耀镇", "code" => "611021118"}
    ]

  def next(input) when input == "丹凤县" or input == "611022",
    do: [
      %{"name" => "龙驹寨街道", "code" => "611022001"},
      %{"name" => "庾岭镇", "code" => "611022101"},
      %{"name" => "蔡川镇", "code" => "611022102"},
      %{"name" => "峦庄镇", "code" => "611022103"},
      %{"name" => "铁峪铺镇", "code" => "611022104"},
      %{"name" => "武关镇", "code" => "611022105"},
      %{"name" => "竹林关镇", "code" => "611022106"},
      %{"name" => "土门镇", "code" => "611022107"},
      %{"name" => "寺坪镇", "code" => "611022108"},
      %{"name" => "商镇", "code" => "611022109"},
      %{"name" => "棣花镇", "code" => "611022110"},
      %{"name" => "花瓶子镇", "code" => "611022115"}
    ]

  def next(input) when input == "商南县" or input == "611023",
    do: [
      %{"name" => "城关街道", "code" => "611023001"},
      %{"name" => "富水镇", "code" => "611023101"},
      %{"name" => "湘河镇", "code" => "611023102"},
      %{"name" => "赵川镇", "code" => "611023104"},
      %{"name" => "过风楼镇", "code" => "611023107"},
      %{"name" => "试马镇", "code" => "611023108"},
      %{"name" => "清油河镇", "code" => "611023109"},
      %{"name" => "十里坪镇", "code" => "611023110"},
      %{"name" => "金丝峡镇", "code" => "611023111"},
      %{"name" => "青山镇", "code" => "611023112"}
    ]

  def next(input) when input == "山阳县" or input == "611024",
    do: [
      %{"name" => "城关街道", "code" => "611024001"},
      %{"name" => "十里铺街道", "code" => "611024002"},
      %{"name" => "高坝店镇", "code" => "611024101"},
      %{"name" => "天竺山镇", "code" => "611024102"},
      %{"name" => "中村镇", "code" => "611024103"},
      %{"name" => "银花镇", "code" => "611024104"},
      %{"name" => "西照川镇", "code" => "611024105"},
      %{"name" => "漫川关镇", "code" => "611024106"},
      %{"name" => "南宽坪镇", "code" => "611024107"},
      %{"name" => "户家塬镇", "code" => "611024108"},
      %{"name" => "杨地镇", "code" => "611024109"},
      %{"name" => "小河口镇", "code" => "611024111"},
      %{"name" => "色河铺镇", "code" => "611024112"},
      %{"name" => "板岩镇", "code" => "611024113"},
      %{"name" => "延坪镇", "code" => "611024116"},
      %{"name" => "两岭镇", "code" => "611024117"},
      %{"name" => "王阎镇", "code" => "611024118"},
      %{"name" => "法官镇", "code" => "611024121"}
    ]

  def next(input) when input == "镇安县" or input == "611025",
    do: [
      %{"name" => "永乐街道", "code" => "611025001"},
      %{"name" => "回龙镇", "code" => "611025101"},
      %{"name" => "铁厂镇", "code" => "611025102"},
      %{"name" => "大坪镇", "code" => "611025103"},
      %{"name" => "米粮镇", "code" => "611025104"},
      %{"name" => "茅坪回族镇", "code" => "611025105"},
      %{"name" => "西口回族镇", "code" => "611025106"},
      %{"name" => "高峰镇", "code" => "611025107"},
      %{"name" => "青铜关镇", "code" => "611025108"},
      %{"name" => "柴坪镇", "code" => "611025109"},
      %{"name" => "达仁镇", "code" => "611025110"},
      %{"name" => "木王镇", "code" => "611025111"},
      %{"name" => "云盖寺镇", "code" => "611025113"},
      %{"name" => "庙沟镇", "code" => "611025114"},
      %{"name" => "月河镇", "code" => "611025117"},
      %{"name" => "黑窑沟林厂", "code" => "611025400"},
      %{"name" => "木王林厂", "code" => "611025401"},
      %{"name" => "镇安县苗圃", "code" => "611025402"}
    ]

  def next(input) when input == "柞水县" or input == "611026",
    do: [
      %{"name" => "乾佑街道", "code" => "611026001"},
      %{"name" => "营盘镇", "code" => "611026101"},
      %{"name" => "下梁镇", "code" => "611026102"},
      %{"name" => "小岭镇", "code" => "611026104"},
      %{"name" => "凤凰镇", "code" => "611026105"},
      %{"name" => "红岩寺镇", "code" => "611026106"},
      %{"name" => "曹坪镇", "code" => "611026107"},
      %{"name" => "杏坪镇", "code" => "611026109"},
      %{"name" => "瓦房口镇", "code" => "611026110"}
    ]

  def next(input) when input == "汉滨区" or input == "610902",
    do: [
      %{"name" => "老城街道", "code" => "610902001"},
      %{"name" => "新城街道", "code" => "610902002"},
      %{"name" => "江北街道", "code" => "610902003"},
      %{"name" => "建民街道", "code" => "610902004"},
      %{"name" => "关庙镇", "code" => "610902100"},
      %{"name" => "张滩镇", "code" => "610902101"},
      %{"name" => "瀛湖镇", "code" => "610902102"},
      %{"name" => "五里镇", "code" => "610902104"},
      %{"name" => "恒口镇", "code" => "610902107"},
      %{"name" => "吉河镇", "code" => "610902109"},
      %{"name" => "流水镇", "code" => "610902110"},
      %{"name" => "大竹园镇", "code" => "610902111"},
      %{"name" => "洪山镇", "code" => "610902112"},
      %{"name" => "茨沟镇", "code" => "610902114"},
      %{"name" => "大河镇", "code" => "610902115"},
      %{"name" => "沈坝镇", "code" => "610902116"},
      %{"name" => "双龙镇", "code" => "610902117"},
      %{"name" => "叶坪镇", "code" => "610902118"},
      %{"name" => "中原镇", "code" => "610902119"},
      %{"name" => "县河镇", "code" => "610902120"},
      %{"name" => "紫荆镇", "code" => "610902121"},
      %{"name" => "早阳镇", "code" => "610902122"},
      %{"name" => "关家镇", "code" => "610902123"},
      %{"name" => "石梯镇", "code" => "610902124"},
      %{"name" => "坝河镇", "code" => "610902125"},
      %{"name" => "牛蹄镇", "code" => "610902128"},
      %{"name" => "晏坝镇", "code" => "610902130"},
      %{"name" => "谭坝镇", "code" => "610902132"}
    ]

  def next(input) when input == "汉阴县" or input == "610921",
    do: [
      %{"name" => "城关镇", "code" => "610921100"},
      %{"name" => "涧池镇", "code" => "610921101"},
      %{"name" => "蒲溪镇", "code" => "610921102"},
      %{"name" => "平梁镇", "code" => "610921103"},
      %{"name" => "双乳镇", "code" => "610921104"},
      %{"name" => "铁佛寺镇", "code" => "610921105"},
      %{"name" => "漩涡镇", "code" => "610921107"},
      %{"name" => "汉阳镇", "code" => "610921108"},
      %{"name" => "双河口镇", "code" => "610921110"},
      %{"name" => "观音河镇", "code" => "610921112"}
    ]

  def next(input) when input == "石泉县" or input == "610922",
    do: [
      %{"name" => "城关镇", "code" => "610922100"},
      %{"name" => "饶峰镇", "code" => "610922101"},
      %{"name" => "两河镇", "code" => "610922102"},
      %{"name" => "迎丰镇", "code" => "610922103"},
      %{"name" => "池河镇", "code" => "610922104"},
      %{"name" => "后柳镇", "code" => "610922105"},
      %{"name" => "喜河镇", "code" => "610922106"},
      %{"name" => "熨斗镇", "code" => "610922107"},
      %{"name" => "云雾山镇", "code" => "610922108"},
      %{"name" => "中池镇", "code" => "610922109"},
      %{"name" => "曾溪镇", "code" => "610922110"}
    ]

  def next(input) when input == "宁陕县" or input == "610923",
    do: [
      %{"name" => "城关镇", "code" => "610923100"},
      %{"name" => "四亩地镇", "code" => "610923101"},
      %{"name" => "江口镇", "code" => "610923102"},
      %{"name" => "广货街镇", "code" => "610923104"},
      %{"name" => "龙王镇", "code" => "610923105"},
      %{"name" => "筒车湾镇", "code" => "610923106"},
      %{"name" => "金川镇", "code" => "610923108"},
      %{"name" => "皇冠镇", "code" => "610923109"},
      %{"name" => "太山庙镇", "code" => "610923110"},
      %{"name" => "梅子镇", "code" => "610923111"},
      %{"name" => "新场镇", "code" => "610923113"}
    ]

  def next(input) when input == "紫阳县" or input == "610924",
    do: [
      %{"name" => "城关镇", "code" => "610924100"},
      %{"name" => "蒿坪镇", "code" => "610924101"},
      %{"name" => "汉王镇", "code" => "610924102"},
      %{"name" => "焕古镇", "code" => "610924103"},
      %{"name" => "向阳镇", "code" => "610924104"},
      %{"name" => "洞河镇", "code" => "610924105"},
      %{"name" => "洄水镇", "code" => "610924106"},
      %{"name" => "双桥镇", "code" => "610924108"},
      %{"name" => "高桥镇", "code" => "610924109"},
      %{"name" => "红椿镇", "code" => "610924110"},
      %{"name" => "高滩镇", "code" => "610924111"},
      %{"name" => "毛坝镇", "code" => "610924112"},
      %{"name" => "瓦庙镇", "code" => "610924113"},
      %{"name" => "麻柳镇", "code" => "610924114"},
      %{"name" => "双安镇", "code" => "610924115"},
      %{"name" => "东木镇", "code" => "610924116"},
      %{"name" => "界岭镇", "code" => "610924117"}
    ]

  def next(input) when input == "岚皋县" or input == "610925",
    do: [
      %{"name" => "城关镇", "code" => "610925100"},
      %{"name" => "佐龙镇", "code" => "610925101"},
      %{"name" => "滔河镇", "code" => "610925103"},
      %{"name" => "官元镇", "code" => "610925104"},
      %{"name" => "石门镇", "code" => "610925105"},
      %{"name" => "民主镇", "code" => "610925106"},
      %{"name" => "大道河镇", "code" => "610925107"},
      %{"name" => "堰门镇", "code" => "610925109"},
      %{"name" => "蔺河镇", "code" => "610925111"},
      %{"name" => "四季镇", "code" => "610925112"},
      %{"name" => "孟石岭镇", "code" => "610925114"},
      %{"name" => "南宫山镇", "code" => "610925115"}
    ]

  def next(input) when input == "平利县" or input == "610926",
    do: [
      %{"name" => "城关镇", "code" => "610926100"},
      %{"name" => "兴隆镇", "code" => "610926101"},
      %{"name" => "老县镇", "code" => "610926102"},
      %{"name" => "大贵镇", "code" => "610926103"},
      %{"name" => "三阳镇", "code" => "610926104"},
      %{"name" => "洛河镇", "code" => "610926105"},
      %{"name" => "广佛镇", "code" => "610926106"},
      %{"name" => "八仙镇", "code" => "610926107"},
      %{"name" => "长安镇", "code" => "610926108"},
      %{"name" => "正阳镇", "code" => "610926109"},
      %{"name" => "西河镇", "code" => "610926110"}
    ]

  def next(input) when input == "镇坪县" or input == "610927",
    do: [
      %{"name" => "城关镇", "code" => "610927100"},
      %{"name" => "曾家镇", "code" => "610927101"},
      %{"name" => "牛头店镇", "code" => "610927102"},
      %{"name" => "钟宝镇", "code" => "610927103"},
      %{"name" => "上竹镇", "code" => "610927105"},
      %{"name" => "华坪镇", "code" => "610927106"},
      %{"name" => "曙坪镇", "code" => "610927108"}
    ]

  def next(input) when input == "白河县" or input == "610929",
    do: [
      %{"name" => "城关镇", "code" => "610929100"},
      %{"name" => "中厂镇", "code" => "610929101"},
      %{"name" => "构朳镇", "code" => "610929102"},
      %{"name" => "卡子镇", "code" => "610929103"},
      %{"name" => "茅坪镇", "code" => "610929104"},
      %{"name" => "宋家镇", "code" => "610929105"},
      %{"name" => "西营镇", "code" => "610929106"},
      %{"name" => "仓上镇", "code" => "610929107"},
      %{"name" => "冷水镇", "code" => "610929108"},
      %{"name" => "双丰镇", "code" => "610929109"},
      %{"name" => "麻虎镇", "code" => "610929110"}
    ]

  def next(input) when input == "旬阳市" or input == "610981",
    do: [
      %{"name" => "城关镇", "code" => "610981100"},
      %{"name" => "棕溪镇", "code" => "610981101"},
      %{"name" => "关口镇", "code" => "610981102"},
      %{"name" => "蜀河镇", "code" => "610981103"},
      %{"name" => "双河镇", "code" => "610981104"},
      %{"name" => "小河镇", "code" => "610981105"},
      %{"name" => "赵湾镇", "code" => "610981106"},
      %{"name" => "麻坪镇", "code" => "610981107"},
      %{"name" => "甘溪镇", "code" => "610981108"},
      %{"name" => "白柳镇", "code" => "610981109"},
      %{"name" => "吕河镇", "code" => "610981110"},
      %{"name" => "神河镇", "code" => "610981111"},
      %{"name" => "铜钱关镇", "code" => "610981112"},
      %{"name" => "段家河镇", "code" => "610981113"},
      %{"name" => "仙河镇", "code" => "610981114"},
      %{"name" => "金寨镇", "code" => "610981115"},
      %{"name" => "桐木镇", "code" => "610981116"},
      %{"name" => "构元镇", "code" => "610981117"},
      %{"name" => "石门镇", "code" => "610981118"},
      %{"name" => "红军镇", "code" => "610981119"},
      %{"name" => "仁河口镇", "code" => "610981120"}
    ]

  def next(input) when input == "榆阳区" or input == "610802",
    do: [
      %{"name" => "鼓楼街道", "code" => "610802001"},
      %{"name" => "青山路街道", "code" => "610802002"},
      %{"name" => "上郡路街道", "code" => "610802003"},
      %{"name" => "新明楼街道", "code" => "610802004"},
      %{"name" => "驼峰路街道", "code" => "610802005"},
      %{"name" => "崇文路街道", "code" => "610802006"},
      %{"name" => "航宇路街道", "code" => "610802007"},
      %{"name" => "长城路街道", "code" => "610802008"},
      %{"name" => "金沙路街道", "code" => "610802009"},
      %{"name" => "朝阳路街道", "code" => "610802010"},
      %{"name" => "沙河路街道", "code" => "610802011"},
      %{"name" => "明珠路街道", "code" => "610802012"},
      %{"name" => "鱼河镇", "code" => "610802100"},
      %{"name" => "上盐湾镇", "code" => "610802101"},
      %{"name" => "镇川镇", "code" => "610802102"},
      %{"name" => "麻黄梁镇", "code" => "610802105"},
      %{"name" => "牛家梁镇", "code" => "610802106"},
      %{"name" => "金鸡滩镇", "code" => "610802107"},
      %{"name" => "马合镇", "code" => "610802108"},
      %{"name" => "巴拉素镇", "code" => "610802109"},
      %{"name" => "鱼河峁镇", "code" => "610802111"},
      %{"name" => "青云镇", "code" => "610802112"},
      %{"name" => "古塔镇", "code" => "610802113"},
      %{"name" => "大河塔镇", "code" => "610802114"},
      %{"name" => "小纪汗镇", "code" => "610802115"},
      %{"name" => "芹河镇", "code" => "610802116"},
      %{"name" => "孟家湾乡", "code" => "610802205"},
      %{"name" => "小壕兔乡", "code" => "610802206"},
      %{"name" => "岔河则乡", "code" => "610802207"},
      %{"name" => "补浪河乡", "code" => "610802208"},
      %{"name" => "红石桥乡", "code" => "610802209"}
    ]

  def next(input) when input == "横山区" or input == "610803",
    do: [
      %{"name" => "城关街道", "code" => "610803001"},
      %{"name" => "怀远街道", "code" => "610803002"},
      %{"name" => "夏州街道", "code" => "610803003"},
      %{"name" => "怀仁路街道", "code" => "610803004"},
      %{"name" => "崇德路街道", "code" => "610803005"},
      %{"name" => "石湾镇", "code" => "610803101"},
      %{"name" => "高镇", "code" => "610803102"},
      %{"name" => "武镇", "code" => "610803103"},
      %{"name" => "党岔镇", "code" => "610803104"},
      %{"name" => "响水镇", "code" => "610803105"},
      %{"name" => "波罗镇", "code" => "610803106"},
      %{"name" => "殿市镇", "code" => "610803107"},
      %{"name" => "塔湾镇", "code" => "610803108"},
      %{"name" => "赵石畔镇", "code" => "610803109"},
      %{"name" => "魏家楼镇", "code" => "610803110"},
      %{"name" => "韩岔镇", "code" => "610803111"},
      %{"name" => "白界镇", "code" => "610803112"},
      %{"name" => "雷龙湾镇", "code" => "610803113"}
    ]

  def next(input) when input == "府谷县" or input == "610822",
    do: [
      %{"name" => "府谷镇", "code" => "610822100"},
      %{"name" => "黄甫镇", "code" => "610822101"},
      %{"name" => "哈镇", "code" => "610822103"},
      %{"name" => "庙沟门镇", "code" => "610822104"},
      %{"name" => "新民镇", "code" => "610822105"},
      %{"name" => "孤山镇", "code" => "610822106"},
      %{"name" => "清水镇", "code" => "610822107"},
      %{"name" => "大昌汗镇", "code" => "610822108"},
      %{"name" => "古城镇", "code" => "610822109"},
      %{"name" => "三道沟镇", "code" => "610822110"},
      %{"name" => "老高川镇", "code" => "610822111"},
      %{"name" => "武家庄镇", "code" => "610822112"},
      %{"name" => "木瓜镇", "code" => "610822113"},
      %{"name" => "田家寨镇", "code" => "610822114"}
    ]

  def next(input) when input == "靖边县" or input == "610824",
    do: [
      %{"name" => "张家畔街道", "code" => "610824001"},
      %{"name" => "东坑镇", "code" => "610824101"},
      %{"name" => "青阳岔镇", "code" => "610824102"},
      %{"name" => "宁条梁镇", "code" => "610824103"},
      %{"name" => "周河镇", "code" => "610824104"},
      %{"name" => "红墩界镇", "code" => "610824105"},
      %{"name" => "杨桥畔镇", "code" => "610824106"},
      %{"name" => "王渠则镇", "code" => "610824107"},
      %{"name" => "中山涧镇", "code" => "610824108"},
      %{"name" => "杨米涧镇", "code" => "610824109"},
      %{"name" => "天赐湾镇", "code" => "610824110"},
      %{"name" => "小河镇", "code" => "610824111"},
      %{"name" => "龙洲镇", "code" => "610824112"},
      %{"name" => "黄蒿界镇", "code" => "610824113"},
      %{"name" => "海则滩镇", "code" => "610824114"},
      %{"name" => "席麻湾镇", "code" => "610824115"},
      %{"name" => "镇靖镇", "code" => "610824116"}
    ]

  def next(input) when input == "定边县" or input == "610825",
    do: [
      %{"name" => "定边街道", "code" => "610825001"},
      %{"name" => "贺圈镇", "code" => "610825101"},
      %{"name" => "红柳沟镇", "code" => "610825102"},
      %{"name" => "砖井镇", "code" => "610825103"},
      %{"name" => "白泥井镇", "code" => "610825104"},
      %{"name" => "安边镇", "code" => "610825105"},
      %{"name" => "堆子梁镇", "code" => "610825106"},
      %{"name" => "白湾子镇", "code" => "610825107"},
      %{"name" => "姬塬镇", "code" => "610825108"},
      %{"name" => "杨井镇", "code" => "610825109"},
      %{"name" => "新安边镇", "code" => "610825110"},
      %{"name" => "张崾先镇", "code" => "610825111"},
      %{"name" => "樊学镇", "code" => "610825112"},
      %{"name" => "盐场堡镇", "code" => "610825113"},
      %{"name" => "郝滩镇", "code" => "610825114"},
      %{"name" => "石洞沟镇", "code" => "610825115"},
      %{"name" => "冯地坑镇", "code" => "610825116"},
      %{"name" => "油房庄乡", "code" => "610825204"},
      %{"name" => "学庄乡", "code" => "610825210"}
    ]

  def next(input) when input == "绥德县" or input == "610826",
    do: [
      %{"name" => "名州镇", "code" => "610826100"},
      %{"name" => "薛家峁镇", "code" => "610826101"},
      %{"name" => "崔家湾镇", "code" => "610826102"},
      %{"name" => "定仙墕镇", "code" => "610826103"},
      %{"name" => "枣林坪镇", "code" => "610826104"},
      %{"name" => "义合镇", "code" => "610826105"},
      %{"name" => "吉镇", "code" => "610826106"},
      %{"name" => "薛家河镇", "code" => "610826107"},
      %{"name" => "四十里铺镇", "code" => "610826108"},
      %{"name" => "石家湾镇", "code" => "610826109"},
      %{"name" => "田庄镇", "code" => "610826110"},
      %{"name" => "中角镇", "code" => "610826111"},
      %{"name" => "满堂川镇", "code" => "610826112"},
      %{"name" => "张家砭镇", "code" => "610826113"},
      %{"name" => "白家硷镇", "code" => "610826114"}
    ]

  def next(input) when input == "米脂县" or input == "610827",
    do: [
      %{"name" => "银州街道", "code" => "610827001"},
      %{"name" => "桃镇", "code" => "610827101"},
      %{"name" => "龙镇", "code" => "610827102"},
      %{"name" => "杨家沟镇", "code" => "610827103"},
      %{"name" => "杜家石沟镇", "code" => "610827104"},
      %{"name" => "沙家店镇", "code" => "610827105"},
      %{"name" => "印斗镇", "code" => "610827106"},
      %{"name" => "郭兴庄镇", "code" => "610827107"},
      %{"name" => "城郊镇", "code" => "610827108"}
    ]

  def next(input) when input == "佳县" or input == "610828",
    do: [
      %{"name" => "佳州街道", "code" => "610828001"},
      %{"name" => "坑镇", "code" => "610828101"},
      %{"name" => "店镇", "code" => "610828102"},
      %{"name" => "乌镇", "code" => "610828103"},
      %{"name" => "金明寺镇", "code" => "610828104"},
      %{"name" => "通镇", "code" => "610828105"},
      %{"name" => "王家砭镇", "code" => "610828106"},
      %{"name" => "方塌镇", "code" => "610828107"},
      %{"name" => "朱家坬镇", "code" => "610828108"},
      %{"name" => "螅镇", "code" => "610828109"},
      %{"name" => "朱官寨镇", "code" => "610828110"},
      %{"name" => "刘国具镇", "code" => "610828111"},
      %{"name" => "木头峪镇", "code" => "610828112"}
    ]

  def next(input) when input == "吴堡县" or input == "610829",
    do: [
      %{"name" => "宋家川街道", "code" => "610829001"},
      %{"name" => "辛家沟镇", "code" => "610829101"},
      %{"name" => "郭家沟镇", "code" => "610829102"},
      %{"name" => "寇家塬镇", "code" => "610829103"},
      %{"name" => "岔上镇", "code" => "610829104"},
      %{"name" => "张家山镇", "code" => "610829105"}
    ]

  def next(input) when input == "清涧县" or input == "610830",
    do: [
      %{"name" => "宽州镇", "code" => "610830100"},
      %{"name" => "石咀驿镇", "code" => "610830101"},
      %{"name" => "折家坪镇", "code" => "610830102"},
      %{"name" => "玉家河镇", "code" => "610830103"},
      %{"name" => "高杰村镇", "code" => "610830104"},
      %{"name" => "李家塔镇", "code" => "610830105"},
      %{"name" => "店则沟镇", "code" => "610830106"},
      %{"name" => "解家沟镇", "code" => "610830107"},
      %{"name" => "下廿里铺镇", "code" => "610830108"}
    ]

  def next(input) when input == "子洲县" or input == "610831",
    do: [
      %{"name" => "双湖峪街道", "code" => "610831001"},
      %{"name" => "何家集镇", "code" => "610831101"},
      %{"name" => "老君殿镇", "code" => "610831102"},
      %{"name" => "裴家湾镇", "code" => "610831103"},
      %{"name" => "苗家坪镇", "code" => "610831104"},
      %{"name" => "三川口镇", "code" => "610831105"},
      %{"name" => "马蹄沟镇", "code" => "610831106"},
      %{"name" => "周家硷镇", "code" => "610831107"},
      %{"name" => "电市镇", "code" => "610831108"},
      %{"name" => "砖庙镇", "code" => "610831109"},
      %{"name" => "淮宁湾镇", "code" => "610831110"},
      %{"name" => "马岔镇", "code" => "610831111"},
      %{"name" => "驼耳巷乡", "code" => "610831200"}
    ]

  def next(input) when input == "神木市" or input == "610881",
    do: [
      %{"name" => "滨河新区街道", "code" => "610881001"},
      %{"name" => "西沙街道", "code" => "610881002"},
      %{"name" => "麟州街道", "code" => "610881003"},
      %{"name" => "迎宾路街道", "code" => "610881004"},
      %{"name" => "永兴街道", "code" => "610881005"},
      %{"name" => "西沟街道", "code" => "610881006"},
      %{"name" => "高家堡镇", "code" => "610881101"},
      %{"name" => "店塔镇", "code" => "610881102"},
      %{"name" => "孙家岔镇", "code" => "610881103"},
      %{"name" => "大柳塔镇", "code" => "610881104"},
      %{"name" => "花石崖镇", "code" => "610881105"},
      %{"name" => "中鸡镇", "code" => "610881106"},
      %{"name" => "贺家川镇", "code" => "610881107"},
      %{"name" => "尔林兔镇", "code" => "610881108"},
      %{"name" => "万镇", "code" => "610881109"},
      %{"name" => "大保当镇", "code" => "610881110"},
      %{"name" => "马镇", "code" => "610881111"},
      %{"name" => "栏杆堡镇", "code" => "610881112"},
      %{"name" => "沙峁镇", "code" => "610881113"},
      %{"name" => "锦界镇", "code" => "610881114"}
    ]

  def next(input) when input == "汉台区" or input == "610702",
    do: [
      %{"name" => "北关街道", "code" => "610702001"},
      %{"name" => "东大街街道", "code" => "610702002"},
      %{"name" => "汉中路街道", "code" => "610702003"},
      %{"name" => "中山街街道", "code" => "610702004"},
      %{"name" => "东关街道", "code" => "610702005"},
      %{"name" => "鑫源街道", "code" => "610702006"},
      %{"name" => "七里街道", "code" => "610702008"},
      %{"name" => "龙江街道", "code" => "610702009"},
      %{"name" => "铺镇", "code" => "610702100"},
      %{"name" => "武乡镇", "code" => "610702101"},
      %{"name" => "河东店镇", "code" => "610702102"},
      %{"name" => "宗营镇", "code" => "610702104"},
      %{"name" => "老君镇", "code" => "610702105"},
      %{"name" => "汉王镇", "code" => "610702106"},
      %{"name" => "徐望镇", "code" => "610702107"}
    ]

  def next(input) when input == "南郑区" or input == "610703",
    do: [
      %{"name" => "汉山街道", "code" => "610703001"},
      %{"name" => "中所营街道", "code" => "610703002"},
      %{"name" => "圣水镇", "code" => "610703101"},
      %{"name" => "大河坎镇", "code" => "610703102"},
      %{"name" => "协税镇", "code" => "610703103"},
      %{"name" => "梁山镇", "code" => "610703104"},
      %{"name" => "阳春镇", "code" => "610703105"},
      %{"name" => "高台镇", "code" => "610703106"},
      %{"name" => "新集镇", "code" => "610703107"},
      %{"name" => "濂水镇", "code" => "610703108"},
      %{"name" => "黄官镇", "code" => "610703109"},
      %{"name" => "青树镇", "code" => "610703110"},
      %{"name" => "红庙镇", "code" => "610703111"},
      %{"name" => "牟家坝镇", "code" => "610703112"},
      %{"name" => "法镇", "code" => "610703113"},
      %{"name" => "湘水镇", "code" => "610703114"},
      %{"name" => "小南海镇", "code" => "610703115"},
      %{"name" => "碑坝镇", "code" => "610703116"},
      %{"name" => "黎坪镇", "code" => "610703117"},
      %{"name" => "福成镇", "code" => "610703118"},
      %{"name" => "两河镇", "code" => "610703119"},
      %{"name" => "胡家营镇", "code" => "610703120"}
    ]

  def next(input) when input == "城固县" or input == "610722",
    do: [
      %{"name" => "博望街道", "code" => "610722001"},
      %{"name" => "莲花街道", "code" => "610722002"},
      %{"name" => "龙头镇", "code" => "610722101"},
      %{"name" => "沙河营镇", "code" => "610722102"},
      %{"name" => "文川镇", "code" => "610722103"},
      %{"name" => "柳林镇", "code" => "610722104"},
      %{"name" => "老庄镇", "code" => "610722105"},
      %{"name" => "桔园镇", "code" => "610722107"},
      %{"name" => "原公镇", "code" => "610722108"},
      %{"name" => "上元观镇", "code" => "610722109"},
      %{"name" => "天明镇", "code" => "610722110"},
      %{"name" => "二里镇", "code" => "610722111"},
      %{"name" => "五堵镇", "code" => "610722112"},
      %{"name" => "双溪镇", "code" => "610722114"},
      %{"name" => "小河镇", "code" => "610722116"},
      %{"name" => "董家营镇", "code" => "610722119"},
      %{"name" => "三合镇", "code" => "610722120"}
    ]

  def next(input) when input == "洋县" or input == "610723",
    do: [
      %{"name" => "洋州街道", "code" => "610723001"},
      %{"name" => "纸坊街道", "code" => "610723002"},
      %{"name" => "戚氏街道", "code" => "610723003"},
      %{"name" => "龙亭镇", "code" => "610723103"},
      %{"name" => "谢村镇", "code" => "610723104"},
      %{"name" => "马畅镇", "code" => "610723105"},
      %{"name" => "溢水镇", "code" => "610723107"},
      %{"name" => "磨子桥镇", "code" => "610723108"},
      %{"name" => "黄家营镇", "code" => "610723109"},
      %{"name" => "黄安镇", "code" => "610723110"},
      %{"name" => "黄金峡镇", "code" => "610723111"},
      %{"name" => "槐树关镇", "code" => "610723112"},
      %{"name" => "金水镇", "code" => "610723113"},
      %{"name" => "华阳镇", "code" => "610723114"},
      %{"name" => "茅坪镇", "code" => "610723115"},
      %{"name" => "八里关镇", "code" => "610723119"},
      %{"name" => "桑溪镇", "code" => "610723120"},
      %{"name" => "关帝镇", "code" => "610723121"}
    ]

  def next(input) when input == "西乡县" or input == "610724",
    do: [
      %{"name" => "城北街道", "code" => "610724001"},
      %{"name" => "城南街道", "code" => "610724002"},
      %{"name" => "杨河镇", "code" => "610724101"},
      %{"name" => "柳树镇", "code" => "610724102"},
      %{"name" => "沙河镇", "code" => "610724103"},
      %{"name" => "私渡镇", "code" => "610724104"},
      %{"name" => "桑园镇", "code" => "610724105"},
      %{"name" => "白龙塘镇", "code" => "610724106"},
      %{"name" => "峡口镇", "code" => "610724108"},
      %{"name" => "堰口镇", "code" => "610724109"},
      %{"name" => "茶镇", "code" => "610724110"},
      %{"name" => "高川镇", "code" => "610724111"},
      %{"name" => "两河口镇", "code" => "610724112"},
      %{"name" => "大河镇", "code" => "610724114"},
      %{"name" => "骆家坝镇", "code" => "610724116"},
      %{"name" => "子午镇", "code" => "610724117"},
      %{"name" => "白勉峡镇", "code" => "610724118"}
    ]

  def next(input) when input == "勉县" or input == "610725",
    do: [
      %{"name" => "勉阳街道", "code" => "610725001"},
      %{"name" => "武侯镇", "code" => "610725101"},
      %{"name" => "周家山镇", "code" => "610725102"},
      %{"name" => "同沟寺镇", "code" => "610725103"},
      %{"name" => "新街子镇", "code" => "610725105"},
      %{"name" => "老道寺镇", "code" => "610725106"},
      %{"name" => "褒城镇", "code" => "610725107"},
      %{"name" => "金泉镇", "code" => "610725109"},
      %{"name" => "定军山镇", "code" => "610725110"},
      %{"name" => "温泉镇", "code" => "610725111"},
      %{"name" => "元墩镇", "code" => "610725112"},
      %{"name" => "阜川镇", "code" => "610725113"},
      %{"name" => "新铺镇", "code" => "610725114"},
      %{"name" => "茶店镇", "code" => "610725116"},
      %{"name" => "镇川镇", "code" => "610725117"},
      %{"name" => "漆树坝镇", "code" => "610725118"},
      %{"name" => "张家河镇", "code" => "610725119"},
      %{"name" => "长沟河镇", "code" => "610725120"}
    ]

  def next(input) when input == "宁强县" or input == "610726",
    do: [
      %{"name" => "汉源街道", "code" => "610726001"},
      %{"name" => "高寨子街道", "code" => "610726002"},
      %{"name" => "大安镇", "code" => "610726102"},
      %{"name" => "代家坝镇", "code" => "610726103"},
      %{"name" => "阳平关镇", "code" => "610726104"},
      %{"name" => "燕子砭镇", "code" => "610726105"},
      %{"name" => "广坪镇", "code" => "610726106"},
      %{"name" => "青木川镇", "code" => "610726107"},
      %{"name" => "毛坝河镇", "code" => "610726108"},
      %{"name" => "铁锁关镇", "code" => "610726109"},
      %{"name" => "胡家坝镇", "code" => "610726110"},
      %{"name" => "巴山镇", "code" => "610726111"},
      %{"name" => "巨亭镇", "code" => "610726112"},
      %{"name" => "舒家坝镇", "code" => "610726113"},
      %{"name" => "太阳岭镇", "code" => "610726117"},
      %{"name" => "安乐河镇", "code" => "610726118"},
      %{"name" => "二郎坝镇", "code" => "610726119"},
      %{"name" => "禅家岩镇", "code" => "610726120"}
    ]

  def next(input) when input == "略阳县" or input == "610727",
    do: [
      %{"name" => "兴州街道", "code" => "610727001"},
      %{"name" => "横现河街道", "code" => "610727002"},
      %{"name" => "接官亭镇", "code" => "610727101"},
      %{"name" => "西淮坝镇", "code" => "610727102"},
      %{"name" => "两河口镇", "code" => "610727103"},
      %{"name" => "金家河镇", "code" => "610727104"},
      %{"name" => "徐家坪镇", "code" => "610727105"},
      %{"name" => "白水江镇", "code" => "610727106"},
      %{"name" => "硖口驿镇", "code" => "610727107"},
      %{"name" => "马蹄湾镇", "code" => "610727108"},
      %{"name" => "乐素河镇", "code" => "610727109"},
      %{"name" => "郭镇", "code" => "610727110"},
      %{"name" => "黑河镇", "code" => "610727111"},
      %{"name" => "白雀寺镇", "code" => "610727112"},
      %{"name" => "仙台坝镇", "code" => "610727113"},
      %{"name" => "五龙洞镇", "code" => "610727114"},
      %{"name" => "观音寺镇", "code" => "610727115"}
    ]

  def next(input) when input == "镇巴县" or input == "610728",
    do: [
      %{"name" => "泾洋街道", "code" => "610728001"},
      %{"name" => "渔渡镇", "code" => "610728101"},
      %{"name" => "盐场镇", "code" => "610728102"},
      %{"name" => "观音镇", "code" => "610728103"},
      %{"name" => "巴庙镇", "code" => "610728104"},
      %{"name" => "兴隆镇", "code" => "610728105"},
      %{"name" => "长岭镇", "code" => "610728106"},
      %{"name" => "三元镇", "code" => "610728107"},
      %{"name" => "简池镇", "code" => "610728108"},
      %{"name" => "碾子镇", "code" => "610728109"},
      %{"name" => "小洋镇", "code" => "610728110"},
      %{"name" => "青水镇", "code" => "610728111"},
      %{"name" => "赤南镇", "code" => "610728112"},
      %{"name" => "平安镇", "code" => "610728113"},
      %{"name" => "杨家河镇", "code" => "610728114"},
      %{"name" => "巴山镇", "code" => "610728115"},
      %{"name" => "黎坝镇", "code" => "610728116"},
      %{"name" => "仁村镇", "code" => "610728117"},
      %{"name" => "大池镇", "code" => "610728118"},
      %{"name" => "永乐镇", "code" => "610728120"}
    ]

  def next(input) when input == "留坝县" or input == "610729",
    do: [
      %{"name" => "紫柏街道", "code" => "610729001"},
      %{"name" => "马道镇", "code" => "610729101"},
      %{"name" => "武关驿镇", "code" => "610729102"},
      %{"name" => "留侯镇", "code" => "610729103"},
      %{"name" => "江口镇", "code" => "610729104"},
      %{"name" => "玉皇庙镇", "code" => "610729105"},
      %{"name" => "火烧店镇", "code" => "610729106"},
      %{"name" => "青桥驿镇", "code" => "610729107"}
    ]

  def next(input) when input == "佛坪县" or input == "610730",
    do: [
      %{"name" => "袁家庄街道", "code" => "610730001"},
      %{"name" => "陈家坝镇", "code" => "610730101"},
      %{"name" => "大河坝镇", "code" => "610730102"},
      %{"name" => "西岔河镇", "code" => "610730103"},
      %{"name" => "岳坝镇", "code" => "610730104"},
      %{"name" => "长角坝镇", "code" => "610730105"},
      %{"name" => "石墩河镇", "code" => "610730106"}
    ]

  def next(input) when input == "宝塔区" or input == "610602",
    do: [
      %{"name" => "宝塔山街道", "code" => "610602001"},
      %{"name" => "南市街道", "code" => "610602002"},
      %{"name" => "凤凰山街道", "code" => "610602003"},
      %{"name" => "枣园街道", "code" => "610602004"},
      %{"name" => "桥沟街道", "code" => "610602005"},
      %{"name" => "新城街道", "code" => "610602006"},
      %{"name" => "河庄坪镇", "code" => "610602102"},
      %{"name" => "李渠镇", "code" => "610602103"},
      %{"name" => "姚店镇", "code" => "610602104"},
      %{"name" => "青化砭镇", "code" => "610602105"},
      %{"name" => "蟠龙镇", "code" => "610602106"},
      %{"name" => "柳林镇", "code" => "610602107"},
      %{"name" => "南泥湾镇", "code" => "610602108"},
      %{"name" => "临镇", "code" => "610602109"},
      %{"name" => "甘谷驿镇", "code" => "610602110"},
      %{"name" => "万花山镇", "code" => "610602111"},
      %{"name" => "川口镇", "code" => "610602112"},
      %{"name" => "麻洞川镇", "code" => "610602113"},
      %{"name" => "冯庄乡", "code" => "610602202"}
    ]

  def next(input) when input == "安塞区" or input == "610603",
    do: [
      %{"name" => "真武洞街道", "code" => "610603001"},
      %{"name" => "金明街道", "code" => "610603002"},
      %{"name" => "白坪街道", "code" => "610603003"},
      %{"name" => "砖窑湾镇", "code" => "610603101"},
      %{"name" => "沿河湾镇", "code" => "610603102"},
      %{"name" => "招安镇", "code" => "610603103"},
      %{"name" => "化子坪镇", "code" => "610603104"},
      %{"name" => "坪桥镇", "code" => "610603105"},
      %{"name" => "建华镇", "code" => "610603106"},
      %{"name" => "高桥镇", "code" => "610603107"},
      %{"name" => "镰刀湾镇", "code" => "610603108"}
    ]

  def next(input) when input == "延长县" or input == "610621",
    do: [
      %{"name" => "七里村街道", "code" => "610621001"},
      %{"name" => "黑家堡镇", "code" => "610621101"},
      %{"name" => "郑庄镇", "code" => "610621102"},
      %{"name" => "张家滩镇", "code" => "610621103"},
      %{"name" => "交口镇", "code" => "610621104"},
      %{"name" => "雷赤镇", "code" => "610621106"},
      %{"name" => "罗子山镇", "code" => "610621107"},
      %{"name" => "安沟镇", "code" => "610621108"}
    ]

  def next(input) when input == "延川县" or input == "610622",
    do: [
      %{"name" => "大禹街道", "code" => "610622001"},
      %{"name" => "永坪镇", "code" => "610622101"},
      %{"name" => "延水关镇", "code" => "610622102"},
      %{"name" => "文安驿镇", "code" => "610622103"},
      %{"name" => "杨家圪台镇", "code" => "610622104"},
      %{"name" => "贾家坪镇", "code" => "610622105"},
      %{"name" => "关庄镇", "code" => "610622107"},
      %{"name" => "乾坤湾镇", "code" => "610622108"}
    ]

  def next(input) when input == "志丹县" or input == "610625",
    do: [
      %{"name" => "保安街道", "code" => "610625001"},
      %{"name" => "杏河镇", "code" => "610625101"},
      %{"name" => "顺宁镇", "code" => "610625102"},
      %{"name" => "旦八镇", "code" => "610625103"},
      %{"name" => "金丁镇", "code" => "610625104"},
      %{"name" => "永宁镇", "code" => "610625105"},
      %{"name" => "义正镇", "code" => "610625106"},
      %{"name" => "双河镇", "code" => "610625107"}
    ]

  def next(input) when input == "吴起县" or input == "610626",
    do: [
      %{"name" => "吴起街道", "code" => "610626001"},
      %{"name" => "铁边城镇", "code" => "610626101"},
      %{"name" => "周湾镇", "code" => "610626102"},
      %{"name" => "白豹镇", "code" => "610626103"},
      %{"name" => "长官庙镇", "code" => "610626104"},
      %{"name" => "长城镇", "code" => "610626105"},
      %{"name" => "五谷城镇", "code" => "610626106"},
      %{"name" => "吴仓堡镇", "code" => "610626107"},
      %{"name" => "庙沟镇", "code" => "610626108"}
    ]

  def next(input) when input == "甘泉县" or input == "610627",
    do: [
      %{"name" => "美水街道", "code" => "610627001"},
      %{"name" => "下寺湾镇", "code" => "610627101"},
      %{"name" => "道镇", "code" => "610627102"},
      %{"name" => "石门镇", "code" => "610627103"},
      %{"name" => "桥镇乡", "code" => "610627200"},
      %{"name" => "劳山乡", "code" => "610627203"}
    ]

  def next(input) when input == "富县" or input == "610628",
    do: [
      %{"name" => "茶坊街道", "code" => "610628001"},
      %{"name" => "羊泉镇", "code" => "610628101"},
      %{"name" => "张村驿镇", "code" => "610628102"},
      %{"name" => "张家湾镇", "code" => "610628103"},
      %{"name" => "直罗镇", "code" => "610628104"},
      %{"name" => "牛武镇", "code" => "610628106"},
      %{"name" => "寺仙镇", "code" => "610628109"},
      %{"name" => "北道德乡", "code" => "610628204"}
    ]

  def next(input) when input == "洛川县" or input == "610629",
    do: [
      %{"name" => "凤栖街道", "code" => "610629001"},
      %{"name" => "旧县镇", "code" => "610629101"},
      %{"name" => "交口河镇", "code" => "610629102"},
      %{"name" => "老庙镇", "code" => "610629103"},
      %{"name" => "土基镇", "code" => "610629104"},
      %{"name" => "石头镇", "code" => "610629105"},
      %{"name" => "槐柏镇", "code" => "610629106"},
      %{"name" => "永乡镇", "code" => "610629107"},
      %{"name" => "菩提镇", "code" => "610629108"}
    ]

  def next(input) when input == "宜川县" or input == "610630",
    do: [
      %{"name" => "丹州街道", "code" => "610630001"},
      %{"name" => "秋林镇", "code" => "610630101"},
      %{"name" => "云岩镇", "code" => "610630102"},
      %{"name" => "集义镇", "code" => "610630104"},
      %{"name" => "壶口镇", "code" => "610630105"},
      %{"name" => "英旺乡", "code" => "610630200"},
      %{"name" => "交里乡", "code" => "610630201"}
    ]

  def next(input) when input == "黄龙县" or input == "610631",
    do: [
      %{"name" => "石堡镇", "code" => "610631100"},
      %{"name" => "白马滩镇", "code" => "610631101"},
      %{"name" => "瓦子街镇", "code" => "610631102"},
      %{"name" => "界头庙镇", "code" => "610631106"},
      %{"name" => "三岔镇", "code" => "610631107"},
      %{"name" => "圪台乡", "code" => "610631205"},
      %{"name" => "崾崄乡", "code" => "610631206"}
    ]

  def next(input) when input == "黄陵县" or input == "610632",
    do: [
      %{"name" => "桥山街道", "code" => "610632001"},
      %{"name" => "店头镇", "code" => "610632101"},
      %{"name" => "隆坊镇", "code" => "610632102"},
      %{"name" => "田庄镇", "code" => "610632103"},
      %{"name" => "阿党镇", "code" => "610632104"},
      %{"name" => "双龙镇", "code" => "610632105"}
    ]

  def next(input) when input == "子长市" or input == "610681",
    do: [
      %{"name" => "瓦窑堡街道", "code" => "610681001"},
      %{"name" => "秀延街道", "code" => "610681002"},
      %{"name" => "栾家坪街道", "code" => "610681003"},
      %{"name" => "杨家园则镇", "code" => "610681101"},
      %{"name" => "玉家湾镇", "code" => "610681102"},
      %{"name" => "安定镇", "code" => "610681103"},
      %{"name" => "马家砭镇", "code" => "610681104"},
      %{"name" => "南沟岔镇", "code" => "610681105"},
      %{"name" => "涧峪岔镇", "code" => "610681106"},
      %{"name" => "李家岔镇", "code" => "610681107"},
      %{"name" => "余家坪镇", "code" => "610681108"}
    ]

  def next(input) when input == "临渭区" or input == "610502",
    do: [
      %{"name" => "人民街道", "code" => "610502001"},
      %{"name" => "杜桥街道", "code" => "610502002"},
      %{"name" => "解放街道", "code" => "610502003"},
      %{"name" => "向阳街道", "code" => "610502004"},
      %{"name" => "站南街道", "code" => "610502005"},
      %{"name" => "双王街道", "code" => "610502006"},
      %{"name" => "良田街道", "code" => "610502007"},
      %{"name" => "崇业路街道", "code" => "610502008"},
      %{"name" => "辛市街道", "code" => "610502009"},
      %{"name" => "龙背街道", "code" => "610502010"},
      %{"name" => "阳曲街道", "code" => "610502011"},
      %{"name" => "信义街道", "code" => "610502012"},
      %{"name" => "白杨街道", "code" => "610502013"},
      %{"name" => "桥南镇", "code" => "610502100"},
      %{"name" => "阳郭镇", "code" => "610502101"},
      %{"name" => "故市镇", "code" => "610502102"},
      %{"name" => "下邽镇", "code" => "610502103"},
      %{"name" => "三张镇", "code" => "610502104"},
      %{"name" => "交斜镇", "code" => "610502105"},
      %{"name" => "崇凝镇", "code" => "610502107"},
      %{"name" => "孝义镇", "code" => "610502108"},
      %{"name" => "蔺店镇", "code" => "610502109"},
      %{"name" => "官底镇", "code" => "610502111"},
      %{"name" => "官路镇", "code" => "610502112"},
      %{"name" => "丰原镇", "code" => "610502113"},
      %{"name" => "阎村镇", "code" => "610502114"},
      %{"name" => "官道镇", "code" => "610502116"}
    ]

  def next(input) when input == "华州区" or input == "610503",
    do: [
      %{"name" => "华州街道", "code" => "610503001"},
      %{"name" => "杏林镇", "code" => "610503101"},
      %{"name" => "赤水镇", "code" => "610503102"},
      %{"name" => "高塘镇", "code" => "610503103"},
      %{"name" => "大明镇", "code" => "610503104"},
      %{"name" => "瓜坡镇", "code" => "610503105"},
      %{"name" => "莲花寺镇", "code" => "610503106"},
      %{"name" => "柳枝镇", "code" => "610503107"},
      %{"name" => "下庙镇", "code" => "610503108"},
      %{"name" => "金堆镇", "code" => "610503109"}
    ]

  def next(input) when input == "潼关县" or input == "610522",
    do: [
      %{"name" => "城关街道", "code" => "610522001"},
      %{"name" => "秦东镇", "code" => "610522101"},
      %{"name" => "太要镇", "code" => "610522102"},
      %{"name" => "桐峪镇", "code" => "610522103"},
      %{"name" => "代字营镇", "code" => "610522104"}
    ]

  def next(input) when input == "大荔县" or input == "610523",
    do: [
      %{"name" => "西城街道", "code" => "610523001"},
      %{"name" => "东城街道", "code" => "610523002"},
      %{"name" => "许庄镇", "code" => "610523101"},
      %{"name" => "朝邑镇", "code" => "610523102"},
      %{"name" => "安仁镇", "code" => "610523103"},
      %{"name" => "两宜镇", "code" => "610523104"},
      %{"name" => "羌白镇", "code" => "610523105"},
      %{"name" => "官池镇", "code" => "610523106"},
      %{"name" => "冯村镇", "code" => "610523107"},
      %{"name" => "双泉镇", "code" => "610523108"},
      %{"name" => "下寨镇", "code" => "610523110"},
      %{"name" => "韦林镇", "code" => "610523111"},
      %{"name" => "范家镇", "code" => "610523112"},
      %{"name" => "苏村镇", "code" => "610523113"},
      %{"name" => "赵渡镇", "code" => "610523114"},
      %{"name" => "埝桥镇", "code" => "610523116"},
      %{"name" => "段家镇", "code" => "610523117"}
    ]

  def next(input) when input == "合阳县" or input == "610524",
    do: [
      %{"name" => "城关街道", "code" => "610524001"},
      %{"name" => "甘井镇", "code" => "610524101"},
      %{"name" => "坊镇", "code" => "610524102"},
      %{"name" => "洽川镇", "code" => "610524103"},
      %{"name" => "新池镇", "code" => "610524104"},
      %{"name" => "黑池镇", "code" => "610524105"},
      %{"name" => "路井镇", "code" => "610524106"},
      %{"name" => "和家庄镇", "code" => "610524107"},
      %{"name" => "王村镇", "code" => "610524108"},
      %{"name" => "同家庄镇", "code" => "610524110"},
      %{"name" => "百良镇", "code" => "610524111"},
      %{"name" => "金峪镇", "code" => "610524112"}
    ]

  def next(input) when input == "澄城县" or input == "610525",
    do: [
      %{"name" => "城关街道", "code" => "610525001"},
      %{"name" => "冯原镇", "code" => "610525101"},
      %{"name" => "王庄镇", "code" => "610525102"},
      %{"name" => "尧头镇", "code" => "610525103"},
      %{"name" => "赵庄镇", "code" => "610525104"},
      %{"name" => "交道镇", "code" => "610525105"},
      %{"name" => "寺前镇", "code" => "610525106"},
      %{"name" => "韦庄镇", "code" => "610525107"},
      %{"name" => "安里镇", "code" => "610525108"},
      %{"name" => "庄头镇", "code" => "610525109"}
    ]

  def next(input) when input == "蒲城县" or input == "610526",
    do: [
      %{"name" => "奉先街道", "code" => "610526001"},
      %{"name" => "紫荆街道", "code" => "610526002"},
      %{"name" => "罕井镇", "code" => "610526101"},
      %{"name" => "孙镇", "code" => "610526102"},
      %{"name" => "兴镇", "code" => "610526103"},
      %{"name" => "党睦镇", "code" => "610526104"},
      %{"name" => "高阳镇", "code" => "610526105"},
      %{"name" => "永丰镇", "code" => "610526106"},
      %{"name" => "荆姚镇", "code" => "610526107"},
      %{"name" => "苏坊镇", "code" => "610526108"},
      %{"name" => "龙阳镇", "code" => "610526109"},
      %{"name" => "洛滨镇", "code" => "610526112"},
      %{"name" => "陈庄镇", "code" => "610526113"},
      %{"name" => "桥陵镇", "code" => "610526114"},
      %{"name" => "尧山镇", "code" => "610526116"},
      %{"name" => "椿林镇", "code" => "610526117"},
      %{"name" => "龙池镇", "code" => "610526118"}
    ]

  def next(input) when input == "白水县" or input == "610527",
    do: [
      %{"name" => "城关街道", "code" => "610527001"},
      %{"name" => "尧禾镇", "code" => "610527102"},
      %{"name" => "杜康镇", "code" => "610527103"},
      %{"name" => "西固镇", "code" => "610527104"},
      %{"name" => "林皋镇", "code" => "610527105"},
      %{"name" => "史官镇", "code" => "610527106"},
      %{"name" => "北塬镇", "code" => "610527107"},
      %{"name" => "雷牙镇", "code" => "610527109"}
    ]

  def next(input) when input == "富平县" or input == "610528",
    do: [
      %{"name" => "城关街道", "code" => "610528001"},
      %{"name" => "庄里镇", "code" => "610528101"},
      %{"name" => "张桥镇", "code" => "610528102"},
      %{"name" => "美原镇", "code" => "610528103"},
      %{"name" => "流曲镇", "code" => "610528104"},
      %{"name" => "淡村镇", "code" => "610528105"},
      %{"name" => "留古镇", "code" => "610528107"},
      %{"name" => "老庙镇", "code" => "610528108"},
      %{"name" => "薛镇", "code" => "610528109"},
      %{"name" => "到贤镇", "code" => "610528110"},
      %{"name" => "曹村镇", "code" => "610528111"},
      %{"name" => "宫里镇", "code" => "610528112"},
      %{"name" => "梅家坪镇", "code" => "610528113"},
      %{"name" => "刘集镇", "code" => "610528114"},
      %{"name" => "齐村镇", "code" => "610528115"}
    ]

  def next(input) when input == "韩城市" or input == "610581",
    do: [
      %{"name" => "新城街道", "code" => "610581001"},
      %{"name" => "金城街道", "code" => "610581002"},
      %{"name" => "龙门镇", "code" => "610581100"},
      %{"name" => "桑树坪镇", "code" => "610581101"},
      %{"name" => "芝川镇", "code" => "610581103"},
      %{"name" => "西庄镇", "code" => "610581104"},
      %{"name" => "芝阳镇", "code" => "610581106"},
      %{"name" => "板桥镇", "code" => "610581107"}
    ]

  def next(input) when input == "华阴市" or input == "610582",
    do: [
      %{"name" => "太华路街道", "code" => "610582001"},
      %{"name" => "岳庙街道", "code" => "610582002"},
      %{"name" => "孟塬镇", "code" => "610582100"},
      %{"name" => "华西镇", "code" => "610582103"},
      %{"name" => "罗敷镇", "code" => "610582104"},
      %{"name" => "华山镇", "code" => "610582105"},
      %{"name" => "国营陕西华山企业公司", "code" => "610582400"}
    ]

  def next(input) when input == "秦都区" or input == "610402",
    do: [
      %{"name" => "人民路街道", "code" => "610402001"},
      %{"name" => "西兰路街道", "code" => "610402002"},
      %{"name" => "吴家堡街道", "code" => "610402003"},
      %{"name" => "渭阳西路街道", "code" => "610402004"},
      %{"name" => "陈杨寨街道", "code" => "610402005"},
      %{"name" => "古渡街道", "code" => "610402006"},
      %{"name" => "上林街道", "code" => "610402007"},
      %{"name" => "钓台街道", "code" => "610402008"},
      %{"name" => "马泉街道", "code" => "610402009"},
      %{"name" => "渭滨街道", "code" => "610402010"},
      %{"name" => "双照街道", "code" => "610402011"},
      %{"name" => "马庄街道", "code" => "610402012"}
    ]

  def next(input) when input == "杨陵区" or input == "610403",
    do: [
      %{"name" => "杨陵街道", "code" => "610403001"},
      %{"name" => "李台街道", "code" => "610403002"},
      %{"name" => "大寨街道", "code" => "610403003"},
      %{"name" => "五泉镇", "code" => "610403100"},
      %{"name" => "揉谷镇", "code" => "610403102"}
    ]

  def next(input) when input == "渭城区" or input == "610404",
    do: [
      %{"name" => "中山街街道", "code" => "610404001"},
      %{"name" => "文汇路街道", "code" => "610404002"},
      %{"name" => "新兴路街道", "code" => "610404003"},
      %{"name" => "渭阳街道", "code" => "610404004"},
      %{"name" => "渭城街道", "code" => "610404005"},
      %{"name" => "窑店街道", "code" => "610404006"},
      %{"name" => "正阳街道", "code" => "610404007"},
      %{"name" => "周陵街道", "code" => "610404008"},
      %{"name" => "底张街道", "code" => "610404009"},
      %{"name" => "北杜街道", "code" => "610404010"}
    ]

  def next(input) when input == "三原县" or input == "610422",
    do: [
      %{"name" => "城关街道", "code" => "610422001"},
      %{"name" => "陂西镇", "code" => "610422102"},
      %{"name" => "独李镇", "code" => "610422103"},
      %{"name" => "大程镇", "code" => "610422104"},
      %{"name" => "西阳镇", "code" => "610422105"},
      %{"name" => "鲁桥镇", "code" => "610422106"},
      %{"name" => "陵前镇", "code" => "610422107"},
      %{"name" => "新兴镇", "code" => "610422109"},
      %{"name" => "嵯峨镇", "code" => "610422110"},
      %{"name" => "渠岸镇", "code" => "610422111"}
    ]

  def next(input) when input == "泾阳县" or input == "610423",
    do: [
      %{"name" => "泾干街道", "code" => "610423001"},
      %{"name" => "永乐镇", "code" => "610423101"},
      %{"name" => "云阳镇", "code" => "610423102"},
      %{"name" => "桥底镇", "code" => "610423103"},
      %{"name" => "王桥镇", "code" => "610423104"},
      %{"name" => "口镇", "code" => "610423105"},
      %{"name" => "三渠镇", "code" => "610423107"},
      %{"name" => "高庄镇", "code" => "610423108"},
      %{"name" => "太平镇", "code" => "610423111"},
      %{"name" => "崇文镇", "code" => "610423112"},
      %{"name" => "安吴镇", "code" => "610423113"},
      %{"name" => "兴隆镇", "code" => "610423114"},
      %{"name" => "中张镇", "code" => "610423115"}
    ]

  def next(input) when input == "乾县" or input == "610424",
    do: [
      %{"name" => "城关街道", "code" => "610424001"},
      %{"name" => "薛录镇", "code" => "610424101"},
      %{"name" => "梁村镇", "code" => "610424102"},
      %{"name" => "临平镇", "code" => "610424103"},
      %{"name" => "姜村镇", "code" => "610424104"},
      %{"name" => "王村镇", "code" => "610424105"},
      %{"name" => "马连镇", "code" => "610424106"},
      %{"name" => "阳峪镇", "code" => "610424107"},
      %{"name" => "峰阳镇", "code" => "610424108"},
      %{"name" => "注泔镇", "code" => "610424109"},
      %{"name" => "灵源镇", "code" => "610424110"},
      %{"name" => "阳洪镇", "code" => "610424111"},
      %{"name" => "梁山镇", "code" => "610424112"},
      %{"name" => "周城镇", "code" => "610424113"},
      %{"name" => "新阳镇", "code" => "610424114"},
      %{"name" => "大杨镇", "code" => "610424115"}
    ]

  def next(input) when input == "礼泉县" or input == "610425",
    do: [
      %{"name" => "城关街道", "code" => "610425001"},
      %{"name" => "史德镇", "code" => "610425101"},
      %{"name" => "西张堡镇", "code" => "610425102"},
      %{"name" => "阡东镇", "code" => "610425103"},
      %{"name" => "烽火镇", "code" => "610425104"},
      %{"name" => "烟霞镇", "code" => "610425105"},
      %{"name" => "赵镇", "code" => "610425106"},
      %{"name" => "叱干镇", "code" => "610425108"},
      %{"name" => "南坊镇", "code" => "610425109"},
      %{"name" => "石潭镇", "code" => "610425110"},
      %{"name" => "昭陵镇", "code" => "610425111"},
      %{"name" => "骏马镇", "code" => "610425112"}
    ]

  def next(input) when input == "永寿县" or input == "610426",
    do: [
      %{"name" => "监军街道", "code" => "610426001"},
      %{"name" => "店头镇", "code" => "610426101"},
      %{"name" => "常宁镇", "code" => "610426102"},
      %{"name" => "甘井镇", "code" => "610426104"},
      %{"name" => "马坊镇", "code" => "610426105"},
      %{"name" => "渠子镇", "code" => "610426108"},
      %{"name" => "永平镇", "code" => "610426110"}
    ]

  def next(input) when input == "长武县" or input == "610428",
    do: [
      %{"name" => "昭仁街道", "code" => "610428001"},
      %{"name" => "相公镇", "code" => "610428101"},
      %{"name" => "巨家镇", "code" => "610428102"},
      %{"name" => "丁家镇", "code" => "610428103"},
      %{"name" => "洪家镇", "code" => "610428104"},
      %{"name" => "亭口镇", "code" => "610428105"},
      %{"name" => "彭公镇", "code" => "610428106"},
      %{"name" => "枣园镇", "code" => "610428108"}
    ]

  def next(input) when input == "旬邑县" or input == "610429",
    do: [
      %{"name" => "城关街道", "code" => "610429001"},
      %{"name" => "土桥镇", "code" => "610429101"},
      %{"name" => "职田镇", "code" => "610429102"},
      %{"name" => "张洪镇", "code" => "610429103"},
      %{"name" => "太村镇", "code" => "610429104"},
      %{"name" => "郑家镇", "code" => "610429105"},
      %{"name" => "湫坡头镇", "code" => "610429106"},
      %{"name" => "底庙镇", "code" => "610429107"},
      %{"name" => "马栏镇", "code" => "610429109"},
      %{"name" => "清塬镇", "code" => "610429110"}
    ]

  def next(input) when input == "淳化县" or input == "610430",
    do: [
      %{"name" => "城关街道", "code" => "610430001"},
      %{"name" => "官庄镇", "code" => "610430101"},
      %{"name" => "方里镇", "code" => "610430103"},
      %{"name" => "润镇", "code" => "610430104"},
      %{"name" => "车坞镇", "code" => "610430105"},
      %{"name" => "铁王镇", "code" => "610430106"},
      %{"name" => "石桥镇", "code" => "610430107"},
      %{"name" => "十里塬镇", "code" => "610430109"}
    ]

  def next(input) when input == "武功县" or input == "610431",
    do: [
      %{"name" => "普集街道", "code" => "610431001"},
      %{"name" => "苏坊镇", "code" => "610431101"},
      %{"name" => "武功镇", "code" => "610431102"},
      %{"name" => "游凤镇", "code" => "610431103"},
      %{"name" => "贞元镇", "code" => "610431104"},
      %{"name" => "长宁镇", "code" => "610431105"},
      %{"name" => "小村镇", "code" => "610431106"},
      %{"name" => "大庄镇", "code" => "610431107"}
    ]

  def next(input) when input == "兴平市" or input == "610481",
    do: [
      %{"name" => "东城街道", "code" => "610481001"},
      %{"name" => "西城街道", "code" => "610481002"},
      %{"name" => "店张街道", "code" => "610481003"},
      %{"name" => "西吴街道", "code" => "610481004"},
      %{"name" => "马嵬街道", "code" => "610481005"},
      %{"name" => "赵村镇", "code" => "610481101"},
      %{"name" => "桑镇", "code" => "610481102"},
      %{"name" => "南市镇", "code" => "610481104"},
      %{"name" => "庄头镇", "code" => "610481105"},
      %{"name" => "南位镇", "code" => "610481106"},
      %{"name" => "阜寨镇", "code" => "610481107"},
      %{"name" => "丰仪镇", "code" => "610481108"},
      %{"name" => "汤坊镇", "code" => "610481109"}
    ]

  def next(input) when input == "彬州市" or input == "610482",
    do: [
      %{"name" => "城关街道", "code" => "610482001"},
      %{"name" => "豳风街道", "code" => "610482002"},
      %{"name" => "北极镇", "code" => "610482101"},
      %{"name" => "新民镇", "code" => "610482102"},
      %{"name" => "龙高镇", "code" => "610482103"},
      %{"name" => "永乐镇", "code" => "610482105"},
      %{"name" => "义门镇", "code" => "610482106"},
      %{"name" => "水口镇", "code" => "610482107"},
      %{"name" => "韩家镇", "code" => "610482108"},
      %{"name" => "太峪镇", "code" => "610482109"}
    ]

  def next(input) when input == "渭滨区" or input == "610302",
    do: [
      %{"name" => "金陵街道", "code" => "610302001"},
      %{"name" => "经二路街道", "code" => "610302002"},
      %{"name" => "清姜街道", "code" => "610302003"},
      %{"name" => "姜谭街道", "code" => "610302004"},
      %{"name" => "桥南街道", "code" => "610302005"},
      %{"name" => "马营镇", "code" => "610302100"},
      %{"name" => "石鼓镇", "code" => "610302101"},
      %{"name" => "神农镇", "code" => "610302102"},
      %{"name" => "高家镇", "code" => "610302103"},
      %{"name" => "八鱼镇", "code" => "610302104"}
    ]

  def next(input) when input == "金台区" or input == "610303",
    do: [
      %{"name" => "中山东路街道", "code" => "610303001"},
      %{"name" => "西关街道", "code" => "610303002"},
      %{"name" => "中山西路街道", "code" => "610303003"},
      %{"name" => "群众路街道", "code" => "610303004"},
      %{"name" => "东风路街道", "code" => "610303006"},
      %{"name" => "十里铺街道", "code" => "610303007"},
      %{"name" => "卧龙寺街道", "code" => "610303008"},
      %{"name" => "陈仓镇", "code" => "610303100"},
      %{"name" => "蟠龙镇", "code" => "610303101"},
      %{"name" => "金河镇", "code" => "610303102"},
      %{"name" => "硖石镇", "code" => "610303103"}
    ]

  def next(input) when input == "陈仓区" or input == "610304",
    do: [
      %{"name" => "虢镇街道", "code" => "610304001"},
      %{"name" => "东关街道", "code" => "610304002"},
      %{"name" => "千渭街道", "code" => "610304003"},
      %{"name" => "阳平镇", "code" => "610304101"},
      %{"name" => "千河镇", "code" => "610304102"},
      %{"name" => "磻溪镇", "code" => "610304103"},
      %{"name" => "天王镇", "code" => "610304104"},
      %{"name" => "慕仪镇", "code" => "610304105"},
      %{"name" => "周原镇", "code" => "610304106"},
      %{"name" => "贾村镇", "code" => "610304107"},
      %{"name" => "县功镇", "code" => "610304109"},
      %{"name" => "新街镇", "code" => "610304110"},
      %{"name" => "坪头镇", "code" => "610304111"},
      %{"name" => "香泉镇", "code" => "610304112"},
      %{"name" => "赤沙镇", "code" => "610304113"},
      %{"name" => "拓石镇", "code" => "610304114"},
      %{"name" => "凤阁岭镇", "code" => "610304115"},
      %{"name" => "钓渭镇", "code" => "610304116"}
    ]

  def next(input) when input == "凤翔区" or input == "610305",
    do: [
      %{"name" => "城关镇", "code" => "610305100"},
      %{"name" => "虢王镇", "code" => "610305101"},
      %{"name" => "彪角镇", "code" => "610305102"},
      %{"name" => "横水镇", "code" => "610305103"},
      %{"name" => "田家庄镇", "code" => "610305104"},
      %{"name" => "糜杆桥镇", "code" => "610305105"},
      %{"name" => "南指挥镇", "code" => "610305107"},
      %{"name" => "陈村镇", "code" => "610305108"},
      %{"name" => "长青镇", "code" => "610305109"},
      %{"name" => "柳林镇", "code" => "610305110"},
      %{"name" => "姚家沟镇", "code" => "610305111"},
      %{"name" => "范家寨镇", "code" => "610305112"}
    ]

  def next(input) when input == "岐山县" or input == "610323",
    do: [
      %{"name" => "凤鸣镇", "code" => "610323100"},
      %{"name" => "蔡家坡镇", "code" => "610323101"},
      %{"name" => "益店镇", "code" => "610323103"},
      %{"name" => "蒲村镇", "code" => "610323104"},
      %{"name" => "青化镇", "code" => "610323106"},
      %{"name" => "枣林镇", "code" => "610323107"},
      %{"name" => "雍川镇", "code" => "610323108"},
      %{"name" => "故郡镇", "code" => "610323111"},
      %{"name" => "京当镇", "code" => "610323112"}
    ]

  def next(input) when input == "扶风县" or input == "610324",
    do: [
      %{"name" => "城关街道", "code" => "610324001"},
      %{"name" => "天度镇", "code" => "610324101"},
      %{"name" => "午井镇", "code" => "610324102"},
      %{"name" => "绛帐镇", "code" => "610324103"},
      %{"name" => "段家镇", "code" => "610324104"},
      %{"name" => "杏林镇", "code" => "610324105"},
      %{"name" => "召公镇", "code" => "610324106"},
      %{"name" => "法门镇", "code" => "610324107"}
    ]

  def next(input) when input == "眉县" or input == "610326",
    do: [
      %{"name" => "首善街道", "code" => "610326001"},
      %{"name" => "横渠镇", "code" => "610326101"},
      %{"name" => "槐芽镇", "code" => "610326102"},
      %{"name" => "汤峪镇", "code" => "610326103"},
      %{"name" => "常兴镇", "code" => "610326104"},
      %{"name" => "金渠镇", "code" => "610326105"},
      %{"name" => "营头镇", "code" => "610326106"},
      %{"name" => "齐镇", "code" => "610326107"},
      %{"name" => "陕西省太白山旅游区", "code" => "610326400"},
      %{"name" => "红河谷森林公园", "code" => "610326401"}
    ]

  def next(input) when input == "陇县" or input == "610327",
    do: [
      %{"name" => "城关镇", "code" => "610327100"},
      %{"name" => "东风镇", "code" => "610327101"},
      %{"name" => "八渡镇", "code" => "610327102"},
      %{"name" => "东南镇", "code" => "610327104"},
      %{"name" => "温水镇", "code" => "610327106"},
      %{"name" => "天成镇", "code" => "610327107"},
      %{"name" => "曹家湾镇", "code" => "610327108"},
      %{"name" => "固关镇", "code" => "610327109"},
      %{"name" => "河北镇", "code" => "610327112"},
      %{"name" => "新集川镇", "code" => "610327113"}
    ]

  def next(input) when input == "千阳县" or input == "610328",
    do: [
      %{"name" => "城关镇", "code" => "610328100"},
      %{"name" => "崔家头镇", "code" => "610328101"},
      %{"name" => "南寨镇", "code" => "610328102"},
      %{"name" => "张家塬镇", "code" => "610328103"},
      %{"name" => "水沟镇", "code" => "610328104"},
      %{"name" => "草碧镇", "code" => "610328105"},
      %{"name" => "高崖镇", "code" => "610328107"}
    ]

  def next(input) when input == "麟游县" or input == "610329",
    do: [
      %{"name" => "九成宫镇", "code" => "610329100"},
      %{"name" => "崔木镇", "code" => "610329101"},
      %{"name" => "招贤镇", "code" => "610329102"},
      %{"name" => "两亭镇", "code" => "610329103"},
      %{"name" => "常丰镇", "code" => "610329105"},
      %{"name" => "丈八镇", "code" => "610329106"},
      %{"name" => "酒房镇", "code" => "610329107"}
    ]

  def next(input) when input == "凤县" or input == "610330",
    do: [
      %{"name" => "双石铺镇", "code" => "610330100"},
      %{"name" => "凤州镇", "code" => "610330101"},
      %{"name" => "黄牛铺镇", "code" => "610330102"},
      %{"name" => "红花铺镇", "code" => "610330103"},
      %{"name" => "河口镇", "code" => "610330104"},
      %{"name" => "唐藏镇", "code" => "610330105"},
      %{"name" => "平木镇", "code" => "610330106"},
      %{"name" => "坪坎镇", "code" => "610330107"},
      %{"name" => "留凤关镇", "code" => "610330110"},
      %{"name" => "马头滩林业局", "code" => "610330400"},
      %{"name" => "辛家山林业场", "code" => "610330401"}
    ]

  def next(input) when input == "太白县" or input == "610331",
    do: [
      %{"name" => "咀头镇", "code" => "610331100"},
      %{"name" => "桃川镇", "code" => "610331101"},
      %{"name" => "鹦鸽镇", "code" => "610331102"},
      %{"name" => "靖口镇", "code" => "610331103"},
      %{"name" => "太白河镇", "code" => "610331104"},
      %{"name" => "黄柏塬镇", "code" => "610331105"},
      %{"name" => "王家堎镇", "code" => "610331106"}
    ]

  def next(input) when input == "王益区" or input == "610202",
    do: [
      %{"name" => "七一路街道", "code" => "610202001"},
      %{"name" => "红旗街街道", "code" => "610202002"},
      %{"name" => "桃园街道", "code" => "610202003"},
      %{"name" => "青年路街道", "code" => "610202004"},
      %{"name" => "王家河街道", "code" => "610202005"},
      %{"name" => "王益街道", "code" => "610202006"},
      %{"name" => "黄堡镇", "code" => "610202100"}
    ]

  def next(input) when input == "印台区" or input == "610203",
    do: [
      %{"name" => "城关街道", "code" => "610203001"},
      %{"name" => "三里洞街道", "code" => "610203002"},
      %{"name" => "王石凹街道", "code" => "610203003"},
      %{"name" => "印台街道", "code" => "610203004"},
      %{"name" => "陈炉镇", "code" => "610203100"},
      %{"name" => "红土镇", "code" => "610203101"},
      %{"name" => "广阳镇", "code" => "610203102"},
      %{"name" => "金锁关镇", "code" => "610203104"},
      %{"name" => "阿庄镇", "code" => "610203106"}
    ]

  def next(input) when input == "耀州区" or input == "610204",
    do: [
      %{"name" => "永安路街道", "code" => "610204001"},
      %{"name" => "天宝路街道", "code" => "610204002"},
      %{"name" => "咸丰路街道", "code" => "610204003"},
      %{"name" => "正阳路街道", "code" => "610204004"},
      %{"name" => "锦阳路街道", "code" => "610204005"},
      %{"name" => "坡头街道", "code" => "610204006"},
      %{"name" => "董家河镇", "code" => "610204101"},
      %{"name" => "庙湾镇", "code" => "610204102"},
      %{"name" => "瑶曲镇", "code" => "610204103"},
      %{"name" => "照金镇", "code" => "610204104"},
      %{"name" => "小丘镇", "code" => "610204107"},
      %{"name" => "孙原镇", "code" => "610204108"},
      %{"name" => "关庄镇", "code" => "610204109"},
      %{"name" => "石柱镇", "code" => "610204111"}
    ]

  def next(input) when input == "宜君县" or input == "610222",
    do: [
      %{"name" => "宜阳街道", "code" => "610222001"},
      %{"name" => "彭镇", "code" => "610222101"},
      %{"name" => "五里镇", "code" => "610222102"},
      %{"name" => "太安镇", "code" => "610222103"},
      %{"name" => "棋盘镇", "code" => "610222104"},
      %{"name" => "尧生镇", "code" => "610222105"},
      %{"name" => "哭泉镇", "code" => "610222106"},
      %{"name" => "云梦乡", "code" => "610222201"}
    ]

  def next(input) when input == "新城区" or input == "610102",
    do: [
      %{"name" => "西一路街道", "code" => "610102001"},
      %{"name" => "长乐中路街道", "code" => "610102002"},
      %{"name" => "中山门街道", "code" => "610102003"},
      %{"name" => "韩森寨街道", "code" => "610102004"},
      %{"name" => "解放门街道", "code" => "610102005"},
      %{"name" => "自强路街道", "code" => "610102006"},
      %{"name" => "太华路街道", "code" => "610102007"},
      %{"name" => "长乐西路街道", "code" => "610102008"},
      %{"name" => "胡家庙街道", "code" => "610102009"}
    ]

  def next(input) when input == "碑林区" or input == "610103",
    do: [
      %{"name" => "南院门街道", "code" => "610103001"},
      %{"name" => "柏树林街道", "code" => "610103002"},
      %{"name" => "长乐坊街道", "code" => "610103003"},
      %{"name" => "东关南街街道", "code" => "610103004"},
      %{"name" => "太乙路街道", "code" => "610103005"},
      %{"name" => "文艺路街道", "code" => "610103006"},
      %{"name" => "长安路街道", "code" => "610103007"},
      %{"name" => "张家村街道", "code" => "610103008"}
    ]

  def next(input) when input == "莲湖区" or input == "610104",
    do: [
      %{"name" => "青年路街道", "code" => "610104001"},
      %{"name" => "北院门街道", "code" => "610104002"},
      %{"name" => "北关街道", "code" => "610104003"},
      %{"name" => "红庙坡街道", "code" => "610104004"},
      %{"name" => "环城西路街道", "code" => "610104005"},
      %{"name" => "西关街道", "code" => "610104006"},
      %{"name" => "土门街道", "code" => "610104007"},
      %{"name" => "桃园路街道", "code" => "610104008"},
      %{"name" => "枣园街道", "code" => "610104009"}
    ]

  def next(input) when input == "灞桥区" or input == "610111",
    do: [
      %{"name" => "纺织城街道", "code" => "610111001"},
      %{"name" => "十里铺街道", "code" => "610111002"},
      %{"name" => "红旗街道", "code" => "610111003"},
      %{"name" => "席王街道", "code" => "610111004"},
      %{"name" => "洪庆街道", "code" => "610111005"},
      %{"name" => "狄寨街道", "code" => "610111006"},
      %{"name" => "灞桥街道", "code" => "610111007"},
      %{"name" => "新筑街道", "code" => "610111008"},
      %{"name" => "新合街道", "code" => "610111009"}
    ]

  def next(input) when input == "未央区" or input == "610112",
    do: [
      %{"name" => "张家堡街道", "code" => "610112001"},
      %{"name" => "三桥街道", "code" => "610112002"},
      %{"name" => "辛家庙街道", "code" => "610112003"},
      %{"name" => "徐家湾街道", "code" => "610112004"},
      %{"name" => "大明宫街道", "code" => "610112005"},
      %{"name" => "谭家街道", "code" => "610112006"},
      %{"name" => "草滩街道", "code" => "610112007"},
      %{"name" => "六村堡街道", "code" => "610112008"},
      %{"name" => "未央宫街道", "code" => "610112009"},
      %{"name" => "汉城街道", "code" => "610112010"},
      %{"name" => "未央湖街道", "code" => "610112011"},
      %{"name" => "建章路街道", "code" => "610112012"}
    ]

  def next(input) when input == "雁塔区" or input == "610113",
    do: [
      %{"name" => "小寨路街道", "code" => "610113001"},
      %{"name" => "大雁塔街道", "code" => "610113002"},
      %{"name" => "长延堡街道", "code" => "610113003"},
      %{"name" => "电子城街道", "code" => "610113004"},
      %{"name" => "等驾坡街道", "code" => "610113005"},
      %{"name" => "鱼化寨街道", "code" => "610113006"},
      %{"name" => "丈八沟街道", "code" => "610113007"},
      %{"name" => "曲江街道", "code" => "610113008"},
      %{"name" => "杜城街道", "code" => "610113009"},
      %{"name" => "漳浒寨街道", "code" => "610113010"}
    ]

  def next(input) when input == "阎良区" or input == "610114",
    do: [
      %{"name" => "凤凰路街道", "code" => "610114001"},
      %{"name" => "新华路街道", "code" => "610114002"},
      %{"name" => "振兴街道", "code" => "610114003"},
      %{"name" => "新兴街道", "code" => "610114004"},
      %{"name" => "北屯街道", "code" => "610114005"},
      %{"name" => "武屯街道", "code" => "610114006"},
      %{"name" => "关山街道", "code" => "610114007"}
    ]

  def next(input) when input == "临潼区" or input == "610115",
    do: [
      %{"name" => "骊山街道", "code" => "610115001"},
      %{"name" => "秦陵街道", "code" => "610115002"},
      %{"name" => "新丰街道", "code" => "610115003"},
      %{"name" => "代王街道", "code" => "610115004"},
      %{"name" => "斜口街道", "code" => "610115005"},
      %{"name" => "行者街道", "code" => "610115006"},
      %{"name" => "零口街道", "code" => "610115007"},
      %{"name" => "相桥街道", "code" => "610115008"},
      %{"name" => "雨金街道", "code" => "610115009"},
      %{"name" => "新市街道", "code" => "610115010"},
      %{"name" => "徐杨街道", "code" => "610115011"},
      %{"name" => "西泉街道", "code" => "610115012"},
      %{"name" => "栎阳街道", "code" => "610115013"},
      %{"name" => "马额街道", "code" => "610115014"},
      %{"name" => "何寨街道", "code" => "610115015"},
      %{"name" => "交口街道", "code" => "610115016"},
      %{"name" => "油槐街道", "code" => "610115017"},
      %{"name" => "北田街道", "code" => "610115018"},
      %{"name" => "铁炉街道", "code" => "610115019"},
      %{"name" => "任留街道", "code" => "610115020"},
      %{"name" => "穆寨街道", "code" => "610115021"},
      %{"name" => "小金街道", "code" => "610115022"},
      %{"name" => "仁宗街道", "code" => "610115023"}
    ]

  def next(input) when input == "长安区" or input == "610116",
    do: [
      %{"name" => "韦曲街道", "code" => "610116001"},
      %{"name" => "郭杜街道", "code" => "610116002"},
      %{"name" => "滦镇街道", "code" => "610116003"},
      %{"name" => "引镇街道", "code" => "610116004"},
      %{"name" => "王寺街道", "code" => "610116005"},
      %{"name" => "马王街道", "code" => "610116006"},
      %{"name" => "太乙宫街道", "code" => "610116007"},
      %{"name" => "东大街道", "code" => "610116008"},
      %{"name" => "子午街道", "code" => "610116009"},
      %{"name" => "斗门街道", "code" => "610116010"},
      %{"name" => "细柳街道", "code" => "610116011"},
      %{"name" => "杜曲街道", "code" => "610116012"},
      %{"name" => "大兆街道", "code" => "610116013"},
      %{"name" => "黄良街道", "code" => "610116014"},
      %{"name" => "兴隆街道", "code" => "610116015"},
      %{"name" => "王曲街道", "code" => "610116016"},
      %{"name" => "鸣犊街道", "code" => "610116017"},
      %{"name" => "王莽街道", "code" => "610116018"},
      %{"name" => "五台街道", "code" => "610116019"},
      %{"name" => "高桥街道", "code" => "610116020"},
      %{"name" => "五星街道", "code" => "610116021"},
      %{"name" => "灵沼街道", "code" => "610116022"},
      %{"name" => "杨庄街道", "code" => "610116023"},
      %{"name" => "砲里街道", "code" => "610116024"},
      %{"name" => "魏寨街道", "code" => "610116025"}
    ]

  def next(input) when input == "高陵区" or input == "610117",
    do: [
      %{"name" => "鹿苑街道", "code" => "610117001"},
      %{"name" => "泾渭街道", "code" => "610117002"},
      %{"name" => "崇皇街道", "code" => "610117003"},
      %{"name" => "姬家街道", "code" => "610117004"},
      %{"name" => "耿镇街道", "code" => "610117005"},
      %{"name" => "张卜街道", "code" => "610117006"},
      %{"name" => "通远街道", "code" => "610117007"}
    ]

  def next(input) when input == "鄠邑区" or input == "610118",
    do: [
      %{"name" => "甘亭街道", "code" => "610118001"},
      %{"name" => "余下街道", "code" => "610118002"},
      %{"name" => "玉蝉街道", "code" => "610118003"},
      %{"name" => "五竹街道", "code" => "610118004"},
      %{"name" => "大王街道", "code" => "610118005"},
      %{"name" => "秦渡街道", "code" => "610118006"},
      %{"name" => "草堂街道", "code" => "610118007"},
      %{"name" => "庞光街道", "code" => "610118008"},
      %{"name" => "祖庵街道", "code" => "610118009"},
      %{"name" => "渭丰街道", "code" => "610118010"},
      %{"name" => "涝店街道", "code" => "610118011"},
      %{"name" => "甘河街道", "code" => "610118012"},
      %{"name" => "蒋村街道", "code" => "610118013"},
      %{"name" => "石井街道", "code" => "610118014"}
    ]

  def next(input) when input == "蓝田县" or input == "610122",
    do: [
      %{"name" => "蓝关街道", "code" => "610122001"},
      %{"name" => "洩湖镇", "code" => "610122101"},
      %{"name" => "华胥镇", "code" => "610122102"},
      %{"name" => "前卫镇", "code" => "610122103"},
      %{"name" => "汤峪镇", "code" => "610122104"},
      %{"name" => "焦岱镇", "code" => "610122105"},
      %{"name" => "玉山镇", "code" => "610122106"},
      %{"name" => "三里镇", "code" => "610122107"},
      %{"name" => "普化镇", "code" => "610122108"},
      %{"name" => "葛牌镇", "code" => "610122109"},
      %{"name" => "灞源镇", "code" => "610122110"},
      %{"name" => "九间房镇", "code" => "610122111"},
      %{"name" => "蓝桥镇", "code" => "610122112"},
      %{"name" => "辋川镇", "code" => "610122113"},
      %{"name" => "厚镇", "code" => "610122115"},
      %{"name" => "三官庙镇", "code" => "610122116"},
      %{"name" => "安村镇", "code" => "610122118"},
      %{"name" => "孟村镇", "code" => "610122119"},
      %{"name" => "小寨镇", "code" => "610122120"}
    ]

  def next(input) when input == "周至县" or input == "610124",
    do: [
      %{"name" => "二曲街道", "code" => "610124001"},
      %{"name" => "哑柏镇", "code" => "610124101"},
      %{"name" => "终南镇", "code" => "610124102"},
      %{"name" => "马召镇", "code" => "610124103"},
      %{"name" => "集贤镇", "code" => "610124104"},
      %{"name" => "楼观镇", "code" => "610124105"},
      %{"name" => "尚村镇", "code" => "610124106"},
      %{"name" => "广济镇", "code" => "610124107"},
      %{"name" => "厚畛子镇", "code" => "610124108"},
      %{"name" => "青化镇", "code" => "610124109"},
      %{"name" => "竹峪镇", "code" => "610124110"},
      %{"name" => "翠峰镇", "code" => "610124111"},
      %{"name" => "四屯镇", "code" => "610124112"},
      %{"name" => "司竹镇", "code" => "610124115"},
      %{"name" => "九峰镇", "code" => "610124116"},
      %{"name" => "富仁镇", "code" => "610124117"},
      %{"name" => "骆峪镇", "code" => "610124118"},
      %{"name" => "陈河镇", "code" => "610124119"},
      %{"name" => "板房子镇", "code" => "610124120"},
      %{"name" => "王家河镇", "code" => "610124121"}
    ]

  def next(_), do: nil
end