defmodule ChinaAdminDivisions.Gen.Lv3x.M62 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "合作市" or input == "623001",
    do: [
      %{"name" => "当周街道", "code" => "623001001"},
      %{"name" => "伊合昂街道", "code" => "623001002"},
      %{"name" => "坚木克尔街道", "code" => "623001003"},
      %{"name" => "通钦街道", "code" => "623001004"},
      %{"name" => "那吾镇", "code" => "623001100"},
      %{"name" => "勒秀镇", "code" => "623001101"},
      %{"name" => "佐盖曼玛镇", "code" => "623001102"},
      %{"name" => "卡加曼乡", "code" => "623001200"},
      %{"name" => "卡加道乡", "code" => "623001201"},
      %{"name" => "佐盖多玛乡", "code" => "623001202"}
    ]

  def next(input) when input == "临潭县" or input == "623021",
    do: [
      %{"name" => "城关镇", "code" => "623021100"},
      %{"name" => "新城镇", "code" => "623021101"},
      %{"name" => "冶力关镇", "code" => "623021102"},
      %{"name" => "羊永镇", "code" => "623021103"},
      %{"name" => "王旗镇", "code" => "623021104"},
      %{"name" => "古战镇", "code" => "623021105"},
      %{"name" => "洮滨镇", "code" => "623021106"},
      %{"name" => "八角镇", "code" => "623021107"},
      %{"name" => "流顺镇", "code" => "623021108"},
      %{"name" => "店子镇", "code" => "623021109"},
      %{"name" => "羊沙镇", "code" => "623021110"},
      %{"name" => "术布乡", "code" => "623021200"},
      %{"name" => "卓洛乡", "code" => "623021202"},
      %{"name" => "长川乡", "code" => "623021203"},
      %{"name" => "三岔乡", "code" => "623021208"},
      %{"name" => "石门乡", "code" => "623021210"}
    ]

  def next(input) when input == "卓尼县" or input == "623022",
    do: [
      %{"name" => "柳林镇", "code" => "623022100"},
      %{"name" => "木耳镇", "code" => "623022101"},
      %{"name" => "扎古录镇", "code" => "623022102"},
      %{"name" => "喀尔钦镇", "code" => "623022103"},
      %{"name" => "藏巴哇镇", "code" => "623022104"},
      %{"name" => "纳浪镇", "code" => "623022105"},
      %{"name" => "洮砚镇", "code" => "623022106"},
      %{"name" => "阿子滩镇", "code" => "623022107"},
      %{"name" => "申藏镇", "code" => "623022108"},
      %{"name" => "完冒镇", "code" => "623022109"},
      %{"name" => "尼巴镇", "code" => "623022110"},
      %{"name" => "刀告乡", "code" => "623022202"},
      %{"name" => "恰盖乡", "code" => "623022207"},
      %{"name" => "康多乡", "code" => "623022208"},
      %{"name" => "杓哇土族乡", "code" => "623022209"}
    ]

  def next(input) when input == "舟曲县" or input == "623023",
    do: [
      %{"name" => "城关镇", "code" => "623023100"},
      %{"name" => "大川镇", "code" => "623023101"},
      %{"name" => "峰迭镇", "code" => "623023102"},
      %{"name" => "立节镇", "code" => "623023103"},
      %{"name" => "东山镇", "code" => "623023104"},
      %{"name" => "曲告纳镇", "code" => "623023105"},
      %{"name" => "博峪镇", "code" => "623023106"},
      %{"name" => "巴藏镇", "code" => "623023107"},
      %{"name" => "憨班镇", "code" => "623023108"},
      %{"name" => "坪定镇", "code" => "623023109"},
      %{"name" => "果耶镇", "code" => "623023110"},
      %{"name" => "武坪镇", "code" => "623023111"},
      %{"name" => "大峪镇", "code" => "623023112"},
      %{"name" => "江盘镇", "code" => "623023113"},
      %{"name" => "拱坝镇", "code" => "623023114"},
      %{"name" => "曲瓦乡", "code" => "623023200"},
      %{"name" => "南峪乡", "code" => "623023208"},
      %{"name" => "八楞乡", "code" => "623023210"},
      %{"name" => "插岗乡", "code" => "623023212"}
    ]

  def next(input) when input == "迭部县" or input == "623024",
    do: [
      %{"name" => "电尕镇", "code" => "623024100"},
      %{"name" => "益哇镇", "code" => "623024101"},
      %{"name" => "旺藏镇", "code" => "623024102"},
      %{"name" => "腊子口镇", "code" => "623024103"},
      %{"name" => "洛大镇", "code" => "623024104"},
      %{"name" => "卡坝乡", "code" => "623024201"},
      %{"name" => "达拉乡", "code" => "623024202"},
      %{"name" => "尼傲乡", "code" => "623024203"},
      %{"name" => "阿夏乡", "code" => "623024205"},
      %{"name" => "多儿乡", "code" => "623024206"},
      %{"name" => "桑坝乡", "code" => "623024207"}
    ]

  def next(input) when input == "玛曲县" or input == "623025",
    do: [
      %{"name" => "尼玛镇", "code" => "623025100"},
      %{"name" => "曼日玛镇", "code" => "623025101"},
      %{"name" => "阿万仓镇", "code" => "623025102"},
      %{"name" => "齐哈玛镇", "code" => "623025103"},
      %{"name" => "采日玛镇", "code" => "623025104"},
      %{"name" => "欧拉镇", "code" => "623025105"},
      %{"name" => "欧拉秀玛乡", "code" => "623025201"},
      %{"name" => "木西合乡", "code" => "623025203"},
      %{"name" => "河曲马场", "code" => "623025400"},
      %{"name" => "大水军牧场", "code" => "623025401"},
      %{"name" => "高原生物研究所", "code" => "623025402"}
    ]

  def next(input) when input == "碌曲县" or input == "623026",
    do: [
      %{"name" => "郎木寺镇", "code" => "623026100"},
      %{"name" => "玛艾镇", "code" => "623026101"},
      %{"name" => "西仓镇", "code" => "623026102"},
      %{"name" => "尕海镇", "code" => "623026103"},
      %{"name" => "双岔镇", "code" => "623026104"},
      %{"name" => "拉仁关乡", "code" => "623026202"},
      %{"name" => "阿拉乡", "code" => "623026204"}
    ]

  def next(input) when input == "夏河县" or input == "623027",
    do: [
      %{"name" => "拉卜楞镇", "code" => "623027100"},
      %{"name" => "王格尔塘镇", "code" => "623027101"},
      %{"name" => "阿木去乎镇", "code" => "623027102"},
      %{"name" => "桑科镇", "code" => "623027103"},
      %{"name" => "甘加镇", "code" => "623027104"},
      %{"name" => "麻当镇", "code" => "623027105"},
      %{"name" => "博拉镇", "code" => "623027106"},
      %{"name" => "科才镇", "code" => "623027107"},
      %{"name" => "达麦乡", "code" => "623027202"},
      %{"name" => "曲奥乡", "code" => "623027204"},
      %{"name" => "唐尕昂乡", "code" => "623027205"},
      %{"name" => "扎油乡", "code" => "623027206"},
      %{"name" => "吉仓乡", "code" => "623027208"}
    ]

  def next(input) when input == "临夏市" or input == "622901",
    do: [
      %{"name" => "城南街道", "code" => "622901001"},
      %{"name" => "城北街道", "code" => "622901002"},
      %{"name" => "东关街道", "code" => "622901003"},
      %{"name" => "西关街道", "code" => "622901004"},
      %{"name" => "八坊街道", "code" => "622901005"},
      %{"name" => "红园街道", "code" => "622901006"},
      %{"name" => "东区街道", "code" => "622901007"},
      %{"name" => "城郊镇", "code" => "622901100"},
      %{"name" => "枹罕镇", "code" => "622901101"},
      %{"name" => "南龙镇", "code" => "622901102"},
      %{"name" => "折桥镇", "code" => "622901103"}
    ]

  def next(input) when input == "临夏县" or input == "622921",
    do: [
      %{"name" => "韩集镇", "code" => "622921100"},
      %{"name" => "土桥镇", "code" => "622921101"},
      %{"name" => "马集镇", "code" => "622921102"},
      %{"name" => "莲花镇", "code" => "622921103"},
      %{"name" => "新集镇", "code" => "622921104"},
      %{"name" => "尹集镇", "code" => "622921105"},
      %{"name" => "刁祁镇", "code" => "622921106"},
      %{"name" => "北塬镇", "code" => "622921107"},
      %{"name" => "黄泥湾镇", "code" => "622921108"},
      %{"name" => "营滩乡", "code" => "622921200"},
      %{"name" => "掌子沟乡", "code" => "622921201"},
      %{"name" => "麻尼寺沟乡", "code" => "622921202"},
      %{"name" => "漠泥沟乡", "code" => "622921204"},
      %{"name" => "漫路乡", "code" => "622921208"},
      %{"name" => "榆林乡", "code" => "622921209"},
      %{"name" => "井沟乡", "code" => "622921210"},
      %{"name" => "坡头乡", "code" => "622921213"},
      %{"name" => "桥寺乡", "code" => "622921214"},
      %{"name" => "先锋乡", "code" => "622921215"},
      %{"name" => "河西乡", "code" => "622921216"},
      %{"name" => "安家坡乡", "code" => "622921217"},
      %{"name" => "南塬乡", "code" => "622921218"},
      %{"name" => "红台乡", "code" => "622921220"},
      %{"name" => "路盘乡", "code" => "622921223"},
      %{"name" => "民主乡", "code" => "622921224"}
    ]

  def next(input) when input == "康乐县" or input == "622922",
    do: [
      %{"name" => "附城镇", "code" => "622922100"},
      %{"name" => "苏集镇", "code" => "622922101"},
      %{"name" => "胭脂镇", "code" => "622922102"},
      %{"name" => "景古镇", "code" => "622922103"},
      %{"name" => "莲麓镇", "code" => "622922104"},
      %{"name" => "康丰乡", "code" => "622922200"},
      %{"name" => "虎关乡", "code" => "622922201"},
      %{"name" => "流川乡", "code" => "622922202"},
      %{"name" => "白王乡", "code" => "622922203"},
      %{"name" => "八松乡", "code" => "622922205"},
      %{"name" => "鸣鹿乡", "code" => "622922206"},
      %{"name" => "八丹乡", "code" => "622922207"},
      %{"name" => "上湾乡", "code" => "622922208"},
      %{"name" => "草滩乡", "code" => "622922211"},
      %{"name" => "五户乡", "code" => "622922212"}
    ]

  def next(input) when input == "永靖县" or input == "622923",
    do: [
      %{"name" => "刘家峡镇", "code" => "622923100"},
      %{"name" => "盐锅峡镇", "code" => "622923101"},
      %{"name" => "太极镇", "code" => "622923102"},
      %{"name" => "西河镇", "code" => "622923103"},
      %{"name" => "三塬镇", "code" => "622923104"},
      %{"name" => "岘塬镇", "code" => "622923105"},
      %{"name" => "陈井镇", "code" => "622923106"},
      %{"name" => "川城镇", "code" => "622923107"},
      %{"name" => "王台镇", "code" => "622923108"},
      %{"name" => "红泉镇", "code" => "622923109"},
      %{"name" => "关山乡", "code" => "622923200"},
      %{"name" => "徐顶乡", "code" => "622923201"},
      %{"name" => "三条岘乡", "code" => "622923202"},
      %{"name" => "坪沟乡", "code" => "622923203"},
      %{"name" => "新寺乡", "code" => "622923206"},
      %{"name" => "小岭乡", "code" => "622923207"},
      %{"name" => "杨塔乡", "code" => "622923208"}
    ]

  def next(input) when input == "广河县" or input == "622924",
    do: [
      %{"name" => "城关镇", "code" => "622924100"},
      %{"name" => "三甲集镇", "code" => "622924101"},
      %{"name" => "祁家集镇", "code" => "622924102"},
      %{"name" => "庄窠集镇", "code" => "622924103"},
      %{"name" => "买家巷镇", "code" => "622924104"},
      %{"name" => "齐家镇", "code" => "622924105"},
      %{"name" => "水泉乡", "code" => "622924202"},
      %{"name" => "官坊乡", "code" => "622924203"},
      %{"name" => "阿力麻土东乡族乡", "code" => "622924204"}
    ]

  def next(input) when input == "和政县" or input == "622925",
    do: [
      %{"name" => "城关镇", "code" => "622925100"},
      %{"name" => "三合镇", "code" => "622925101"},
      %{"name" => "三十里铺镇", "code" => "622925102"},
      %{"name" => "马家堡镇", "code" => "622925103"},
      %{"name" => "买家集镇", "code" => "622925104"},
      %{"name" => "松鸣镇", "code" => "622925105"},
      %{"name" => "陈家集镇", "code" => "622925106"},
      %{"name" => "罗家集镇", "code" => "622925107"},
      %{"name" => "新营镇", "code" => "622925108"},
      %{"name" => "梁家寺乡", "code" => "622925200"},
      %{"name" => "卜家庄乡", "code" => "622925203"},
      %{"name" => "新庄乡", "code" => "622925205"},
      %{"name" => "达浪乡", "code" => "622925207"}
    ]

  def next(input) when input == "东乡族自治县" or input == "622926",
    do: [
      %{"name" => "锁南镇", "code" => "622926100"},
      %{"name" => "达板镇", "code" => "622926101"},
      %{"name" => "河滩镇", "code" => "622926102"},
      %{"name" => "那勒寺镇", "code" => "622926103"},
      %{"name" => "唐汪镇", "code" => "622926104"},
      %{"name" => "果园镇", "code" => "622926105"},
      %{"name" => "汪集镇", "code" => "622926106"},
      %{"name" => "龙泉镇", "code" => "622926107"},
      %{"name" => "春台乡", "code" => "622926200"},
      %{"name" => "柳树乡", "code" => "622926201"},
      %{"name" => "东塬乡", "code" => "622926202"},
      %{"name" => "坪庄乡", "code" => "622926204"},
      %{"name" => "百和乡", "code" => "622926205"},
      %{"name" => "关卜乡", "code" => "622926206"},
      %{"name" => "赵家乡", "code" => "622926208"},
      %{"name" => "五家乡", "code" => "622926209"},
      %{"name" => "沿岭乡", "code" => "622926212"},
      %{"name" => "风山乡", "code" => "622926214"},
      %{"name" => "车家湾乡", "code" => "622926215"},
      %{"name" => "高山乡", "code" => "622926216"},
      %{"name" => "大树乡", "code" => "622926219"},
      %{"name" => "北岭乡", "code" => "622926220"},
      %{"name" => "考勒乡", "code" => "622926222"},
      %{"name" => "董岭乡", "code" => "622926223"}
    ]

  def next(input) when input == "积石山保安族东乡族撒拉族自治县" or input == "622927",
    do: [
      %{"name" => "吹麻滩镇", "code" => "622927100"},
      %{"name" => "大河家镇", "code" => "622927101"},
      %{"name" => "居集镇", "code" => "622927102"},
      %{"name" => "癿藏镇", "code" => "622927103"},
      %{"name" => "石塬镇", "code" => "622927104"},
      %{"name" => "安集镇", "code" => "622927105"},
      %{"name" => "银川镇", "code" => "622927106"},
      %{"name" => "刘集乡", "code" => "622927200"},
      %{"name" => "柳沟乡", "code" => "622927202"},
      %{"name" => "关家川乡", "code" => "622927203"},
      %{"name" => "胡林家乡", "code" => "622927204"},
      %{"name" => "寨子沟乡", "code" => "622927206"},
      %{"name" => "郭干乡", "code" => "622927207"},
      %{"name" => "徐扈家乡", "code" => "622927208"},
      %{"name" => "中咀岭乡", "code" => "622927209"},
      %{"name" => "小关乡", "code" => "622927210"},
      %{"name" => "铺川乡", "code" => "622927211"}
    ]

  def next(input) when input == "武都区" or input == "621202",
    do: [
      %{"name" => "钟楼街道", "code" => "621202001"},
      %{"name" => "吉石坝街道", "code" => "621202002"},
      %{"name" => "江北街道", "code" => "621202003"},
      %{"name" => "江南街道", "code" => "621202004"},
      %{"name" => "城关镇", "code" => "621202100"},
      %{"name" => "安化镇", "code" => "621202101"},
      %{"name" => "东江镇", "code" => "621202102"},
      %{"name" => "两水镇", "code" => "621202103"},
      %{"name" => "汉王镇", "code" => "621202104"},
      %{"name" => "洛塘镇", "code" => "621202105"},
      %{"name" => "角弓镇", "code" => "621202106"},
      %{"name" => "马街镇", "code" => "621202107"},
      %{"name" => "三河镇", "code" => "621202108"},
      %{"name" => "甘泉镇", "code" => "621202109"},
      %{"name" => "鱼龙镇", "code" => "621202110"},
      %{"name" => "琵琶镇", "code" => "621202111"},
      %{"name" => "外纳镇", "code" => "621202112"},
      %{"name" => "马营镇", "code" => "621202113"},
      %{"name" => "柏林镇", "code" => "621202114"},
      %{"name" => "姚寨镇", "code" => "621202115"},
      %{"name" => "佛崖镇", "code" => "621202116"},
      %{"name" => "石门镇", "code" => "621202117"},
      %{"name" => "五马镇", "code" => "621202118"},
      %{"name" => "裕河镇", "code" => "621202119"},
      %{"name" => "汉林镇", "code" => "621202120"},
      %{"name" => "桔柑镇", "code" => "621202121"},
      %{"name" => "隆兴镇", "code" => "621202122"},
      %{"name" => "黄坪镇", "code" => "621202123"},
      %{"name" => "五库镇", "code" => "621202124"},
      %{"name" => "三仓镇", "code" => "621202125"},
      %{"name" => "坪垭藏族乡", "code" => "621202201"},
      %{"name" => "蒲池乡", "code" => "621202203"},
      %{"name" => "池坝乡", "code" => "621202211"},
      %{"name" => "龙坝乡", "code" => "621202218"},
      %{"name" => "龙凤乡", "code" => "621202219"},
      %{"name" => "磨坝藏族乡", "code" => "621202221"},
      %{"name" => "玉皇乡", "code" => "621202225"},
      %{"name" => "郭河乡", "code" => "621202226"},
      %{"name" => "枫相乡", "code" => "621202229"},
      %{"name" => "月照乡", "code" => "621202233"}
    ]

  def next(input) when input == "成县" or input == "621221",
    do: [
      %{"name" => "城关镇", "code" => "621221100"},
      %{"name" => "黄渚镇", "code" => "621221101"},
      %{"name" => "红川镇", "code" => "621221102"},
      %{"name" => "小川镇", "code" => "621221103"},
      %{"name" => "纸坊镇", "code" => "621221104"},
      %{"name" => "抛沙镇", "code" => "621221105"},
      %{"name" => "店村镇", "code" => "621221107"},
      %{"name" => "王磨镇", "code" => "621221108"},
      %{"name" => "陈院镇", "code" => "621221109"},
      %{"name" => "沙坝镇", "code" => "621221110"},
      %{"name" => "黄陈镇", "code" => "621221111"},
      %{"name" => "鸡峰镇", "code" => "621221112"},
      %{"name" => "苏元镇", "code" => "621221113"},
      %{"name" => "索池镇", "code" => "621221114"},
      %{"name" => "宋坪乡", "code" => "621221203"},
      %{"name" => "二郎乡", "code" => "621221206"},
      %{"name" => "镡河乡", "code" => "621221213"}
    ]

  def next(input) when input == "文县" or input == "621222",
    do: [
      %{"name" => "城关镇", "code" => "621222100"},
      %{"name" => "碧口镇", "code" => "621222101"},
      %{"name" => "尚德镇", "code" => "621222102"},
      %{"name" => "中寨镇", "code" => "621222103"},
      %{"name" => "临江镇", "code" => "621222104"},
      %{"name" => "桥头镇", "code" => "621222105"},
      %{"name" => "梨坪镇", "code" => "621222106"},
      %{"name" => "天池镇", "code" => "621222107"},
      %{"name" => "堡子坝镇", "code" => "621222108"},
      %{"name" => "石坊镇", "code" => "621222109"},
      %{"name" => "石鸡坝镇", "code" => "621222110"},
      %{"name" => "丹堡镇", "code" => "621222111"},
      %{"name" => "中庙镇", "code" => "621222112"},
      %{"name" => "范坝镇", "code" => "621222113"},
      %{"name" => "铁楼藏族乡", "code" => "621222200"},
      %{"name" => "刘家坪乡", "code" => "621222205"},
      %{"name" => "玉垒乡", "code" => "621222206"},
      %{"name" => "口头坝乡", "code" => "621222211"},
      %{"name" => "尖山乡", "code" => "621222212"},
      %{"name" => "舍书乡", "code" => "621222215"}
    ]

  def next(input) when input == "宕昌县" or input == "621223",
    do: [
      %{"name" => "城关镇", "code" => "621223100"},
      %{"name" => "哈达铺镇", "code" => "621223101"},
      %{"name" => "理川镇", "code" => "621223102"},
      %{"name" => "南阳镇", "code" => "621223103"},
      %{"name" => "官亭镇", "code" => "621223104"},
      %{"name" => "沙湾镇", "code" => "621223105"},
      %{"name" => "阿坞镇", "code" => "621223106"},
      %{"name" => "南河镇", "code" => "621223107"},
      %{"name" => "八力镇", "code" => "621223108"},
      %{"name" => "临江铺镇", "code" => "621223109"},
      %{"name" => "两河口镇", "code" => "621223110"},
      %{"name" => "木耳乡", "code" => "621223206"},
      %{"name" => "庞家乡", "code" => "621223207"},
      %{"name" => "何家堡乡", "code" => "621223209"},
      %{"name" => "贾河乡", "code" => "621223211"},
      %{"name" => "将台乡", "code" => "621223212"},
      %{"name" => "车拉乡", "code" => "621223213"},
      %{"name" => "新城子藏族乡", "code" => "621223214"},
      %{"name" => "好梯乡", "code" => "621223216"},
      %{"name" => "韩院乡", "code" => "621223217"},
      %{"name" => "竹院乡", "code" => "621223218"},
      %{"name" => "兴化乡", "code" => "621223219"},
      %{"name" => "甘江头乡", "code" => "621223220"},
      %{"name" => "新寨乡", "code" => "621223223"},
      %{"name" => "狮子乡", "code" => "621223224"}
    ]

  def next(input) when input == "康县" or input == "621224",
    do: [
      %{"name" => "城关镇", "code" => "621224100"},
      %{"name" => "平洛镇", "code" => "621224101"},
      %{"name" => "大堡镇", "code" => "621224102"},
      %{"name" => "岸门口镇", "code" => "621224103"},
      %{"name" => "两河镇", "code" => "621224104"},
      %{"name" => "长坝镇", "code" => "621224105"},
      %{"name" => "云台镇", "code" => "621224106"},
      %{"name" => "阳坝镇", "code" => "621224107"},
      %{"name" => "王坝镇", "code" => "621224108"},
      %{"name" => "碾坝镇", "code" => "621224109"},
      %{"name" => "豆坝镇", "code" => "621224110"},
      %{"name" => "望关镇", "code" => "621224111"},
      %{"name" => "大南峪镇", "code" => "621224112"},
      %{"name" => "周家坝镇", "code" => "621224113"},
      %{"name" => "寺台镇", "code" => "621224114"},
      %{"name" => "白杨镇", "code" => "621224115"},
      %{"name" => "铜钱镇", "code" => "621224116"},
      %{"name" => "三河坝镇", "code" => "621224117"},
      %{"name" => "迷坝乡", "code" => "621224204"},
      %{"name" => "店子乡", "code" => "621224209"},
      %{"name" => "太石乡", "code" => "621224214"}
    ]

  def next(input) when input == "西和县" or input == "621225",
    do: [
      %{"name" => "汉源镇", "code" => "621225100"},
      %{"name" => "长道镇", "code" => "621225101"},
      %{"name" => "何坝镇", "code" => "621225102"},
      %{"name" => "姜席镇", "code" => "621225103"},
      %{"name" => "石峡镇", "code" => "621225104"},
      %{"name" => "洛峪镇", "code" => "621225105"},
      %{"name" => "西峪镇", "code" => "621225106"},
      %{"name" => "马元镇", "code" => "621225107"},
      %{"name" => "大桥镇", "code" => "621225108"},
      %{"name" => "十里镇", "code" => "621225109"},
      %{"name" => "石堡镇", "code" => "621225110"},
      %{"name" => "兴隆镇", "code" => "621225111"},
      %{"name" => "苏合镇", "code" => "621225112"},
      %{"name" => "卢河镇", "code" => "621225113"},
      %{"name" => "稍峪镇", "code" => "621225114"},
      %{"name" => "西高山镇", "code" => "621225115"},
      %{"name" => "晒经乡", "code" => "621225208"},
      %{"name" => "蒿林乡", "code" => "621225217"},
      %{"name" => "太石河乡", "code" => "621225218"},
      %{"name" => "六巷乡", "code" => "621225220"}
    ]

  def next(input) when input == "礼县" or input == "621226",
    do: [
      %{"name" => "城关镇", "code" => "621226100"},
      %{"name" => "盐官镇", "code" => "621226101"},
      %{"name" => "石桥镇", "code" => "621226102"},
      %{"name" => "白河镇", "code" => "621226103"},
      %{"name" => "宽川镇", "code" => "621226104"},
      %{"name" => "永兴镇", "code" => "621226105"},
      %{"name" => "祁山镇", "code" => "621226106"},
      %{"name" => "红河镇", "code" => "621226107"},
      %{"name" => "永坪镇", "code" => "621226108"},
      %{"name" => "中坝镇", "code" => "621226109"},
      %{"name" => "罗坝镇", "code" => "621226110"},
      %{"name" => "雷坝镇", "code" => "621226111"},
      %{"name" => "崖城镇", "code" => "621226112"},
      %{"name" => "洮坪镇", "code" => "621226113"},
      %{"name" => "龙林镇", "code" => "621226114"},
      %{"name" => "固城镇", "code" => "621226115"},
      %{"name" => "江口镇", "code" => "621226116"},
      %{"name" => "湫山镇", "code" => "621226117"},
      %{"name" => "白关镇", "code" => "621226118"},
      %{"name" => "桥头镇", "code" => "621226119"},
      %{"name" => "王坝镇", "code" => "621226120"},
      %{"name" => "滩坪镇", "code" => "621226121"},
      %{"name" => "马河乡", "code" => "621226203"},
      %{"name" => "上坪乡", "code" => "621226215"},
      %{"name" => "雷王乡", "code" => "621226219"},
      %{"name" => "沙金乡", "code" => "621226224"},
      %{"name" => "草坪乡", "code" => "621226228"},
      %{"name" => "肖良乡", "code" => "621226231"},
      %{"name" => "三峪乡", "code" => "621226232"}
    ]

  def next(input) when input == "徽县" or input == "621227",
    do: [
      %{"name" => "城关镇", "code" => "621227100"},
      %{"name" => "伏家镇", "code" => "621227101"},
      %{"name" => "江洛镇", "code" => "621227102"},
      %{"name" => "泥阳镇", "code" => "621227103"},
      %{"name" => "柳林镇", "code" => "621227104"},
      %{"name" => "嘉陵镇", "code" => "621227105"},
      %{"name" => "永宁镇", "code" => "621227106"},
      %{"name" => "银杏树镇", "code" => "621227107"},
      %{"name" => "水阳镇", "code" => "621227108"},
      %{"name" => "栗川镇", "code" => "621227109"},
      %{"name" => "麻沿河镇", "code" => "621227110"},
      %{"name" => "高桥镇", "code" => "621227111"},
      %{"name" => "大河店镇", "code" => "621227112"},
      %{"name" => "榆树乡", "code" => "621227208"},
      %{"name" => "虞关乡", "code" => "621227211"}
    ]

  def next(input) when input == "两当县" or input == "621228",
    do: [
      %{"name" => "城关镇", "code" => "621228100"},
      %{"name" => "站儿巷镇", "code" => "621228101"},
      %{"name" => "西坡镇", "code" => "621228102"},
      %{"name" => "杨店镇", "code" => "621228103"},
      %{"name" => "显龙镇", "code" => "621228104"},
      %{"name" => "云屏镇", "code" => "621228105"},
      %{"name" => "左家乡", "code" => "621228201"},
      %{"name" => "鱼池乡", "code" => "621228203"},
      %{"name" => "兴化乡", "code" => "621228204"},
      %{"name" => "张家乡", "code" => "621228207"},
      %{"name" => "泰山乡", "code" => "621228210"},
      %{"name" => "金洞乡", "code" => "621228212"}
    ]

  def next(input) when input == "安定区" or input == "621102",
    do: [
      %{"name" => "中华路街道", "code" => "621102001"},
      %{"name" => "永定路街道", "code" => "621102002"},
      %{"name" => "福台路街道", "code" => "621102003"},
      %{"name" => "凤翔镇", "code" => "621102101"},
      %{"name" => "内官营镇", "code" => "621102102"},
      %{"name" => "巉口镇", "code" => "621102103"},
      %{"name" => "称钩驿镇", "code" => "621102104"},
      %{"name" => "鲁家沟镇", "code" => "621102105"},
      %{"name" => "西巩驿镇", "code" => "621102106"},
      %{"name" => "宁远镇", "code" => "621102107"},
      %{"name" => "李家堡镇", "code" => "621102108"},
      %{"name" => "团结镇", "code" => "621102109"},
      %{"name" => "香泉镇", "code" => "621102110"},
      %{"name" => "符家川镇", "code" => "621102111"},
      %{"name" => "葛家岔镇", "code" => "621102112"},
      %{"name" => "白碌乡", "code" => "621102204"},
      %{"name" => "石峡湾乡", "code" => "621102207"},
      %{"name" => "新集乡", "code" => "621102208"},
      %{"name" => "青岚山乡", "code" => "621102209"},
      %{"name" => "高峰乡", "code" => "621102210"},
      %{"name" => "石泉乡", "code" => "621102211"},
      %{"name" => "杏园乡", "code" => "621102214"}
    ]

  def next(input) when input == "通渭县" or input == "621121",
    do: [
      %{"name" => "平襄镇", "code" => "621121100"},
      %{"name" => "马营镇", "code" => "621121101"},
      %{"name" => "鸡川镇", "code" => "621121102"},
      %{"name" => "榜罗镇", "code" => "621121103"},
      %{"name" => "常家河镇", "code" => "621121104"},
      %{"name" => "义岗川镇", "code" => "621121105"},
      %{"name" => "陇阳镇", "code" => "621121106"},
      %{"name" => "陇山镇", "code" => "621121107"},
      %{"name" => "陇川镇", "code" => "621121108"},
      %{"name" => "碧玉镇", "code" => "621121109"},
      %{"name" => "襄南镇", "code" => "621121110"},
      %{"name" => "什川镇", "code" => "621121111"},
      %{"name" => "华家岭镇", "code" => "621121112"},
      %{"name" => "北城铺镇", "code" => "621121113"},
      %{"name" => "新景乡", "code" => "621121203"},
      %{"name" => "李家店乡", "code" => "621121207"},
      %{"name" => "第三铺乡", "code" => "621121212"},
      %{"name" => "寺子川乡", "code" => "621121215"}
    ]

  def next(input) when input == "陇西县" or input == "621122",
    do: [
      %{"name" => "巩昌镇", "code" => "621122100"},
      %{"name" => "文峰镇", "code" => "621122101"},
      %{"name" => "首阳镇", "code" => "621122102"},
      %{"name" => "菜子镇", "code" => "621122103"},
      %{"name" => "福星镇", "code" => "621122104"},
      %{"name" => "通安驿镇", "code" => "621122105"},
      %{"name" => "云田镇", "code" => "621122106"},
      %{"name" => "碧岩镇", "code" => "621122107"},
      %{"name" => "马河镇", "code" => "621122108"},
      %{"name" => "柯寨镇", "code" => "621122109"},
      %{"name" => "双泉镇", "code" => "621122110"},
      %{"name" => "权家湾镇", "code" => "621122111"},
      %{"name" => "渭阳乡", "code" => "621122200"},
      %{"name" => "宏伟乡", "code" => "621122201"},
      %{"name" => "和平乡", "code" => "621122202"},
      %{"name" => "德兴乡", "code" => "621122205"},
      %{"name" => "永吉乡", "code" => "621122206"}
    ]

  def next(input) when input == "渭源县" or input == "621123",
    do: [
      %{"name" => "清源镇", "code" => "621123100"},
      %{"name" => "莲峰镇", "code" => "621123101"},
      %{"name" => "会川镇", "code" => "621123102"},
      %{"name" => "五竹镇", "code" => "621123103"},
      %{"name" => "路园镇", "code" => "621123104"},
      %{"name" => "北寨镇", "code" => "621123105"},
      %{"name" => "新寨镇", "code" => "621123106"},
      %{"name" => "麻家集镇", "code" => "621123107"},
      %{"name" => "锹峪镇", "code" => "621123108"},
      %{"name" => "庆坪镇", "code" => "621123109"},
      %{"name" => "祁家庙镇", "code" => "621123110"},
      %{"name" => "上湾镇", "code" => "621123111"},
      %{"name" => "大安乡", "code" => "621123203"},
      %{"name" => "秦祁乡", "code" => "621123204"},
      %{"name" => "峡城乡", "code" => "621123209"},
      %{"name" => "田家河乡", "code" => "621123210"}
    ]

  def next(input) when input == "临洮县" or input == "621124",
    do: [
      %{"name" => "洮阳镇", "code" => "621124100"},
      %{"name" => "八里铺镇", "code" => "621124101"},
      %{"name" => "新添镇", "code" => "621124102"},
      %{"name" => "辛店镇", "code" => "621124103"},
      %{"name" => "太石镇", "code" => "621124104"},
      %{"name" => "中铺镇", "code" => "621124105"},
      %{"name" => "峡口镇", "code" => "621124106"},
      %{"name" => "龙门镇", "code" => "621124107"},
      %{"name" => "窑店镇", "code" => "621124108"},
      %{"name" => "玉井镇", "code" => "621124109"},
      %{"name" => "衙下集镇", "code" => "621124110"},
      %{"name" => "南屏镇", "code" => "621124111"},
      %{"name" => "红旗乡", "code" => "621124200"},
      %{"name" => "上营乡", "code" => "621124201"},
      %{"name" => "康家集乡", "code" => "621124202"},
      %{"name" => "站滩乡", "code" => "621124203"},
      %{"name" => "漫洼乡", "code" => "621124204"},
      %{"name" => "连儿湾乡", "code" => "621124205"}
    ]

  def next(input) when input == "漳县" or input == "621125",
    do: [
      %{"name" => "武阳镇", "code" => "621125100"},
      %{"name" => "三岔镇", "code" => "621125101"},
      %{"name" => "新寺镇", "code" => "621125102"},
      %{"name" => "金钟镇", "code" => "621125103"},
      %{"name" => "盐井镇", "code" => "621125104"},
      %{"name" => "殪虎桥镇", "code" => "621125105"},
      %{"name" => "大草滩镇", "code" => "621125106"},
      %{"name" => "四族镇", "code" => "621125107"},
      %{"name" => "石川镇", "code" => "621125108"},
      %{"name" => "贵清山镇", "code" => "621125109"},
      %{"name" => "马泉乡", "code" => "621125204"},
      %{"name" => "武当乡", "code" => "621125208"},
      %{"name" => "东泉乡", "code" => "621125209"}
    ]

  def next(input) when input == "岷县" or input == "621126",
    do: [
      %{"name" => "岷阳镇", "code" => "621126100"},
      %{"name" => "蒲麻镇", "code" => "621126101"},
      %{"name" => "西寨镇", "code" => "621126102"},
      %{"name" => "梅川镇", "code" => "621126103"},
      %{"name" => "西江镇", "code" => "621126104"},
      %{"name" => "闾井镇", "code" => "621126105"},
      %{"name" => "十里镇", "code" => "621126106"},
      %{"name" => "茶埠镇", "code" => "621126107"},
      %{"name" => "中寨镇", "code" => "621126108"},
      %{"name" => "清水镇", "code" => "621126109"},
      %{"name" => "寺沟镇", "code" => "621126110"},
      %{"name" => "麻子川镇", "code" => "621126111"},
      %{"name" => "维新镇", "code" => "621126112"},
      %{"name" => "禾驮镇", "code" => "621126113"},
      %{"name" => "马坞镇", "code" => "621126114"},
      %{"name" => "秦许乡", "code" => "621126204"},
      %{"name" => "申都乡", "code" => "621126207"},
      %{"name" => "锁龙乡", "code" => "621126208"}
    ]

  def next(input) when input == "西峰区" or input == "621002",
    do: [
      %{"name" => "北街街道", "code" => "621002001"},
      %{"name" => "南街街道", "code" => "621002002"},
      %{"name" => "西街街道", "code" => "621002003"},
      %{"name" => "肖金镇", "code" => "621002100"},
      %{"name" => "董志镇", "code" => "621002101"},
      %{"name" => "后官寨镇", "code" => "621002102"},
      %{"name" => "彭原镇", "code" => "621002103"},
      %{"name" => "温泉镇", "code" => "621002104"},
      %{"name" => "什社乡", "code" => "621002203"},
      %{"name" => "显胜乡", "code" => "621002204"}
    ]

  def next(input) when input == "庆城县" or input == "621021",
    do: [
      %{"name" => "庆城镇", "code" => "621021100"},
      %{"name" => "驿马镇", "code" => "621021101"},
      %{"name" => "三十里铺镇", "code" => "621021102"},
      %{"name" => "马岭镇", "code" => "621021103"},
      %{"name" => "玄马镇", "code" => "621021104"},
      %{"name" => "白马铺镇", "code" => "621021105"},
      %{"name" => "桐川镇", "code" => "621021106"},
      %{"name" => "赤城镇", "code" => "621021107"},
      %{"name" => "高楼镇", "code" => "621021108"},
      %{"name" => "太白梁乡", "code" => "621021203"},
      %{"name" => "土桥乡", "code" => "621021204"},
      %{"name" => "蔡口集乡", "code" => "621021205"},
      %{"name" => "南庄乡", "code" => "621021207"},
      %{"name" => "翟家河乡", "code" => "621021208"},
      %{"name" => "蔡家庙乡", "code" => "621021209"}
    ]

  def next(input) when input == "环县" or input == "621022",
    do: [
      %{"name" => "环城镇", "code" => "621022100"},
      %{"name" => "曲子镇", "code" => "621022101"},
      %{"name" => "甜水镇", "code" => "621022102"},
      %{"name" => "木钵镇", "code" => "621022103"},
      %{"name" => "洪德镇", "code" => "621022104"},
      %{"name" => "合道镇", "code" => "621022105"},
      %{"name" => "虎洞镇", "code" => "621022106"},
      %{"name" => "毛井镇", "code" => "621022107"},
      %{"name" => "樊家川镇", "code" => "621022108"},
      %{"name" => "车道镇", "code" => "621022109"},
      %{"name" => "天池乡", "code" => "621022200"},
      %{"name" => "演武乡", "code" => "621022201"},
      %{"name" => "八珠乡", "code" => "621022204"},
      %{"name" => "耿湾乡", "code" => "621022206"},
      %{"name" => "秦团庄乡", "code" => "621022207"},
      %{"name" => "山城乡", "code" => "621022208"},
      %{"name" => "南湫乡", "code" => "621022209"},
      %{"name" => "罗山川乡", "code" => "621022210"},
      %{"name" => "小南沟乡", "code" => "621022212"},
      %{"name" => "芦家湾乡", "code" => "621022215"}
    ]

  def next(input) when input == "华池县" or input == "621023",
    do: [
      %{"name" => "悦乐镇", "code" => "621023100"},
      %{"name" => "柔远镇", "code" => "621023101"},
      %{"name" => "元城镇", "code" => "621023102"},
      %{"name" => "南梁镇", "code" => "621023103"},
      %{"name" => "城壕镇", "code" => "621023104"},
      %{"name" => "五蛟镇", "code" => "621023105"},
      %{"name" => "上里塬乡", "code" => "621023202"},
      %{"name" => "王咀子乡", "code" => "621023203"},
      %{"name" => "白马乡", "code" => "621023204"},
      %{"name" => "怀安乡", "code" => "621023205"},
      %{"name" => "乔川乡", "code" => "621023206"},
      %{"name" => "乔河乡", "code" => "621023207"},
      %{"name" => "山庄乡", "code" => "621023208"},
      %{"name" => "林镇乡", "code" => "621023210"},
      %{"name" => "紫坊畔乡", "code" => "621023211"}
    ]

  def next(input) when input == "合水县" or input == "621024",
    do: [
      %{"name" => "西华池镇", "code" => "621024100"},
      %{"name" => "老城镇", "code" => "621024101"},
      %{"name" => "太白镇", "code" => "621024102"},
      %{"name" => "板桥镇", "code" => "621024103"},
      %{"name" => "何家畔镇", "code" => "621024104"},
      %{"name" => "吉岘镇", "code" => "621024105"},
      %{"name" => "肖咀镇", "code" => "621024106"},
      %{"name" => "固城镇", "code" => "621024107"},
      %{"name" => "段家集乡", "code" => "621024202"},
      %{"name" => "太莪乡", "code" => "621024204"},
      %{"name" => "店子乡", "code" => "621024205"},
      %{"name" => "蒿咀铺乡", "code" => "621024208"}
    ]

  def next(input) when input == "正宁县" or input == "621025",
    do: [
      %{"name" => "山河镇", "code" => "621025100"},
      %{"name" => "榆林子镇", "code" => "621025101"},
      %{"name" => "宫河镇", "code" => "621025102"},
      %{"name" => "永和镇", "code" => "621025103"},
      %{"name" => "永正镇", "code" => "621025104"},
      %{"name" => "周家镇", "code" => "621025105"},
      %{"name" => "湫头镇", "code" => "621025106"},
      %{"name" => "西坡镇", "code" => "621025107"},
      %{"name" => "五顷塬回族乡", "code" => "621025204"},
      %{"name" => "三嘉乡", "code" => "621025205"}
    ]

  def next(input) when input == "宁县" or input == "621026",
    do: [
      %{"name" => "新宁镇", "code" => "621026100"},
      %{"name" => "平子镇", "code" => "621026101"},
      %{"name" => "早胜镇", "code" => "621026102"},
      %{"name" => "长庆桥镇", "code" => "621026103"},
      %{"name" => "和盛镇", "code" => "621026104"},
      %{"name" => "湘乐镇", "code" => "621026105"},
      %{"name" => "新庄镇", "code" => "621026106"},
      %{"name" => "盘克镇", "code" => "621026107"},
      %{"name" => "中村镇", "code" => "621026108"},
      %{"name" => "焦村镇", "code" => "621026109"},
      %{"name" => "米桥镇", "code" => "621026110"},
      %{"name" => "良平镇", "code" => "621026111"},
      %{"name" => "太昌镇", "code" => "621026112"},
      %{"name" => "春荣镇", "code" => "621026113"},
      %{"name" => "南义乡", "code" => "621026205"},
      %{"name" => "瓦斜乡", "code" => "621026206"},
      %{"name" => "金村乡", "code" => "621026207"},
      %{"name" => "九岘乡", "code" => "621026208"}
    ]

  def next(input) when input == "镇原县" or input == "621027",
    do: [
      %{"name" => "城关镇", "code" => "621027100"},
      %{"name" => "屯字镇", "code" => "621027101"},
      %{"name" => "孟坝镇", "code" => "621027102"},
      %{"name" => "三岔镇", "code" => "621027103"},
      %{"name" => "平泉镇", "code" => "621027104"},
      %{"name" => "开边镇", "code" => "621027105"},
      %{"name" => "太平镇", "code" => "621027106"},
      %{"name" => "临泾镇", "code" => "621027107"},
      %{"name" => "新城镇", "code" => "621027108"},
      %{"name" => "上肖镇", "code" => "621027109"},
      %{"name" => "新集镇", "code" => "621027110"},
      %{"name" => "马渠镇", "code" => "621027111"},
      %{"name" => "庙渠镇", "code" => "621027112"},
      %{"name" => "南川乡", "code" => "621027201"},
      %{"name" => "方山乡", "code" => "621027204"},
      %{"name" => "殷家城乡", "code" => "621027205"},
      %{"name" => "武沟乡", "code" => "621027208"},
      %{"name" => "郭原乡", "code" => "621027209"},
      %{"name" => "中原乡", "code" => "621027210"}
    ]

  def next(input) when input == "肃州区" or input == "620902",
    do: [
      %{"name" => "东北街街道", "code" => "620902001"},
      %{"name" => "东南街街道", "code" => "620902002"},
      %{"name" => "工业园街道", "code" => "620902003"},
      %{"name" => "新城街道", "code" => "620902004"},
      %{"name" => "西北街街道", "code" => "620902005"},
      %{"name" => "西南街街道", "code" => "620902006"},
      %{"name" => "玉门油田生活基地街道", "code" => "620902007"},
      %{"name" => "西洞镇", "code" => "620902100"},
      %{"name" => "清水镇", "code" => "620902101"},
      %{"name" => "总寨镇", "code" => "620902102"},
      %{"name" => "金佛寺镇", "code" => "620902103"},
      %{"name" => "上坝镇", "code" => "620902104"},
      %{"name" => "三墩镇", "code" => "620902105"},
      %{"name" => "银达镇", "code" => "620902106"},
      %{"name" => "西峰镇", "code" => "620902107"},
      %{"name" => "泉湖镇", "code" => "620902108"},
      %{"name" => "果园镇", "code" => "620902109"},
      %{"name" => "下河清镇", "code" => "620902110"},
      %{"name" => "铧尖镇", "code" => "620902111"},
      %{"name" => "东洞镇", "code" => "620902112"},
      %{"name" => "丰乐镇", "code" => "620902113"},
      %{"name" => "黄泥堡乡", "code" => "620902207"},
      %{"name" => "酒泉经济技术开发区", "code" => "620902403"},
      %{"name" => "十号基地", "code" => "620902404"}
    ]

  def next(input) when input == "金塔县" or input == "620921",
    do: [
      %{"name" => "中东镇", "code" => "620921100"},
      %{"name" => "鼎新镇", "code" => "620921101"},
      %{"name" => "金塔镇", "code" => "620921102"},
      %{"name" => "东坝镇", "code" => "620921103"},
      %{"name" => "航天镇", "code" => "620921105"},
      %{"name" => "大庄子镇", "code" => "620921106"},
      %{"name" => "西坝镇", "code" => "620921107"},
      %{"name" => "古城乡", "code" => "620921204"},
      %{"name" => "羊井子湾乡", "code" => "620921209"},
      %{"name" => "工业集中区", "code" => "620921401"}
    ]

  def next(input) when input == "瓜州县" or input == "620922",
    do: [
      %{"name" => "渊泉镇", "code" => "620922100"},
      %{"name" => "柳园镇", "code" => "620922101"},
      %{"name" => "三道沟镇", "code" => "620922102"},
      %{"name" => "南岔镇", "code" => "620922103"},
      %{"name" => "锁阳城镇", "code" => "620922104"},
      %{"name" => "瓜州镇", "code" => "620922105"},
      %{"name" => "西湖镇", "code" => "620922106"},
      %{"name" => "河东镇", "code" => "620922107"},
      %{"name" => "双塔镇", "code" => "620922108"},
      %{"name" => "腰站子东乡族镇", "code" => "620922109"},
      %{"name" => "布隆吉乡", "code" => "620922201"},
      %{"name" => "七墩回族东乡族乡", "code" => "620922212"},
      %{"name" => "广至藏族乡", "code" => "620922214"},
      %{"name" => "沙河回族乡", "code" => "620922215"},
      %{"name" => "梁湖乡", "code" => "620922216"}
    ]

  def next(input) when input == "肃北蒙古族自治县" or input == "620923",
    do: [
      %{"name" => "党城湾镇", "code" => "620923100"},
      %{"name" => "马鬃山镇", "code" => "620923101"},
      %{"name" => "盐池湾乡", "code" => "620923201"},
      %{"name" => "石包城乡", "code" => "620923202"}
    ]

  def next(input) when input == "阿克塞哈萨克族自治县" or input == "620924",
    do: [
      %{"name" => "红柳湾镇", "code" => "620924100"},
      %{"name" => "阿克旗乡", "code" => "620924200"},
      %{"name" => "阿勒腾乡", "code" => "620924203"},
      %{"name" => "阿伊纳乡", "code" => "620924204"},
      %{"name" => "阿克塞县工业园区", "code" => "620924400"}
    ]

  def next(input) when input == "玉门市" or input == "620981",
    do: [
      %{"name" => "新市区街道", "code" => "620981002"},
      %{"name" => "玉门镇", "code" => "620981101"},
      %{"name" => "赤金镇", "code" => "620981102"},
      %{"name" => "花海镇", "code" => "620981103"},
      %{"name" => "老君庙镇", "code" => "620981104"},
      %{"name" => "黄闸湾镇", "code" => "620981105"},
      %{"name" => "下西号镇", "code" => "620981106"},
      %{"name" => "柳河镇", "code" => "620981107"},
      %{"name" => "昌马镇", "code" => "620981108"},
      %{"name" => "柳湖镇", "code" => "620981109"},
      %{"name" => "六墩镇", "code" => "620981110"},
      %{"name" => "小金湾东乡族乡", "code" => "620981206"},
      %{"name" => "独山子东乡族乡", "code" => "620981208"},
      %{"name" => "国营饮马农场", "code" => "620981400"},
      %{"name" => "国营黄花农场", "code" => "620981401"},
      %{"name" => "甘肃矿区", "code" => "620981404"}
    ]

  def next(input) when input == "敦煌市" or input == "620982",
    do: [
      %{"name" => "七里镇", "code" => "620982100"},
      %{"name" => "沙州镇", "code" => "620982101"},
      %{"name" => "肃州镇", "code" => "620982102"},
      %{"name" => "莫高镇", "code" => "620982103"},
      %{"name" => "转渠口镇", "code" => "620982104"},
      %{"name" => "阳关镇", "code" => "620982105"},
      %{"name" => "月牙泉镇", "code" => "620982106"},
      %{"name" => "郭家堡镇", "code" => "620982107"},
      %{"name" => "黄渠镇", "code" => "620982108"},
      %{"name" => "青海石油管理局生活基地", "code" => "620982401"}
    ]

  def next(input) when input == "崆峒区" or input == "620802",
    do: [
      %{"name" => "东关街道", "code" => "620802001"},
      %{"name" => "中街街道", "code" => "620802002"},
      %{"name" => "西郊街道", "code" => "620802003"},
      %{"name" => "崆峒镇", "code" => "620802101"},
      %{"name" => "白水镇", "code" => "620802102"},
      %{"name" => "草峰镇", "code" => "620802103"},
      %{"name" => "安国镇", "code" => "620802104"},
      %{"name" => "柳湖镇", "code" => "620802105"},
      %{"name" => "四十里铺镇", "code" => "620802106"},
      %{"name" => "花所镇", "code" => "620802107"},
      %{"name" => "索罗乡", "code" => "620802203"},
      %{"name" => "香莲乡", "code" => "620802204"},
      %{"name" => "西阳乡", "code" => "620802205"},
      %{"name" => "大秦乡", "code" => "620802206"},
      %{"name" => "白庙乡", "code" => "620802207"},
      %{"name" => "寨河乡", "code" => "620802208"},
      %{"name" => "大寨乡", "code" => "620802209"},
      %{"name" => "上杨乡", "code" => "620802210"},
      %{"name" => "麻武乡", "code" => "620802211"},
      %{"name" => "峡门乡", "code" => "620802212"},
      %{"name" => "平凉崆峒山大景区管理委员会", "code" => "620802498"}
    ]

  def next(input) when input == "泾川县" or input == "620821",
    do: [
      %{"name" => "城市社区街道", "code" => "620821001"},
      %{"name" => "城关镇", "code" => "620821100"},
      %{"name" => "玉都镇", "code" => "620821101"},
      %{"name" => "高平镇", "code" => "620821102"},
      %{"name" => "荔堡镇", "code" => "620821103"},
      %{"name" => "王村镇", "code" => "620821104"},
      %{"name" => "窑店镇", "code" => "620821105"},
      %{"name" => "飞云镇", "code" => "620821106"},
      %{"name" => "丰台镇", "code" => "620821107"},
      %{"name" => "党原镇", "code" => "620821108"},
      %{"name" => "汭丰镇", "code" => "620821109"},
      %{"name" => "太平镇", "code" => "620821110"},
      %{"name" => "罗汉洞乡", "code" => "620821201"},
      %{"name" => "泾明乡", "code" => "620821202"},
      %{"name" => "红河乡", "code" => "620821203"}
    ]

  def next(input) when input == "灵台县" or input == "620822",
    do: [
      %{"name" => "城市社区管理委员会地区", "code" => "620822001"},
      %{"name" => "中台镇", "code" => "620822100"},
      %{"name" => "邵寨镇", "code" => "620822101"},
      %{"name" => "独店镇", "code" => "620822102"},
      %{"name" => "什字镇", "code" => "620822103"},
      %{"name" => "朝那镇", "code" => "620822104"},
      %{"name" => "西屯镇", "code" => "620822105"},
      %{"name" => "上良镇", "code" => "620822106"},
      %{"name" => "百里镇", "code" => "620822107"},
      %{"name" => "蒲窝镇", "code" => "620822108"},
      %{"name" => "新开乡", "code" => "620822201"},
      %{"name" => "梁原乡", "code" => "620822204"},
      %{"name" => "龙门乡", "code" => "620822205"},
      %{"name" => "星火乡", "code" => "620822206"},
      %{"name" => "万宝川农场", "code" => "620822400"}
    ]

  def next(input) when input == "崇信县" or input == "620823",
    do: [
      %{"name" => "城市社区管理委员会街道", "code" => "620823001"},
      %{"name" => "锦屏镇", "code" => "620823100"},
      %{"name" => "新窑镇", "code" => "620823101"},
      %{"name" => "柏树镇", "code" => "620823102"},
      %{"name" => "黄寨镇", "code" => "620823103"},
      %{"name" => "黄花乡", "code" => "620823202"},
      %{"name" => "木林乡", "code" => "620823203"}
    ]

  def next(input) when input == "庄浪县" or input == "620825",
    do: [
      %{"name" => "水洛街道", "code" => "620825001"},
      %{"name" => "水洛镇", "code" => "620825100"},
      %{"name" => "南湖镇", "code" => "620825101"},
      %{"name" => "朱店镇", "code" => "620825102"},
      %{"name" => "万泉镇", "code" => "620825103"},
      %{"name" => "韩店镇", "code" => "620825104"},
      %{"name" => "卧龙镇", "code" => "620825105"},
      %{"name" => "阳川镇", "code" => "620825106"},
      %{"name" => "盘安镇", "code" => "620825107"},
      %{"name" => "大庄镇", "code" => "620825108"},
      %{"name" => "通化镇", "code" => "620825109"},
      %{"name" => "永宁镇", "code" => "620825110"},
      %{"name" => "良邑镇", "code" => "620825111"},
      %{"name" => "岳堡镇", "code" => "620825112"},
      %{"name" => "柳梁镇", "code" => "620825113"},
      %{"name" => "南坪镇", "code" => "620825114"},
      %{"name" => "杨河乡", "code" => "620825201"},
      %{"name" => "赵墩乡", "code" => "620825202"},
      %{"name" => "郑河乡", "code" => "620825215"}
    ]

  def next(input) when input == "静宁县" or input == "620826",
    do: [
      %{"name" => "城区街道", "code" => "620826001"},
      %{"name" => "城关镇", "code" => "620826100"},
      %{"name" => "威戎镇", "code" => "620826101"},
      %{"name" => "界石铺镇", "code" => "620826102"},
      %{"name" => "八里镇", "code" => "620826103"},
      %{"name" => "李店镇", "code" => "620826104"},
      %{"name" => "古城镇", "code" => "620826105"},
      %{"name" => "仁大镇", "code" => "620826106"},
      %{"name" => "甘沟镇", "code" => "620826107"},
      %{"name" => "城川镇", "code" => "620826108"},
      %{"name" => "曹务镇", "code" => "620826109"},
      %{"name" => "雷大镇", "code" => "620826110"},
      %{"name" => "四河镇", "code" => "620826111"},
      %{"name" => "细巷镇", "code" => "620826112"},
      %{"name" => "双岘镇", "code" => "620826113"},
      %{"name" => "治平镇", "code" => "620826114"},
      %{"name" => "红寺镇", "code" => "620826115"},
      %{"name" => "原安镇", "code" => "620826116"},
      %{"name" => "司桥乡", "code" => "620826201"},
      %{"name" => "余湾乡", "code" => "620826206"},
      %{"name" => "贾河乡", "code" => "620826208"},
      %{"name" => "深沟乡", "code" => "620826209"},
      %{"name" => "新店乡", "code" => "620826211"},
      %{"name" => "三合乡", "code" => "620826216"},
      %{"name" => "灵芝乡", "code" => "620826218"}
    ]

  def next(input) when input == "华亭市" or input == "620881",
    do: [
      %{"name" => "东华街道", "code" => "620881001"},
      %{"name" => "东华镇", "code" => "620881100"},
      %{"name" => "安口镇", "code" => "620881101"},
      %{"name" => "西华镇", "code" => "620881102"},
      %{"name" => "马峡镇", "code" => "620881103"},
      %{"name" => "策底镇", "code" => "620881104"},
      %{"name" => "上关镇", "code" => "620881105"},
      %{"name" => "河西镇", "code" => "620881106"},
      %{"name" => "神峪乡", "code" => "620881201"},
      %{"name" => "山寨乡", "code" => "620881202"},
      %{"name" => "砚峡乡", "code" => "620881204"}
    ]

  def next(input) when input == "甘州区" or input == "620702",
    do: [
      %{"name" => "东街街道", "code" => "620702001"},
      %{"name" => "南街街道", "code" => "620702002"},
      %{"name" => "西街街道", "code" => "620702003"},
      %{"name" => "北街街道", "code" => "620702004"},
      %{"name" => "火车站街道", "code" => "620702005"},
      %{"name" => "梁家墩镇", "code" => "620702100"},
      %{"name" => "上秦镇", "code" => "620702101"},
      %{"name" => "大满镇", "code" => "620702102"},
      %{"name" => "沙井镇", "code" => "620702103"},
      %{"name" => "乌江镇", "code" => "620702104"},
      %{"name" => "甘浚镇", "code" => "620702105"},
      %{"name" => "新墩镇", "code" => "620702106"},
      %{"name" => "党寨镇", "code" => "620702107"},
      %{"name" => "碱滩镇", "code" => "620702108"},
      %{"name" => "三闸镇", "code" => "620702109"},
      %{"name" => "小满镇", "code" => "620702110"},
      %{"name" => "明永镇", "code" => "620702111"},
      %{"name" => "长安镇", "code" => "620702112"},
      %{"name" => "龙渠乡", "code" => "620702202"},
      %{"name" => "安阳乡", "code" => "620702203"},
      %{"name" => "花寨乡", "code" => "620702204"},
      %{"name" => "靖安乡", "code" => "620702207"},
      %{"name" => "平山湖蒙古族乡", "code" => "620702211"},
      %{"name" => "张掖经济技术开发区", "code" => "620702402"}
    ]

  def next(input) when input == "肃南裕固族自治县" or input == "620721",
    do: [
      %{"name" => "红湾寺镇", "code" => "620721100"},
      %{"name" => "皇城镇", "code" => "620721101"},
      %{"name" => "康乐镇", "code" => "620721102"},
      %{"name" => "马蹄藏族乡", "code" => "620721200"},
      %{"name" => "白银蒙古族乡", "code" => "620721202"},
      %{"name" => "大河乡", "code" => "620721203"},
      %{"name" => "明花乡", "code" => "620721204"},
      %{"name" => "祁丰蔵族乡", "code" => "620721205"},
      %{"name" => "甘肃省绵羊育种场", "code" => "620721500"},
      %{"name" => "张掖宝瓶河牧场", "code" => "620721501"}
    ]

  def next(input) when input == "民乐县" or input == "620722",
    do: [
      %{"name" => "洪水镇", "code" => "620722101"},
      %{"name" => "六坝镇", "code" => "620722102"},
      %{"name" => "新天镇", "code" => "620722103"},
      %{"name" => "南古镇", "code" => "620722104"},
      %{"name" => "永固镇", "code" => "620722105"},
      %{"name" => "三堡镇", "code" => "620722106"},
      %{"name" => "南丰镇", "code" => "620722107"},
      %{"name" => "民联镇", "code" => "620722108"},
      %{"name" => "顺化镇", "code" => "620722109"},
      %{"name" => "丰乐镇", "code" => "620722110"},
      %{"name" => "民乐生态工业园区", "code" => "620722400"}
    ]

  def next(input) when input == "临泽县" or input == "620723",
    do: [
      %{"name" => "沙河镇", "code" => "620723101"},
      %{"name" => "新华镇", "code" => "620723102"},
      %{"name" => "蓼泉镇", "code" => "620723103"},
      %{"name" => "平川镇", "code" => "620723104"},
      %{"name" => "板桥镇", "code" => "620723105"},
      %{"name" => "鸭暖镇", "code" => "620723106"},
      %{"name" => "倪家营镇", "code" => "620723107"},
      %{"name" => "国营临泽农场", "code" => "620723500"},
      %{"name" => "五泉林场", "code" => "620723501"},
      %{"name" => "沙河林场", "code" => "620723502"},
      %{"name" => "小泉子治沙站", "code" => "620723503"},
      %{"name" => "园艺场", "code" => "620723504"},
      %{"name" => "良种繁殖场", "code" => "620723505"}
    ]

  def next(input) when input == "高台县" or input == "620724",
    do: [
      %{"name" => "城关镇", "code" => "620724100"},
      %{"name" => "宣化镇", "code" => "620724101"},
      %{"name" => "南华镇", "code" => "620724102"},
      %{"name" => "巷道镇", "code" => "620724103"},
      %{"name" => "合黎镇", "code" => "620724104"},
      %{"name" => "骆驼城镇", "code" => "620724105"},
      %{"name" => "新坝镇", "code" => "620724106"},
      %{"name" => "黑泉镇", "code" => "620724107"},
      %{"name" => "罗城镇", "code" => "620724108"},
      %{"name" => "甘肃高台工业园区", "code" => "620724400"}
    ]

  def next(input) when input == "山丹县" or input == "620725",
    do: [
      %{"name" => "清泉镇", "code" => "620725101"},
      %{"name" => "位奇镇", "code" => "620725102"},
      %{"name" => "霍城镇", "code" => "620725103"},
      %{"name" => "陈户镇", "code" => "620725104"},
      %{"name" => "大马营镇", "code" => "620725105"},
      %{"name" => "东乐镇", "code" => "620725106"},
      %{"name" => "老军乡", "code" => "620725203"},
      %{"name" => "李桥乡", "code" => "620725204"},
      %{"name" => "国营山丹农场", "code" => "620725400"},
      %{"name" => "中牧公司山丹马场", "code" => "620725402"}
    ]

  def next(input) when input == "凉州区" or input == "620602",
    do: [
      %{"name" => "东大街街道", "code" => "620602001"},
      %{"name" => "西大街街道", "code" => "620602002"},
      %{"name" => "东关街街道", "code" => "620602003"},
      %{"name" => "西关街街道", "code" => "620602004"},
      %{"name" => "火车站街街道", "code" => "620602005"},
      %{"name" => "地质新村街街道", "code" => "620602006"},
      %{"name" => "荣华街街道", "code" => "620602007"},
      %{"name" => "宣武街街道", "code" => "620602008"},
      %{"name" => "黄羊河街道", "code" => "620602009"},
      %{"name" => "黄羊镇", "code" => "620602100"},
      %{"name" => "武南镇", "code" => "620602101"},
      %{"name" => "清源镇", "code" => "620602102"},
      %{"name" => "永昌镇", "code" => "620602103"},
      %{"name" => "双城镇", "code" => "620602104"},
      %{"name" => "丰乐镇", "code" => "620602105"},
      %{"name" => "高坝镇", "code" => "620602106"},
      %{"name" => "金羊镇", "code" => "620602107"},
      %{"name" => "和平镇", "code" => "620602108"},
      %{"name" => "羊下坝镇", "code" => "620602109"},
      %{"name" => "中坝镇", "code" => "620602110"},
      %{"name" => "永丰镇", "code" => "620602111"},
      %{"name" => "古城镇", "code" => "620602112"},
      %{"name" => "张义镇", "code" => "620602113"},
      %{"name" => "发放镇", "code" => "620602114"},
      %{"name" => "西营镇", "code" => "620602115"},
      %{"name" => "四坝镇", "code" => "620602116"},
      %{"name" => "洪祥镇", "code" => "620602117"},
      %{"name" => "谢河镇", "code" => "620602118"},
      %{"name" => "金沙镇", "code" => "620602119"},
      %{"name" => "松树镇", "code" => "620602120"},
      %{"name" => "怀安镇", "code" => "620602121"},
      %{"name" => "下双镇", "code" => "620602122"},
      %{"name" => "清水镇", "code" => "620602123"},
      %{"name" => "河东镇", "code" => "620602124"},
      %{"name" => "五和镇", "code" => "620602125"},
      %{"name" => "长城镇", "code" => "620602126"},
      %{"name" => "吴家井镇", "code" => "620602127"},
      %{"name" => "金河镇", "code" => "620602128"},
      %{"name" => "韩佐镇", "code" => "620602129"},
      %{"name" => "大柳镇", "code" => "620602130"},
      %{"name" => "柏树镇", "code" => "620602131"},
      %{"name" => "金塔镇", "code" => "620602132"},
      %{"name" => "九墩镇", "code" => "620602133"},
      %{"name" => "金山镇", "code" => "620602134"},
      %{"name" => "新华镇", "code" => "620602135"},
      %{"name" => "康宁镇", "code" => "620602136"},
      %{"name" => "九墩滩生态建设指挥部", "code" => "620602400"},
      %{"name" => "邓马营湖生态建设指挥部", "code" => "620602401"},
      %{"name" => "凉州工业园区", "code" => "620602402"},
      %{"name" => "武威工业园区", "code" => "620602403"}
    ]

  def next(input) when input == "民勤县" or input == "620621",
    do: [
      %{"name" => "三雷镇", "code" => "620621100"},
      %{"name" => "东坝镇", "code" => "620621101"},
      %{"name" => "泉山镇", "code" => "620621102"},
      %{"name" => "西渠镇", "code" => "620621103"},
      %{"name" => "东湖镇", "code" => "620621104"},
      %{"name" => "红砂岗镇", "code" => "620621105"},
      %{"name" => "昌宁镇", "code" => "620621106"},
      %{"name" => "重兴镇", "code" => "620621107"},
      %{"name" => "薛百镇", "code" => "620621108"},
      %{"name" => "大坝镇", "code" => "620621109"},
      %{"name" => "苏武镇", "code" => "620621110"},
      %{"name" => "大滩镇", "code" => "620621111"},
      %{"name" => "双茨科镇", "code" => "620621112"},
      %{"name" => "红沙梁镇", "code" => "620621113"},
      %{"name" => "蔡旗镇", "code" => "620621114"},
      %{"name" => "夹河镇", "code" => "620621115"},
      %{"name" => "收成镇", "code" => "620621116"},
      %{"name" => "南湖镇", "code" => "620621117"}
    ]

  def next(input) when input == "古浪县" or input == "620622",
    do: [
      %{"name" => "古浪镇", "code" => "620622100"},
      %{"name" => "泗水镇", "code" => "620622101"},
      %{"name" => "土门镇", "code" => "620622102"},
      %{"name" => "大靖镇", "code" => "620622103"},
      %{"name" => "裴家营镇", "code" => "620622104"},
      %{"name" => "海子滩镇", "code" => "620622105"},
      %{"name" => "定宁镇", "code" => "620622106"},
      %{"name" => "黄羊川镇", "code" => "620622107"},
      %{"name" => "黑松驿镇", "code" => "620622108"},
      %{"name" => "永丰滩镇", "code" => "620622109"},
      %{"name" => "黄花滩镇", "code" => "620622110"},
      %{"name" => "西靖镇", "code" => "620622111"},
      %{"name" => "民权镇", "code" => "620622112"},
      %{"name" => "直滩镇", "code" => "620622113"},
      %{"name" => "古丰镇", "code" => "620622114"},
      %{"name" => "新堡乡", "code" => "620622205"},
      %{"name" => "干城乡", "code" => "620622206"},
      %{"name" => "横梁乡", "code" => "620622207"},
      %{"name" => "十八里堡乡", "code" => "620622208"}
    ]

  def next(input) when input == "天祝藏族自治县" or input == "620623",
    do: [
      %{"name" => "华藏寺镇", "code" => "620623100"},
      %{"name" => "打柴沟镇", "code" => "620623101"},
      %{"name" => "安远镇", "code" => "620623102"},
      %{"name" => "炭山岭镇", "code" => "620623103"},
      %{"name" => "哈溪镇", "code" => "620623104"},
      %{"name" => "赛什斯镇", "code" => "620623105"},
      %{"name" => "石门镇", "code" => "620623106"},
      %{"name" => "松山镇", "code" => "620623107"},
      %{"name" => "天堂镇", "code" => "620623108"},
      %{"name" => "朵什镇", "code" => "620623109"},
      %{"name" => "西大滩镇", "code" => "620623110"},
      %{"name" => "抓喜秀龙镇", "code" => "620623111"},
      %{"name" => "大红沟镇", "code" => "620623112"},
      %{"name" => "祁连镇", "code" => "620623113"},
      %{"name" => "东坪乡", "code" => "620623201"},
      %{"name" => "赛拉隆乡", "code" => "620623202"},
      %{"name" => "东大滩乡", "code" => "620623203"},
      %{"name" => "毛藏乡", "code" => "620623208"},
      %{"name" => "旦马乡", "code" => "620623210"},
      %{"name" => "天祝建材厂", "code" => "620623401"},
      %{"name" => "天祝煤电公司", "code" => "620623402"}
    ]

  def next(input) when input == "秦州区" or input == "620502",
    do: [
      %{"name" => "大城街道", "code" => "620502001"},
      %{"name" => "七里墩街道", "code" => "620502002"},
      %{"name" => "东关街道", "code" => "620502003"},
      %{"name" => "中城街道", "code" => "620502004"},
      %{"name" => "西关街道", "code" => "620502005"},
      %{"name" => "石马坪街道", "code" => "620502006"},
      %{"name" => "天水郡街道", "code" => "620502007"},
      %{"name" => "玉泉镇", "code" => "620502100"},
      %{"name" => "太京镇", "code" => "620502101"},
      %{"name" => "藉口镇", "code" => "620502102"},
      %{"name" => "皂郊镇", "code" => "620502103"},
      %{"name" => "汪川镇", "code" => "620502104"},
      %{"name" => "牡丹镇", "code" => "620502105"},
      %{"name" => "关子镇", "code" => "620502106"},
      %{"name" => "平南镇", "code" => "620502107"},
      %{"name" => "天水镇", "code" => "620502108"},
      %{"name" => "娘娘坝镇", "code" => "620502109"},
      %{"name" => "中梁镇", "code" => "620502110"},
      %{"name" => "杨家寺镇", "code" => "620502111"},
      %{"name" => "齐寿镇", "code" => "620502112"},
      %{"name" => "大门镇", "code" => "620502113"},
      %{"name" => "秦岭镇", "code" => "620502114"},
      %{"name" => "华歧镇", "code" => "620502115"}
    ]

  def next(input) when input == "麦积区" or input == "620503",
    do: [
      %{"name" => "道北街道", "code" => "620503001"},
      %{"name" => "北道埠街道", "code" => "620503002"},
      %{"name" => "桥南街道", "code" => "620503003"},
      %{"name" => "社棠镇", "code" => "620503100"},
      %{"name" => "马跑泉镇", "code" => "620503101"},
      %{"name" => "甘泉镇", "code" => "620503102"},
      %{"name" => "渭南镇", "code" => "620503103"},
      %{"name" => "东岔镇", "code" => "620503104"},
      %{"name" => "花牛镇", "code" => "620503105"},
      %{"name" => "中滩镇", "code" => "620503106"},
      %{"name" => "新阳镇", "code" => "620503107"},
      %{"name" => "元龙镇", "code" => "620503108"},
      %{"name" => "伯阳镇", "code" => "620503109"},
      %{"name" => "麦积镇", "code" => "620503110"},
      %{"name" => "石佛镇", "code" => "620503111"},
      %{"name" => "三岔镇", "code" => "620503112"},
      %{"name" => "琥珀镇", "code" => "620503113"},
      %{"name" => "利桥镇", "code" => "620503114"},
      %{"name" => "五龙镇", "code" => "620503115"},
      %{"name" => "党川镇", "code" => "620503116"},
      %{"name" => "天水经济开发区", "code" => "620503400"},
      %{"name" => "天水市高新技术工业园", "code" => "620503401"},
      %{"name" => "天水市农业高新技术示范区", "code" => "620503402"},
      %{"name" => "天水市麦积区三阳工业示范区", "code" => "620503403"},
      %{"name" => "天水市麦积区廿铺工业示范区", "code" => "620503404"},
      %{"name" => "天水市麦积区东柯河工业园区", "code" => "620503405"}
    ]

  def next(input) when input == "清水县" or input == "620521",
    do: [
      %{"name" => "永清镇", "code" => "620521100"},
      %{"name" => "红堡镇", "code" => "620521101"},
      %{"name" => "白驼镇", "code" => "620521102"},
      %{"name" => "金集镇", "code" => "620521103"},
      %{"name" => "秦亭镇", "code" => "620521104"},
      %{"name" => "山门镇", "code" => "620521105"},
      %{"name" => "白沙镇", "code" => "620521106"},
      %{"name" => "王河镇", "code" => "620521107"},
      %{"name" => "郭川镇", "code" => "620521108"},
      %{"name" => "黄门镇", "code" => "620521109"},
      %{"name" => "松树镇", "code" => "620521110"},
      %{"name" => "远门镇", "code" => "620521111"},
      %{"name" => "土门镇", "code" => "620521112"},
      %{"name" => "草川铺镇", "code" => "620521113"},
      %{"name" => "陇东镇", "code" => "620521114"},
      %{"name" => "贾川乡", "code" => "620521206"},
      %{"name" => "丰望乡", "code" => "620521207"},
      %{"name" => "新城乡", "code" => "620521211"},
      %{"name" => "清水县科技养殖示范园区", "code" => "620521400"}
    ]

  def next(input) when input == "秦安县" or input == "620522",
    do: [
      %{"name" => "兴国镇", "code" => "620522100"},
      %{"name" => "莲花镇", "code" => "620522101"},
      %{"name" => "西川镇", "code" => "620522102"},
      %{"name" => "陇城镇", "code" => "620522103"},
      %{"name" => "郭嘉镇", "code" => "620522104"},
      %{"name" => "五营镇", "code" => "620522105"},
      %{"name" => "叶堡镇", "code" => "620522106"},
      %{"name" => "魏店镇", "code" => "620522107"},
      %{"name" => "安伏镇", "code" => "620522108"},
      %{"name" => "千户镇", "code" => "620522109"},
      %{"name" => "王尹镇", "code" => "620522110"},
      %{"name" => "兴丰镇", "code" => "620522111"},
      %{"name" => "中山镇", "code" => "620522112"},
      %{"name" => "刘坪镇", "code" => "620522113"},
      %{"name" => "王铺镇", "code" => "620522114"},
      %{"name" => "王窑镇", "code" => "620522115"},
      %{"name" => "云山镇", "code" => "620522116"}
    ]

  def next(input) when input == "甘谷县" or input == "620523",
    do: [
      %{"name" => "大像山镇", "code" => "620523100"},
      %{"name" => "新兴镇", "code" => "620523101"},
      %{"name" => "磐安镇", "code" => "620523102"},
      %{"name" => "六峰镇", "code" => "620523103"},
      %{"name" => "安远镇", "code" => "620523104"},
      %{"name" => "金山镇", "code" => "620523105"},
      %{"name" => "大石镇", "code" => "620523106"},
      %{"name" => "礼辛镇", "code" => "620523107"},
      %{"name" => "武家河镇", "code" => "620523108"},
      %{"name" => "大庄镇", "code" => "620523109"},
      %{"name" => "古坡镇", "code" => "620523110"},
      %{"name" => "八里湾镇", "code" => "620523111"},
      %{"name" => "西坪镇", "code" => "620523112"},
      %{"name" => "谢家湾乡", "code" => "620523200"},
      %{"name" => "白家湾乡", "code" => "620523207"}
    ]

  def next(input) when input == "武山县" or input == "620524",
    do: [
      %{"name" => "城关镇", "code" => "620524100"},
      %{"name" => "洛门镇", "code" => "620524101"},
      %{"name" => "鸳鸯镇", "code" => "620524102"},
      %{"name" => "滩歌镇", "code" => "620524103"},
      %{"name" => "四门镇", "code" => "620524104"},
      %{"name" => "马力镇", "code" => "620524105"},
      %{"name" => "山丹镇", "code" => "620524106"},
      %{"name" => "温泉镇", "code" => "620524107"},
      %{"name" => "桦林镇", "code" => "620524108"},
      %{"name" => "龙台镇", "code" => "620524109"},
      %{"name" => "榆盘镇", "code" => "620524110"},
      %{"name" => "高楼镇", "code" => "620524111"},
      %{"name" => "杨河镇", "code" => "620524112"},
      %{"name" => "嘴头乡", "code" => "620524202"},
      %{"name" => "沿安乡", "code" => "620524206"}
    ]

  def next(input) when input == "张家川回族自治县" or input == "620525",
    do: [
      %{"name" => "张家川镇", "code" => "620525100"},
      %{"name" => "龙山镇", "code" => "620525101"},
      %{"name" => "恭门镇", "code" => "620525102"},
      %{"name" => "马鹿镇", "code" => "620525103"},
      %{"name" => "梁山镇", "code" => "620525104"},
      %{"name" => "马关镇", "code" => "620525105"},
      %{"name" => "刘堡镇", "code" => "620525106"},
      %{"name" => "胡川镇", "code" => "620525107"},
      %{"name" => "大阳镇", "code" => "620525108"},
      %{"name" => "川王镇", "code" => "620525109"},
      %{"name" => "张棉乡", "code" => "620525202"},
      %{"name" => "木河乡", "code" => "620525204"},
      %{"name" => "连五乡", "code" => "620525209"},
      %{"name" => "平安乡", "code" => "620525213"},
      %{"name" => "阎家乡", "code" => "620525214"}
    ]

  def next(input) when input == "白银区" or input == "620402",
    do: [
      %{"name" => "人民路街道", "code" => "620402001"},
      %{"name" => "公园路街道", "code" => "620402002"},
      %{"name" => "四龙路街道", "code" => "620402003"},
      %{"name" => "工农路街道", "code" => "620402004"},
      %{"name" => "纺织路街道", "code" => "620402005"},
      %{"name" => "水川镇", "code" => "620402100"},
      %{"name" => "四龙镇", "code" => "620402101"},
      %{"name" => "王岘镇", "code" => "620402102"},
      %{"name" => "强湾乡", "code" => "620402201"},
      %{"name" => "武川乡", "code" => "620402202"}
    ]

  def next(input) when input == "平川区" or input == "620403",
    do: [
      %{"name" => "长征街道", "code" => "620403001"},
      %{"name" => "电力路街道", "code" => "620403002"},
      %{"name" => "红会路街道", "code" => "620403003"},
      %{"name" => "兴平路街道", "code" => "620403004"},
      %{"name" => "王家山镇", "code" => "620403100"},
      %{"name" => "水泉镇", "code" => "620403101"},
      %{"name" => "共和镇", "code" => "620403102"},
      %{"name" => "宝积镇", "code" => "620403105"},
      %{"name" => "黄峤镇", "code" => "620403106"},
      %{"name" => "种田乡", "code" => "620403203"},
      %{"name" => "复兴乡", "code" => "620403204"}
    ]

  def next(input) when input == "靖远县" or input == "620421",
    do: [
      %{"name" => "北湾镇", "code" => "620421101"},
      %{"name" => "东湾镇", "code" => "620421102"},
      %{"name" => "乌兰镇", "code" => "620421103"},
      %{"name" => "刘川镇", "code" => "620421104"},
      %{"name" => "北滩镇", "code" => "620421105"},
      %{"name" => "五合镇", "code" => "620421106"},
      %{"name" => "大芦镇", "code" => "620421107"},
      %{"name" => "糜滩镇", "code" => "620421108"},
      %{"name" => "高湾镇", "code" => "620421109"},
      %{"name" => "平堡镇", "code" => "620421110"},
      %{"name" => "东升镇", "code" => "620421111"},
      %{"name" => "双龙镇", "code" => "620421112"},
      %{"name" => "三滩镇", "code" => "620421113"},
      %{"name" => "兴隆乡", "code" => "620421206"},
      %{"name" => "石门乡", "code" => "620421208"},
      %{"name" => "靖安乡", "code" => "620421211"},
      %{"name" => "永新乡", "code" => "620421215"},
      %{"name" => "若笠乡", "code" => "620421216"}
    ]

  def next(input) when input == "会宁县" or input == "620422",
    do: [
      %{"name" => "会师镇", "code" => "620422100"},
      %{"name" => "郭城驿镇", "code" => "620422101"},
      %{"name" => "河畔镇", "code" => "620422102"},
      %{"name" => "头寨子镇", "code" => "620422103"},
      %{"name" => "太平店镇", "code" => "620422104"},
      %{"name" => "甘沟驿镇", "code" => "620422105"},
      %{"name" => "侯家川镇", "code" => "620422106"},
      %{"name" => "柴家门镇", "code" => "620422107"},
      %{"name" => "汉家岔镇", "code" => "620422108"},
      %{"name" => "刘家寨子镇", "code" => "620422109"},
      %{"name" => "白草塬镇", "code" => "620422110"},
      %{"name" => "大沟镇", "code" => "620422111"},
      %{"name" => "四房吴镇", "code" => "620422112"},
      %{"name" => "中川镇", "code" => "620422113"},
      %{"name" => "老君坡镇", "code" => "620422114"},
      %{"name" => "平头川镇", "code" => "620422115"},
      %{"name" => "丁家沟镇", "code" => "620422116"},
      %{"name" => "杨崖集镇", "code" => "620422117"},
      %{"name" => "翟家所镇", "code" => "620422118"},
      %{"name" => "韩家集镇", "code" => "620422119"},
      %{"name" => "土门岘镇", "code" => "620422120"},
      %{"name" => "新塬镇", "code" => "620422121"},
      %{"name" => "草滩镇", "code" => "620422122"},
      %{"name" => "新庄镇", "code" => "620422123"},
      %{"name" => "新添堡回族乡", "code" => "620422202"},
      %{"name" => "党家岘乡", "code" => "620422204"},
      %{"name" => "八里湾乡", "code" => "620422213"},
      %{"name" => "土高山乡", "code" => "620422225"}
    ]

  def next(input) when input == "景泰县" or input == "620423",
    do: [
      %{"name" => "一条山镇", "code" => "620423100"},
      %{"name" => "芦阳镇", "code" => "620423101"},
      %{"name" => "上沙沃镇", "code" => "620423102"},
      %{"name" => "喜泉镇", "code" => "620423103"},
      %{"name" => "草窝滩镇", "code" => "620423104"},
      %{"name" => "红水镇", "code" => "620423105"},
      %{"name" => "中泉镇", "code" => "620423106"},
      %{"name" => "正路镇", "code" => "620423107"},
      %{"name" => "寺滩乡", "code" => "620423203"},
      %{"name" => "五佛乡", "code" => "620423205"},
      %{"name" => "漫水滩乡", "code" => "620423207"}
    ]

  def next(input) when input == "金川区" or input == "620302",
    do: [
      %{"name" => "滨河路街道", "code" => "620302001"},
      %{"name" => "桂林路街道", "code" => "620302002"},
      %{"name" => "北京路街道", "code" => "620302003"},
      %{"name" => "金川路街道", "code" => "620302004"},
      %{"name" => "新华路街道", "code" => "620302005"},
      %{"name" => "广州路街道", "code" => "620302006"},
      %{"name" => "宁远堡镇", "code" => "620302100"},
      %{"name" => "双湾镇", "code" => "620302101"}
    ]

  def next(input) when input == "永昌县" or input == "620321",
    do: [
      %{"name" => "城关镇", "code" => "620321100"},
      %{"name" => "河西堡镇", "code" => "620321101"},
      %{"name" => "新城子镇", "code" => "620321102"},
      %{"name" => "朱王堡镇", "code" => "620321103"},
      %{"name" => "东寨镇", "code" => "620321104"},
      %{"name" => "水源镇", "code" => "620321105"},
      %{"name" => "红山窑镇", "code" => "620321106"},
      %{"name" => "焦家庄镇", "code" => "620321107"},
      %{"name" => "六坝镇", "code" => "620321108"},
      %{"name" => "南坝乡", "code" => "620321203"}
    ]

  def next(input) when input == "嘉峪关市" or input == "620201",
    do: [
      %{"name" => "雄关街道", "code" => "620201001"},
      %{"name" => "钢城街道", "code" => "620201002"},
      %{"name" => "新城镇", "code" => "620201100"},
      %{"name" => "峪泉镇", "code" => "620201101"},
      %{"name" => "文殊镇", "code" => "620201102"}
    ]

  def next(input) when input == "城关区" or input == "620102",
    do: [
      %{"name" => "酒泉路街道", "code" => "620102001"},
      %{"name" => "张掖路街道", "code" => "620102002"},
      %{"name" => "雁南街道", "code" => "620102003"},
      %{"name" => "临夏路街道", "code" => "620102004"},
      %{"name" => "雁北街道", "code" => "620102005"},
      %{"name" => "五泉街道", "code" => "620102006"},
      %{"name" => "白银路街道", "code" => "620102007"},
      %{"name" => "皋兰路街道", "code" => "620102008"},
      %{"name" => "广武门街道", "code" => "620102009"},
      %{"name" => "伏龙坪街道", "code" => "620102010"},
      %{"name" => "靖远路街道", "code" => "620102011"},
      %{"name" => "草场街街道", "code" => "620102012"},
      %{"name" => "火车站街道", "code" => "620102013"},
      %{"name" => "拱星墩街道", "code" => "620102014"},
      %{"name" => "东岗街道", "code" => "620102015"},
      %{"name" => "团结新村街道", "code" => "620102016"},
      %{"name" => "东岗西路街道", "code" => "620102017"},
      %{"name" => "铁路东村街道", "code" => "620102018"},
      %{"name" => "铁路西村街道", "code" => "620102019"},
      %{"name" => "渭源路街道", "code" => "620102020"},
      %{"name" => "盐场路街道", "code" => "620102021"},
      %{"name" => "嘉峪关路街道", "code" => "620102022"},
      %{"name" => "焦家湾街道", "code" => "620102023"},
      %{"name" => "青白石街道", "code" => "620102024"},
      %{"name" => "雁园街道", "code" => "620102025"},
      %{"name" => "高新区", "code" => "620102400"},
      %{"name" => "甘肃农垦集团", "code" => "620102402"},
      %{"name" => "甘肃监狱企业集团公司", "code" => "620102403"}
    ]

  def next(input) when input == "七里河区" or input == "620103",
    do: [
      %{"name" => "西园街道", "code" => "620103001"},
      %{"name" => "西湖街道", "code" => "620103002"},
      %{"name" => "建兰路街道", "code" => "620103003"},
      %{"name" => "敦煌路街道", "code" => "620103004"},
      %{"name" => "西站街道", "code" => "620103005"},
      %{"name" => "晏家坪街道", "code" => "620103006"},
      %{"name" => "龚家湾街道", "code" => "620103007"},
      %{"name" => "土门墩街道", "code" => "620103008"},
      %{"name" => "秀川街道", "code" => "620103009"},
      %{"name" => "阿干镇", "code" => "620103100"},
      %{"name" => "八里镇", "code" => "620103101"},
      %{"name" => "彭家坪镇", "code" => "620103102"},
      %{"name" => "西果园镇", "code" => "620103103"},
      %{"name" => "黄峪镇", "code" => "620103104"},
      %{"name" => "魏岭乡", "code" => "620103201"}
    ]

  def next(input) when input == "西固区" or input == "620104",
    do: [
      %{"name" => "陈坪街道", "code" => "620104001"},
      %{"name" => "先锋路街道", "code" => "620104002"},
      %{"name" => "福利路街道", "code" => "620104003"},
      %{"name" => "西固城街道", "code" => "620104004"},
      %{"name" => "四季青街道", "code" => "620104005"},
      %{"name" => "临洮街街道", "code" => "620104006"},
      %{"name" => "西柳沟街道", "code" => "620104007"},
      %{"name" => "新城镇", "code" => "620104100"},
      %{"name" => "东川镇", "code" => "620104101"},
      %{"name" => "河口镇", "code" => "620104102"},
      %{"name" => "达川镇", "code" => "620104103"},
      %{"name" => "柳泉镇", "code" => "620104104"},
      %{"name" => "金沟乡", "code" => "620104204"}
    ]

  def next(input) when input == "安宁区" or input == "620105",
    do: [
      %{"name" => "培黎街道", "code" => "620105001"},
      %{"name" => "西路街道", "code" => "620105002"},
      %{"name" => "沙井驿街道", "code" => "620105003"},
      %{"name" => "十里店街道", "code" => "620105004"},
      %{"name" => "孔家崖街道", "code" => "620105005"},
      %{"name" => "银滩路街道", "code" => "620105006"},
      %{"name" => "刘家堡街道", "code" => "620105007"},
      %{"name" => "安宁堡街道", "code" => "620105008"},
      %{"name" => "忠和镇", "code" => "620105100"},
      %{"name" => "九合镇", "code" => "620105101"}
    ]

  def next(input) when input == "红古区" or input == "620111",
    do: [
      %{"name" => "窑街街道", "code" => "620111001"},
      %{"name" => "矿区街道", "code" => "620111003"},
      %{"name" => "华龙街道", "code" => "620111004"},
      %{"name" => "海石湾镇", "code" => "620111101"},
      %{"name" => "花庄镇", "code" => "620111102"},
      %{"name" => "平安镇", "code" => "620111103"},
      %{"name" => "红古镇", "code" => "620111104"}
    ]

  def next(input) when input == "永登县" or input == "620121",
    do: [
      %{"name" => "城关镇", "code" => "620121100"},
      %{"name" => "红城镇", "code" => "620121101"},
      %{"name" => "中堡镇", "code" => "620121102"},
      %{"name" => "武胜驿镇", "code" => "620121103"},
      %{"name" => "河桥镇", "code" => "620121104"},
      %{"name" => "连城镇", "code" => "620121105"},
      %{"name" => "苦水镇", "code" => "620121106"},
      %{"name" => "大同镇", "code" => "620121109"},
      %{"name" => "龙泉寺镇", "code" => "620121110"},
      %{"name" => "树屏镇", "code" => "620121111"},
      %{"name" => "柳树镇", "code" => "620121113"},
      %{"name" => "通远镇", "code" => "620121114"},
      %{"name" => "坪城乡", "code" => "620121201"},
      %{"name" => "民乐乡", "code" => "620121202"},
      %{"name" => "七山乡", "code" => "620121204"}
    ]

  def next(input) when input == "皋兰县" or input == "620122",
    do: [
      %{"name" => "石洞镇", "code" => "620122100"},
      %{"name" => "什川镇", "code" => "620122103"},
      %{"name" => "水阜镇", "code" => "620122105"},
      %{"name" => "黑石镇", "code" => "620122106"}
    ]

  def next(input) when input == "榆中县" or input == "620123",
    do: [
      %{"name" => "城关镇", "code" => "620123100"},
      %{"name" => "夏官营镇", "code" => "620123101"},
      %{"name" => "高崖镇", "code" => "620123102"},
      %{"name" => "金崖镇", "code" => "620123103"},
      %{"name" => "和平镇", "code" => "620123104"},
      %{"name" => "甘草店镇", "code" => "620123105"},
      %{"name" => "青城镇", "code" => "620123106"},
      %{"name" => "定远镇", "code" => "620123107"},
      %{"name" => "连搭镇", "code" => "620123108"},
      %{"name" => "新营镇", "code" => "620123109"},
      %{"name" => "贡井镇", "code" => "620123110"},
      %{"name" => "小康营乡", "code" => "620123202"},
      %{"name" => "马坡乡", "code" => "620123205"},
      %{"name" => "清水驿乡", "code" => "620123207"},
      %{"name" => "龙泉乡", "code" => "620123208"},
      %{"name" => "韦营乡", "code" => "620123209"},
      %{"name" => "中连川乡", "code" => "620123210"},
      %{"name" => "园子岔乡", "code" => "620123212"},
      %{"name" => "上花岔乡", "code" => "620123213"},
      %{"name" => "哈岘乡", "code" => "620123214"}
    ]

  def next(input) when input == "兰州新区" or input == "620171",
    do: [
      %{"name" => "中川镇", "code" => "620171101"},
      %{"name" => "秦川镇", "code" => "620171102"},
      %{"name" => "西岔镇", "code" => "620171103"},
      %{"name" => "上川镇", "code" => "620171104"}
    ]

  def next(_), do: nil
end