defmodule ChinaAdminDivisions.Gen.Lv3x.M63 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "格尔木市" or input == "632801",
    do: [
      %{"name" => "昆仑路街道", "code" => "632801001"},
      %{"name" => "黄河路街道", "code" => "632801002"},
      %{"name" => "金峰路街道", "code" => "632801003"},
      %{"name" => "河西街道", "code" => "632801004"},
      %{"name" => "西藏路街道", "code" => "632801005"},
      %{"name" => "郭勒木德镇", "code" => "632801100"},
      %{"name" => "唐古拉镇", "code" => "632801101"},
      %{"name" => "大格勒乡", "code" => "632801200"},
      %{"name" => "乌图美仁乡", "code" => "632801201"},
      %{"name" => "察尔汗工行委", "code" => "632801400"},
      %{"name" => "格尔木农垦有限公司", "code" => "632801401"}
    ]

  def next(input) when input == "德令哈市" or input == "632802",
    do: [
      %{"name" => "河西街道", "code" => "632802001"},
      %{"name" => "河东街道", "code" => "632802002"},
      %{"name" => "火车站街道", "code" => "632802003"},
      %{"name" => "尕海镇", "code" => "632802100"},
      %{"name" => "怀头他拉镇", "code" => "632802101"},
      %{"name" => "柯鲁柯镇", "code" => "632802102"},
      %{"name" => "蓄集乡", "code" => "632802200"}
    ]

  def next(input) when input == "茫崖市" or input == "632803",
    do: [
      %{"name" => "花土沟镇", "code" => "632803100"},
      %{"name" => "茫崖镇", "code" => "632803101"},
      %{"name" => "冷湖镇", "code" => "632803102"}
    ]

  def next(input) when input == "乌兰县" or input == "632821",
    do: [
      %{"name" => "希里沟镇", "code" => "632821100"},
      %{"name" => "茶卡镇", "code" => "632821101"},
      %{"name" => "柯柯镇", "code" => "632821102"},
      %{"name" => "铜普镇", "code" => "632821103"},
      %{"name" => "海西州莫河畜牧场", "code" => "632821500"}
    ]

  def next(input) when input == "都兰县" or input == "632822",
    do: [
      %{"name" => "察汉乌苏镇", "code" => "632822100"},
      %{"name" => "香日德镇", "code" => "632822101"},
      %{"name" => "夏日哈镇", "code" => "632822102"},
      %{"name" => "宗加镇", "code" => "632822103"},
      %{"name" => "热水乡", "code" => "632822200"},
      %{"name" => "香加乡", "code" => "632822201"},
      %{"name" => "沟里乡", "code" => "632822202"},
      %{"name" => "巴隆乡", "code" => "632822203"}
    ]

  def next(input) when input == "天峻县" or input == "632823",
    do: [
      %{"name" => "新源镇", "code" => "632823100"},
      %{"name" => "木里镇", "code" => "632823101"},
      %{"name" => "江河镇", "code" => "632823102"},
      %{"name" => "快尔玛乡", "code" => "632823200"},
      %{"name" => "舟群乡", "code" => "632823201"},
      %{"name" => "织合玛乡", "code" => "632823202"},
      %{"name" => "苏里乡", "code" => "632823203"},
      %{"name" => "生格乡", "code" => "632823204"},
      %{"name" => "阳康乡", "code" => "632823205"},
      %{"name" => "龙门乡", "code" => "632823206"}
    ]

  def next(input) when input == "大柴旦行政委员会" or input == "632857",
    do: [%{"name" => "柴旦镇", "code" => "632857100"}, %{"name" => "锡铁山镇", "code" => "632857101"}]

  def next(input) when input == "玉树市" or input == "632701",
    do: [
      %{"name" => "结古街道", "code" => "632701001"},
      %{"name" => "扎西科街道", "code" => "632701002"},
      %{"name" => "西杭街道", "code" => "632701003"},
      %{"name" => "新寨街道", "code" => "632701004"},
      %{"name" => "隆宝镇", "code" => "632701101"},
      %{"name" => "下拉秀镇", "code" => "632701102"},
      %{"name" => "仲达乡", "code" => "632701200"},
      %{"name" => "巴塘乡", "code" => "632701201"},
      %{"name" => "小苏莽乡", "code" => "632701202"},
      %{"name" => "上拉秀乡", "code" => "632701203"},
      %{"name" => "安冲乡", "code" => "632701205"},
      %{"name" => "哈秀乡", "code" => "632701400"}
    ]

  def next(input) when input == "杂多县" or input == "632722",
    do: [
      %{"name" => "萨呼腾镇", "code" => "632722100"},
      %{"name" => "昂赛乡", "code" => "632722200"},
      %{"name" => "结多乡", "code" => "632722201"},
      %{"name" => "阿多乡", "code" => "632722202"},
      %{"name" => "苏鲁乡", "code" => "632722203"},
      %{"name" => "查旦乡", "code" => "632722204"},
      %{"name" => "莫云乡", "code" => "632722205"},
      %{"name" => "扎青乡", "code" => "632722206"}
    ]

  def next(input) when input == "称多县" or input == "632723",
    do: [
      %{"name" => "称文镇", "code" => "632723100"},
      %{"name" => "歇武镇", "code" => "632723101"},
      %{"name" => "扎朵镇", "code" => "632723102"},
      %{"name" => "清水河镇", "code" => "632723103"},
      %{"name" => "珍秦镇", "code" => "632723104"},
      %{"name" => "尕朵乡", "code" => "632723200"},
      %{"name" => "拉布乡", "code" => "632723201"}
    ]

  def next(input) when input == "治多县" or input == "632724",
    do: [
      %{"name" => "加吉博洛格镇", "code" => "632724100"},
      %{"name" => "索加乡", "code" => "632724200"},
      %{"name" => "扎河乡", "code" => "632724201"},
      %{"name" => "多彩乡", "code" => "632724202"},
      %{"name" => "治渠乡", "code" => "632724203"},
      %{"name" => "立新乡", "code" => "632724204"}
    ]

  def next(input) when input == "囊谦县" or input == "632725",
    do: [
      %{"name" => "香达镇", "code" => "632725100"},
      %{"name" => "白扎乡", "code" => "632725200"},
      %{"name" => "吉曲乡", "code" => "632725201"},
      %{"name" => "娘拉乡", "code" => "632725202"},
      %{"name" => "毛庄乡", "code" => "632725203"},
      %{"name" => "觉拉乡", "code" => "632725204"},
      %{"name" => "东坝乡", "code" => "632725205"},
      %{"name" => "尕羊乡", "code" => "632725206"},
      %{"name" => "吉尼赛乡", "code" => "632725207"},
      %{"name" => "着晓乡", "code" => "632725208"}
    ]

  def next(input) when input == "曲麻莱县" or input == "632726",
    do: [
      %{"name" => "约改镇", "code" => "632726100"},
      %{"name" => "巴干乡", "code" => "632726200"},
      %{"name" => "秋智乡", "code" => "632726201"},
      %{"name" => "叶格乡", "code" => "632726202"},
      %{"name" => "麻多乡", "code" => "632726203"},
      %{"name" => "曲麻河乡", "code" => "632726204"}
    ]

  def next(input) when input == "玛沁县" or input == "632621",
    do: [
      %{"name" => "大武镇", "code" => "632621100"},
      %{"name" => "拉加镇", "code" => "632621101"},
      %{"name" => "大武乡", "code" => "632621200"},
      %{"name" => "东倾沟乡", "code" => "632621201"},
      %{"name" => "雪山乡", "code" => "632621202"},
      %{"name" => "下大武乡", "code" => "632621203"},
      %{"name" => "优云乡", "code" => "632621204"},
      %{"name" => "当洛乡", "code" => "632621205"}
    ]

  def next(input) when input == "班玛县" or input == "632622",
    do: [
      %{"name" => "赛来塘镇", "code" => "632622100"},
      %{"name" => "多贡麻乡", "code" => "632622200"},
      %{"name" => "马可河乡", "code" => "632622201"},
      %{"name" => "吉卡乡", "code" => "632622202"},
      %{"name" => "达卡乡", "code" => "632622203"},
      %{"name" => "知钦乡", "code" => "632622204"},
      %{"name" => "江日堂乡", "code" => "632622205"},
      %{"name" => "亚尔堂乡", "code" => "632622206"},
      %{"name" => "灯塔乡", "code" => "632622207"}
    ]

  def next(input) when input == "甘德县" or input == "632623",
    do: [
      %{"name" => "柯曲镇", "code" => "632623100"},
      %{"name" => "上贡麻乡", "code" => "632623200"},
      %{"name" => "下贡麻乡", "code" => "632623201"},
      %{"name" => "岗龙乡", "code" => "632623202"},
      %{"name" => "青珍乡", "code" => "632623203"},
      %{"name" => "江千乡", "code" => "632623204"},
      %{"name" => "下藏科乡", "code" => "632623205"}
    ]

  def next(input) when input == "达日县" or input == "632624",
    do: [
      %{"name" => "吉迈镇", "code" => "632624100"},
      %{"name" => "满掌乡", "code" => "632624200"},
      %{"name" => "德昂乡", "code" => "632624201"},
      %{"name" => "窝赛乡", "code" => "632624202"},
      %{"name" => "莫坝乡", "code" => "632624203"},
      %{"name" => "上红科乡", "code" => "632624204"},
      %{"name" => "下红科乡", "code" => "632624205"},
      %{"name" => "建设乡", "code" => "632624206"},
      %{"name" => "桑日麻乡", "code" => "632624207"},
      %{"name" => "特合土乡", "code" => "632624208"}
    ]

  def next(input) when input == "久治县" or input == "632625",
    do: [
      %{"name" => "智青松多镇", "code" => "632625100"},
      %{"name" => "门堂乡", "code" => "632625200"},
      %{"name" => "哇赛乡", "code" => "632625201"},
      %{"name" => "索呼日麻乡", "code" => "632625202"},
      %{"name" => "白玉乡", "code" => "632625203"},
      %{"name" => "哇尔依乡", "code" => "632625204"}
    ]

  def next(input) when input == "玛多县" or input == "632626",
    do: [
      %{"name" => "玛查理镇", "code" => "632626100"},
      %{"name" => "花石峡镇", "code" => "632626101"},
      %{"name" => "黄河乡", "code" => "632626200"},
      %{"name" => "扎陵湖乡", "code" => "632626201"}
    ]

  def next(input) when input == "共和县" or input == "632521",
    do: [
      %{"name" => "恰卜恰镇", "code" => "632521100"},
      %{"name" => "倒淌河镇", "code" => "632521101"},
      %{"name" => "龙羊峡镇", "code" => "632521102"},
      %{"name" => "塘格木镇", "code" => "632521103"},
      %{"name" => "黑马河镇", "code" => "632521104"},
      %{"name" => "石乃亥镇", "code" => "632521105"},
      %{"name" => "江西沟镇", "code" => "632521106"},
      %{"name" => "沙珠玉乡", "code" => "632521202"},
      %{"name" => "铁盖乡", "code" => "632521203"},
      %{"name" => "廿地乡", "code" => "632521204"},
      %{"name" => "切吉乡", "code" => "632521205"},
      %{"name" => "海南州绿色产业发展园区管理区委员会", "code" => "632521400"},
      %{"name" => "巴卡台农场", "code" => "632521402"},
      %{"name" => "安置农场", "code" => "632521403"},
      %{"name" => "铁卜加草改站", "code" => "632521404"}
    ]

  def next(input) when input == "同德县" or input == "632522",
    do: [
      %{"name" => "尕巴松多镇", "code" => "632522100"},
      %{"name" => "唐谷镇", "code" => "632522101"},
      %{"name" => "巴沟乡", "code" => "632522200"},
      %{"name" => "秀麻乡", "code" => "632522201"},
      %{"name" => "河北乡", "code" => "632522202"}
    ]

  def next(input) when input == "贵德县" or input == "632523",
    do: [
      %{"name" => "河阴镇", "code" => "632523100"},
      %{"name" => "河西镇", "code" => "632523101"},
      %{"name" => "拉西瓦镇", "code" => "632523102"},
      %{"name" => "常牧镇", "code" => "632523103"},
      %{"name" => "河东乡", "code" => "632523200"},
      %{"name" => "新街回族乡", "code" => "632523201"},
      %{"name" => "尕让乡", "code" => "632523202"}
    ]

  def next(input) when input == "兴海县" or input == "632524",
    do: [
      %{"name" => "子科滩镇", "code" => "632524100"},
      %{"name" => "河卡镇", "code" => "632524101"},
      %{"name" => "曲什安镇", "code" => "632524102"},
      %{"name" => "温泉乡", "code" => "632524200"},
      %{"name" => "龙藏乡", "code" => "632524201"},
      %{"name" => "中铁乡", "code" => "632524202"},
      %{"name" => "唐乃亥乡", "code" => "632524203"}
    ]

  def next(input) when input == "贵南县" or input == "632525",
    do: [
      %{"name" => "茫曲镇", "code" => "632525100"},
      %{"name" => "过马营镇", "code" => "632525101"},
      %{"name" => "森多镇", "code" => "632525102"},
      %{"name" => "沙沟乡", "code" => "632525200"},
      %{"name" => "茫拉乡", "code" => "632525202"},
      %{"name" => "塔秀乡", "code" => "632525203"}
    ]

  def next(input) when input == "同仁市" or input == "632301",
    do: [
      %{"name" => "隆务镇", "code" => "632301100"},
      %{"name" => "保安镇", "code" => "632301101"},
      %{"name" => "多哇镇", "code" => "632301102"},
      %{"name" => "兰采乡", "code" => "632301200"},
      %{"name" => "双朋西乡", "code" => "632301201"},
      %{"name" => "扎毛乡", "code" => "632301202"},
      %{"name" => "黄乃亥乡", "code" => "632301203"},
      %{"name" => "曲库乎乡", "code" => "632301204"},
      %{"name" => "年都乎乡", "code" => "632301205"},
      %{"name" => "瓜什则乡", "code" => "632301206"},
      %{"name" => "加吾乡", "code" => "632301207"}
    ]

  def next(input) when input == "尖扎县" or input == "632322",
    do: [
      %{"name" => "马克堂镇", "code" => "632322100"},
      %{"name" => "康扬镇", "code" => "632322101"},
      %{"name" => "坎布拉镇", "code" => "632322102"},
      %{"name" => "贾加乡", "code" => "632322200"},
      %{"name" => "措周乡", "code" => "632322201"},
      %{"name" => "昂拉乡", "code" => "632322202"},
      %{"name" => "能科乡", "code" => "632322203"},
      %{"name" => "当顺乡", "code" => "632322204"},
      %{"name" => "尖扎滩乡", "code" => "632322205"}
    ]

  def next(input) when input == "泽库县" or input == "632323",
    do: [
      %{"name" => "泽曲镇", "code" => "632323100"},
      %{"name" => "麦秀镇", "code" => "632323101"},
      %{"name" => "和日镇", "code" => "632323102"},
      %{"name" => "宁秀镇", "code" => "632323103"},
      %{"name" => "王加乡", "code" => "632323202"},
      %{"name" => "西卜沙乡", "code" => "632323203"},
      %{"name" => "多禾茂乡", "code" => "632323204"}
    ]

  def next(input) when input == "河南蒙古族自治县" or input == "632324",
    do: [
      %{"name" => "优干宁镇", "code" => "632324100"},
      %{"name" => "宁木特镇", "code" => "632324101"},
      %{"name" => "多松乡", "code" => "632324201"},
      %{"name" => "赛尔龙乡", "code" => "632324202"},
      %{"name" => "柯生乡", "code" => "632324203"},
      %{"name" => "托叶玛乡", "code" => "632324204"}
    ]

  def next(input) when input == "门源回族自治县" or input == "632221",
    do: [
      %{"name" => "浩门镇", "code" => "632221100"},
      %{"name" => "青石咀镇", "code" => "632221101"},
      %{"name" => "泉口镇", "code" => "632221102"},
      %{"name" => "东川镇", "code" => "632221103"},
      %{"name" => "北山乡", "code" => "632221200"},
      %{"name" => "麻莲乡", "code" => "632221201"},
      %{"name" => "西滩乡", "code" => "632221202"},
      %{"name" => "阴田乡", "code" => "632221203"},
      %{"name" => "仙米乡", "code" => "632221204"},
      %{"name" => "珠固乡", "code" => "632221205"},
      %{"name" => "苏吉滩乡", "code" => "632221206"},
      %{"name" => "皇城蒙古族乡", "code" => "632221207"},
      %{"name" => "门源监狱", "code" => "632221400"},
      %{"name" => "门源种马场", "code" => "632221401"}
    ]

  def next(input) when input == "祁连县" or input == "632222",
    do: [
      %{"name" => "八宝镇", "code" => "632222100"},
      %{"name" => "峨堡镇", "code" => "632222101"},
      %{"name" => "默勒镇", "code" => "632222102"},
      %{"name" => "扎麻什乡", "code" => "632222200"},
      %{"name" => "阿柔乡", "code" => "632222201"},
      %{"name" => "野牛沟乡", "code" => "632222202"},
      %{"name" => "央隆乡", "code" => "632222203"}
    ]

  def next(input) when input == "海晏县" or input == "632223",
    do: [
      %{"name" => "三角城镇", "code" => "632223100"},
      %{"name" => "西海镇", "code" => "632223101"},
      %{"name" => "金滩乡", "code" => "632223200"},
      %{"name" => "哈勒景蒙古族乡", "code" => "632223201"},
      %{"name" => "青海湖乡", "code" => "632223202"},
      %{"name" => "甘子河乡", "code" => "632223203"}
    ]

  def next(input) when input == "刚察县" or input == "632224",
    do: [
      %{"name" => "沙柳河镇", "code" => "632224100"},
      %{"name" => "哈尔盖镇", "code" => "632224101"},
      %{"name" => "伊克乌兰乡", "code" => "632224200"},
      %{"name" => "泉吉乡", "code" => "632224201"},
      %{"name" => "吉尔孟乡", "code" => "632224202"}
    ]

  def next(input) when input == "乐都区" or input == "630202",
    do: [
      %{"name" => "碾伯街道", "code" => "630202001"},
      %{"name" => "岗沟街道", "code" => "630202002"},
      %{"name" => "雨润镇", "code" => "630202101"},
      %{"name" => "寿乐镇", "code" => "630202102"},
      %{"name" => "高庙镇", "code" => "630202103"},
      %{"name" => "洪水镇", "code" => "630202104"},
      %{"name" => "高店镇", "code" => "630202105"},
      %{"name" => "瞿昙镇", "code" => "630202106"},
      %{"name" => "共和乡", "code" => "630202200"},
      %{"name" => "中岭乡", "code" => "630202201"},
      %{"name" => "李家乡", "code" => "630202202"},
      %{"name" => "下营乡", "code" => "630202203"},
      %{"name" => "芦花乡", "code" => "630202204"},
      %{"name" => "马营乡", "code" => "630202205"},
      %{"name" => "马厂乡", "code" => "630202206"},
      %{"name" => "蒲台乡", "code" => "630202207"},
      %{"name" => "中坝乡", "code" => "630202208"},
      %{"name" => "峰堆乡", "code" => "630202209"},
      %{"name" => "城台乡", "code" => "630202210"},
      %{"name" => "达拉乡", "code" => "630202211"},
      %{"name" => "海东工业园区乐都工业园", "code" => "630202400"}
    ]

  def next(input) when input == "平安区" or input == "630203",
    do: [
      %{"name" => "平安街道", "code" => "630203001"},
      %{"name" => "小峡街道", "code" => "630203002"},
      %{"name" => "三合镇", "code" => "630203102"},
      %{"name" => "洪水泉乡", "code" => "630203200"},
      %{"name" => "石灰窑乡", "code" => "630203201"},
      %{"name" => "古城乡", "code" => "630203202"},
      %{"name" => "沙沟乡", "code" => "630203203"},
      %{"name" => "巴藏沟乡", "code" => "630203204"},
      %{"name" => "曹家堡临空综合经济园平安园区", "code" => "630203400"}
    ]

  def next(input) when input == "民和回族土族自治县" or input == "630222",
    do: [
      %{"name" => "川口镇", "code" => "630222100"},
      %{"name" => "古鄯镇", "code" => "630222101"},
      %{"name" => "马营镇", "code" => "630222102"},
      %{"name" => "官亭镇", "code" => "630222103"},
      %{"name" => "巴州镇", "code" => "630222104"},
      %{"name" => "满坪镇", "code" => "630222105"},
      %{"name" => "李二堡镇", "code" => "630222106"},
      %{"name" => "峡门镇", "code" => "630222107"},
      %{"name" => "马场垣乡", "code" => "630222200"},
      %{"name" => "北山乡", "code" => "630222201"},
      %{"name" => "松树乡", "code" => "630222202"},
      %{"name" => "西沟乡", "code" => "630222203"},
      %{"name" => "总堡乡", "code" => "630222204"},
      %{"name" => "隆治乡", "code" => "630222205"},
      %{"name" => "大庄乡", "code" => "630222206"},
      %{"name" => "转导乡", "code" => "630222207"},
      %{"name" => "前河乡", "code" => "630222208"},
      %{"name" => "甘沟乡", "code" => "630222209"},
      %{"name" => "中川乡", "code" => "630222210"},
      %{"name" => "杏儿乡", "code" => "630222211"},
      %{"name" => "核桃庄乡", "code" => "630222212"},
      %{"name" => "新民乡", "code" => "630222213"}
    ]

  def next(input) when input == "互助土族自治县" or input == "630223",
    do: [
      %{"name" => "高寨街道", "code" => "630223001"},
      %{"name" => "威远镇", "code" => "630223100"},
      %{"name" => "丹麻镇", "code" => "630223101"},
      %{"name" => "南门峡镇", "code" => "630223103"},
      %{"name" => "加定镇", "code" => "630223104"},
      %{"name" => "塘川镇", "code" => "630223105"},
      %{"name" => "五十镇", "code" => "630223106"},
      %{"name" => "五峰镇", "code" => "630223107"},
      %{"name" => "台子乡", "code" => "630223200"},
      %{"name" => "西山乡", "code" => "630223201"},
      %{"name" => "红崖子沟乡", "code" => "630223202"},
      %{"name" => "巴扎藏族乡", "code" => "630223203"},
      %{"name" => "哈拉直沟乡", "code" => "630223204"},
      %{"name" => "松多藏族乡", "code" => "630223205"},
      %{"name" => "东山乡", "code" => "630223206"},
      %{"name" => "东和乡", "code" => "630223207"},
      %{"name" => "东沟乡", "code" => "630223208"},
      %{"name" => "林川乡", "code" => "630223209"},
      %{"name" => "蔡家堡乡", "code" => "630223210"},
      %{"name" => "曹家堡临空综合经济园互助园区", "code" => "630223400"}
    ]

  def next(input) when input == "化隆回族自治县" or input == "630224",
    do: [
      %{"name" => "巴燕镇", "code" => "630224100"},
      %{"name" => "群科镇", "code" => "630224101"},
      %{"name" => "牙什尕镇", "code" => "630224102"},
      %{"name" => "甘都镇", "code" => "630224103"},
      %{"name" => "扎巴镇", "code" => "630224104"},
      %{"name" => "昂思多镇", "code" => "630224105"},
      %{"name" => "雄先藏族乡", "code" => "630224200"},
      %{"name" => "初麻乡", "code" => "630224201"},
      %{"name" => "查甫藏族乡", "code" => "630224202"},
      %{"name" => "塔加藏族乡", "code" => "630224203"},
      %{"name" => "金源藏族乡", "code" => "630224204"},
      %{"name" => "二塘乡", "code" => "630224205"},
      %{"name" => "谢家滩乡", "code" => "630224206"},
      %{"name" => "德恒隆乡", "code" => "630224207"},
      %{"name" => "沙连堡乡", "code" => "630224208"},
      %{"name" => "阿什努乡", "code" => "630224209"},
      %{"name" => "石大仓乡", "code" => "630224210"}
    ]

  def next(input) when input == "循化撒拉族自治县" or input == "630225",
    do: [
      %{"name" => "积石镇", "code" => "630225100"},
      %{"name" => "白庄镇", "code" => "630225101"},
      %{"name" => "街子镇", "code" => "630225102"},
      %{"name" => "道帏藏族乡", "code" => "630225200"},
      %{"name" => "清水乡", "code" => "630225201"},
      %{"name" => "岗察藏族乡", "code" => "630225202"},
      %{"name" => "查汗都斯乡", "code" => "630225203"},
      %{"name" => "文都藏族乡", "code" => "630225204"},
      %{"name" => "尕楞藏族乡", "code" => "630225205"}
    ]

  def next(input) when input == "城东区" or input == "630102",
    do: [
      %{"name" => "东关大街街道", "code" => "630102001"},
      %{"name" => "清真巷街道", "code" => "630102002"},
      %{"name" => "大众街街道", "code" => "630102003"},
      %{"name" => "周家泉街道", "code" => "630102004"},
      %{"name" => "火车站街道", "code" => "630102005"},
      %{"name" => "八一路街道", "code" => "630102006"},
      %{"name" => "林家崖街道", "code" => "630102007"},
      %{"name" => "乐家湾镇", "code" => "630102100"},
      %{"name" => "韵家口镇", "code" => "630102101"},
      %{"name" => "东川工业园", "code" => "630102400"}
    ]

  def next(input) when input == "城中区" or input == "630103",
    do: [
      %{"name" => "人民街街道", "code" => "630103001"},
      %{"name" => "南滩街道", "code" => "630103002"},
      %{"name" => "仓门街街道", "code" => "630103003"},
      %{"name" => "礼让街街道", "code" => "630103004"},
      %{"name" => "饮马街街道", "code" => "630103005"},
      %{"name" => "南川东路街道", "code" => "630103006"},
      %{"name" => "南川西路街道", "code" => "630103007"},
      %{"name" => "总寨镇", "code" => "630103100"},
      %{"name" => "南川工业园", "code" => "630103400"}
    ]

  def next(input) when input == "城西区" or input == "630104",
    do: [
      %{"name" => "西关大街街道", "code" => "630104001"},
      %{"name" => "古城台街道", "code" => "630104002"},
      %{"name" => "虎台街道", "code" => "630104003"},
      %{"name" => "胜利路街道", "code" => "630104004"},
      %{"name" => "兴海路街道", "code" => "630104005"},
      %{"name" => "文汇路街道", "code" => "630104006"},
      %{"name" => "通海路街道", "code" => "630104007"},
      %{"name" => "彭家寨镇", "code" => "630104100"}
    ]

  def next(input) when input == "城北区" or input == "630105",
    do: [
      %{"name" => "朝阳街道", "code" => "630105001"},
      %{"name" => "小桥大街街道", "code" => "630105002"},
      %{"name" => "马坊街道", "code" => "630105003"},
      %{"name" => "火车西站街道", "code" => "630105004"},
      %{"name" => "大堡子镇", "code" => "630105100"},
      %{"name" => "廿里铺镇", "code" => "630105101"},
      %{"name" => "生物科技产业园", "code" => "630105400"}
    ]

  def next(input) when input == "湟中区" or input == "630106",
    do: [
      %{"name" => "田家寨镇", "code" => "630106100"},
      %{"name" => "上新庄镇", "code" => "630106101"},
      %{"name" => "鲁沙尔镇", "code" => "630106102"},
      %{"name" => "甘河滩镇", "code" => "630106103"},
      %{"name" => "共和镇", "code" => "630106104"},
      %{"name" => "多巴镇", "code" => "630106105"},
      %{"name" => "拦隆口镇", "code" => "630106106"},
      %{"name" => "上五庄镇", "code" => "630106107"},
      %{"name" => "李家山镇", "code" => "630106108"},
      %{"name" => "西堡镇", "code" => "630106109"},
      %{"name" => "群加藏族乡", "code" => "630106200"},
      %{"name" => "土门关乡", "code" => "630106201"},
      %{"name" => "汉东回族乡", "code" => "630106202"},
      %{"name" => "大才回族乡", "code" => "630106203"},
      %{"name" => "海子沟乡", "code" => "630106204"},
      %{"name" => "甘河工业园", "code" => "630106400"},
      %{"name" => "康川街道", "code" => "630106401"}
    ]

  def next(input) when input == "大通回族土族自治县" or input == "630121",
    do: [
      %{"name" => "桥头镇", "code" => "630121100"},
      %{"name" => "城关镇", "code" => "630121101"},
      %{"name" => "塔尔镇", "code" => "630121102"},
      %{"name" => "东峡镇", "code" => "630121103"},
      %{"name" => "黄家寨镇", "code" => "630121104"},
      %{"name" => "长宁镇", "code" => "630121105"},
      %{"name" => "景阳镇", "code" => "630121106"},
      %{"name" => "多林镇", "code" => "630121107"},
      %{"name" => "新庄镇", "code" => "630121108"},
      %{"name" => "青林乡", "code" => "630121200"},
      %{"name" => "青山乡", "code" => "630121201"},
      %{"name" => "逊让乡", "code" => "630121202"},
      %{"name" => "极乐乡", "code" => "630121203"},
      %{"name" => "石山乡", "code" => "630121204"},
      %{"name" => "宝库乡", "code" => "630121205"},
      %{"name" => "斜沟乡", "code" => "630121206"},
      %{"name" => "良教乡", "code" => "630121207"},
      %{"name" => "向化藏族乡", "code" => "630121208"},
      %{"name" => "桦林乡", "code" => "630121209"},
      %{"name" => "朔北藏族乡", "code" => "630121210"}
    ]

  def next(input) when input == "湟源县" or input == "630123",
    do: [
      %{"name" => "城关镇", "code" => "630123100"},
      %{"name" => "大华镇", "code" => "630123101"},
      %{"name" => "东峡乡", "code" => "630123200"},
      %{"name" => "日月藏族乡", "code" => "630123201"},
      %{"name" => "和平乡", "code" => "630123202"},
      %{"name" => "波航乡", "code" => "630123203"},
      %{"name" => "申中乡", "code" => "630123204"},
      %{"name" => "巴燕乡", "code" => "630123205"},
      %{"name" => "寺寨乡", "code" => "630123206"}
    ]

  def next(_), do: nil
end