defmodule ChinaAdminDivisions.Gen.Lv3x.M65 do
  @moduledoc false
  # 县级/Sub

  def next(input) when input == "白杨市" or input == "659012",
    do: [
      %{"name" => "一六一团分部", "code" => "659012400000"},
      %{"name" => "一六三团", "code" => "659012503000"},
      %{"name" => "一六四团", "code" => "659012504000"},
      %{"name" => "一六五团", "code" => "659012505000"}
    ]

  def next(input) when input == "新星市" or input == "659011",
    do: [
      %{"name" => "新星市核心区", "code" => "659011400000"},
      %{"name" => "二道湖镇", "code" => "659011500000"},
      %{"name" => "骆驿镇", "code" => "659011501000"},
      %{"name" => "黄田镇", "code" => "659011502000"}
    ]

  def next(input) when input == "胡杨河市" or input == "659010",
    do: [
      %{"name" => "胡杨街道", "code" => "659010001000"},
      %{"name" => "共青镇", "code" => "659010100000"},
      %{"name" => "兵团一二五团", "code" => "659010500000"},
      %{"name" => "兵团一二八团", "code" => "659010501000"},
      %{"name" => "兵团一二九团", "code" => "659010502000"}
    ]

  def next(input) when input == "昆玉市" or input == "659009",
    do: [
      %{"name" => "玉都街道", "code" => "659009001000"},
      %{"name" => "老兵镇", "code" => "659009100000"},
      %{"name" => "昆泉镇", "code" => "659009101000"},
      %{"name" => "昆牧镇", "code" => "659009102000"},
      %{"name" => "玉泉镇", "code" => "659009103000"},
      %{"name" => "玉园镇", "code" => "659009104000"}
    ]

  def next(input) when input == "可克达拉市" or input == "659008",
    do: [
      %{"name" => "金山街道", "code" => "659008001000"},
      %{"name" => "花城街道", "code" => "659008002000"},
      %{"name" => "榆树庄镇", "code" => "659008100000"},
      %{"name" => "苇湖镇", "code" => "659008101000"},
      %{"name" => "长丰镇", "code" => "659008102000"},
      %{"name" => "金梁镇", "code" => "659008103000"},
      %{"name" => "金屯镇", "code" => "659008104000"}
    ]

  def next(input) when input == "双河市" or input == "659007",
    do: [
      %{"name" => "明珠街道", "code" => "659007001000"},
      %{"name" => "双桥镇", "code" => "659007100000"},
      %{"name" => "石峪镇", "code" => "659007101000"},
      %{"name" => "博河镇", "code" => "659007102000"},
      %{"name" => "双乐镇", "code" => "659007103000"},
      %{"name" => "友谊镇", "code" => "659007104000"}
    ]

  def next(input) when input == "铁门关市" or input == "659006",
    do: [
      %{"name" => "迎宾街道", "code" => "659006001000"},
      %{"name" => "博古其镇", "code" => "659006100000"},
      %{"name" => "双丰镇", "code" => "659006101000"},
      %{"name" => "河畔镇", "code" => "659006102000"},
      %{"name" => "高桥镇", "code" => "659006103000"},
      %{"name" => "天湖镇", "code" => "659006104000"},
      %{"name" => "开泽镇", "code" => "659006105000"},
      %{"name" => "米兰镇", "code" => "659006106000"},
      %{"name" => "金山镇", "code" => "659006107000"},
      %{"name" => "南屯镇", "code" => "659006108000"}
    ]

  def next(input) when input == "北屯市" or input == "659005",
    do: [
      %{"name" => "天骄街道", "code" => "659005001000"},
      %{"name" => "龙疆街道", "code" => "659005002000"},
      %{"name" => "军垦街道", "code" => "659005003000"},
      %{"name" => "双渠镇", "code" => "659005100000"},
      %{"name" => "丰庆镇", "code" => "659005101000"},
      %{"name" => "海川镇", "code" => "659005102000"}
    ]

  def next(input) when input == "五家渠市" or input == "659004",
    do: [
      %{"name" => "军垦路街道", "code" => "659004001000"},
      %{"name" => "青湖路街道", "code" => "659004002000"},
      %{"name" => "人民路街道", "code" => "659004003000"},
      %{"name" => "梧桐镇", "code" => "659004100000"},
      %{"name" => "蔡家湖镇", "code" => "659004101000"},
      %{"name" => "青湖镇", "code" => "659004102000"}
    ]

  def next(input) when input == "图木舒克市" or input == "659003",
    do: [
      %{"name" => "锦绣街道", "code" => "659003001000"},
      %{"name" => "前海街道", "code" => "659003002000"},
      %{"name" => "永安坝街道", "code" => "659003003000"},
      %{"name" => "草湖镇", "code" => "659003100000"},
      %{"name" => "龙口镇", "code" => "659003101000"},
      %{"name" => "前海镇", "code" => "659003102000"},
      %{"name" => "永兴镇", "code" => "659003103000"},
      %{"name" => "兴安镇", "code" => "659003104000"},
      %{"name" => "嘉和镇", "code" => "659003105000"},
      %{"name" => "河东镇", "code" => "659003106000"},
      %{"name" => "夏河镇", "code" => "659003107000"},
      %{"name" => "永安镇", "code" => "659003108000"},
      %{"name" => "海安镇", "code" => "659003109000"},
      %{"name" => "唐驿镇", "code" => "659003110000"},
      %{"name" => "金胡杨镇", "code" => "659003111000"},
      %{"name" => "东风镇", "code" => "659003112000"},
      %{"name" => "杏花镇", "code" => "659003113000"}
    ]

  def next(input) when input == "阿拉尔市" or input == "659002",
    do: [
      %{"name" => "金银川路街道", "code" => "659002001000"},
      %{"name" => "幸福路街道", "code" => "659002002000"},
      %{"name" => "青松路街道", "code" => "659002003000"},
      %{"name" => "金银川镇", "code" => "659002100000"},
      %{"name" => "新井子镇", "code" => "659002101000"},
      %{"name" => "甘泉镇", "code" => "659002102000"},
      %{"name" => "永宁镇", "code" => "659002103000"},
      %{"name" => "沙河镇", "code" => "659002104000"},
      %{"name" => "双城镇", "code" => "659002105000"},
      %{"name" => "花桥镇", "code" => "659002106000"},
      %{"name" => "幸福镇", "code" => "659002107000"},
      %{"name" => "金杨镇", "code" => "659002108000"},
      %{"name" => "玛滩镇", "code" => "659002109000"},
      %{"name" => "塔门镇", "code" => "659002110000"},
      %{"name" => "梨花镇", "code" => "659002111000"},
      %{"name" => "昌安镇", "code" => "659002112000"},
      %{"name" => "塔南镇", "code" => "659002113000"},
      %{"name" => "新开岭镇", "code" => "659002114000"},
      %{"name" => "托喀依乡", "code" => "659002200000"},
      %{"name" => "西工业园区", "code" => "659002518000"}
    ]

  def next(input) when input == "石河子市" or input == "659001",
    do: [
      %{"name" => "新城街道", "code" => "659001001000"},
      %{"name" => "向阳街道", "code" => "659001002000"},
      %{"name" => "红山街道", "code" => "659001003000"},
      %{"name" => "老街街道", "code" => "659001004000"},
      %{"name" => "东城街道", "code" => "659001005000"},
      %{"name" => "北泉镇", "code" => "659001100000"},
      %{"name" => "石河子镇", "code" => "659001101000"},
      %{"name" => "兵团一五二团", "code" => "659001500000"}
    ]

  def next(input) when input == "吉木乃县" or input == "654326",
    do: [
      %{"name" => "托普铁热克镇", "code" => "654326100000"},
      %{"name" => "吉木乃镇", "code" => "654326101000"},
      %{"name" => "喀尔交镇", "code" => "654326102000"},
      %{"name" => "乌拉斯特镇", "code" => "654326103000"},
      %{"name" => "托斯特乡", "code" => "654326201000"},
      %{"name" => "恰勒什海乡", "code" => "654326202000"},
      %{"name" => "别斯铁热克乡", "code" => "654326204000"},
      %{"name" => "兵团一八六团", "code" => "654326500000"}
    ]

  def next(input) when input == "青河县" or input == "654325",
    do: [
      %{"name" => "青河镇", "code" => "654325100000"},
      %{"name" => "塔克什肯镇", "code" => "654325101000"},
      %{"name" => "阿热勒托别镇", "code" => "654325102000"},
      %{"name" => "阿格达拉镇", "code" => "654325103000"},
      %{"name" => "阿热勒镇", "code" => "654325104000"},
      %{"name" => "萨尔托海乡", "code" => "654325202000"},
      %{"name" => "查干郭勒乡", "code" => "654325203000"},
      %{"name" => "阿尕什敖包乡", "code" => "654325204000"}
    ]

  def next(input) when input == "哈巴河县" or input == "654324",
    do: [
      %{"name" => "阿克齐镇", "code" => "654324100000"},
      %{"name" => "萨尔布拉克镇", "code" => "654324101000"},
      %{"name" => "齐巴尔镇", "code" => "654324102000"},
      %{"name" => "库勒拜镇", "code" => "654324103000"},
      %{"name" => "萨尔塔木乡", "code" => "654324200000"},
      %{"name" => "加依勒玛乡", "code" => "654324201000"},
      %{"name" => "铁热克提乡", "code" => "654324204000"},
      %{"name" => "兵团一八五团", "code" => "654324500000"}
    ]

  def next(input) when input == "福海县" or input == "654323",
    do: [
      %{"name" => "福海镇", "code" => "654323100000"},
      %{"name" => "喀拉玛盖镇", "code" => "654323101000"},
      %{"name" => "解特阿热勒镇", "code" => "654323102000"},
      %{"name" => "阔克阿尕什乡", "code" => "654323201000"},
      %{"name" => "齐干吉迭乡", "code" => "654323202000"},
      %{"name" => "阿尔达乡", "code" => "654323204000"},
      %{"name" => "地区一农场", "code" => "654323400000"},
      %{"name" => "福海监狱", "code" => "654323401000"},
      %{"name" => "兵团一八二团", "code" => "654323500000"},
      %{"name" => "兵团一八三团分部", "code" => "654323504000"},
      %{"name" => "兵团一八八团分部", "code" => "654323505000"}
    ]

  def next(input) when input == "富蕴县" or input == "654322",
    do: [
      %{"name" => "库额尔齐斯镇", "code" => "654322100000"},
      %{"name" => "可可托海镇", "code" => "654322101000"},
      %{"name" => "恰库尔图镇", "code" => "654322102000"},
      %{"name" => "喀拉通克镇", "code" => "654322103000"},
      %{"name" => "杜热镇", "code" => "654322104000"},
      %{"name" => "吐尔洪乡", "code" => "654322200000"},
      %{"name" => "库尔特乡", "code" => "654322202000"},
      %{"name" => "克孜勒希力克乡", "code" => "654322203000"},
      %{"name" => "铁买克乡", "code" => "654322204000"},
      %{"name" => "喀拉布勒根乡", "code" => "654322205000"}
    ]

  def next(input) when input == "布尔津县" or input == "654321",
    do: [
      %{"name" => "布尔津镇", "code" => "654321100000"},
      %{"name" => "冲乎尔镇", "code" => "654321101000"},
      %{"name" => "窝依莫克镇", "code" => "654321102000"},
      %{"name" => "阔斯特克镇", "code" => "654321103000"},
      %{"name" => "杜来提乡", "code" => "654321201000"},
      %{"name" => "也格孜托别乡", "code" => "654321204000"},
      %{"name" => "禾木哈纳斯蒙古族乡", "code" => "654321205000"}
    ]

  def next(input) when input == "阿勒泰市" or input == "654301",
    do: [
      %{"name" => "金山路街道", "code" => "654301001000"},
      %{"name" => "解放路街道", "code" => "654301002000"},
      %{"name" => "团结路街道", "code" => "654301003000"},
      %{"name" => "恰秀路街道", "code" => "654301004000"},
      %{"name" => "北屯镇", "code" => "654301100000"},
      %{"name" => "阿苇滩镇", "code" => "654301101000"},
      %{"name" => "红墩镇", "code" => "654301102000"},
      %{"name" => "切木尔切克镇", "code" => "654301103000"},
      %{"name" => "阿拉哈克镇", "code" => "654301104000"},
      %{"name" => "汗德尕特蒙古族乡", "code" => "654301202000"},
      %{"name" => "拉斯特乡", "code" => "654301203000"},
      %{"name" => "喀拉希力克乡", "code" => "654301204000"},
      %{"name" => "萨尔胡松乡", "code" => "654301205000"},
      %{"name" => "巴里巴盖乡", "code" => "654301206000"},
      %{"name" => "切尔克齐乡", "code" => "654301207000"},
      %{"name" => "喀拉尕什牧场", "code" => "654301400000"},
      %{"name" => "阿克吐木斯克牧场", "code" => "654301401000"},
      %{"name" => "兵团一八一团", "code" => "654301500000"}
    ]

  def next(input) when input == "和布克赛尔蒙古自治县" or input == "654226",
    do: [
      %{"name" => "和布克赛尔镇", "code" => "654226100000"},
      %{"name" => "和什托洛盖镇", "code" => "654226101000"},
      %{"name" => "夏孜盖乡", "code" => "654226200000"},
      %{"name" => "铁布肯乌散乡", "code" => "654226201000"},
      %{"name" => "查干库勒乡", "code" => "654226202000"},
      %{"name" => "巴音傲瓦乡", "code" => "654226203000"},
      %{"name" => "莫特格乡", "code" => "654226204000"},
      %{"name" => "查和特乡", "code" => "654226205000"},
      %{"name" => "伊克乌图布拉格牧场", "code" => "654226400000"},
      %{"name" => "巴嘎乌图布拉格牧场", "code" => "654226402000"},
      %{"name" => "布斯屯格牧场", "code" => "654226403000"},
      %{"name" => "第十师一八四团", "code" => "654226500000"}
    ]

  def next(input) when input == "裕民县" or input == "654225",
    do: [
      %{"name" => "哈拉布拉镇", "code" => "654225100000"},
      %{"name" => "吉也克镇", "code" => "654225101000"},
      %{"name" => "哈拉布拉乡", "code" => "654225200000"},
      %{"name" => "新地乡", "code" => "654225201000"},
      %{"name" => "阿勒腾也木勒乡", "code" => "654225202000"},
      %{"name" => "江格斯乡", "code" => "654225204000"},
      %{"name" => "兵团农九师一六一团", "code" => "654225501000"}
    ]

  def next(input) when input == "托里县" or input == "654224",
    do: [
      %{"name" => "托里镇", "code" => "654224100000"},
      %{"name" => "铁厂沟镇", "code" => "654224101000"},
      %{"name" => "庙尔沟镇", "code" => "654224102000"},
      %{"name" => "哈图镇", "code" => "654224103000"},
      %{"name" => "多拉特乡", "code" => "654224200000"},
      %{"name" => "乌雪特乡", "code" => "654224201000"},
      %{"name" => "库普乡", "code" => "654224202000"},
      %{"name" => "阿克别里斗乡", "code" => "654224203000"},
      %{"name" => "白杨河林场", "code" => "654224401000"},
      %{"name" => "老风口林场", "code" => "654224402000"},
      %{"name" => "巴尔鲁克山塔斯特林场", "code" => "654224403000"},
      %{"name" => "兵团农九师一七零团", "code" => "654224510000"}
    ]

  def next(input) when input == "额敏县" or input == "654221",
    do: [
      %{"name" => "额敏镇", "code" => "654221100000"},
      %{"name" => "玉什喀拉苏镇", "code" => "654221101000"},
      %{"name" => "杰勒阿尕什镇", "code" => "654221102000"},
      %{"name" => "上户镇", "code" => "654221103000"},
      %{"name" => "玛热勒苏镇", "code" => "654221104000"},
      %{"name" => "喀拉也木勒镇", "code" => "654221105000"},
      %{"name" => "郊区乡", "code" => "654221200000"},
      %{"name" => "额玛勒郭楞蒙古民族乡", "code" => "654221202000"},
      %{"name" => "喇嘛昭乡", "code" => "654221207000"},
      %{"name" => "霍吉尔特蒙古民族乡", "code" => "654221208000"},
      %{"name" => "二道桥乡", "code" => "654221209000"},
      %{"name" => "二支河牧场", "code" => "654221400000"},
      %{"name" => "加尔布拉克农场", "code" => "654221401000"},
      %{"name" => "阔什比克良种场", "code" => "654221402000"},
      %{"name" => "萨尔也木勒牧场", "code" => "654221403000"},
      %{"name" => "也木勒牧场", "code" => "654221404000"},
      %{"name" => "吾宗布拉克牧场", "code" => "654221406000"},
      %{"name" => "额敏（兵地、辽阳）工业园区", "code" => "654221407000"},
      %{"name" => "兵团农九师一六六团", "code" => "654221506000"},
      %{"name" => "兵团农九师一六七团", "code" => "654221507000"},
      %{"name" => "兵团农九师一六八团", "code" => "654221508000"},
      %{"name" => "兵团农九师团结农场", "code" => "654221511000"}
    ]

  def next(input) when input == "沙湾市" or input == "654203",
    do: [
      %{"name" => "桃园街道", "code" => "654203001000"},
      %{"name" => "团结街道", "code" => "654203002000"},
      %{"name" => "书香街道", "code" => "654203003000"},
      %{"name" => "凯旋街道", "code" => "654203004000"},
      %{"name" => "四道河子镇", "code" => "654203101000"},
      %{"name" => "老沙湾镇", "code" => "654203102000"},
      %{"name" => "乌兰乌苏镇", "code" => "654203103000"},
      %{"name" => "安集海镇", "code" => "654203104000"},
      %{"name" => "东湾镇", "code" => "654203105000"},
      %{"name" => "西戈壁镇", "code" => "654203106000"},
      %{"name" => "柳毛湾镇", "code" => "654203107000"},
      %{"name" => "金沟河镇", "code" => "654203108000"},
      %{"name" => "商户地乡", "code" => "654203200000"},
      %{"name" => "大泉乡", "code" => "654203201000"},
      %{"name" => "博尔通古乡", "code" => "654203202000"},
      %{"name" => "兵团北泉镇分部", "code" => "654203500000"},
      %{"name" => "兵团一二一团", "code" => "654203503000"},
      %{"name" => "兵团一三三团", "code" => "654203506000"},
      %{"name" => "兵团一三四团", "code" => "654203507000"},
      %{"name" => "兵团一四一团", "code" => "654203509000"},
      %{"name" => "兵团一四二团", "code" => "654203510000"},
      %{"name" => "兵团一四三团", "code" => "654203511000"},
      %{"name" => "兵团一四四团", "code" => "654203512000"}
    ]

  def next(input) when input == "乌苏市" or input == "654202",
    do: [
      %{"name" => "南苑街道", "code" => "654202001000"},
      %{"name" => "虹桥街道", "code" => "654202002000"},
      %{"name" => "新市区街道", "code" => "654202003000"},
      %{"name" => "西城街道", "code" => "654202006000"},
      %{"name" => "奎河街道", "code" => "654202007000"},
      %{"name" => "白杨沟镇", "code" => "654202100000"},
      %{"name" => "哈图布呼镇", "code" => "654202101000"},
      %{"name" => "皇宫镇", "code" => "654202102000"},
      %{"name" => "车排子镇", "code" => "654202103000"},
      %{"name" => "甘河子镇", "code" => "654202104000"},
      %{"name" => "百泉镇", "code" => "654202105000"},
      %{"name" => "四棵树镇", "code" => "654202106000"},
      %{"name" => "古尔图镇", "code" => "654202107000"},
      %{"name" => "西湖镇", "code" => "654202108000"},
      %{"name" => "西大沟镇", "code" => "654202109000"},
      %{"name" => "八十四户乡", "code" => "654202200000"},
      %{"name" => "夹河子乡", "code" => "654202201000"},
      %{"name" => "九间楼乡", "code" => "654202202000"},
      %{"name" => "石桥乡", "code" => "654202203000"},
      %{"name" => "头台乡", "code" => "654202204000"},
      %{"name" => "吉尔格勒特郭愣蒙古民族乡", "code" => "654202205000"},
      %{"name" => "塔布勒合特蒙古民族乡", "code" => "654202206000"},
      %{"name" => "甘家湖牧场", "code" => "654202400000"},
      %{"name" => "巴音沟牧场", "code" => "654202401000"},
      %{"name" => "赛力克提牧场", "code" => "654202402000"},
      %{"name" => "乌苏监狱", "code" => "654202403000"},
      %{"name" => "兵团一二三团生活区", "code" => "654202500000"},
      %{"name" => "兵团一二四团生活区", "code" => "654202501000"},
      %{"name" => "兵团一二五团分部生活区", "code" => "654202502000"},
      %{"name" => "兵团一二六团生活区", "code" => "654202503000"},
      %{"name" => "兵团一二七团生活区", "code" => "654202504000"},
      %{"name" => "兵团一二八团分部生活区", "code" => "654202505000"},
      %{"name" => "兵团一三零团分部生活区", "code" => "654202507000"}
    ]

  def next(input) when input == "塔城市" or input == "654201",
    do: [
      %{"name" => "和平街道", "code" => "654201001000"},
      %{"name" => "杜别克街道", "code" => "654201002000"},
      %{"name" => "新城街道", "code" => "654201003000"},
      %{"name" => "二工镇", "code" => "654201100000"},
      %{"name" => "恰夏镇", "code" => "654201101000"},
      %{"name" => "博孜达克镇", "code" => "654201102000"},
      %{"name" => "喀拉哈巴克乡", "code" => "654201200000"},
      %{"name" => "阿西尔达斡尔民族乡", "code" => "654201202000"},
      %{"name" => "阿不都拉乡", "code" => "654201203000"},
      %{"name" => "也门勒乡", "code" => "654201204000"},
      %{"name" => "兵团第九师一六二团", "code" => "654201502000"}
    ]

  def next(input) when input == "尼勒克县" or input == "654028",
    do: [
      %{"name" => "尼勒克镇", "code" => "654028100000"},
      %{"name" => "乌拉斯台镇", "code" => "654028101000"},
      %{"name" => "乌赞镇", "code" => "654028102000"},
      %{"name" => "木斯镇", "code" => "654028103000"},
      %{"name" => "克令镇", "code" => "654028104000"},
      %{"name" => "苏布台乡", "code" => "654028200000"},
      %{"name" => "喀拉苏乡", "code" => "654028201000"},
      %{"name" => "加哈乌拉斯台乡", "code" => "654028202000"},
      %{"name" => "科克浩特浩尔蒙古民族乡", "code" => "654028204000"},
      %{"name" => "喀拉托别乡", "code" => "654028207000"},
      %{"name" => "胡吉尔台乡", "code" => "654028208000"},
      %{"name" => "种蜂场", "code" => "654028404000"},
      %{"name" => "兵团七十九团", "code" => "654028518000"}
    ]

  def next(input) when input == "特克斯县" or input == "654027",
    do: [
      %{"name" => "特克斯镇", "code" => "654027100000"},
      %{"name" => "乔拉克铁热克镇", "code" => "654027101000"},
      %{"name" => "喀拉达拉镇", "code" => "654027102000"},
      %{"name" => "齐勒乌泽克镇", "code" => "654027103000"},
      %{"name" => "喀拉托海镇", "code" => "654027104000"},
      %{"name" => "科克苏镇", "code" => "654027105000"},
      %{"name" => "呼吉尔特蒙古民族乡", "code" => "654027200000"},
      %{"name" => "阔克铁热克柯尔克孜民族乡", "code" => "654027203000"},
      %{"name" => "科克苏林场", "code" => "654027405000"},
      %{"name" => "兵团七十八团", "code" => "654027517000"}
    ]

  def next(input) when input == "昭苏县" or input == "654026",
    do: [
      %{"name" => "昭苏镇", "code" => "654026100000"},
      %{"name" => "喀夏加尔镇", "code" => "654026101000"},
      %{"name" => "阿克达拉镇", "code" => "654026102000"},
      %{"name" => "喀拉苏镇", "code" => "654026103000"},
      %{"name" => "洪纳海镇", "code" => "654026104000"},
      %{"name" => "乌尊布拉克镇", "code" => "654026105000"},
      %{"name" => "萨尔阔布乡", "code" => "654026203000"},
      %{"name" => "察汗乌苏蒙古族乡", "code" => "654026206000"},
      %{"name" => "夏特柯尔克孜族乡", "code" => "654026207000"},
      %{"name" => "胡松图喀尔逊蒙古族乡", "code" => "654026208000"},
      %{"name" => "兵团七十四团", "code" => "654026513000"},
      %{"name" => "兵团七十五团", "code" => "654026514000"},
      %{"name" => "兵团七十六团", "code" => "654026515000"},
      %{"name" => "兵团七十七团", "code" => "654026516000"}
    ]

  def next(input) when input == "新源县" or input == "654025",
    do: [
      %{"name" => "新源镇", "code" => "654025100000"},
      %{"name" => "则克台镇", "code" => "654025101000"},
      %{"name" => "阿热勒托别镇", "code" => "654025102000"},
      %{"name" => "塔勒德镇", "code" => "654025103000"},
      %{"name" => "那拉提镇", "code" => "654025104000"},
      %{"name" => "肖尔布拉克镇", "code" => "654025105000"},
      %{"name" => "喀拉布拉镇", "code" => "654025106000"},
      %{"name" => "阿勒玛勒镇", "code" => "654025107000"},
      %{"name" => "坎苏镇", "code" => "654025108000"},
      %{"name" => "别斯托别乡", "code" => "654025200000"},
      %{"name" => "吐尔根乡", "code" => "654025204000"},
      %{"name" => "种羊场", "code" => "654025400000"},
      %{"name" => "公安农场", "code" => "654025403000"},
      %{"name" => "兵团七十一团", "code" => "654025511000"},
      %{"name" => "兵团七十二团", "code" => "654025512000"}
    ]

  def next(input) when input == "巩留县" or input == "654024",
    do: [
      %{"name" => "巩留镇", "code" => "654024100000"},
      %{"name" => "阿克吐别克镇", "code" => "654024101000"},
      %{"name" => "库尔德宁镇", "code" => "654024102000"},
      %{"name" => "东买里镇", "code" => "654024103000"},
      %{"name" => "阿尕尔森镇", "code" => "654024104000"},
      %{"name" => "提克阿热克镇", "code" => "654024105000"},
      %{"name" => "吉尔格郎乡", "code" => "654024201000"},
      %{"name" => "塔斯托别乡", "code" => "654024204000"},
      %{"name" => "牛场", "code" => "654024402000"},
      %{"name" => "林场", "code" => "654024405000"},
      %{"name" => "兵团七十三团", "code" => "654024510000"}
    ]

  def next(input) when input == "霍城县" or input == "654023",
    do: [
      %{"name" => "水定镇", "code" => "654023100000"},
      %{"name" => "清水河镇", "code" => "654023101000"},
      %{"name" => "芦草沟镇", "code" => "654023102000"},
      %{"name" => "惠远镇", "code" => "654023103000"},
      %{"name" => "萨尔布拉克镇", "code" => "654023104000"},
      %{"name" => "兰干镇", "code" => "654023105000"},
      %{"name" => "三道河乡", "code" => "654023201000"},
      %{"name" => "三宫乡", "code" => "654023204000"},
      %{"name" => "大西沟乡", "code" => "654023205000"},
      %{"name" => "良种繁育中心", "code" => "654023403000"},
      %{"name" => "兵团六十六团分部", "code" => "654023509000"}
    ]

  def next(input) when input == "察布查尔锡伯自治县" or input == "654022",
    do: [
      %{"name" => "察布查尔镇", "code" => "654022100000"},
      %{"name" => "爱新色里镇", "code" => "654022101000"},
      %{"name" => "孙扎齐牛录镇", "code" => "654022102000"},
      %{"name" => "绰霍尔镇", "code" => "654022103000"},
      %{"name" => "加尕斯台镇", "code" => "654022104000"},
      %{"name" => "琼博拉镇", "code" => "654022105000"},
      %{"name" => "海努克镇", "code" => "654022106000"},
      %{"name" => "堆齐牛录乡", "code" => "654022200000"},
      %{"name" => "纳达齐牛录乡", "code" => "654022203000"},
      %{"name" => "扎库齐牛录乡", "code" => "654022204000"},
      %{"name" => "米粮泉回族乡", "code" => "654022205000"},
      %{"name" => "坎乡", "code" => "654022206000"},
      %{"name" => "阔洪奇乡", "code" => "654022207000"},
      %{"name" => "安班巴格良繁场", "code" => "654022401000"},
      %{"name" => "伊犁州平原林场", "code" => "654022403000"},
      %{"name" => "山区林场", "code" => "654022404000"},
      %{"name" => "都拉塔口岸", "code" => "654022408000"},
      %{"name" => "兵团六十七团分部", "code" => "654022503000"},
      %{"name" => "兵团六十九团", "code" => "654022504000"}
    ]

  def next(input) when input == "伊宁县" or input == "654021",
    do: [
      %{"name" => "吉里于孜镇", "code" => "654021100000"},
      %{"name" => "墩麻扎镇", "code" => "654021101000"},
      %{"name" => "英塔木镇", "code" => "654021102000"},
      %{"name" => "胡地于孜镇", "code" => "654021103000"},
      %{"name" => "巴依托海镇", "code" => "654021104000"},
      %{"name" => "阿热吾斯塘镇", "code" => "654021105000"},
      %{"name" => "萨木于孜镇", "code" => "654021106000"},
      %{"name" => "喀什镇", "code" => "654021107000"},
      %{"name" => "维吾尔玉其温镇", "code" => "654021108000"},
      %{"name" => "温亚尔镇", "code" => "654021109000"},
      %{"name" => "吐鲁番于孜乡", "code" => "654021201000"},
      %{"name" => "喀拉亚尕奇乡", "code" => "654021202000"},
      %{"name" => "武功乡", "code" => "654021203000"},
      %{"name" => "萨地克于孜乡", "code" => "654021204000"},
      %{"name" => "愉群翁回族乡", "code" => "654021205000"},
      %{"name" => "麻扎乡", "code" => "654021212000"},
      %{"name" => "阿乌利亚乡", "code" => "654021214000"},
      %{"name" => "曲鲁海乡", "code" => "654021215000"},
      %{"name" => "兵团七十团中心团场", "code" => "654021501000"}
    ]

  def next(input) when input == "霍尔果斯市" or input == "654004",
    do: [
      %{"name" => "卡拉苏街道", "code" => "654004001000"},
      %{"name" => "亚欧东路街道", "code" => "654004002000"},
      %{"name" => "亚欧西路街道", "code" => "654004003000"},
      %{"name" => "工业园区街道", "code" => "654004004000"},
      %{"name" => "伊车嘎善乡", "code" => "654004200000"},
      %{"name" => "兵团六十一团", "code" => "654004505000"},
      %{"name" => "兵团六十二团", "code" => "654004506000"}
    ]

  def next(input) when input == "奎屯市" or input == "654003",
    do: [
      %{"name" => "团结路街道", "code" => "654003001000"},
      %{"name" => "乌东路街道", "code" => "654003002000"},
      %{"name" => "北京路街道", "code" => "654003003000"},
      %{"name" => "乌鲁木齐西路街道", "code" => "654003004000"},
      %{"name" => "火车站街道", "code" => "654003005000"},
      %{"name" => "北京西路街道", "code" => "654003006000"},
      %{"name" => "开干齐乡", "code" => "654003201000"},
      %{"name" => "兵团一三一团", "code" => "654003508000"},
      %{"name" => "天北新区", "code" => "654003510000"}
    ]

  def next(input) when input == "伊宁市" or input == "654002",
    do: [
      %{"name" => "萨依布依街道", "code" => "654002001000"},
      %{"name" => "墩买里街道", "code" => "654002002000"},
      %{"name" => "伊犁河路街道", "code" => "654002003000"},
      %{"name" => "喀赞其街道", "code" => "654002004000"},
      %{"name" => "都来提巴格街道", "code" => "654002005000"},
      %{"name" => "琼科瑞克街道", "code" => "654002006000"},
      %{"name" => "艾兰木巴格街道", "code" => "654002007000"},
      %{"name" => "解放路街道", "code" => "654002008000"},
      %{"name" => "北京路街道", "code" => "654002009000"},
      %{"name" => "上海路街道", "code" => "654002010000"},
      %{"name" => "重庆路街道", "code" => "654002011000"},
      %{"name" => "宁远街道", "code" => "654002012000"},
      %{"name" => "巴彦岱镇", "code" => "654002100000"},
      %{"name" => "潘津镇", "code" => "654002101000"},
      %{"name" => "英也尔镇", "code" => "654002102000"},
      %{"name" => "达达木图镇", "code" => "654002103000"},
      %{"name" => "汉宾乡", "code" => "654002201000"},
      %{"name" => "塔什科瑞克乡", "code" => "654002202000"},
      %{"name" => "喀尔墩乡", "code" => "654002203000"},
      %{"name" => "托格拉克乡", "code" => "654002204000"},
      %{"name" => "克伯克于孜乡", "code" => "654002205000"},
      %{"name" => "南岸新区", "code" => "654002404000"}
    ]

  def next(input) when input == "民丰县" or input == "653227",
    do: [
      %{"name" => "尼雅镇", "code" => "653227100000"},
      %{"name" => "尼雅乡", "code" => "653227200000"},
      %{"name" => "若克雅乡", "code" => "653227201000"},
      %{"name" => "萨勒吾则克乡", "code" => "653227202000"},
      %{"name" => "叶亦克乡", "code" => "653227203000"},
      %{"name" => "安迪尔乡", "code" => "653227204000"},
      %{"name" => "亚瓦通古孜乡", "code" => "653227205000"}
    ]

  def next(input) when input == "于田县" or input == "653226",
    do: [
      %{"name" => "木尕拉镇", "code" => "653226100000"},
      %{"name" => "先拜巴扎镇", "code" => "653226101000"},
      %{"name" => "加依乡", "code" => "653226200000"},
      %{"name" => "科克亚乡", "code" => "653226201000"},
      %{"name" => "阿热勒乡", "code" => "653226202000"},
      %{"name" => "阿日希乡", "code" => "653226203000"},
      %{"name" => "兰干乡", "code" => "653226204000"},
      %{"name" => "斯也克乡", "code" => "653226205000"},
      %{"name" => "托格日尕孜乡", "code" => "653226206000"},
      %{"name" => "喀拉克尔乡", "code" => "653226207000"},
      %{"name" => "奥依托格拉克乡", "code" => "653226208000"},
      %{"name" => "阿羌乡", "code" => "653226209000"},
      %{"name" => "英巴格乡", "code" => "653226210000"},
      %{"name" => "希吾勒乡", "code" => "653226211000"},
      %{"name" => "达里雅布依乡", "code" => "653226212000"},
      %{"name" => "于田监狱", "code" => "653226402000"},
      %{"name" => "工业园区", "code" => "653226403000"}
    ]

  def next(input) when input == "策勒县" or input == "653225",
    do: [
      %{"name" => "策勒镇", "code" => "653225100000"},
      %{"name" => "固拉合玛镇", "code" => "653225101000"},
      %{"name" => "策勒乡", "code" => "653225200000"},
      %{"name" => "达玛沟乡", "code" => "653225202000"},
      %{"name" => "恰哈乡", "code" => "653225203000"},
      %{"name" => "乌鲁克萨依乡", "code" => "653225204000"},
      %{"name" => "奴尔乡", "code" => "653225205000"},
      %{"name" => "博斯坦乡", "code" => "653225206000"}
    ]

  def next(input) when input == "洛浦县" or input == "653224",
    do: [
      %{"name" => "城区街道", "code" => "653224001000"},
      %{"name" => "洛浦镇", "code" => "653224100000"},
      %{"name" => "山普鲁镇", "code" => "653224101000"},
      %{"name" => "杭桂镇", "code" => "653224102000"},
      %{"name" => "恰尔巴格镇", "code" => "653224103000"},
      %{"name" => "多鲁镇", "code" => "653224104000"},
      %{"name" => "布亚乡", "code" => "653224201000"},
      %{"name" => "纳瓦乡", "code" => "653224206000"},
      %{"name" => "拜什托格拉克乡", "code" => "653224207000"},
      %{"name" => "阿其克乡", "code" => "653224208000"},
      %{"name" => "洛浦县北京工业园区", "code" => "653224403000"}
    ]

  def next(input) when input == "皮山县" or input == "653223",
    do: [
      %{"name" => "街道", "code" => "653223001000"},
      %{"name" => "固玛镇", "code" => "653223100000"},
      %{"name" => "杜瓦镇", "code" => "653223101000"},
      %{"name" => "赛图拉镇", "code" => "653223102000"},
      %{"name" => "木吉镇", "code" => "653223103000"},
      %{"name" => "阔什塔格镇", "code" => "653223104000"},
      %{"name" => "桑株镇", "code" => "653223105000"},
      %{"name" => "科克铁热克镇", "code" => "653223106000"},
      %{"name" => "克里阳乡", "code" => "653223201000"},
      %{"name" => "乔达乡", "code" => "653223205000"},
      %{"name" => "木奎拉乡", "code" => "653223206000"},
      %{"name" => "藏桂乡", "code" => "653223207000"},
      %{"name" => "皮亚勒玛乡", "code" => "653223208000"},
      %{"name" => "皮西那乡", "code" => "653223209000"},
      %{"name" => "巴什兰干乡", "code" => "653223210000"},
      %{"name" => "垴阿巴提塔吉克民族乡", "code" => "653223211000"},
      %{"name" => "康克尔柯尔克孜民族乡", "code" => "653223212000"},
      %{"name" => "皮山三峡工业园区", "code" => "653223401000"}
    ]

  def next(input) when input == "墨玉县" or input == "653222",
    do: [
      %{"name" => "喀拉喀什镇", "code" => "653222100000"},
      %{"name" => "扎瓦镇", "code" => "653222101000"},
      %{"name" => "奎牙镇", "code" => "653222102000"},
      %{"name" => "喀尔赛镇", "code" => "653222103000"},
      %{"name" => "普恰克其镇", "code" => "653222104000"},
      %{"name" => "阿克萨拉依乡", "code" => "653222203000"},
      %{"name" => "乌尔其乡", "code" => "653222204000"},
      %{"name" => "托胡拉乡", "code" => "653222205000"},
      %{"name" => "萨依巴格乡", "code" => "653222206000"},
      %{"name" => "加汗巴格乡", "code" => "653222207000"},
      %{"name" => "芒来乡", "code" => "653222209000"},
      %{"name" => "阔依其乡", "code" => "653222210000"},
      %{"name" => "雅瓦乡", "code" => "653222211000"},
      %{"name" => "吐外特乡", "code" => "653222212000"},
      %{"name" => "英也尔乡", "code" => "653222213000"},
      %{"name" => "喀瓦克乡", "code" => "653222214000"},
      %{"name" => "现代农业产业园", "code" => "653222401000"}
    ]

  def next(input) when input == "和田县" or input == "653221",
    do: [
      %{"name" => "巴格其镇", "code" => "653221100000"},
      %{"name" => "罕艾日克镇", "code" => "653221102000"},
      %{"name" => "红柳镇", "code" => "653221103000"},
      %{"name" => "英阿瓦提乡", "code" => "653221202000"},
      %{"name" => "英艾日克乡", "code" => "653221203000"},
      %{"name" => "布扎克乡", "code" => "653221204000"},
      %{"name" => "拉依喀乡", "code" => "653221205000"},
      %{"name" => "朗如乡", "code" => "653221206000"},
      %{"name" => "塔瓦库勒乡", "code" => "653221207000"},
      %{"name" => "伊斯拉木阿瓦提乡", "code" => "653221208000"},
      %{"name" => "色格孜库勒乡", "code" => "653221209000"},
      %{"name" => "喀什塔什乡", "code" => "653221210000"},
      %{"name" => "吾宗肖乡", "code" => "653221211000"},
      %{"name" => "和田县经济新区", "code" => "653221401000"}
    ]

  def next(input) when input == "和田市" or input == "653201",
    do: [
      %{"name" => "努尔巴格街道", "code" => "653201001000"},
      %{"name" => "古江巴格街道", "code" => "653201002000"},
      %{"name" => "古勒巴格街道", "code" => "653201003000"},
      %{"name" => "纳尔巴格街道", "code" => "653201004000"},
      %{"name" => "拉斯奎镇", "code" => "653201100000"},
      %{"name" => "玉龙喀什镇", "code" => "653201101000"},
      %{"name" => "吐沙拉镇", "code" => "653201102000"},
      %{"name" => "肖尔巴格乡", "code" => "653201200000"},
      %{"name" => "伊里其乡", "code" => "653201201000"},
      %{"name" => "古江巴格乡", "code" => "653201202000"},
      %{"name" => "吉亚乡", "code" => "653201204000"},
      %{"name" => "阿克恰勒乡", "code" => "653201205000"},
      %{"name" => "北京工业园区", "code" => "653201401000"},
      %{"name" => "和田市京和物流园区", "code" => "653201402000"}
    ]

  def next(input) when input == "塔什库尔干塔吉克自治县" or input == "653131",
    do: [
      %{"name" => "塔什库尔干镇", "code" => "653131100000"},
      %{"name" => "塔吉克阿巴提镇", "code" => "653131101000"},
      %{"name" => "塔什库尔干乡", "code" => "653131200000"},
      %{"name" => "塔合曼乡", "code" => "653131201000"},
      %{"name" => "科克亚尔柯尔克孜族乡", "code" => "653131202000"},
      %{"name" => "提孜那甫乡", "code" => "653131203000"},
      %{"name" => "达布达尔乡", "code" => "653131204000"},
      %{"name" => "马尔洋乡", "code" => "653131205000"},
      %{"name" => "瓦恰乡", "code" => "653131206000"},
      %{"name" => "班迪尔乡", "code" => "653131207000"},
      %{"name" => "库科西鲁格乡", "code" => "653131208000"},
      %{"name" => "大同乡", "code" => "653131210000"}
    ]

  def next(input) when input == "巴楚县" or input == "653130",
    do: [
      %{"name" => "巴楚镇", "code" => "653130100000"},
      %{"name" => "色力布亚镇", "code" => "653130101000"},
      %{"name" => "阿瓦提镇", "code" => "653130102000"},
      %{"name" => "三岔口镇", "code" => "653130103000"},
      %{"name" => "恰尔巴格乡", "code" => "653130200000"},
      %{"name" => "多来提巴格乡", "code" => "653130201000"},
      %{"name" => "阿纳库勒乡", "code" => "653130202000"},
      %{"name" => "夏马勒乡", "code" => "653130203000"},
      %{"name" => "阿克萨克马热勒乡", "code" => "653130204000"},
      %{"name" => "阿拉格尔乡", "code" => "653130205000"},
      %{"name" => "琼库尔恰克乡", "code" => "653130206000"},
      %{"name" => "英吾斯塘乡", "code" => "653130207000"}
    ]

  def next(input) when input == "伽师县" or input == "653129",
    do: [
      %{"name" => "巴仁镇", "code" => "653129100000"},
      %{"name" => "西克尔库勒镇", "code" => "653129101000"},
      %{"name" => "夏普吐勒镇", "code" => "653129102000"},
      %{"name" => "卧里托格拉克镇", "code" => "653129103000"},
      %{"name" => "克孜勒博依镇", "code" => "653129104000"},
      %{"name" => "英买里镇", "code" => "653129106000"},
      %{"name" => "和夏阿瓦提镇", "code" => "653129107000"},
      %{"name" => "铁日木乡", "code" => "653129200000"},
      %{"name" => "江巴孜乡", "code" => "653129202000"},
      %{"name" => "米夏乡", "code" => "653129205000"},
      %{"name" => "克孜勒苏乡", "code" => "653129208000"},
      %{"name" => "古勒鲁克乡", "code" => "653129209000"},
      %{"name" => "玉代克力克乡", "code" => "653129210000"}
    ]

  def next(input) when input == "岳普湖县" or input == "653128",
    do: [
      %{"name" => "岳普湖镇", "code" => "653128100000"},
      %{"name" => "艾西曼镇", "code" => "653128101000"},
      %{"name" => "铁热木镇", "code" => "653128102000"},
      %{"name" => "也克先拜巴扎镇", "code" => "653128103000"},
      %{"name" => "岳普湖乡", "code" => "653128200000"},
      %{"name" => "阿其克乡", "code" => "653128203000"},
      %{"name" => "色也克乡", "code" => "653128204000"},
      %{"name" => "巴依阿瓦提乡", "code" => "653128206000"},
      %{"name" => "阿洪鲁库木乡", "code" => "653128207000"}
    ]

  def next(input) when input == "麦盖提县" or input == "653127",
    do: [
      %{"name" => "麦盖提镇", "code" => "653127100000"},
      %{"name" => "巴扎结米镇", "code" => "653127101000"},
      %{"name" => "希依提墩乡", "code" => "653127201000"},
      %{"name" => "央塔克乡", "code" => "653127202000"},
      %{"name" => "吐曼塔勒乡", "code" => "653127203000"},
      %{"name" => "尕孜库勒乡", "code" => "653127204000"},
      %{"name" => "克孜勒阿瓦提乡", "code" => "653127205000"},
      %{"name" => "库木库萨尔乡", "code" => "653127206000"},
      %{"name" => "昂格特勒克乡", "code" => "653127207000"},
      %{"name" => "库尔玛乡", "code" => "653127208000"},
      %{"name" => "胡杨林场", "code" => "653127400000"},
      %{"name" => "园艺场", "code" => "653127401000"},
      %{"name" => "五一林场", "code" => "653127402000"}
    ]

  def next(input) when input == "叶城县" or input == "653126",
    do: [
      %{"name" => "喀格勒克镇", "code" => "653126100000"},
      %{"name" => "恰尔巴格镇", "code" => "653126101000"},
      %{"name" => "乌夏巴什镇", "code" => "653126102000"},
      %{"name" => "阿克塔什镇", "code" => "653126103000"},
      %{"name" => "金果镇", "code" => "653126104000"},
      %{"name" => "依提木孔镇", "code" => "653126105000"},
      %{"name" => "白杨镇", "code" => "653126106000"},
      %{"name" => "伯西热克镇", "code" => "653126107000"},
      %{"name" => "洛克乡", "code" => "653126200000"},
      %{"name" => "铁提乡", "code" => "653126202000"},
      %{"name" => "吐古其乡", "code" => "653126204000"},
      %{"name" => "江格勒斯乡", "code" => "653126205000"},
      %{"name" => "巴仁乡", "code" => "653126207000"},
      %{"name" => "乌吉热克乡", "code" => "653126208000"},
      %{"name" => "夏合甫乡", "code" => "653126209000"},
      %{"name" => "依力克其乡", "code" => "653126210000"},
      %{"name" => "宗朗乡", "code" => "653126212000"},
      %{"name" => "柯克亚乡", "code" => "653126213000"},
      %{"name" => "西合休乡", "code" => "653126214000"},
      %{"name" => "棋盘乡", "code" => "653126215000"},
      %{"name" => "萨依巴格乡", "code" => "653126216000"},
      %{"name" => "阿克塔什农场", "code" => "653126402000"},
      %{"name" => "良种场", "code" => "653126403000"},
      %{"name" => "林场", "code" => "653126405000"},
      %{"name" => "叶城工业园区", "code" => "653126409000"}
    ]

  def next(input) when input == "莎车县" or input == "653125",
    do: [
      %{"name" => "叶尓羌街道", "code" => "653125001000"},
      %{"name" => "城中街道", "code" => "653125002000"},
      %{"name" => "城东街道", "code" => "653125003000"},
      %{"name" => "城西街道", "code" => "653125004000"},
      %{"name" => "城北街道", "code" => "653125005000"},
      %{"name" => "莎车镇", "code" => "653125100000"},
      %{"name" => "恰热克镇", "code" => "653125101000"},
      %{"name" => "艾力西湖镇", "code" => "653125102000"},
      %{"name" => "荒地镇", "code" => "653125103000"},
      %{"name" => "阿瓦提镇", "code" => "653125104000"},
      %{"name" => "白什坎特镇", "code" => "653125105000"},
      %{"name" => "依盖尔其镇", "code" => "653125106000"},
      %{"name" => "古勒巴格镇", "code" => "653125107000"},
      %{"name" => "米夏镇", "code" => "653125108000"},
      %{"name" => "托木吾斯塘镇", "code" => "653125109000"},
      %{"name" => "塔尕尔其镇", "code" => "653125110000"},
      %{"name" => "乌达力克镇", "code" => "653125111000"},
      %{"name" => "阿拉买提镇", "code" => "653125112000"},
      %{"name" => "阿扎特巴格镇", "code" => "653125113000"},
      %{"name" => "阿热勒乡", "code" => "653125201000"},
      %{"name" => "恰尔巴格乡", "code" => "653125202000"},
      %{"name" => "英吾斯塘乡", "code" => "653125204000"},
      %{"name" => "阿尔斯兰巴格乡", "code" => "653125206000"},
      %{"name" => "孜热甫夏提塔吉克族乡", "code" => "653125207000"},
      %{"name" => "亚喀艾日克乡", "code" => "653125208000"},
      %{"name" => "喀群乡", "code" => "653125209000"},
      %{"name" => "霍什拉甫乡", "code" => "653125210000"},
      %{"name" => "达木斯乡", "code" => "653125211000"},
      %{"name" => "伊什库力乡", "code" => "653125213000"},
      %{"name" => "拍克其乡", "code" => "653125214000"},
      %{"name" => "阔什艾日克乡", "code" => "653125216000"},
      %{"name" => "墩巴格乡", "code" => "653125217000"},
      %{"name" => "巴格阿瓦提乡", "code" => "653125220000"},
      %{"name" => "喀拉苏乡", "code" => "653125221000"},
      %{"name" => "喀什监狱", "code" => "653125401000"},
      %{"name" => "莎车县良种繁育场", "code" => "653125402000"},
      %{"name" => "莎车县第一林场（国营苗圃）", "code" => "653125403000"},
      %{"name" => "莎车县国营二林场", "code" => "653125404000"},
      %{"name" => "莎车县园艺场", "code" => "653125405000"},
      %{"name" => "莎车县蚕种场", "code" => "653125406000"},
      %{"name" => "莎车县鱼苗场", "code" => "653125407000"},
      %{"name" => "农科院莎车农业试验站", "code" => "653125408000"},
      %{"name" => "工业园区管委会", "code" => "653125409000"},
      %{"name" => "英阿瓦提管理委员会", "code" => "653125410000"},
      %{"name" => "永安管理委员会", "code" => "653125411000"}
    ]

  def next(input) when input == "泽普县" or input == "653124",
    do: [
      %{"name" => "泽普镇", "code" => "653124100000"},
      %{"name" => "奎依巴格镇", "code" => "653124101000"},
      %{"name" => "波斯喀木乡", "code" => "653124200000"},
      %{"name" => "泽普县依玛乡", "code" => "653124201000"},
      %{"name" => "古勒巴格乡", "code" => "653124202000"},
      %{"name" => "赛力乡", "code" => "653124203000"},
      %{"name" => "依肯苏乡", "code" => "653124204000"},
      %{"name" => "图呼其乡", "code" => "653124205000"},
      %{"name" => "奎依巴格乡", "code" => "653124206000"},
      %{"name" => "阿克塔木乡", "code" => "653124207000"},
      %{"name" => "阿依库勒乡", "code" => "653124208000"},
      %{"name" => "布依鲁克塔吉克族乡", "code" => "653124209000"},
      %{"name" => "桐安乡", "code" => "653124210000"},
      %{"name" => "泽普县良种场", "code" => "653124401000"},
      %{"name" => "国营林场", "code" => "653124403000"}
    ]

  def next(input) when input == "英吉沙县" or input == "653123",
    do: [
      %{"name" => "英吉沙镇", "code" => "653123100000"},
      %{"name" => "乌恰镇", "code" => "653123101000"},
      %{"name" => "芒辛镇", "code" => "653123102000"},
      %{"name" => "萨罕镇", "code" => "653123103000"},
      %{"name" => "城关乡", "code" => "653123200000"},
      %{"name" => "乔勒潘乡", "code" => "653123201000"},
      %{"name" => "龙甫乡", "code" => "653123202000"},
      %{"name" => "色提力乡", "code" => "653123204000"},
      %{"name" => "英也尔乡", "code" => "653123206000"},
      %{"name" => "克孜勒乡", "code" => "653123207000"},
      %{"name" => "托普鲁克乡", "code" => "653123208000"},
      %{"name" => "苏盖提乡", "code" => "653123209000"},
      %{"name" => "艾古斯乡", "code" => "653123211000"},
      %{"name" => "依格孜也尔乡", "code" => "653123212000"},
      %{"name" => "英吉沙工业园区", "code" => "653123401000"}
    ]

  def next(input) when input == "疏勒县" or input == "653122",
    do: [
      %{"name" => "疏勒镇", "code" => "653122100000"},
      %{"name" => "罕南力克镇", "code" => "653122101000"},
      %{"name" => "牙甫泉镇", "code" => "653122102000"},
      %{"name" => "巴仁乡", "code" => "653122200000"},
      %{"name" => "洋大曼乡", "code" => "653122201000"},
      %{"name" => "亚曼牙乡", "code" => "653122202000"},
      %{"name" => "巴合齐乡", "code" => "653122203000"},
      %{"name" => "塔孜洪乡", "code" => "653122204000"},
      %{"name" => "英尔力克乡", "code" => "653122205000"},
      %{"name" => "库木西力克乡", "code" => "653122206000"},
      %{"name" => "塔尕尔其乡", "code" => "653122207000"},
      %{"name" => "艾尔木东乡", "code" => "653122208000"},
      %{"name" => "阿拉力乡", "code" => "653122209000"},
      %{"name" => "阿拉甫乡", "code" => "653122210000"},
      %{"name" => "英阿瓦提乡", "code" => "653122211000"},
      %{"name" => "高新技术产业孵化园区管委会", "code" => "653122400000"}
    ]

  def next(input) when input == "疏附县" or input == "653121",
    do: [
      %{"name" => "托克扎克镇", "code" => "653121100000"},
      %{"name" => "兰干镇", "code" => "653121101000"},
      %{"name" => "吾库萨克镇", "code" => "653121102000"},
      %{"name" => "乌帕尔镇", "code" => "653121103000"},
      %{"name" => "塔什米里克乡", "code" => "653121201000"},
      %{"name" => "铁日木乡", "code" => "653121202000"},
      %{"name" => "布拉克苏乡", "code" => "653121203000"},
      %{"name" => "萨依巴格乡", "code" => "653121204000"},
      %{"name" => "站敏乡", "code" => "653121205000"},
      %{"name" => "木什乡", "code" => "653121211000"},
      %{"name" => "县种畜场", "code" => "653121400000"},
      %{"name" => "县园艺场", "code" => "653121401000"},
      %{"name" => "县林场", "code" => "653121402000"},
      %{"name" => "县良种场", "code" => "653121403000"},
      %{"name" => "疏附广州工业城", "code" => "653121406000"}
    ]

  def next(input) when input == "喀什市" or input == "653101",
    do: [
      %{"name" => "恰萨街道", "code" => "653101001000"},
      %{"name" => "亚瓦格街道", "code" => "653101002000"},
      %{"name" => "吾斯塘博依街道", "code" => "653101003000"},
      %{"name" => "库木代尔瓦扎街道", "code" => "653101004000"},
      %{"name" => "西域大道街道", "code" => "653101005000"},
      %{"name" => "东湖街道", "code" => "653101006000"},
      %{"name" => "迎宾大道街道", "code" => "653101007000"},
      %{"name" => "西公园街道", "code" => "653101008000"},
      %{"name" => "乃则尔巴格镇", "code" => "653101100000"},
      %{"name" => "夏马勒巴格镇", "code" => "653101101000"},
      %{"name" => "多来特巴格乡", "code" => "653101202000"},
      %{"name" => "浩罕乡", "code" => "653101203000"},
      %{"name" => "色满乡", "code" => "653101204000"},
      %{"name" => "荒地乡", "code" => "653101205000"},
      %{"name" => "帕哈太克里乡", "code" => "653101206000"},
      %{"name" => "伯什克然木乡", "code" => "653101207000"},
      %{"name" => "阿瓦提乡", "code" => "653101208000"},
      %{"name" => "英吾斯坦乡", "code" => "653101209000"},
      %{"name" => "阿克喀什乡", "code" => "653101210000"}
    ]

  def next(input) when input == "乌恰县" or input == "653024",
    do: [
      %{"name" => "乌恰镇", "code" => "653024100000"},
      %{"name" => "康苏镇", "code" => "653024101000"},
      %{"name" => "巴音库鲁提镇", "code" => "653024102000"},
      %{"name" => "乌鲁克恰提乡", "code" => "653024200000"},
      %{"name" => "吾合沙鲁乡", "code" => "653024201000"},
      %{"name" => "膘尔托阔依乡", "code" => "653024202000"},
      %{"name" => "黑孜苇乡", "code" => "653024203000"},
      %{"name" => "托云乡", "code" => "653024204000"},
      %{"name" => "铁列克乡", "code" => "653024205000"},
      %{"name" => "波斯坦铁列克乡", "code" => "653024207000"},
      %{"name" => "吉根乡", "code" => "653024208000"},
      %{"name" => "兵团托云牧场", "code" => "653024501000"}
    ]

  def next(input) when input == "阿合奇县" or input == "653023",
    do: [
      %{"name" => "阿合奇镇", "code" => "653023100000"},
      %{"name" => "库兰萨日克乡", "code" => "653023200000"},
      %{"name" => "色帕巴依乡", "code" => "653023201000"},
      %{"name" => "苏木塔什乡", "code" => "653023202000"},
      %{"name" => "哈拉奇乡", "code" => "653023203000"},
      %{"name" => "哈拉布拉克乡", "code" => "653023204000"}
    ]

  def next(input) when input == "阿克陶县" or input == "653022",
    do: [
      %{"name" => "阿克陶镇", "code" => "653022100000"},
      %{"name" => "奥依塔克镇", "code" => "653022101000"},
      %{"name" => "克孜勒陶镇", "code" => "653022102000"},
      %{"name" => "恰尔隆镇", "code" => "653022103000"},
      %{"name" => "玉麦镇", "code" => "653022104000"},
      %{"name" => "皮拉勒乡", "code" => "653022201000"},
      %{"name" => "巴仁乡", "code" => "653022202000"},
      %{"name" => "喀热开其克乡", "code" => "653022203000"},
      %{"name" => "加马铁热克乡", "code" => "653022204000"},
      %{"name" => "木吉乡", "code" => "653022205000"},
      %{"name" => "布伦口乡", "code" => "653022206000"},
      %{"name" => "塔尔塔吉克民族乡", "code" => "653022210000"},
      %{"name" => "托尔塔依农场", "code" => "653022400000"},
      %{"name" => "阿克达拉牧场", "code" => "653022401000"},
      %{"name" => "原种场", "code" => "653022402000"},
      %{"name" => "克孜勒苏柯尔克孜自治州林场", "code" => "653022403000"},
      %{"name" => "苗圃", "code" => "653022404000"}
    ]

  def next(input) when input == "阿图什市" or input == "653001",
    do: [
      %{"name" => "幸福路街道", "code" => "653001001000"},
      %{"name" => "光明路街道", "code" => "653001002000"},
      %{"name" => "新城街道", "code" => "653001003000"},
      %{"name" => "上阿图什镇", "code" => "653001100000"},
      %{"name" => "松他克镇", "code" => "653001101000"},
      %{"name" => "阿扎克镇", "code" => "653001102000"},
      %{"name" => "阿湖乡", "code" => "653001202000"},
      %{"name" => "格达良乡", "code" => "653001204000"},
      %{"name" => "哈拉峻乡", "code" => "653001205000"},
      %{"name" => "吐古买提乡", "code" => "653001206000"},
      %{"name" => "兵团农三师红旗农场", "code" => "653001500000"}
    ]

  def next(input) when input == "柯坪县" or input == "652929",
    do: [
      %{"name" => "柯坪镇", "code" => "652929100000"},
      %{"name" => "盖孜力克镇", "code" => "652929101000"},
      %{"name" => "阿恰勒镇", "code" => "652929102000"},
      %{"name" => "玉尔其乡", "code" => "652929201000"},
      %{"name" => "启浪乡", "code" => "652929203000"}
    ]

  def next(input) when input == "阿瓦提县" or input == "652928",
    do: [
      %{"name" => "阿瓦提镇", "code" => "652928100000"},
      %{"name" => "乌鲁却勒镇", "code" => "652928101000"},
      %{"name" => "拜什艾日克镇", "code" => "652928102000"},
      %{"name" => "塔木托格拉克镇", "code" => "652928103000"},
      %{"name" => "英艾日克镇", "code" => "652928104000"},
      %{"name" => "阿依巴格镇", "code" => "652928105000"},
      %{"name" => "三河镇", "code" => "652928106000"},
      %{"name" => "多浪乡", "code" => "652928203000"},
      %{"name" => "巴格托格拉克乡", "code" => "652928204000"},
      %{"name" => "阿克苏监狱", "code" => "652928405000"}
    ]

  def next(input) when input == "乌什县" or input == "652927",
    do: [
      %{"name" => "乌什镇", "code" => "652927100000"},
      %{"name" => "阿合雅镇", "code" => "652927101000"},
      %{"name" => "依麻木镇", "code" => "652927102000"},
      %{"name" => "阿克托海乡", "code" => "652927200000"},
      %{"name" => "亚科瑞克乡", "code" => "652927201000"},
      %{"name" => "阿恰塔格乡", "code" => "652927202000"},
      %{"name" => "英阿瓦提乡", "code" => "652927205000"},
      %{"name" => "亚曼苏柯尔克孜族乡", "code" => "652927206000"},
      %{"name" => "奥特贝希乡", "code" => "652927207000"}
    ]

  def next(input) when input == "拜城县" or input == "652926",
    do: [
      %{"name" => "拜城镇", "code" => "652926100000"},
      %{"name" => "铁热克镇", "code" => "652926101000"},
      %{"name" => "察尔齐镇", "code" => "652926102000"},
      %{"name" => "赛里木镇", "code" => "652926103000"},
      %{"name" => "黑英山乡", "code" => "652926200000"},
      %{"name" => "克孜尔乡", "code" => "652926201000"},
      %{"name" => "托克逊乡", "code" => "652926203000"},
      %{"name" => "亚吐尔乡", "code" => "652926204000"},
      %{"name" => "康其乡", "code" => "652926205000"},
      %{"name" => "布隆乡", "code" => "652926206000"},
      %{"name" => "米吉克乡", "code" => "652926207000"},
      %{"name" => "温巴什乡", "code" => "652926208000"},
      %{"name" => "大桥乡", "code" => "652926209000"},
      %{"name" => "老虎台乡", "code" => "652926210000"}
    ]

  def next(input) when input == "新和县" or input == "652925",
    do: [
      %{"name" => "新和镇", "code" => "652925100000"},
      %{"name" => "尤鲁都斯巴格镇", "code" => "652925101000"},
      %{"name" => "依其艾日克镇", "code" => "652925102000"},
      %{"name" => "塔什艾日克镇", "code" => "652925103000"},
      %{"name" => "排先拜巴扎镇", "code" => "652925104000"},
      %{"name" => "玉奇喀特镇", "code" => "652925105000"},
      %{"name" => "渭干乡", "code" => "652925203000"},
      %{"name" => "塔木托格拉克乡", "code" => "652925205000"},
      %{"name" => "央塔库都片区管委会", "code" => "652925402000"},
      %{"name" => "新和县轻工业园区生活区", "code" => "652925403000"},
      %{"name" => "新和县物流园区生活区", "code" => "652925404000"},
      %{"name" => "新和县新材料园区生活区", "code" => "652925405000"}
    ]

  def next(input) when input == "沙雅县" or input == "652924",
    do: [
      %{"name" => "沙雅镇", "code" => "652924100000"},
      %{"name" => "托依堡勒迪镇", "code" => "652924101000"},
      %{"name" => "红旗镇", "code" => "652924102000"},
      %{"name" => "英买力镇", "code" => "652924103000"},
      %{"name" => "沙雅县哈德墩镇", "code" => "652924104000"},
      %{"name" => "古勒巴格镇", "code" => "652924105000"},
      %{"name" => "海楼镇", "code" => "652924106000"},
      %{"name" => "努尔巴格乡", "code" => "652924205000"},
      %{"name" => "塔里木乡", "code" => "652924206000"},
      %{"name" => "盖孜库木乡", "code" => "652924207000"},
      %{"name" => "央塔克协海尔乡", "code" => "652924208000"},
      %{"name" => "沙雅县塔河管理委员会", "code" => "652924402000"}
    ]

  def next(input) when input == "温宿县" or input == "652922",
    do: [
      %{"name" => "温宿镇", "code" => "652922100000"},
      %{"name" => "吐木秀克镇", "code" => "652922101000"},
      %{"name" => "克孜勒镇", "code" => "652922102000"},
      %{"name" => "阿热勒镇", "code" => "652922103000"},
      %{"name" => "佳木镇", "code" => "652922104000"},
      %{"name" => "托甫汗镇", "code" => "652922105000"},
      %{"name" => "共青团镇", "code" => "652922106000"},
      %{"name" => "柯柯牙镇", "code" => "652922107000"},
      %{"name" => "托乎拉乡", "code" => "652922200000"},
      %{"name" => "恰格拉克乡", "code" => "652922202000"},
      %{"name" => "依希来木其乡", "code" => "652922204000"},
      %{"name" => "古勒阿瓦提乡", "code" => "652922206000"},
      %{"name" => "博孜墩柯尔克孜族乡", "code" => "652922207000"}
    ]

  def next(input) when input == "库车市" or input == "652902",
    do: [
      %{"name" => "热斯坦街道", "code" => "652902001000"},
      %{"name" => "萨克萨克街道", "code" => "652902002000"},
      %{"name" => "新城街道", "code" => "652902003000"},
      %{"name" => "东城街道", "code" => "652902004000"},
      %{"name" => "乌恰镇", "code" => "652902101000"},
      %{"name" => "阿拉哈格镇", "code" => "652902102000"},
      %{"name" => "齐满镇", "code" => "652902103000"},
      %{"name" => "墩阔坦镇", "code" => "652902104000"},
      %{"name" => "牙哈镇", "code" => "652902105000"},
      %{"name" => "乌尊镇", "code" => "652902106000"},
      %{"name" => "伊西哈拉镇", "code" => "652902107000"},
      %{"name" => "二八台镇", "code" => "652902108000"},
      %{"name" => "塔里木镇", "code" => "652902109000"},
      %{"name" => "玉奇吾斯塘乡", "code" => "652902201000"},
      %{"name" => "比西巴格乡", "code" => "652902202000"},
      %{"name" => "哈尼喀塔木乡", "code" => "652902203000"},
      %{"name" => "阿克吾斯塘乡", "code" => "652902204000"},
      %{"name" => "阿格乡", "code" => "652902205000"},
      %{"name" => "库车经济技术开发区", "code" => "652902400000"},
      %{"name" => "城南片区管委会", "code" => "652902401000"},
      %{"name" => "五眼泉片区管委会", "code" => "652902402000"}
    ]

  def next(input) when input == "阿克苏市" or input == "652901",
    do: [
      %{"name" => "兰干街道", "code" => "652901001000"},
      %{"name" => "英巴扎街道", "code" => "652901002000"},
      %{"name" => "红桥街道", "code" => "652901003000"},
      %{"name" => "新城街道", "code" => "652901004000"},
      %{"name" => "南城街道", "code" => "652901005000"},
      %{"name" => "柯柯牙街道", "code" => "652901006000"},
      %{"name" => "多浪街道", "code" => "652901007000"},
      %{"name" => "喀拉塔勒镇", "code" => "652901100000"},
      %{"name" => "阿依库勒镇", "code" => "652901101000"},
      %{"name" => "依干其镇", "code" => "652901102000"},
      %{"name" => "拜什吐格曼乡", "code" => "652901201000"},
      %{"name" => "托普鲁克乡", "code" => "652901202000"},
      %{"name" => "库木巴什乡", "code" => "652901203000"},
      %{"name" => "实验林场", "code" => "652901404000"},
      %{"name" => "纺织工业城", "code" => "652901407000"},
      %{"name" => "经济技术开发区", "code" => "652901408000"},
      %{"name" => "特色产业园区", "code" => "652901409000"},
      %{"name" => "柳源农场", "code" => "652901410000"}
    ]

  def next(input) when input == "博湖县" or input == "652829",
    do: [
      %{"name" => "博湖镇", "code" => "652829100000"},
      %{"name" => "本布图镇", "code" => "652829101000"},
      %{"name" => "塔温觉肯乡", "code" => "652829200000"},
      %{"name" => "乌兰再格森乡", "code" => "652829202000"},
      %{"name" => "才坎诺尔乡", "code" => "652829203000"},
      %{"name" => "查干诺尔乡", "code" => "652829204000"},
      %{"name" => "博斯腾湖乡", "code" => "652829205000"},
      %{"name" => "兵团二十五团", "code" => "652829501000"}
    ]

  def next(input) when input == "和硕县" or input == "652828",
    do: [
      %{"name" => "特吾里克镇", "code" => "652828100000"},
      %{"name" => "塔哈其镇", "code" => "652828101000"},
      %{"name" => "曲惠镇", "code" => "652828102000"},
      %{"name" => "乌什塔拉回族民族乡", "code" => "652828200000"},
      %{"name" => "苏哈特乡", "code" => "652828203000"},
      %{"name" => "乃仁克尔乡", "code" => "652828204000"},
      %{"name" => "新塔热乡", "code" => "652828205000"},
      %{"name" => "清水河农场", "code" => "652828400000"},
      %{"name" => "和硕县马兰公安管区", "code" => "652828402000"}
    ]

  def next(input) when input == "和静县" or input == "652827",
    do: [
      %{"name" => "和静镇", "code" => "652827100000"},
      %{"name" => "巴伦台镇", "code" => "652827101000"},
      %{"name" => "巴润哈尔莫敦镇", "code" => "652827102000"},
      %{"name" => "哈尔莫敦镇", "code" => "652827103000"},
      %{"name" => "巴音布鲁克镇", "code" => "652827104000"},
      %{"name" => "巩乃斯镇", "code" => "652827105000"},
      %{"name" => "乃门莫敦镇", "code" => "652827106000"},
      %{"name" => "协比乃尔布呼镇", "code" => "652827107000"},
      %{"name" => "克尔古提乡", "code" => "652827203000"},
      %{"name" => "阿拉沟乡", "code" => "652827204000"},
      %{"name" => "额勒再特乌鲁乡", "code" => "652827205000"},
      %{"name" => "巴音郭楞乡", "code" => "652827206000"},
      %{"name" => "兵团二十一团", "code" => "652827501000"}
    ]

  def next(input) when input == "焉耆回族自治县" or input == "652826",
    do: [
      %{"name" => "焉耆镇", "code" => "652826100000"},
      %{"name" => "七个星镇", "code" => "652826101000"},
      %{"name" => "永宁镇", "code" => "652826102000"},
      %{"name" => "四十里城子镇", "code" => "652826103000"},
      %{"name" => "北大渠乡", "code" => "652826200000"},
      %{"name" => "五号渠乡", "code" => "652826201000"},
      %{"name" => "查汗采开乡", "code" => "652826203000"},
      %{"name" => "包尔海乡", "code" => "652826204000"},
      %{"name" => "王家庄牧场", "code" => "652826400000"},
      %{"name" => "苏海良种场", "code" => "652826401000"}
    ]

  def next(input) when input == "且末县" or input == "652825",
    do: [
      %{"name" => "且末镇", "code" => "652825100000"},
      %{"name" => "奥依亚依拉克镇", "code" => "652825101000"},
      %{"name" => "塔提让镇", "code" => "652825102000"},
      %{"name" => "塔中镇", "code" => "652825103000"},
      %{"name" => "阿羌镇", "code" => "652825104000"},
      %{"name" => "阿热勒镇", "code" => "652825105000"},
      %{"name" => "琼库勒乡", "code" => "652825201000"},
      %{"name" => "托格拉克勒克乡", "code" => "652825202000"},
      %{"name" => "巴格艾日克乡", "code" => "652825203000"},
      %{"name" => "英吾斯塘乡", "code" => "652825204000"},
      %{"name" => "阿克提坎墩乡", "code" => "652825205000"},
      %{"name" => "阔什萨特玛乡", "code" => "652825206000"},
      %{"name" => "库拉木勒克乡", "code" => "652825209000"}
    ]

  def next(input) when input == "若羌县" or input == "652824",
    do: [
      %{"name" => "若羌镇", "code" => "652824100000"},
      %{"name" => "依吞布拉克镇", "code" => "652824101000"},
      %{"name" => "罗布泊镇", "code" => "652824102000"},
      %{"name" => "瓦石峡镇", "code" => "652824103000"},
      %{"name" => "铁干里克镇", "code" => "652824104000"},
      %{"name" => "吾塔木乡", "code" => "652824201000"},
      %{"name" => "铁木里克乡", "code" => "652824203000"},
      %{"name" => "祁曼塔格乡", "code" => "652824204000"}
    ]

  def next(input) when input == "尉犁县" or input == "652823",
    do: [
      %{"name" => "尉犁镇", "code" => "652823100000"},
      %{"name" => "团结镇", "code" => "652823110000"},
      %{"name" => "兴平镇", "code" => "652823120000"},
      %{"name" => "塔里木乡", "code" => "652823200000"},
      %{"name" => "墩阔坦乡", "code" => "652823203000"},
      %{"name" => "喀尔曲尕乡", "code" => "652823204000"},
      %{"name" => "阿克苏普乡", "code" => "652823205000"},
      %{"name" => "古勒巴格乡", "code" => "652823206000"},
      %{"name" => "兵团三十一团", "code" => "652823501000"},
      %{"name" => "兵团三十三团", "code" => "652823502000"},
      %{"name" => "兵团三十四团", "code" => "652823503000"}
    ]

  def next(input) when input == "轮台县" or input == "652822",
    do: [
      %{"name" => "轮台镇", "code" => "652822100000"},
      %{"name" => "轮南镇", "code" => "652822101000"},
      %{"name" => "群巴克镇", "code" => "652822102000"},
      %{"name" => "阳霞镇", "code" => "652822103000"},
      %{"name" => "哈尔巴克乡", "code" => "652822201000"},
      %{"name" => "野云沟乡", "code" => "652822202000"},
      %{"name" => "阿克萨来乡", "code" => "652822203000"},
      %{"name" => "塔尔拉克乡", "code" => "652822204000"},
      %{"name" => "草湖乡", "code" => "652822205000"},
      %{"name" => "铁热克巴扎乡", "code" => "652822206000"},
      %{"name" => "策达雅乡", "code" => "652822207000"}
    ]

  def next(input) when input == "库尔勒市" or input == "652801",
    do: [
      %{"name" => "团结街道", "code" => "652801001000"},
      %{"name" => "萨依巴格街道", "code" => "652801002000"},
      %{"name" => "天山街道", "code" => "652801003000"},
      %{"name" => "新城街道", "code" => "652801004000"},
      %{"name" => "建设街道", "code" => "652801005000"},
      %{"name" => "朝阳街道", "code" => "652801006000"},
      %{"name" => "梨香街道", "code" => "652801007000"},
      %{"name" => "塔什店镇", "code" => "652801100000"},
      %{"name" => "上户镇", "code" => "652801101000"},
      %{"name" => "西尼尔镇", "code" => "652801102000"},
      %{"name" => "铁克其乡", "code" => "652801200000"},
      %{"name" => "恰尔巴格乡", "code" => "652801201000"},
      %{"name" => "英下乡", "code" => "652801202000"},
      %{"name" => "兰干乡", "code" => "652801203000"},
      %{"name" => "和什力克乡", "code" => "652801204000"},
      %{"name" => "哈拉玉宫乡", "code" => "652801205000"},
      %{"name" => "阿瓦提乡", "code" => "652801206000"},
      %{"name" => "托布力其乡", "code" => "652801207000"},
      %{"name" => "普惠乡", "code" => "652801208000"},
      %{"name" => "迎宾街道片区", "code" => "652801412000"},
      %{"name" => "丝路街道片区", "code" => "652801413000"},
      %{"name" => "希望街道片区", "code" => "652801414000"},
      %{"name" => "永安街道片区", "code" => "652801415000"},
      %{"name" => "友好街道片区", "code" => "652801416000"},
      %{"name" => "楼兰街道片区", "code" => "652801417000"},
      %{"name" => "康都街道片区", "code" => "652801418000"}
    ]

  def next(input) when input == "温泉县" or input == "652723",
    do: [
      %{"name" => "博格达尔镇", "code" => "652723100000"},
      %{"name" => "哈日布呼镇", "code" => "652723101000"},
      %{"name" => "安格里格镇", "code" => "652723102000"},
      %{"name" => "查干屯格乡", "code" => "652723201000"},
      %{"name" => "扎勒木特乡", "code" => "652723202000"},
      %{"name" => "塔秀乡", "code" => "652723203000"},
      %{"name" => "呼和托哈种畜场", "code" => "652723400000"},
      %{"name" => "昆得仑牧场", "code" => "652723401000"},
      %{"name" => "兵团八十七团", "code" => "652723502000"},
      %{"name" => "兵团八十八团", "code" => "652723503000"}
    ]

  def next(input) when input == "精河县" or input == "652722",
    do: [
      %{"name" => "精河镇", "code" => "652722100000"},
      %{"name" => "大河沿子镇", "code" => "652722101000"},
      %{"name" => "托里镇", "code" => "652722102000"},
      %{"name" => "托托镇", "code" => "652722103000"},
      %{"name" => "茫丁乡", "code" => "652722200000"},
      %{"name" => "阿合其农场", "code" => "652722400000"},
      %{"name" => "八家户农场", "code" => "652722401000"},
      %{"name" => "精河工业园区", "code" => "652722402000"},
      %{"name" => "兵团八十三团", "code" => "652722503000"},
      %{"name" => "兵团九十一团", "code" => "652722504000"}
    ]

  def next(input) when input == "阿拉山口市" or input == "652702",
    do: [
      %{"name" => "阿拉套街道", "code" => "652702001000"},
      %{"name" => "艾比湖镇", "code" => "652702100000"}
    ]

  def next(input) when input == "博乐市" or input == "652701",
    do: [
      %{"name" => "青得里街道", "code" => "652701001000"},
      %{"name" => "顾力木图街道", "code" => "652701002000"},
      %{"name" => "南城区街道", "code" => "652701004000"},
      %{"name" => "青达拉街道", "code" => "652701005000"},
      %{"name" => "克尔根卓街道", "code" => "652701006000"},
      %{"name" => "小营盘镇", "code" => "652701100000"},
      %{"name" => "达勒特镇", "code" => "652701101000"},
      %{"name" => "乌图布拉格镇", "code" => "652701102000"},
      %{"name" => "青得里镇", "code" => "652701103000"},
      %{"name" => "贝林哈日莫墩乡", "code" => "652701201000"},
      %{"name" => "阿热勒托海牧场", "code" => "652701400000"},
      %{"name" => "兵团八十六团分部", "code" => "652701504000"}
    ]

  def next(input) when input == "木垒哈萨克自治县" or input == "652328",
    do: [
      %{"name" => "木垒镇", "code" => "652328100000"},
      %{"name" => "西吉尔镇", "code" => "652328101000"},
      %{"name" => "东城镇", "code" => "652328102000"},
      %{"name" => "新户镇", "code" => "652328103000"},
      %{"name" => "英格堡乡", "code" => "652328200000"},
      %{"name" => "照壁山乡", "code" => "652328201000"},
      %{"name" => "雀仁乡", "code" => "652328203000"},
      %{"name" => "白杨河乡", "code" => "652328204000"},
      %{"name" => "大石头乡", "code" => "652328205000"},
      %{"name" => "大南沟乌孜别克乡", "code" => "652328206000"},
      %{"name" => "博斯坦乡", "code" => "652328207000"}
    ]

  def next(input) when input == "吉木萨尔县" or input == "652327",
    do: [
      %{"name" => "吉木萨尔镇", "code" => "652327100000"},
      %{"name" => "三台镇", "code" => "652327101000"},
      %{"name" => "泉子街镇", "code" => "652327102000"},
      %{"name" => "北庭镇", "code" => "652327103000"},
      %{"name" => "二工镇", "code" => "652327104000"},
      %{"name" => "大有镇", "code" => "652327105000"},
      %{"name" => "五彩湾镇", "code" => "652327106000"},
      %{"name" => "庆阳湖乡", "code" => "652327202000"},
      %{"name" => "老台乡", "code" => "652327203000"},
      %{"name" => "新地乡", "code" => "652327205000"},
      %{"name" => "兵团农六师红旗农场", "code" => "652327500000"}
    ]

  def next(input) when input == "奇台县" or input == "652325",
    do: [
      %{"name" => "奇台镇", "code" => "652325100000"},
      %{"name" => "老奇台镇", "code" => "652325101000"},
      %{"name" => "半截沟镇", "code" => "652325102000"},
      %{"name" => "吉布库镇", "code" => "652325103000"},
      %{"name" => "东湾镇", "code" => "652325104000"},
      %{"name" => "西地镇", "code" => "652325105000"},
      %{"name" => "碧流河镇", "code" => "652325106000"},
      %{"name" => "三个庄子镇", "code" => "652325107000"},
      %{"name" => "西北湾镇", "code" => "652325108000"},
      %{"name" => "芨芨湖镇", "code" => "652325109000"},
      %{"name" => "坎尔孜乡", "code" => "652325202000"},
      %{"name" => "五马场乡", "code" => "652325203000"},
      %{"name" => "古城乡", "code" => "652325204000"},
      %{"name" => "乔仁乡", "code" => "652325205000"},
      %{"name" => "七户乡", "code" => "652325206000"},
      %{"name" => "塔塔尔乡", "code" => "652325208000"},
      %{"name" => "兵团奇台农场", "code" => "652325503000"},
      %{"name" => "兵团农六师北塔山牧场", "code" => "652325504000"}
    ]

  def next(input) when input == "玛纳斯县" or input == "652324",
    do: [
      %{"name" => "玛纳斯镇", "code" => "652324100000"},
      %{"name" => "乐土驿镇", "code" => "652324101000"},
      %{"name" => "包家店镇", "code" => "652324102000"},
      %{"name" => "凉州户镇", "code" => "652324103000"},
      %{"name" => "北五岔镇", "code" => "652324104000"},
      %{"name" => "六户地镇", "code" => "652324105000"},
      %{"name" => "兰州湾镇", "code" => "652324106000"},
      %{"name" => "广东地乡", "code" => "652324201000"},
      %{"name" => "清水河子哈萨克民族乡", "code" => "652324202000"},
      %{"name" => "塔西河乡", "code" => "652324203000"},
      %{"name" => "旱卡子滩乡", "code" => "652324204000"},
      %{"name" => "玛电工业区", "code" => "652324400000"},
      %{"name" => "自治区林业厅玛纳斯平原林场", "code" => "652324402000"},
      %{"name" => "新疆农业科学院玛纳斯县试验站", "code" => "652324404000"},
      %{"name" => "兵团农六师新湖农场", "code" => "652324520000"},
      %{"name" => "兵团一四七团", "code" => "652324521000"},
      %{"name" => "兵团一四八团", "code" => "652324522000"},
      %{"name" => "兵团一四九团", "code" => "652324523000"},
      %{"name" => "兵团一五零团", "code" => "652324524000"}
    ]

  def next(input) when input == "呼图壁县" or input == "652323",
    do: [
      %{"name" => "呼图壁镇", "code" => "652323100000"},
      %{"name" => "大丰镇", "code" => "652323101000"},
      %{"name" => "雀尔沟镇", "code" => "652323102000"},
      %{"name" => "二十里店镇", "code" => "652323103000"},
      %{"name" => "园户村镇", "code" => "652323104000"},
      %{"name" => "五工台镇", "code" => "652323105000"},
      %{"name" => "石梯子哈萨克民族乡", "code" => "652323201000"},
      %{"name" => "国有林管理中心", "code" => "652323402000"},
      %{"name" => "呼图壁种牛场", "code" => "652323405000"},
      %{"name" => "兵团一零五团", "code" => "652323520000"},
      %{"name" => "兵团一零六团", "code" => "652323521000"},
      %{"name" => "兵团芳草湖总场", "code" => "652323523000"}
    ]

  def next(input) when input == "阜康市" or input == "652302",
    do: [
      %{"name" => "博峰街道", "code" => "652302001000"},
      %{"name" => "阜新街道", "code" => "652302002000"},
      %{"name" => "准东街道", "code" => "652302003000"},
      %{"name" => "甘河子镇", "code" => "652302100000"},
      %{"name" => "城关镇", "code" => "652302101000"},
      %{"name" => "九运街镇", "code" => "652302102000"},
      %{"name" => "滋泥泉子镇", "code" => "652302103000"},
      %{"name" => "上户沟哈萨克族乡", "code" => "652302201000"},
      %{"name" => "水磨沟乡", "code" => "652302202000"},
      %{"name" => "三工河哈萨克族乡", "code" => "652302203000"},
      %{"name" => "兵团农六师土墩子农场", "code" => "652302503000"},
      %{"name" => "兵团六运湖农场", "code" => "652302504000"},
      %{"name" => "兵团二二二团农场", "code" => "652302505000"}
    ]

  def next(input) when input == "昌吉市" or input == "652301",
    do: [
      %{"name" => "宁边路街道", "code" => "652301001000"},
      %{"name" => "延安北路街道", "code" => "652301002000"},
      %{"name" => "北京南路街道", "code" => "652301003000"},
      %{"name" => "建国路街道", "code" => "652301004000"},
      %{"name" => "中山路街道", "code" => "652301005000"},
      %{"name" => "绿洲路街道", "code" => "652301006000"},
      %{"name" => "硫磺沟镇", "code" => "652301100000"},
      %{"name" => "三工镇", "code" => "652301101000"},
      %{"name" => "榆树沟镇", "code" => "652301102000"},
      %{"name" => "二六工镇", "code" => "652301103000"},
      %{"name" => "大西渠镇", "code" => "652301104000"},
      %{"name" => "六工镇", "code" => "652301105000"},
      %{"name" => "滨湖镇", "code" => "652301106000"},
      %{"name" => "佃坝镇", "code" => "652301107000"},
      %{"name" => "阿什里哈萨克民族乡", "code" => "652301202000"},
      %{"name" => "庙尔沟乡", "code" => "652301203000"},
      %{"name" => "新疆昌吉国家农业科技园区管理委员会", "code" => "652301400000"},
      %{"name" => "昌吉市北部荒漠生态保护管理站", "code" => "652301401000"},
      %{"name" => "昌吉国家高新技术产业开发区", "code" => "652301402000"},
      %{"name" => "兵团蔡家湖镇分部", "code" => "652301500000"},
      %{"name" => "兵团共青团农场", "code" => "652301503000"},
      %{"name" => "兵团军户农场", "code" => "652301504000"}
    ]

  def next(input) when input == "伊吾县" or input == "650522",
    do: [
      %{"name" => "伊吾镇", "code" => "650522100000"},
      %{"name" => "淖毛湖镇", "code" => "650522101000"},
      %{"name" => "盐池镇", "code" => "650522102000"},
      %{"name" => "苇子峡乡", "code" => "650522201000"},
      %{"name" => "下马崖乡", "code" => "650522202000"},
      %{"name" => "吐葫芦乡", "code" => "650522204000"},
      %{"name" => "前山哈萨克民族乡", "code" => "650522205000"},
      %{"name" => "伊吾县工业加工区", "code" => "650522400000"},
      %{"name" => "伊吾县山南开发区管委会", "code" => "650522403000"},
      %{"name" => "兵团淖毛湖农场", "code" => "650522500000"}
    ]

  def next(input) when input == "巴里坤哈萨克自治县" or input == "650521",
    do: [
      %{"name" => "巴里坤镇", "code" => "650521100000"},
      %{"name" => "博尔羌吉镇", "code" => "650521101000"},
      %{"name" => "大河镇", "code" => "650521102000"},
      %{"name" => "奎苏镇", "code" => "650521103000"},
      %{"name" => "三塘湖镇", "code" => "650521104000"},
      %{"name" => "萨尔乔克乡", "code" => "650521200000"},
      %{"name" => "海子沿乡", "code" => "650521201000"},
      %{"name" => "下涝坝乡", "code" => "650521202000"},
      %{"name" => "石人子乡", "code" => "650521205000"},
      %{"name" => "花园乡", "code" => "650521206000"},
      %{"name" => "大红柳峡乡", "code" => "650521208000"},
      %{"name" => "八墙子乡", "code" => "650521209000"},
      %{"name" => "良种繁育场", "code" => "650521400000"},
      %{"name" => "黄土场开发区", "code" => "650521401000"},
      %{"name" => "巴里坤县山南开发区", "code" => "650521402000"},
      %{"name" => "兵团红山农场", "code" => "650521500000"}
    ]

  def next(input) when input == "伊州区" or input == "650502",
    do: [
      %{"name" => "东河街道", "code" => "650502001000"},
      %{"name" => "西河街道", "code" => "650502002000"},
      %{"name" => "城北街道", "code" => "650502003000"},
      %{"name" => "丽园街道", "code" => "650502004000"},
      %{"name" => "石油新城街道", "code" => "650502005000"},
      %{"name" => "雅满苏镇", "code" => "650502100000"},
      %{"name" => "七角井镇", "code" => "650502101000"},
      %{"name" => "星星峡镇", "code" => "650502102000"},
      %{"name" => "二堡镇", "code" => "650502103000"},
      %{"name" => "陶家宫镇", "code" => "650502104000"},
      %{"name" => "五堡镇", "code" => "650502105000"},
      %{"name" => "三道岭镇", "code" => "650502106000"},
      %{"name" => "沁城乡", "code" => "650502200000"},
      %{"name" => "乌拉台哈萨克民族乡", "code" => "650502201000"},
      %{"name" => "双井子乡", "code" => "650502202000"},
      %{"name" => "大泉湾乡", "code" => "650502203000"},
      %{"name" => "回城乡", "code" => "650502205000"},
      %{"name" => "花园乡", "code" => "650502206000"},
      %{"name" => "南湖乡", "code" => "650502207000"},
      %{"name" => "德外里都如克哈萨克乡", "code" => "650502209000"},
      %{"name" => "西山乡", "code" => "650502210000"},
      %{"name" => "天山乡", "code" => "650502211000"},
      %{"name" => "白石头乡", "code" => "650502212000"},
      %{"name" => "柳树沟乡", "code" => "650502214000"},
      %{"name" => "现代农业园区管理委员会", "code" => "650502404000"},
      %{"name" => "哈密工业园区", "code" => "650502406000"},
      %{"name" => "东郊开发区管理委员会", "code" => "650502407000"},
      %{"name" => "兵团红星二场", "code" => "650502501000"},
      %{"name" => "兵团红星四场", "code" => "650502502000"},
      %{"name" => "兵团黄田农场", "code" => "650502503000"},
      %{"name" => "兵团火箭农场", "code" => "650502504000"},
      %{"name" => "兵团柳树泉农场", "code" => "650502505000"}
    ]

  def next(input) when input == "托克逊县" or input == "650422",
    do: [
      %{"name" => "托克逊镇", "code" => "650422100000"},
      %{"name" => "库米什镇", "code" => "650422101000"},
      %{"name" => "克尔碱镇", "code" => "650422102000"},
      %{"name" => "阿乐惠镇", "code" => "650422103000"},
      %{"name" => "伊拉湖镇", "code" => "650422104000"},
      %{"name" => "夏镇", "code" => "650422105000"},
      %{"name" => "博斯坦镇", "code" => "650422106000"},
      %{"name" => "郭勒布依乡", "code" => "650422201000"}
    ]

  def next(input) when input == "鄯善县" or input == "650421",
    do: [
      %{"name" => "鄯善镇", "code" => "650421100000"},
      %{"name" => "七克台镇", "code" => "650421101000"},
      %{"name" => "火车站镇", "code" => "650421102000"},
      %{"name" => "连木沁镇", "code" => "650421103000"},
      %{"name" => "鲁克沁镇", "code" => "650421104000"},
      %{"name" => "辟展镇", "code" => "650421105000"},
      %{"name" => "迪坎镇", "code" => "650421106000"},
      %{"name" => "东巴扎回族乡", "code" => "650421201000"},
      %{"name" => "吐峪沟乡", "code" => "650421202000"},
      %{"name" => "达朗坎乡", "code" => "650421203000"},
      %{"name" => "南山矿区", "code" => "650421400000"},
      %{"name" => "园艺场", "code" => "650421401000"}
    ]

  def next(input) when input == "高昌区" or input == "650402",
    do: [
      %{"name" => "老城路街道", "code" => "650402001000"},
      %{"name" => "高昌路街道", "code" => "650402002000"},
      %{"name" => "葡萄沟街道", "code" => "650402003000"},
      %{"name" => "红柳河街道", "code" => "650402004000"},
      %{"name" => "七泉湖镇", "code" => "650402100000"},
      %{"name" => "大河沿镇", "code" => "650402101000"},
      %{"name" => "亚尔镇", "code" => "650402102000"},
      %{"name" => "艾丁湖镇", "code" => "650402103000"},
      %{"name" => "葡萄镇", "code" => "650402104000"},
      %{"name" => "火焰山镇", "code" => "650402105000"},
      %{"name" => "恰特喀勒乡", "code" => "650402203000"},
      %{"name" => "三堡乡", "code" => "650402205000"},
      %{"name" => "胜金乡", "code" => "650402206000"},
      %{"name" => "原种场", "code" => "650402401000"},
      %{"name" => "兵团二二一团", "code" => "650402502000"}
    ]

  def next(input) when input == "乌尔禾区" or input == "650205",
    do: [
      %{"name" => "柳树街街道", "code" => "650205001000"},
      %{"name" => "乌尔禾镇", "code" => "650205100000"},
      %{"name" => "兵团一三七团乡", "code" => "650205509000"}
    ]

  def next(input) when input == "白碱滩区" or input == "650204",
    do: [
      %{"name" => "中兴路街道", "code" => "650204001000"},
      %{"name" => "三平路街道", "code" => "650204002000"},
      %{"name" => "金龙镇街道", "code" => "650204003000"}
    ]

  def next(input) when input == "克拉玛依区" or input == "650203",
    do: [
      %{"name" => "天山路街道", "code" => "650203001000"},
      %{"name" => "胜利路街道", "code" => "650203002000"},
      %{"name" => "昆仑路街道", "code" => "650203003000"},
      %{"name" => "银河路街道", "code" => "650203004000"},
      %{"name" => "五五新镇街道", "code" => "650203006000"},
      %{"name" => "迎宾街道", "code" => "650203007000"},
      %{"name" => "古海街道", "code" => "650203008000"},
      %{"name" => "小拐乡", "code" => "650203200000"},
      %{"name" => "兵团一二九团分部", "code" => "650203506000"},
      %{"name" => "兵团一三六团", "code" => "650203530000"}
    ]

  def next(input) when input == "独山子区" or input == "650202",
    do: [
      %{"name" => "金山路街道", "code" => "650202001000"},
      %{"name" => "西宁路街道", "code" => "650202002000"},
      %{"name" => "新北区街道", "code" => "650202003000"}
    ]

  def next(input) when input == "乌鲁木齐县" or input == "650121",
    do: [
      %{"name" => "清水泉片区管委会街道", "code" => "650121001000"},
      %{"name" => "谢家沟片区管委会街道", "code" => "650121002000"},
      %{"name" => "水西沟镇", "code" => "650121100000"},
      %{"name" => "板房沟镇", "code" => "650121102000"},
      %{"name" => "永丰镇", "code" => "650121103000"},
      %{"name" => "萨尔达坂乡", "code" => "650121207000"},
      %{"name" => "甘沟乡", "code" => "650121208000"},
      %{"name" => "托里乡", "code" => "650121213000"}
    ]

  def next(input) when input == "米东区" or input == "650109",
    do: [
      %{"name" => "石化街道", "code" => "650109001000"},
      %{"name" => "地磅街道", "code" => "650109002000"},
      %{"name" => "卡子湾街道", "code" => "650109003000"},
      %{"name" => "古牧地东路街道", "code" => "650109004000"},
      %{"name" => "古牧地西路街道", "code" => "650109005000"},
      %{"name" => "南路街道", "code" => "650109006000"},
      %{"name" => "永祥街街道", "code" => "650109007000"},
      %{"name" => "盛达东路街道", "code" => "650109008000"},
      %{"name" => "古牧地镇", "code" => "650109100000"},
      %{"name" => "铁厂沟镇", "code" => "650109101000"},
      %{"name" => "长山子镇", "code" => "650109102000"},
      %{"name" => "羊毛工镇", "code" => "650109103000"},
      %{"name" => "三道坝镇", "code" => "650109104000"},
      %{"name" => "柏杨河乡", "code" => "650109200000"},
      %{"name" => "芦草沟乡", "code" => "650109201000"},
      %{"name" => "兵团梧桐镇分部", "code" => "650109500000"}
    ]

  def next(input) when input == "达坂城区" or input == "650107",
    do: [
      %{"name" => "艾维尔沟街道", "code" => "650107001000"},
      %{"name" => "乌拉泊街道", "code" => "650107004000"},
      %{"name" => "达坂城区盐湖街道", "code" => "650107006000"},
      %{"name" => "达坂城镇", "code" => "650107100000"},
      %{"name" => "东沟乡", "code" => "650107200000"},
      %{"name" => "西沟乡", "code" => "650107201000"},
      %{"name" => "阿克苏乡", "code" => "650107202000"},
      %{"name" => "柴窝堡管委会", "code" => "650107400000"}
    ]

  def next(input) when input == "头屯河区" or input == "650106",
    do: [
      %{"name" => "钢城片区街道", "code" => "650106001000"},
      %{"name" => "火车西站片区街道", "code" => "650106002000"},
      %{"name" => "王家沟片区街道", "code" => "650106003000"},
      %{"name" => "乌昌路片区街道", "code" => "650106004000"},
      %{"name" => "北站西路片区街道", "code" => "650106005000"},
      %{"name" => "中亚北路片区街道", "code" => "650106007000"},
      %{"name" => "中亚南路片区街道", "code" => "650106008000"},
      %{"name" => "嵩山街片区街道", "code" => "650106009000"},
      %{"name" => "高铁片区街道", "code" => "650106010000"},
      %{"name" => "白鸟湖片区街道", "code" => "650106011000"},
      %{"name" => "西湖片区街道", "code" => "650106012000"},
      %{"name" => "北站东路片区街道", "code" => "650106013000"},
      %{"name" => "两河片区街道", "code" => "650106014000"},
      %{"name" => "乌鲁木齐站片区街道", "code" => "650106015000"},
      %{"name" => "区直辖村级区划", "code" => "650106198000"},
      %{"name" => "兵团十二师三坪农场", "code" => "650106501000"},
      %{"name" => "兵团十二师五一农场", "code" => "650106502000"},
      %{"name" => "新疆兵团十二师头屯河农场", "code" => "650106503000"}
    ]

  def next(input) when input == "水磨沟区" or input == "650105",
    do: [
      %{"name" => "七纺街道", "code" => "650105001000"},
      %{"name" => "六道湾街道", "code" => "650105002000"},
      %{"name" => "苇湖梁街道", "code" => "650105003000"},
      %{"name" => "八道湾街道", "code" => "650105004000"},
      %{"name" => "新民路街道", "code" => "650105005000"},
      %{"name" => "南湖南路街道", "code" => "650105006000"},
      %{"name" => "南湖北路街道", "code" => "650105007000"},
      %{"name" => "七道湾街道", "code" => "650105008000"},
      %{"name" => "榆树沟街道", "code" => "650105010000"},
      %{"name" => "石人子沟街道", "code" => "650105011000"},
      %{"name" => "水塔山街道", "code" => "650105012000"},
      %{"name" => "华光街街道", "code" => "650105013000"},
      %{"name" => "龙盛街街道", "code" => "650105014000"},
      %{"name" => "振安街街道", "code" => "650105015000"},
      %{"name" => "河马泉街道", "code" => "650105016000"}
    ]

  def next(input) when input == "新市区" or input == "650104",
    do: [
      %{"name" => "北京路街道", "code" => "650104001000"},
      %{"name" => "二工街道", "code" => "650104002000"},
      %{"name" => "三工街道", "code" => "650104003000"},
      %{"name" => "石油新村街道", "code" => "650104004000"},
      %{"name" => "迎宾路街道", "code" => "650104005000"},
      %{"name" => "喀什东路街道", "code" => "650104006000"},
      %{"name" => "八家户街道", "code" => "650104009000"},
      %{"name" => "银川路街道", "code" => "650104010000"},
      %{"name" => "南纬路街道", "code" => "650104011000"},
      %{"name" => "杭州路街道", "code" => "650104012000"},
      %{"name" => "鲤鱼山街道", "code" => "650104013000"},
      %{"name" => "百园路街道", "code" => "650104014000"},
      %{"name" => "正扬路街道", "code" => "650104015000"},
      %{"name" => "机场街道", "code" => "650104016000"},
      %{"name" => "友谊路街道", "code" => "650104017000"},
      %{"name" => "高新街街道", "code" => "650104018000"},
      %{"name" => "长春中路街道", "code" => "650104019000"},
      %{"name" => "安宁渠镇", "code" => "650104100000"},
      %{"name" => "二工乡", "code" => "650104200000"},
      %{"name" => "地窝堡乡", "code" => "650104201000"},
      %{"name" => "青格达湖乡", "code" => "650104202000"},
      %{"name" => "六十户乡", "code" => "650104203000"},
      %{"name" => "兵团第十二师养禽场", "code" => "650104501000"}
    ]

  def next(input) when input == "沙依巴克区" or input == "650103",
    do: [
      %{"name" => "长江路街道", "code" => "650103001000"},
      %{"name" => "和田街街道", "code" => "650103002000"},
      %{"name" => "扬子江路街道", "code" => "650103003000"},
      %{"name" => "友好南路街道", "code" => "650103004000"},
      %{"name" => "友好北路街道", "code" => "650103005000"},
      %{"name" => "八一街道", "code" => "650103006000"},
      %{"name" => "炉院街街道", "code" => "650103007000"},
      %{"name" => "西山街道", "code" => "650103008000"},
      %{"name" => "雅玛里克山街道", "code" => "650103009000"},
      %{"name" => "红庙子街道", "code" => "650103010000"},
      %{"name" => "长胜东街道", "code" => "650103011000"},
      %{"name" => "长胜西街道", "code" => "650103012000"},
      %{"name" => "长胜南街道", "code" => "650103013000"},
      %{"name" => "火车南站街道", "code" => "650103014000"},
      %{"name" => "仓房沟片区街道", "code" => "650103015000"},
      %{"name" => "环卫路街道", "code" => "650103016000"},
      %{"name" => "骑马山街道", "code" => "650103017000"},
      %{"name" => "平顶山街道", "code" => "650103018000"},
      %{"name" => "兵团农十二师一零四团", "code" => "650103501000"},
      %{"name" => "兵团十二师西山农场", "code" => "650103502000"}
    ]

  def next(input) when input == "天山区" or input == "650102",
    do: [
      %{"name" => "燕儿窝街道", "code" => "650102002000"},
      %{"name" => "胜利路街道", "code" => "650102003000"},
      %{"name" => "团结路街道", "code" => "650102004000"},
      %{"name" => "解放南路街道", "code" => "650102005000"},
      %{"name" => "新华南路街道", "code" => "650102006000"},
      %{"name" => "和平路街道", "code" => "650102007000"},
      %{"name" => "解放北路街道", "code" => "650102008000"},
      %{"name" => "幸福路街道", "code" => "650102009000"},
      %{"name" => "东门街道", "code" => "650102010000"},
      %{"name" => "新华北路街道", "code" => "650102011000"},
      %{"name" => "青年路街道", "code" => "650102012000"},
      %{"name" => "碱泉街道", "code" => "650102013000"},
      %{"name" => "延安路街道", "code" => "650102014000"},
      %{"name" => "红雁街道", "code" => "650102015000"},
      %{"name" => "南草滩街道", "code" => "650102016000"},
      %{"name" => "东泉路街道", "code" => "650102017000"},
      %{"name" => "二道桥片区", "code" => "650102400000"},
      %{"name" => "黑甲山片区", "code" => "650102401000"},
      %{"name" => "大湾片区", "code" => "650102402000"},
      %{"name" => "赛马场片区", "code" => "650102403000"},
      %{"name" => "南湾街片区", "code" => "650102404000"},
      %{"name" => "大巴扎片区", "code" => "650102405000"}
    ]

  def next(_), do: nil
end